{"body": "\nHi Thomas,\n\nYou're right, it should be trivial.  I tested the html file in safari and firefox over the weekend and came to the same conclusion regarding the sliders.  I used dashcode to create the widget, so next step is to see if one of the other sliders in dashcode is generic javascript and not webkit.\n\nI've also received feedback that it doesn't work in OSX 10.4 which is a bummer, and probably related to the webkit sliders.\n\nI'm not sure what to do about the labels.  dashcode has a nice drag and drop interface builder, and I don't remember there being many options for text but I'll look more closely tonight.  Maybe there is an easy way to make the text static that I missed (like a checkbox or something).\n\nUnfortunately my ability is currently limited by the capability dashcode (apple's IDE for dashboard widgets).  I'm not the best person to develop a web tool.   If there is someone with javascript and web development experience that is interested in adapting and enhancing the widget to a website I'd actively encourage them to do it.  My plan is continue to develop it as a dashboard widget within dashcode but to remove and avoid webkit specific components (if possible).  Hopefully avoiding webkit will allow it to function in most browsers.\n\nBest,\nAndy\n\n\n\n\nOn May 3, 2010, at 9:55 AM, Thomas Bleicher wrote:\n\n\n\n", "replyTo": "Subject: [Radiance-general] Re: trans dashboard widget", "sender": "Andy McNeil", "isquestion": false, "tags": [], "id": "<5F241540-A380-4CAB-B57D-5D3202700EB0@lbl.gov>", "refs": ["<BBA990A6-8BA5-4D39-8408-66C791D648C4@lbl.gov>", "<FEC8045A-BAFC-44C7-9A72-EE529F12859D@lmi.net>", "<C7F8AAD7-2300-46CE-94E5-6CFF1E148868@lbl.gov>", "<09FC7FF7-C160-4E56-B4F2-2ED1B97B9ACB@gmail.com>", "<4BDB2923.8020102@visarc.com>", "<982DE41F-98A0-4B0D-86AE-EFC63C06FCF0@lbl.gov>", "<4BDECED3.9060907@visarc.com>", "<l2u89355c0f1005030955ic74dc245hd28339238eadfcd9@mail.gmail.com>"], "datetime": "Mon May  3 11:56:28 2010", "email": "amcneil at lbl.gov", "subject": "[Radiance-general] Re: trans dashboard widget"}