{"body": "\nI also noticed that your window polygon is oriented towards the exterior of the buillding! You shoud rewrite your polygon this way so that its normal points towards the interior:\n\n#part of conf2.rad file:\nlcp_material polygon window\n0\n0\n12\n16    9    2.8\n0    9    2.8\n0    9    0\n16    9    0\n\n________________________________________\nDe : radiance-general-bounces@radiance-online.org [radiance-general-bounces@radiance-online.org] de la part de Kevin Thuot [kthuot@mit.edu]\nDate d'envoi : mercredi, 5. mai 2010 17:08\n? : radiance-general@radiance-online.org\nObjet : [Radiance-general] Laser Cut Panel (LCP) Modelling Problem\n\nHi,\nI have run into some trouble using the lcp0.cal file that models a Laser Cut Panel.\n\nThe problem I'm seeing is that when I replace my regular window with one made of the lcp_material direct sunlight seems to eliminated entirely (both deflected and undeflected) from the interior of my room. My facade is south facing and is fully glazed with either glass in the 1st case or lcp_material in the second. The 1st case, with no LCP, shows a diagonal stripe of direct sun hitting the wall. In the second picture with the lcp_material, instead of the direct beam being split into deflected and undeflected portions as expected, the direct beam is completely eliminated.\n\nI have read Phillip Greenup's paper \"RADIANCE algorithm to simulate laser-cut panel light-redirecting elements\". I get the feeling that there's something wrong with my alignments somewhere, but I haven't been able to find a combination of -rz material rotation, surface normal of the polygon, and rotation of the room as a whole that produce the correct results. Everything I've tried results in the same thing: direct beam sunlight eliminated from the room. One thing I'm not clear on: the -rz rotation in the prism2 material definition should point the surface normal of the material in the same direction as the final orientation of the polygon, and both of those normals should point toward the exterior, correct? I am defining the room with the +Y wall being the window and then rotating that room 180 degrees so that it is south facing. As a result, my -rz rotation is 270, to point the normal in -Y. Unfortunately, the results have the same problem I described whether the -rz rotation is 90, 180, 270,  or 0. I've included some of the relevant code at the bottom of this email.\n\nI'm hoping this is something that someone else has run into before. I've been using Radiance for about 8 months, so I've learned some, but definitely not all, of the ins and outs of the program.\n\nThanks very much for your help,\nKevin Thuot\n\n\n#lcp_material definition\nvoid prism2 lcp_material\n11 f1 dx1 dy1 dz1 f2 dx2 dy2 dz2 lcp0.cal -rz 270\n0\n2 .5 1.5\n\n#part of conf2.rad file:\nlcp_material polygon window\n0\n0\n12\n16    9    2.8\n16    9    0\n0    9    0\n0    9    2.8\n\n#rotating the room so that the window faces south instead of north\n!xform -n conf2 -t -8 -4.5 0 -rz 180 conf2.rad\n\n\n", "replyTo": "Subject: [Radiance-general] Laser Cut Panel (LCP) Modelling Problem", "sender": "=?iso-8859-1?Q?Compagnon_Rapha=EBl?=", "isquestion": false, "tags": [], "id": "<70DD3A1408BDA8498790E8D553B7D25302553F498737@HEFRMAIL.sofr.hefr.lan>", "refs": ["<r2u4a3e24cc1005050808mb02fcda3t5510ac9f2dc529d@mail.gmail.com>"], "datetime": "Wed May  5 08:31:20 2010", "email": "Raphael.Compagnon at hefr.ch", "subject": "[Radiance-general] Laser Cut Panel (LCP) Modelling Problem"}