{"body": "\nHi Lars,\n\nHere is what I understood as the problem from your first message:\n\n\nYou want to take an image of a material (that has multiple colors in the\nimage) and map this to geometry in some calibrated manner. But the\nproblem is how to do this with a material/image that has multiple colors\nin it, such as red marble with blue flecks. Because the image has\nmultiple colors you do not want to use the average color of the material\nfor the definition instead you want to use the photopic reflectance\nvalue. You want to let the colorpict convey the color information of the\nimage and the plastic to govern the overall reflectance of the material.\nThus you should calibrate (macbethcal) the material and normalize\n(normpat) it.\n\nSo I think that you example should be as follows:\n\n# porphyry red 1: values from ximage and macbethcal'ed pic\n# rgb  = .09 .06 .05\n# photopic reflectance =  .0673 as determined with grey(.09,.06,.05)  in\ncalc\nvoid plastic porphyry_red_1_reflectance\n0\n0\n5 .0673 .0673 .0673 .02 0\n\n# calibrate the image with macbethcal to get the colors \"corrected\"\n# normpat the image to make its average 1.0\n# not sure about the use of noop?\nvoid colorpict sophia_porphyry_red_1_pattern\n13 red green blue sophia_porphyry_red_1.pic picture.cal tile_u tile_v -s\n.2 -rx 90 -rz 90\n0\n0\n\n# apply the material\n# give alias the modifier as output from dxf2rad\nsophia_porphyry_red_1_pattern alias l_porphyry_red_1 porphyry_red_1\n\nThus you have a base material that is a grey plastic. The reflectance of\nthis material is equal to the photopic reflectance of your sampled\nmaterial. The rgb color properties are multiplied by the color picture\nsupplied in colorpict. Since the picture is corrected the colors should\nhave a stronger basis in reality (assuming the sampling method is\ncorrect). Since the picture is normalized to an average of 1.0, the\nmultiplication  of the image by the plastic still equals the reflectance\nof the material. Since the base material is neutral (eg grey/white) the\ncolors of the image pattern will be what you want.\n\nI hope this is right and if not some one should jump in and correct me.\n\n-Jack\n\nLars O. Grobe wrote:\n\n\n--\n#\tJohn E. de Valpine\n#\tpresident\n#\n#\tvisarc incorporated\n#\thttp://www.visarc.com\n#\n#\tchanneling technology for superior design and construction\n\n\n\n\n", "replyTo": "Subject: [Radiance-general] colorpict and materials", "sender": "Jack de Valpine", "isquestion": false, "tags": [], "id": "<40E32EF5.2040600@visarc.com>", "refs": ["<E5788A0C-CAB7-11D8-9111-000A959DDB22@gmx.net>"], "datetime": "Wed Jun 30 23:22:10 2004", "email": "jedev at visarc.com", "subject": "[Radiance-general] colorpict and materials"}