{"body": "\nThanks John and Lars\n\nI tried a few things based on your comments, e.g. calling up xform\ninstead of xform2, making sure that the location input is ok, but\nunfortunately without success.\n\nThe problem really seems to be specific to certain computers. One file\nwhich ran fine yesterday on my colleagues computer, didn't work on mine\nwhen I tried to run it just afterwards.\n\nCould it be that there is something in e.g. my windows registry that\ncauses this issue? The batch files created by VE include the following\nline before they run the radiance programs:\n\nSET PATH=C:\\Windows;C:\\Windows\\system32;C:\\Program Files\\IES\\VE\n6\\apps\\ray\n\n\nCheers\nChris\n\n\n\nKind regards,\n\n\n\nChristoph Begert\n\nAssociate\n\nsbe\n\nsustainable built environments\n\nInnovative ideas, collaborative design, practical solutions\n\n\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of John\nMardaljevic\nSent: Monday, 10 May 2010 7:59 PM\nTo: radiance-general@radiance-online.org\nChris,\n\nXform2 is an additional program that IES created.  Similar to xform,\nIES uses xform2 to create rectangles of arbitrary dimension for, it\nseems, use as workplanes (and perhaps other functions).  It does this\nby applying arbitrary scaling in the x and y dimensions\n(independently) on a unit square polygon (z = 0.8) and translating the\noutput to the desired location in the scene.  In addition to the usual\nxform options, xform2 has -sx and -sy to perform the scaling in the x\n& y dims.\n\nI came across this IES peculiarity when transferring IES created\ngeometry to other platforms for simulation using standard (UNIX)\nRadiance.  In those instances it was simply a matter of stripping out\nthe xform2 commands, which didn't affect the building geometry since\ntheir use was confined to generating workplanes.  However, from the\nerror messages that you posted it seems that xform2 is being used for\nmore general transformations where xform would suffice.  Perhaps IES\nhave replaced xform with their own xform2. As an aside, I'm surprised\nto see any form of xform/2 command used for general building geometry\ncreated in IES because I expected its 3D modeller to create explicit\ngeometry (for all but the workplanes).\n\n-John\n\n-----------------------------------------------\nDr. John Mardaljevic\nReader in Daylight Modelling\nInstitute of Energy and Sustainable Development\nDe Montfort University\nThe Gateway\nLeicester\nLE1 9BH, UK\n+44 (0) 116 257 7972\n+44 (0) 116 257 7981 (fax)\n\njm@dmu.ac.uk\nhttp://www.iesd.dmu.ac.uk/~jm\n\n\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of Lars\nO. Grobe\nSent: Monday, 10 May 2010 11:21 AM\nTo: Radiance general discussion\nHi Christoph!\nI do not know that environment, however it seams that it simply calls\nrad on a scene?\n\nand\n(...)\nHm, it looks like you have a modified version of oconv, never seen the\ntime output for it before. I also do not know xform2. However the\nmessage is clear - the files are not found. Either this is a mistake by\nxform2 or by the tool that was supposed to generate these files. So the\nfirst thing to do is to check whether the listed files are at the given\nlocations. I guess the weird directory name have to do with some windows\n\nfile-system limitations? What surprises me is that xform2 uses\nbackslashes for directories - is this the modification against xform\nthat led to the name change?\nIf it happened randomly before there seam to be other reasons.\n\nSo as mentioned before, it seams that the commands involved are not\nreally part of radiance but some derived, modified binaries. Start\ndebugging by finding out whether the error messages correctly detect\nthese missing files. Then one could start to find out how this IES\nVirtual Environment works and creates / names / writes the files. In\nradiance, one would also typically have a variable RAYPATH set including\n\nall file system paths where scene files are to be found.\n\nCheers\n\nLars.\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n", "replyTo": "Subject: [Radiance-general] Components don't show up", "sender": "radiance-general-bounces@radiance-online.or", "isquestion": false, "tags": [], "id": "<83C0527DB301124DA259186C70392812044728AA@ptamel05>", "refs": ["<A3049866-179B-47C6-87AE-93D0B85088F6@dmu.ac.uk>"], "datetime": "Mon May 10 23:11:16 2010", "email": "radiance-general-bounces@radiance-online.org", "subject": "Re: [Radiance-general] Components don't show up"}