{"body": "\nRob:\n\nThanks for the well-put diatribe.  I would have to agree to your\narguments.  I had thought that the term \"Dynamic Radiance\" had been used\nin only local activities like IESNA etc, but given its publicized use in\na symposium involving stakeholders from the US and EU as well as\nconference papers for IBPSA and ACEEE, it has the danger of confusing\nthe general Radiance community and setting a precedent of \"ownership\" to\nan otherwise free and easy, open source code model of collaboration.\n\nGreg Ward has been more than generous with his efforts to keep the\nRadiance community alive at a subsistence level, I might say, and his\nefforts have been aided by some incredible talent world-wide\n(Mardaljevic, Reinhart, Andersen, Fraunhofer, EPFL, LBNL to name a\nfew).  The rtcontrib tool evolved from mardaljevic (dissertation) to\nreinhart (daysim) to nytimes project (greg's implementation).  Modeling\nof complex fenestration systems (CFS) with BSDFs has an even longer\nhistory starting with work at LBNL in early 1990s to define the models\nand build experimental systems to measure BSDFs, to Window6-BSDF link to\nmkillum and validation by Ward/Mistrick/ LBNL last year, to creation of\nrtcontrib-bsdf (or rtcontrib4.0 or rtcontrib') via HMG/ SCE and LBNL\nfunding.  If none of these activities had happened through the hard work\nof others and shared with the general Radiance community, the new\nversion of rtcontrib would never have materialized.  More work is needed\nto validate rtcontrib' (LBNL is in the process of doing this work;\ncollaborators welcome) and make the tool accessible and useable by the\ngeneral Radiance community. There's still a lot of work to be done to\nmake simulation of optically complex fenestration systems routine and\nthis will require world-wide collaborative efforts to make this happen.\n\nBy the way, the term \"dynamic\" in Dynamic Radiance is meant to encompass\nCFS, annual simulations (temporal/ spatial variations), operable facade\nelements like automated blinds, but this makes things even more\nconfusing in my humble opinion.  We've been able to do annual\nsimulations with TMY data and split flux method (ok not great) and\noperable facade elements for two decades using DOE-2.  Daysim has been\ndoing annual simulations and operable facade elements for the past\n5-10(?) years.  What's new is the modeling of CFS.  This method has been\n\"documented\" in the Radiance Workshop last year -- Andrew McNeil will be\nworking on additional documentation with Greg Ward to make this feature\nmore accessible to the Radiance community.\n\nAnother postscript: I think new software titles that include the word\n\"Radiance\" has to be pre-approved by LBNL.\n\nbest, el.\n\nOn 5/16/2010 7:22 PM, Guglielmetti, Robert wrote:\n\n\n", "replyTo": "Subject: [Radiance-general] \"Dynamic Radiance\" and Radiance Terminology", "sender": "Eleanor Lee", "isquestion": false, "tags": [], "id": "<4BF422EB.1030606@lbl.gov>", "refs": ["<FFF56A6D37A3A54F91A03601AC22DA320C46211B22@MAILBOX2.nrel.gov>"], "datetime": "Wed May 19 10:42:07 2010", "email": "eslee at lbl.gov", "subject": "[Radiance-general] \"Dynamic Radiance\" and Radiance Terminology"}