{"body": "\nHi Jill,\n\n\n\nI believe IESNA is trying to have a stronger presence in daylighting.\nFor the past 6 years or so they have had a Daylighting Institute along\nwith a Lighting Institute which occurs for 2 days before the exhibit\nhall opens at LightFair.  This includes two days of daylighting specific\npresentations and relates to the \"Daylighting Pavilion\" they now\ndistinguish on the LightFair floor.  From 2004 - 2006ish there was also\na loose daylighting forum at LightFair organized by New Buildings\nInstitute (I believe) where industry representatives got together to\ndiscuss the state of affairs.  Not much came from that and it fizzled.\nThere is also two IESNA committees focused on daylighting - the\ndaylighting committee (chaired by Kostas Papamichael and working on a\nDaylighting RP-5) and the daylight metrics subcommittee (chaired by Lisa\nHeschong and working on a dynamic daylight metric).  This year, as part\nof a Daylighting Plus research project and the metric subcommittee\nefforts, there was a new Daylighting Forum held at the end of LightFair\nfor 2 days.  Many of the who's who in daylighting attended and there\nwere good general discussions about the state of affairs for\ndaylighting, the need for metrics for a variety of code applications,\nand the idea of making it a more regular forum came up - though nothing\nconcrete that I know of.\n\n\n\nI'd like to see a daylighting forum continue as part of IESNA's\ndaylighting institute, and I'd like to see it occur in combination with\nthe classes during the LightFair event.  Alternatively, perhaps there\nshould be or already is a strong daylighting component to the CIE\nactivities.  I know there is some activity relative to climate based\ndaylight simulation but am not as familiar with CIE activities.\n\n\n\nCheers,\n\nZack\n\n\n\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of Jill\nDalglish\nSent: Tuesday, May 25, 2010 3:51 PM\nTo: radiance-general@radiance-online.org\n\n\nI apologize that this is not really a post regarding Radiance but\nhopefully is still applicable to some users.\n\nDoes anyone know of any professional daylighting groups or societies?\nEspecially one that is geared toward the consultant? I am aware of the\nDaylighting Collaborative at the Energy Center of Wisconsin, however\ntheir membership pricing structure does not seem to be geared toward the\nindependent consultant, but more toward larger manufacturers. I have\nasked them about changing their pricing structure, but they do not seem\nto want to budge.\n\nWould anyone be interested in starting such a group with me? Or in\npersuading the Daylighting Collaborative into changing their pricing\nstructure? Email me directly at jilldalglish@yahoo.com\n\nThanks\n\n\n\nJill Dalglish, EIT, LEED AP\nwww.dalglishdaylighting.com <http://www.dalglishdaylighting.com/>\nDalglish Daylighting, LLC\n\njilldalglish@yahoo.com\n\n\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20100608/50a95e49/attachment.htm\n", "replyTo": "", "sender": "radiance-general-bounces@radiance-online.or", "isquestion": true, "tags": [], "id": "<24A618F8B54C4348B54C8684C918963B01577E68@BUGS.ideasi.com>", "refs": [], "datetime": "Tue Jun  8 15:47:27 2010", "email": "radiance-general-bounces@radiance-online.org", "subject": "[Radiance-general] Daylighting Society"}