{"body": "\nHello experts:\n\nEven if mkillum is used for window, the shadow ray in a point will be still\nsent to sun (just pass through the window) to calculate the contribution of\nsun (direct calculation). The reason is \"illum surface do not interfere with\nthe shadow testing of others, non illumn sources\" (Page 572 in the book\nRendering with Radiance).\n\nIn Page 568-569 of the book, a decorative luminaries is illustrated to show\nwhy to use illum. One reason of using illum is that the shadow ray in\na point may hit the fixture of the lamp and get a shadow which is incorrect\n(it is incorrect because other parts of the lamp may illuminate the\npoint). Using illum will make the lamp a uniform radiator and therefore a\nshadow ray hit the illum will return a nonzero value.\n\nIn the above first paragraph , as the book said, the shadow ray (that\nhitting the sun) will not be interfered with by the illum (window, in this\nexample) . But for the decorative luminaries example (in the second\nparagraph), My problem is that I do not know which of the following is right\nas to the ways of treatment of Shadow ray test of this example.\n\n(1)  In this way, we do not need to consider the shadow ray test of the\nlamp. In orther words, we can think of the new illum enclosing the lamp as\na special light, and there is no light (lamp) inside the illum, and\ntherefore, only one shadow ray is sent to the illum and NO shadow ray is\nsent to the lamp (inside illum)\n\n(2) It is similar with the example (window illum) in the above first\nparagraph,  In this case, one shadow ray is sent to hit the lamp and one\nshadow ray is sent to hit the illum. Both of them will calculate the direct\npart of light source. The illum just shows the luminance distribution of\nlights reflected by the lamp fixture rather than lights directly from lamp.\n\nThank you,\n\nJia\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20100720/263c8680/attachment.html\n", "replyTo": "", "sender": "Jia Hu", "isquestion": true, "tags": [], "id": "<AANLkTinc79Tk-bSbQw0YR6kYmiM_xH4NPZ48AJSpi-cg@mail.gmail.com>", "refs": [], "datetime": "Tue Jul 20 10:23:28 2010", "email": "hujia06 at gmail.com", "subject": "[Radiance-general] illum examples"}