{"body": "\nNote that setting -ab 1 may not count sky component diffusely transmitted through trans materials, as that's considered another bounce. Maybe this is fine, depending on interpretation of your intention - \"direct contribution of the sky to a point on a vertical plane.\"\n\nIf you need to set -ab 2 or higher to count diffuse transmission in this first part, you could set all your non transmitting materials to zero reflectance, or the ambient include/exclude options may serve the purpose, see -ae, -ai, -aE, and -aI.\n\n\n\n-----Original Message-----\nSent: Monday, July 26, 2010 4:32 AM\n\n\nFor the direct part simply use \"-I -ab 1\" in your rtrace command (or \"-i -ab 1\" if you want to calculate pictures):\n\necho \"0 0 2 0 1 0\" | rtrace -w -h -ab 1 -I scene.oct | rcalc -e '$1=($1*0.265+$2*0.67+$3*0.065)*179' > facade_direct.lux\n\nThen calculate the total of direct and reflected component by increasing \"-ab\" to an appropriate value:\n\necho \"0 0 2 0 1 0\" | rtrace -w -h -ab 4 -I scene.oct | rcalc -e '$1=($1*0.265+$2*0.67+$3*0.065)*179' > facade_total.lux\n\nThe reflected light is the difference between total and and direct component. You can also render images and subtract the images from each other. See the 'pcomb' command for details.\n\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n\n\n", "replyTo": "<AANLkTinMgX2vNm9PRB3wq2MEdFA3LFPQp+VLgEgj2STk@mail.gmail.com>", "sender": "radiance-general-bounces@radiance-online.org", "isquestion": false, "tags": [], "id": "<28285BAEA8C0814DBF1B199C876EC5B048624E91CE@AMXEXC01.global.arup.com>", "refs": ["<AANLkTinu4ARdHpmWnL3M1aPFqyyot3ntD42fDPuonGF7@mail.gmail.com>", "<AANLkTinMgX2vNm9PRB3wq2MEdFA3LFPQp+VLgEgj2STk@mail.gmail.com>"], "datetime": "Mon Jul 26 06:50:24 2010", "email": "radiance-general-bounces@radiance-online.org", "subject": "[Radiance-general] how to split vertical illuminance level intolight coming from sky and light reflected by surface?"}