{"refs": [], "id": "", "subject": "[Radiance-general] CALL FOR INTEREST -- FORTH ANNUAL RADIANCEWORKSHOP", "email": "Christoph.Reinhart at nrc-cnrc.gc.ca", "body": "Message-ID: <10C94843061E094A98C02EB77CFC328710728DF9@nrcmrdex1d.imsb.nrc.ca>\n\nWhat: The use of RADIANCE in Design Practice, Research, and Education\n\nWhere: McGill University, School of Architecture, Montreal, Canada\n\nWhen: August 11th & 12th (Thursday & Friday) 2005\n\nThe workshop will be hosted by the National Research Council Canada (NRC)\nand McGill University, School of Architecture. Workshop organizers are\nChristoph Reinhart (NRC) and Greg Ward (Anyhere Software).\n\nEstimated Cost: previous workshop registration fees were about 200-300\nCanadian Dollar (~0.82 $US) and we will aim for a comparable figure.\n\nPurpose: To provide design practitioners, researchers, and educators with an\nopportunity to present their work with the Radiance lighting simulation\nsoftware, and to share ideas and solutions with other attendees.\nParticipants are invited to give a talk, which will be limited to 30 minutes\n(~20 minute for the talk followed by ~10 minutes of open discussion). Please\nnote that a presentation at the workshop does not count as an official\npublication, so it can be submitted in parallel to other venues without\nconflict, and likewise may be work that has been published elsewhere. We\nalso plan to organize a software demo session during which developers can\npresent their working software. It is yet to be determined whether this\nworkshop will also include a tutorial component.\n\nRadiance users of all levels are welcome.\n\nThis is a preliminary call to gauge the level of interest and determine if\nwe will be able to hold this workshop or not. So, if you are interested,\nPLEASE RESPOND NO LATER THAN FRIDAY JANUARY 7 2005 to Greg\n(gregoryjward@gmail.com <mailto:gregoryjward@gmail.com> ) and Christoph\n(christoph.reinhart@nrc.ca <mailto:christoph.reinhart@nrc.ca> ).\n\nPlease note, that this workshop has been scheduled in the week preceding the\n9th International Building Performance Simulation Association Conference\nwhich will also be held in Montreal ( <http://www.ibpsa.ca/bs2005/>\nhttp://www.ibpsa.ca/bs2005/). We hope that some of you will be able to\ncombine the conference with the Radiance workshop. A final announcement with\nthe agenda, workshop dates and registration fees will be sent out in late\nWinter 2005. Please complete the form below if you would like to attend.\n\nChristoph and Greg\n\n------------------------ Pre-registration Form ------------------------\nAttendee Name (First M. Last, Title):\nE-mail:\nAddress:\nTelephone:\nStudent (Yes/No):\nTitle (if you plan to give a talk):\nAbstract/Description:\nSoftware Name (if you plan to demonstrate your software):\nAbstract/Description:\nWould you be interested in attending a tutorial? At which level?\nOther Comments:\n----------------------------------------------------------------------------\n-----\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20041215/ea70516f/attachment.htm\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Reinhart, Christoph", "datetime": "Wed Dec 15 15:42:53 2004"}