{"body": "\nMorning Jia.\n\nOn Wed, Jul 14, 2010 at 3:28 AM, Jia Hu <hujia06@gmail.com> wrote:\n\nFirst think about what rtrace really does: It calculates the\nbrightness of a point on a surface seen from the origin with a given\nview direction (the six coords per line you feed into it). The result\nis a separate value for the red, green and blue colour component. If\nyou do number of calculation each with a slightly different angle you\ncan compose an image out of these r,g,b values. This is what rpict\ndoes.\n\nThe brightness of the spot depends obviously on the colour of the wall\nand the amount of light that falls onto it. A dark wall will reflect\nless of the incident light than a white wall. You can use rcalc to\nconvert these into to the photopic average ie. how \"bright\" this spot\nappears to the human eye.\n\nSo far so good, but in daylight simulation we are traditionally less\ninterested in the brightness of a surface than in the light that falls\nonto it. Therefore rpict and rtrace offer the \"-i\" (lower case) switch\nwhich will ignore the surface colour on the last bounce and report the\namount of light that falls on a given spot instead of the light that\nis reflected off it. An image calculated with this option can be\nconverted with falsecolor to a colour map or in a contour line image\nwhich shows the Lux levels on any given surface.\n\nWhat now if you want to calculate the incident light on a surface when\nthere is no physical surface that would show in an image (like a\ntheoretical workplane)? This is what the \"-I\" (upper case) option\naccomplishes: In addition to reporting the irradiance/illuminance it\nalso adds a virtual plane at the point of your origin and flips around\nthe origin and direction.\n\nTake for example an origin of (0,0,0.75) and a direction of (0,0,1)\nfor up which calculates the horizontal illuminance at 750mm. With \"-i\"\nrtrace would look from (0,0,0.75)  straight up to the ceiling and\ncalculate the light falling onto the spot at (0,0) on the ceiling.\nWith \"-I\" rtrace creates a virtual surface at 750mm with a surface\nnormal of (0,0,1) (=horizontal). Then it places the origin at\n(0,0,0.75+1) and looks down onto this surface (new view\ndirection=(0,0-1)). The result is the irradiance on a horizontal\nsurface calculated at (0,0,0.75). Just what we need for daylight\nfactors etc.\n\n\nAs I mentioned above you can created images pixel by pixel using\nrtrace. However, a valid Radiance picture needs a header containing\nthe resolution and other information. By default rtrace prints this\nheader before it prints the results of the calculations. (I assume\nthere are historical reasons for that. I'd expect that most uses of\nrtrace switch the header of with \"-h\".)\n\nYou probably have never seen the header because your output is piped\nthrough rcalc which converts it into a bit of number garbage. Just try\nthe following commands on your bash prompt:\n\necho \"0 0 1 0 0 1\" | rtrace scene.oct\necho \"0 0 1 0 0 1\" | rtrace -h scene.oct\necho \"0 0 1 0 0 1\" | rtrace -h -w scene.oct\n\nSubstitute \"scene.oct\" with any octree you have around. The difference\nbetween the first two should be obvious. The last command uses \"-w\" to\nswitch of the warning about \"no light sources found\", too. That will\nonly be printed if you have no sun in your scene, though.\n\n\nmkillum can help you saving time by splitting the calculation in one\npart for the exterior (until the light reaches the window) and one for\nthe interior. If your exterior is fairly simple there is little gain\nfrom this extra step.\n\nYou will also find it difficult to extract the window glass geometry\nfrom your *.rad file if it is produced by Revit. The normals might be\nthe wrong way around and you may have multiple surfaces instead of\nonly one as mkillum requires. I think you're better of not to use\nmkillum at his point. If you have doubts about the accuracy of your\ncalculations increase \"-ab\" by 1 or 2.\n\n\nThere are no options for Python that would affect Radiance. From Rob's\npage you should know that you need to specify an ambient file (\"-af\"\noption) to benefit of the \"-n\" parallel processing. If you have a\nnumber of options for your geometry you can also just run one rtrace\nprocess for each scene in a separate shell. Then you don't have to\nworry about parallel processing options.\n\nCheers,\nThomas\n\n", "replyTo": "Subject: [Radiance-general] rtrace", "sender": "Thomas Bleicher", "isquestion": false, "tags": [], "id": "<AANLkTiliuLc3Bh3WXG_-rSt59fmouF8d-8dufv3bqe6C@mail.gmail.com>", "refs": ["<AANLkTimTGpvDCx6VJE5peDHdvRSuNA6xLWQy-lg7XFJL@mail.gmail.com>"], "datetime": "Wed Jul 14 02:14:43 2010", "email": "tbleicher at googlemail.com", "subject": "[Radiance-general] rtrace"}