{"body": "\nHi!\n\nFirst, I would recommend dxf2rad, not torad or radout.\n\nSecond, modelers ar great, but often lack precision you need for\nbuilding models. You do not need nurbs for most architectural\nsimulation, but good precision. That is why I mentioned formz, maybe\nRhino offers the same. Blender is not made for this (but good for\nconversion and such, as it supports quite a lot of formats and\ngeometry functions).\n\nI had mentioned the option to use brlcad for one simple reason.\nAutocad is popular, but a horror for people who want to keep their\nproject data in standard formats. They change format support from\nversion to version and keep the dwg format closed and it's development\nunpredictable. Keeping only the geometry (obj) is not a good solution.\nSo I have been looking for options to link Radiance to open and\nstandardized formats. IGES is one, STEP another. A lot of Cad software\nsupports these. And as brlcad can convert them into obj on the command-\nline, it is possible to keep all geometry in such Cad formats and\nconvert on the fly. I think for people who want to access their\nprojects 10 years later a great advantage, and the only reason I\nmention it here.\n\nAbout texteditors, it depends on the project. A lot of simulation\nmodels require little detail, but high precision. And using genbox and\nCo not only avoids leaks, but makes sure that you control surface\nnormal orientation. But it all depends on needed complexity of\ngeometry and on what you want to do with yor model.\n\nCheers, Lars.\n\n--\nDipl.-Ing. Architect Lars O. Grobe\n\nOn Aug 6, 2010, at 23:21, Jack de Valpine <jedev@visarc.com> wrote:\n\n\n", "replyTo": "Subject: [Radiance-general] Radout", "sender": "Lars O. Grobe", "isquestion": false, "tags": [], "id": "<60398AEE-2E6D-4911-8EDA-53824A3E85D4@gmx.net>", "refs": ["<E35477F1A321144D897D44CCAAFF202C048D146D6B@AD-MAILBOX01.aau.dk><AANLkTin0NaiaR0vJ+781uQGPx+jBtYzXiSxTU+DsKNYb@mail.gmail.com><4C59C3B1.9080602@gmx.net><53712E7580A846E28012D3BAF84D288D@mmgsal.com><AANLkTim8MXA1x0NTcWzm-X6bG+9Z4HLCo+7SO6S-01mf@mail.gmail.com><BA215A87697445D184DF6485C9693577@mmgsal.com>\t<AANLkTin-X_YsmiTDd+ZGyk73CYdiDyZjMbwt0OyKXFdK@mail.gmail.com>\t<3CB2191A006D4424A22300C12B2D95C3@mmgsal.com>\t<4C5C1A38.9010106@visarc.com>\t<bad2a9c420a855683ead8109a30eb859.squirrel@www.eegroup.info>", "<28285BAEA8C0814DBF1B199C876EC5B048631FDE02@AMXEXC01.global.arup.com>", "<4C5C7CD6.4030506@visarc.com>"], "datetime": "Sat Aug  7 00:53:18 2010", "email": "grobe at gmx.net", "subject": "[Radiance-general] Radout"}