{"body": "\nJust thought this was interesting:\n\nFor nearly two decades, if you wanted to run AutoCAD you have had to\nuse a PC. Today Autodesk is announcing that they are reintroducing\nAutoCAD for the Mac and will be introducing free apps that will read\nAutoCAD files for the iPAD and iPhone.\n\nThere are many engineers in the TV business who rely on AutoCAD for\nplant engineering tasks. It will be nice to have access to all your\ndrawings on an iPAD...\n\nRegards\nCraig\n\nhttp://www.nytimes.com/2010/08/31/technology/31autodesk.html?_r=1&th&emc=th\n\nAutodesk Will Reintroduce Its AutoCAD Design Software for Macs\nBy MIGUEL HELFT\nPublished: August 30, 2010\n\nSAN FRANCISCO - When it comes to Apple products, the iPad and the\niPhone get all the headlines.\n\nBut in recent years, the company's Macintosh line of computers has\nenjoyed a remarkable revival that has been vital to Apple's emergence\nas the most valued technology company on Wall Street.\nIn the latest sign of that comeback, Autodesk plans to announce on\nTuesday that it is bringing its flagship AutoCAD design and\nengineering software to the Mac for the first time in nearly two\ndecades.\n\nThe return of AutoCAD to the Mac could help Apple sustain its\nmomentum in the competitive market for personal computers, especially\nwith business customers, where Apple has made significant inroads\nrecently. Autodesk estimates that 10 million people use the AutoCAD\nsoftware around the world, and the company said that its customers\nhad been asking for a Mac version with growing frequency.\n\n\"This is an endorsement from our side that design and engineering\ncustomers are taking the Macintosh seriously again,\" said Amar\nHanspal, senior vice president for platform solutions at Autodesk.\n\nThe Mac was once a popular platform for AutoCAD. But Apple's share of\nthe personal computer market dwindled in the early 1990s, so Autodesk\nmade its last version of AutoCAD for the Mac in 1992, and stopped\nsupporting it in 1994. The company continued to make other products\nfor the Mac, including software used in the entertainment industry.\n\nAutodesk could no longer ignore Mac's comeback, Mr. Hanspal said.\n\nThe Mac accounted for nearly 10 percent of all PCs sold around the\nworld in the first quarter, according to Gartner, or more than double\nits share just a few years ago. In the most recent quarter, Apple\nsold nearly 3.5 million Mac computers, a 33 percent increase from the\nsame quarter a year earlier. That rate of growth far exceeded the\noverall PC market.\n\nIn a news release, Philip Schiller, Apple's senior vice president for\nworldwide product marketing, said his company was thrilled that\nAutodesk was bringing AutoCAD back to the Mac. \"We think it's the\nperfect combination for millions of design and engineering\nprofessionals,\" he said.\n\nThe Mac version will cost $3,995, the same as the PC version, and\nwill be released in October. AutoDesk will soon introduce a free\nmobile version of the software that will run on the iPad, iPhone and\niPod Touch. That version has more limited capabilities, Mr. Hanspal\nsaid. But with it, an engineer, for example, could bring drawings to\na job site on an iPad, rather than on a big roll of paper, and make\nannotations on them.\n\nThe mobile version will be able to read any AutoCAD files, whether\nthey were created on a PC or a Macintosh.\n\nMr. Hanspal said AutoDesk was considering making mobile versions of\nthe design software for other tablets on the market.\n\n\n", "replyTo": "", "sender": "craig@pcube.com", "isquestion": true, "tags": [], "id": "<FD4F7B94-FE07-4973-A3F6-549D9631B142@gmail.com>", "refs": [], "datetime": "Tue, 31 Aug 2010 07:06:05 -0400", "email": "Craig Birkmaier", "subject": "[opendtv] News: Autodesk Will Reintroduce Its AutoCAD Design Software"}