{"refs": ["<BAY22-DAV7A0E5D631C9A893588A5990930@phx.gbl>"], "id": "<9C6043CE-6046-11D9-9BBB-000A95BB392A@gmail.com>", "subject": "[Radiance-general] Problems using hdrgen for hdri generation", "email": "gregoryjward at gmail.com", "body": "\nHi Despina,\n\nThanks to the helpful folks on the mailing list, most of your questions\nhave already been answered, but I'll try to add a few points...\n\n\nYou should definitely vary the shutter speed (i.e., exposure time)\nrather than the aperture (i.e., f-number, f-stop).  You should read the\nattached tips, taken from the quickstart_pf.txt file distributed with\nPhotosphere from <www.anyhere.com>.\n\n\nWarnings are mostly there as a kind of excuse for when things don't\nturn out.  If they turn out, then you shouldn't lose any sleep over\nthem.\n\n\nIt's probably because the sequence didn't capture enough dynamic range,\nor there were no smooth gradients.  The best strategy is to use a good\nsequence to get the camera response, then store it and reuse it via\nhdrgen's -r option.  (See the related tips in the attachment.)\n\n\nI don't know.  I would have to see the source sequence, but there's\nprobably not much I could do to fix it.\n\n\nThe automatic alignment algorithm is not fool-proof, but I don't know\nof one that is.  It does not take care of rotation, and images that are\nvery far out of alignment will not work, either.  (The maximum computed\nshift between adjacent exposures is +/-64 pixels in X and Y.)  The\nfinal solution is to use a tripod.  Using a tripod AND performing\nautomatic alignment usually gives the best results.  I have good luck\nmyself with auto-bracketed hand-held exposures, and practice does help.\nI still get bad sequences, though -- usually in portrait mode, as I\nhave a hard time not leaning during the exposures....\n\n-Greg\n\nTips on HDR image creation taken from Photosphere quickstart blurb:\n\n12) To create a high dynamic-range image, you need to start with\na set of \"bracketed\" exposures of a static scene.  It is best if\nyou take a series of 10 or so exposures of an interior scene looking\nout a window and containing some large, smooth gradients both inside\nand outside, to determine the camera's natural response function.\nBe sure to fix the camera white balance so it doesn't change, and\nuse aperture-priority or manual exposure mode to ensure that only\nthe speed is changing from one exposure to the next.  For calibration,\nyou should place your camera on a tripod, and use a small aperature\n(high f-number) to minimize vignetting.  Take your exposure series\nstarting from the longest shutter time and working to the shortest in\none-stop increments.  Make sure the longest exposure is not all white\nand the darkest exposure is not all black.  Once you have created your\nimage series, load it into Photosphere directly -- DO NOT PROCESS THE\nIMAGES WITH PHOTOSHOP or any other program.  Select the thumbnails,\nthen go to the \"File -> Make HDR...\" menu.  Check the box that says\n\"Save New Response\", and click \"OK\".  The HDR building process\nshould take a few minutes, and Photosphere will record the computed\nresponse function for your camera into its preferences file, which\nwill save time and the risk of error in subsequent HDR images.\nYou will also have the option of setting an absolute calibration\nfor the camera if you have a measured luminance value in the scene.\nThis option is provided by the \"Apply\" button submenu when the\nmeasured area is selected in the image.  (Click and drag to select.)\nOnce an HDR image has been computed, it is stored as a temporary\nfile in 96-bit floating-point TIFF format.  This file is quite\nlarge, but the data will only be saved in this format if you\nselect maximum quality and save as TIFF.  Otherwise, the 32-bit\nLogLuv TIFF format will be preferred (or the 24-bit LogLuv format\nif you set quality to minimum).  You also have the option of saving\nto the more common Radiance file format (a.k.a.  HDR format), or\nILM's 48-bit OpenEXR format.  If you choose not to save the\nimage in high dynamic-range, the tone-mapped display image can be\nwritten out as a 24-bit TIFF or JPEG image.\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Problems using hdrgen for hdri generati", "tags": [], "sender": "Greg Ward", "datetime": "Fri Jan  7 01:54:33 2005"}