{"body": "\nI was creating a light source the other day, from an IES file.  Turns\nout this was to be my first encounter with an IESNA LM-63-95-formatted\nfile, on a directional, linear fixture.  Well, the first time, using\nRadiance that is.\n\nI ran the *non*-directional downlight file thru ies2rad and then checked\nit in ltview, and it looked like this:\n\nhttp://www.rumblestrip.org/site-img/rad/linear.jpg\n\nSo far so good.\n\nThen I ran the *directional* downlight file thru ies2rad and checked it\nin ltview, and it looked like this:\n\nhttp://www.rumblestrip.org/site-img/rad/assym.jpg\n\nEureka!  I have defied physics!  It was after looking at this image that\nI re-checked the ies file, and discovered that it's the LM-63-95 spec.\nThis is a problem, because the spec calls for the 0-180 vertical plane\nto be oriented parallel to the lamp axis, whereas it's more common to\norient it perpendicular.  ies2rad can't even have a check for this,\nbecause the spec is so loosely written.  This is why checking the\ndistribution of my converted luminaires is so important to me, prior\nusing them in a calc.  I always did it because I don't trust myself, but\nclearly too much faith in the quality of your input files is also a bad\nthing.\n\nAnyhoo, I simply reversed the length and width values for the luminous\nopening parameters in the ies file, and got this:\n\nhttp://www.rumblestrip.org/site-img/rad/assym90.jpg\n\nNow, I have a useable fixture, albeit one with a default plan\norientation that is 90 degrees off from the norm.  I guess I could\n\"wrap\" the whole thing in an xform file so that I could use it in a\nstandard library.\n\nIs there a better way to \"correct\" a funky IES file for ies2rad? What do\nyou all do when you encounter this?\n\n- Rob G.\n\n\n", "replyTo": "", "sender": "Rob Guglielmetti", "isquestion": true, "tags": [], "id": "<40CA1120.4070203@rumblestrip.org>", "refs": [], "datetime": "Fri Jun 11 22:07:29 2004", "email": "rpg at rumblestrip.org", "subject": "[Radiance-general] IES file fun"}