{"body": "\nHi Everyone,\n\nI understand the appeal of both Singapore and Golden, CO for the Radiance workshop next year.   While everyone is thinking about it I thought I should highlight some of the benefits of holding the workshop in Berkeley - the birthplace of Radiance.\n\nWe've increased activity in direct Radiance development, as well as indirect Radiance development including optical characterization, Window 6 for complex fenestration, etc.  We'd like the opportunity to share these developments with the Radiance community.  Those of you at the workshop last week remember that half of my presentation covered LBNL software developments that relate to Radiance - If the workshop is held in Berkeley the people who develop these tools will be able to make an appearance to explain, demonstrate, and take comments and suggestions.  Things are moving at a quick pace, so there will be a lot of new developments to showcase.\n\nWe are planning to offer many seminar options for the pre/post workshop day possibly including:\n- A Seminar with LBNL software teams (Window, Optics, COMFEN, BCVTB, etc) to discuss new and old Radiance related features and proposals for future features.\n- An optical measurement workshop given by the optics measurement team covering theory, equipment & procedures, data formats & data dissemination followed by a lab tour and equipment demonstration (for both specular and complex glazing systems).\n- A Radiance beginner workshop for new users.\n- A discussion of Lighting & Daylighting in the evolving design process - San Francisco is a hotbed of collaborative A/E and owner activity.  LBNL has a lot to discuss in this area.\n\nWe also have a windows test bed facility for testing advanced fenestration systems.  We are currently testing automated external louvers, automated awnings, automated venetian blinds, and static and active daylight redirecting systems.  All these technologies are all being cycled (changing every four days - two systems being testing at a time).  We don't yet know what we'll be testing next year, but I'll will do whatever I can to make sure it is equally interesting (I'll take suggestions).\n\nBest,\nAndy\n\n\n\n\nOn Sep 28, 2010, at 10:50 AM, Carsten Bauer wrote:\n\n\n\n", "replyTo": "Subject: [Radiance-general] Re: Next year's workshop (Gregory J. Ward)", "sender": "Andy McNeil", "isquestion": false, "tags": [], "id": "<97C9F885-AC0A-4A8D-9AA9-EED2C39CDC82@lbl.gov>", "refs": ["<201009281750.o8SHoGYS014796@post.webmailer.de>"], "datetime": "Tue Sep 28 13:47:40 2010", "email": "amcneil at lbl.gov", "subject": "[Radiance-general] Re: Next year's workshop (Gregory J. Ward)"}