{"body": "\nResponses below.  Perhaps they are already circulated.\n\nKent Beason\nSchlitterbahn Development Group\n830-609-8904 m\n\n________________________________\nSent: Friday, September 17, 2010 1:18 PM\nTo: duffy@tess-inc.com; Kent Beason; trnsys-users@engr.wisc.edu\nWhat I just did on a project was to run the building model in Daysim to determine the light level in lux achieved in each space and generate an 8760 report.\n\nThen I determined what fraction of light as compared to the design light level I would achieve through daylighting.\n\nThe power fraction reduction is [1-(sensor lux/design lux)].\n\nThen I have a artificial lighting schedule for my building within the Studio that I multiply the schedule fraction by the daylight fraction to get the actual artificial light fraction for that hour.\n\nSomething you should be aware of is the limitations of your ballasts. If the ballasts are stepped or can only dim to 50%, you will need to add more logic to properly represent your lighting control system.\n\nAlso, make sure if you are controlling your blinds in radiance to reduce glare that you use the same algorithms in TRNSYS because of the solar heat gain on the windows.\n\nLet me know if you have any questions.\n\nFred\n\n\nFred Betz  PhD., LEED AP\nSustainable Systems Analyst\n\n\n\nAEI | AFFILIATED ENGINEERS, INC.\n5802 Research Park Blvd. | Madison, WI  53719\n\nP: 608.236.1175 | F: 608.238.2614\nfbetz@aeieng.com<mailto:fbetz@aeieng.com>  |  www.aeieng.com<http://www.aeieng.com/>\n\n\n\nSent: Friday, September 17, 2010 11:28 AM\nTo: Kent Beason; trnsys-users@engr.wisc.edu\n\nHello Kent,\n\nI actually was just presented a response by another user, Cramer Silkworth. I am unfortunately not too familiar with Radiance, but here was the response.\n\nBest regards,\n\nMatt Duffy\n\n\"Both trnsys and radiance are very powerful simulation engines. Though graphical interfaces for both exist (built-in with Trnsys, in Simulation Studio, and as add-ons for Ecotect and Sketchup for Radiance), they are most powerful when used like a programming language - ie, modifying their text input files directly. This gives you the most control, and once you learn their syntax, I'd say easier than the graphical interfaces. Especially for parametric studies.\n\nIf I were to want to couple radiance and trnsys for a project, I'd be using DaySim as a front-end for radiance. Version 3 is on the verge of final release (workable beta is available now - www.daysim.com<http://www.daysim.com/>), and it's free. It essentially runs radiance for your geometry in an annual simulation (with weather data), can handle active shading and electric lighting, and has numerous outputs - including one intended for coupling to trnsys. Then you just need to set up your trnsys model to read this file from daysim (it comes with a generic data file reader component), and then you use your results to modify your lighting power accordingly (or whatever variable you want to respond to lighting conditions). I can't say I've used too many other daylight & energy modeling programs, but I'm fairly confident there are very few if any other programs out there that can handle such a coupling as detailed as trnsys & daysim/radiance can. I've heard of it being done with eQuest, but I think the eQuest side of things is a bit limited. There are other daylight simulation programs as well, but Radiance is always talked of as being the industry 'standard.'\"\n\n\n----- Original Message -----\nSent: Fri, September 17, 2010 10:24\n\nI am on the Radiance users list and the following question regarding TRNSYS was posted in that group.  I believe they want to control the window blinds & the zone's artificial lighting based on lumens entering the zone:\n\nWe want to simulate the lighting conditions in a building with the RADIANCE Software.\nThe Simulation depends on the natural and artificial light and the window blinds.\nAfter this simulation, we want to send the results from RADIANCE to a simulation software called TRNSYS.\n\nHere are my questions regarding this topic:\nIs it possible to couple RADIANCE with TRNSYS?\nDoes RADIANCE only image-files (as output) produce?\nHave anybody of you, connect TRNSYS with RADIANCE successfully?\nAnd have you any tutorials or other useful documents/links?\n\n\nThank you in advance.\n\nRegards,\nMarion\n\nKent Beason\nSchlitterbahn Development Group\n830-609-8904 m\n830-608-8040 f\n\n________________________________\n\n_______________________________________________\n\nTRNSYS-users mailing list\n\nTRNSYS-users@cae.wisc.edu<javascript:bodyCreateMail('TRNSYS-users%40cae.wisc.edu')>\n\nhttps://www-old.cae.wisc.edu/mailman/listinfo/trnsys-users\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20100917/44c4991d/attachment-0001.html\n", "replyTo": "", "sender": "kbeason@schlitterbahn.com", "isquestion": true, "tags": [], "id": "<BE7A057284521F4BA6109CB05AA32B9D0EC9D638D0@mercury>", "refs": [], "datetime": "Fri Sep 17 11:33:12 2010", "email": "\"Kent Beason\"", "subject": "[TRNSYS-users] Radiance to/from TRNSYSDear TRNSYS users,"}