{"refs": [], "id": "<9532C91A4A8A954683A3CF2C59AF889F01BE68C8@sh-srv-mail1.syskamail.syska.net>", "subject": "[Radiance-general] Specular Reflections from Plastic?", "email": "kbaker at syska.com", "body": "\nHello,\n\nI have a fundamental question about Radiance that I can't figure out.\nWhat is the best way to get Source specular reflections from a plastic,\nmetal, or trans material?\n\nIn my model, setting the specular component of the material at or near\n1.0 correctly provides view reflections in the material (reflections of\nthe window on the other end of the room).  However, there are no\nreflected solar patches, as is expected with direct sun landing on the\nreflective material.\n\nUsing the material type mirror, the virtual light source is created and\nthe solar patch shows up, but when a plastic, metal, or trans material\nis specified with a specularity at or near 1.0, there isn't even a\nglimpse of the expected reflected solar patch.\n\nAs an example, imagine a window with a partition perpendicular to that\nwindow.  The sun is out and shining through the window onto that\npartition.\n\n-If I make that partition a mirror material type, I see this wonderful\nreflected solar patch on the floor.\n\n-If I make that partition a plastic, trans, or metal with a specular\ncomponent of 1.0, there is no reflected solar patch on the floor.\n\nvirtual light source and all is good, but it does not do this for\nplastic, metal, trans.\n\nWhen the plastic, metal, or trans is set as specular, Radiance\naccurately shows the reflection of the view in the partition (in this\ncase the window), but the direct solar flux that entered and hit the\npartition is gone, or at least transferred to the indirect or ambient\ncomponent.\n\nAll parameters are defaulted at the medium level and I have bumped\ndirect relays to 3 (lr=6, lw=.002, dr=3, st=0.1)\n\nThis is simple and a most fundamental calculation, but alas no dice.\n\nAny ideas?  Thanks.\n\n\nKB\nKristopher S. Baker\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Baker, Kristopher", "datetime": "Tue Jan 18 16:56:35 2005"}