{"body": "\nHi\n\nThe sky view factor (SVF) is defined as the fraction of visible sky as seen from a given point. Thus a totally unobstructed point should get SVF=1\nA point located just in front of a vertical facade should get SVF=0.5\n\nFor the calculations SVF can be defined by the ratio of two projected solid angles:\nSVF= Omega_p / Omega_h\nwhere Omega_p is the projected solid angle of the sky as seen from the point p of interest and Omega_h is the projected solid angle of the unobstructed sky hemisphere which is equal to Pi\nThen we have SVF=Omega_p / Pi = Omega_p*L / Pi*L\nwhere we just introduced an arbitrary uniform luminance for the sky vault\nThen because the illuminance calculated at point p is E_p = Omega__p*L we can rewrite:\nSVF= E_p / (Pi*L)\nE_p can be calculated with rtarce -I\nIf we choose L=1/Pi then the SVF is directly SVF = E_p\n\nSo what you need is a uniform sky with L=1/Pi as defined like this:\n\nvoid glow white\n0\n0\n4 .318309886 .318309886 .318309886 0\nwhite source uniform_sky\n0\n0\n4 0 0 1 180\n\nNote that you don't need to define the ground (because SVF is just about the sky...)\n\nThen to compute SVF for some points:\nrtrace -h -w -I -aa .... | rcalc -e 'SVF=$1;$1=SVF'\n\nFor the calculations, I think it is better to specify direction vectors pointing towards the true normal direction of the relevant surface.\n\nRaphael\n\n________________________________________\nDe : radiance-general-bounces@radiance-online.org [radiance-general-bounces@radiance-online.org] de la part de Ji Zhang [hope.zh@gmail.com]\nDate d'envoi : mercredi, 1. septembre 2010 08:24\n? : Radiance general discussion\nObjet : [Radiance-general] the vector of sensor in SVF calculation\n\nDear Radiance experts,\n\nAccording to the paper \"Compagnon, R. (2004). Solar and daylight availability in the urban fabric. Energy and Buildings, 36(4), 321-328\", we can use Radiance to calculate Sky View Factor by \"using a uniform sky model of arbitrary luminance L and by computing the illuminance Ei without taking into account the contribution of interreflections to ensure the integration is performed over the unobstructed part of the sky vault only\".\n\nThe formula is: SVF = Ei / (PI * L).\n\nWe use the following to define the uniform sky with a horizontal diffuse irradiation of 100 w/m^2:\n#########################################################\n!gensky 6 20 +15.0  -a 1.0 -o 103.0 -m 105 -u -B 100.0 -g 0.0\n\nskyfunc glow sky_glow 0 0 4 1.0 1.0 1.0 0\n\nskyfunc glow ground_glow 0 0 4 1.0 1.0 1.0 0\n\nsky_glow source sky 0 0 4 0 0 1 180\n\nground_glow source ground 0 0 4 0 0 -1 180\n#########################################################\n\nWe use the following specification for rtrace to calculate the irradiation of a sensor point:\naa=0.1, ab=1, ad=4096, ar=512, as=1024\n\nWe then divide the irradiation value of the sensor point as obtained by 100 (the unobstructed horizontal diffuse irradiation as specified for the \"-B\" option of gensky) and this will give us the SVF of that sensor point.\n\n\nAccording to the way of calculating SVF as introduced by Compagnon (2004), my question is:\nShould the vector of the sensor point being measured always point upward to the zenith (in other words, the xyz vector for the sensor is 0 0 1) no matter how the normal of that sensor point might oriented to?\n\nFor example, if we try to calculate the SVF of the centroid of a tilted polygon (a non-horizontal and non-vertical plane), should we specify the vector of the sensor as 0 0 1 or as the xyz vector values of the actual normal of that polygon?\n\n\nThanks!\n\nJi\n\n\n", "replyTo": "Subject: [Radiance-general] the vector of sensor in SVF calculation", "sender": "=?iso-8859-1?Q?Compagnon_Rapha=EBl?=", "isquestion": false, "tags": [], "id": "<70DD3A1408BDA8498790E8D553B7D253027A3A962FC2@HEFRMAIL.sofr.hefr.lan>", "refs": ["<AANLkTik1us_dVGjtfLTw0NWuqDQXNc9yrML5v47JvUYD@mail.gmail.com>"], "datetime": "Wed Sep  1 01:26:32 2010", "email": "Raphael.Compagnon at hefr.ch", "subject": "[Radiance-general] the vector of sensor in SVF calculation"}