{"body": "\nThanks Jack,\n\nI have done some more reading on the mailing list and found a few useful\nposts describing opt2rad and glaze.\nBoth seem really useful, although glaze seems likely the most\ninteresting option because (if I understand correctly) allows for frit\nand angular dependencies in transmission/reflection.\n\nUnfortunately I am using radiance on windows using the Ming-w compiled\nversion and I do not find the files in my bin or lib folder (but I find\nglaze2.cal). Is there a version of these available for windows?\n\nAlso Glaze supports only two glass panes with an interlayer or can cope\nwith three-ply build ups?\n\nThanks again,\n\nG\n\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of Jack\nde Valpine\nSent: 28 October 2010 14:10\nTo: Radiance general discussion\n\nHi Giovanni,\n\nI will give a short answer and then try to follow-up later with a longer\n\nexplanation. Regarding the diffusing interlayer, as I recall Optics 5 is\n\nnot really set up to deal with diffusing materials (unless this has\nchanged recently). Regardless, any material definition exported to\nRadiance format will be in the form of three materials: a glass\ndefinition and a front and back side BRTDfunc. Note however that the\nBRTDfunc (unless this has been changed) is a very simplified material\ndefinition that is not set up to account for angular variation. There\nare a couple of options to convert Radiance output from Optics 5 to\nsomething more useful: A) optics2rad or B) glaze. These are both scripts\n\nthat come with the standard Radiance distribution.\n\nI am not sure what to suggest for how to manage the diffuse component.\nThis can probably be incorporated into a BRTDfunc definition. Regarding\nthe fritting, I agree with your presumption that if you are any\nreasonable distance from the building then the individual makeup (lines,\n\ndots, whatever), will disappear in most cases. It is possible to build\nup frit glass definitions (based on percent coverage) using the glaze\nscript.\n\nRegards,\n\n-Jack de Valpine\n\n--\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n\n\nOn 10/28/2010 7:49 AM, Giovanni Betti wrote:\n2\nsuggest\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n", "replyTo": "Subject: [Radiance-general] Diffusive laminated material and fritting", "sender": "radiance-general-bounces@radiance-online.or", "isquestion": false, "tags": [], "id": "<6F5225D6E15F954BB4E58EC25F6736C305DD20F8@corp3005.CORPORATE.FOSTER.NETWORK>", "refs": ["<4cc876f5.0d1d640a.7378.2bc2SMTPIN_ADDED@mx.google.com>\t<4CC8865C.7080908@gmail.com><6F5225D6E15F954BB4E58EC25F6736C305DD20DE@corp3005.CORPORATE.FOSTER.NETWORK>", "<4CC9761E.6070500@visarc.com>"], "datetime": "Thu Oct 28 06:44:41 2010", "email": "radiance-general-bounces@radiance-online.org", "subject": "Re: [Radiance-general] Diffusive laminated material andfritting"}