{"body": "\nHi Apiparn,\n\nif you use the -i option, you need to measure the vertical illuminance\nand you should do that as close to the lense as possible ! In that case,\nevalglare will use the value provided by -i as vertical illuminance.\n\nif you don't use the -i option and provide an image smaller than 180?,\nthen the vertical illuminance will be less than the real value and this\nmight have an significant influence, depending on the situation!\n\nThe detection of the glare sources and the calculation of the\ncontribution of the glare sources to the DGP are only  influenced minor\nwhen you use a smaller view angle than 180?.\n\nIn case of DGI and UGR you don't need a 180? image. Be careful when\ntrying to evaluate these glare metrics  - especially that the parameters\nfor the detection of the glare sources fit  to your scenes and that this\nfits also to the validity ranges of the equations! (e.g. DGI is only\ndefined for a window as glare source and the UGR is valid only for\nmedium sized solid angles of the artifical glare source). Always check\nby using -c option, if the \"correct\" glare sources are detected, when\nusing other glare metric than DGP! The DGP is very robust concerning the\ndetection parameters since the main contribution comes from the vertical\neye illuminance (except you have the sun or a specular reflection of it\nin the field of view).\n\nCheers,\n\nJan\n\n\n\n\nBorisuit Apiparn wrote:\n\n\n--\nDr.-Ing. Jan Wienold\nProject Manager\nFraunhofer-Institut f?r Solare Energiesysteme\nThermal Systems and Buildings, Lighting and Daylighting\nHeidenhofstr. 2, 79110 Freiburg, Germany\nPhone: +49(0)761 4588 5133 Fax:+49(0)761 4588 9133\njan.wienold@ise.fraunhofer.de\nhttp://www.ise.fraunhofer.de\n\nIn office:\nMo,Tue: 8:30-18:00\nWe,Thu: 8:30-16:00\nFr:  8:30-15:30\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20101011/c5464041/attachment.htm\n", "replyTo": "Subject: [Radiance-general] Evalglare - Luminance or Illuminance", "sender": "Jan Wienold", "isquestion": false, "tags": [], "id": "<4CB2E59E.40505@ise.fraunhofer.de>", "refs": ["<FF2819A4F073884F9B73CA6DC27F21B4B24C@REXM2.intranet.epfl.ch>\t<4CB2D641.7010004@ise.fraunhofer.de>", "<FF2819A4F073884F9B73CA6DC27F21B4B671@REXM2.intranet.epfl.ch>"], "datetime": "Mon Oct 11 03:22:51 2010", "email": "jan.wienold at ise.fraunhofer.de", "subject": "[Radiance-general] Evalglare - Luminance or Illuminance"}