{"body": "\nDear mailing list members,\n\nI have been experimenting with our new scientific grade CCD camera which\nI suppose can be used as an imaging photometer. Yes, after some\nextensive calibration!\n\nI would like to take some measurements of diffuse reflectance. The\nclassical setup will require an integrating sphere. Well... the\nUniversity I work at will not afford such an expensive device. I'm sure\nthere would be another way to estimate it. I guess it is possible to\nacquire BRDF and to make some diffuse reflectance estimation?\n\nBelow are my questions:\n\n1. Is there way to estimate diffuse reflectance without using of\nintegrating sphere? Also, to some extent, can the reflectance measured\nunder overcast sky conditions be referred to as diffuse reflectance?\n\n2. How do you calibrate your CCD cameras for taking luminance measurements?\n\n3. With uncalibrated camera, I guess the reflectance values can be\nestimated using HDR shots of GretagMacbeth ColorChecker chart as\nreference. The ColorChecker chart's reflectance values are known, right?\nSo, it is possible to compare the values from the shot of a sample\nagainst the values from the shot of the chart to estimate the\nreflectance of the sample?! But where can I get the GretagMacbeth\nColorChecker Rendition chart's RGB reflectance values? I wonder if\nanyone have measured them?!\n\n4. What are in the \"macbeth_spec.hdr\" and \"macbeth_pub.hdr\" files? What\ndata are in these files?\n\n5. Having estimated BRDF for a particular material sample can we\nestimate the material's diffuse reflectance?\n\nThanks,\nIlya\n\n", "replyTo": "<4CC9A14F.1040806@visarc.com>", "sender": "Ilya A. Zimnovich", "isquestion": false, "tags": [], "id": "<4CD1B496.7030104@audice.com>", "refs": ["<4cc876f5.0d1d640a.7378.2bc2SMTPIN_ADDED@mx.google.com>\t<4CC8865C.7080908@gmail.com><6F5225D6E15F954BB4E58EC25F6736C305DD20DE@corp3005.CORPORATE.FOSTER.NETWORK>\t<4CC9761E.6070500@visarc.com>\t<6F5225D6E15F954BB4E58EC25F6736C305DD20F8@corp3005.CORPORATE.FOSTER.NETWORK>\t<4CC9A04A.8080702@visarc.com>", "<4CC9A14F.1040806@visarc.com>"], "datetime": "Wed Nov  3 12:14:19 2010", "email": "webmaster at audice.com", "subject": "[Radiance-general] Diffuse reflectance measurements andGretagMacbeth ColorChecker reflectance values"}