{"body": "\nHi list!\n\nOnce again I have to ask a rather basic question, still I could not\nfind an answer so far.\n\nI have a model of a building which is illuminated solely trough windows\nconsisting of a grid of small rectangular glass panes in stone framing,\nthe whole window has an arc. So far I didn't model the panes, and the\nlight just came in through the frames, which gave not the best results\nin the rendering, but I didn't care so far. Now that I will start\nmodeling the panes, I have to think about how to use the illums later.\nAs I don't want to keep the artefacts caused by the small openings in\nmy final rendering, and as I want to speed up rpict, I need to use\nillums.\n\n- The first question is how to define the illum geometry.\n\na) I could define one polygonal surface covering the whole window from\nthe inside, and using mkillum to \"see\" the effect of the frame which is\n\"outside\" than. The pro is, that I have to model just two surfaces per\nwindow (one for the illum, and one glass pane which could intersect\nwith the frame), and I have few light sources in the scene (one per\nwindow). The negative point is that the mkillum is necessary, although\nI am not really interested in the outside, so I get some overhead. It\nwill also be not to easy to define a polygon for the surface, as the\nround outline is already converted into a polygon from the cad, and\nboth have to fit exactly. However, this is what I would conclude from\nthe advices in Rendering with Radiance (complex fenestration).\n\nb) I could model each pane, place it in its correct location, and than\nsimply put the gensky pattern on it. No mkillum needed any more (I\nactually don't want to look through the windows). The drawback is that\nI get a lot of small lightsources (around 40 per window), and I have to\nmodel lots of panes... don't laugh, modeling a rectangular surface is\nnot that difficult, but I have to make sure that the surface normals\npoint to the inside, and that is not that easy - I found some problems\nin formZ regarding normals and dxf export.\n\nSo which way to go? As I noted, I have also have to think about\nrendering speed and memory - the model is large, and I am supposed to\nproduce animations later. And I found the following on the list, which\nmakes me tend to the b) way:\n\nrectangles or (at least)\nwith\npoor choice.\nrectangles\n\n- A second question, would it make sense to remove the gensky output\nexcept the sun after the illums have been generated if I use procedure\na)? If all openings are covered with illums, I don't need the diffuse\nsky and ground any more, as they will be blocked by the illums, right?\nCould that give some additional performance? This could also reduce\nerrors caused by \"leakage\" in the model.\n\nTIA+CU Lars.\n--\nLars O. Grobe\ngrobe@gmx.net\n\n\n", "replyTo": "", "sender": "Lars O. Grobe", "isquestion": true, "tags": [], "id": "<66D4238C-CB4C-11D8-8841-000A959DDB22@gmx.net>", "refs": [], "datetime": "Thu Jul  1 20:49:14 2004", "email": "grobe at gmx.net", "subject": "[Radiance-general] windows: illum useage?"}