{"body": "\nHi everyone,\n\n\nI would like to model a double glazing system like the following:\n\nfirst pane\nsurface 1: Crystal gray (Optics database number:  3056)\nsurface 2: Crystal gray with a SunGuard Ag 43 coating (Optics: 3156)\n\nsecond pane\nsurface 3: Clear glass with a SunGuard SuperNeutral (SN) 62 coating (Optics: 3116)\nsurface 4: Clear glass (Optics: 3016)\n\n\nUsing the Optics2glazedb script provided by Jack de Valpine, I'm able to create a custom database which contain all of the above surfaces/layers and can be read by the Glaze script.\n\nHowever, the Glaze script, used to combine the surfaces and generate a usable material definition, force the user to select at least one clear glass to compose each pane (surface 1 or 2 must be clear AND surface 3 or 4 must be clear). Moreover, the clear glass must be the same for both panes and must be the first one on the list provided when running the Glaze script.\n\nMy question is:\nIf I bypass the ''if structures'' constraining the composition of the panes in order to allow the selection of two different uncoated glass, can I expect  the output to be still valid ?\n\n...\n#if ($s1t != 1 && $s2t != 1) then\n#echo \"One surface of each pane must be $sn_arr[1]\"\n#exit 1\n#endif\n...\n\n\n...\n#if ($s3t != 1 && $s4t != 1) then\n#echo \"One surface of each pane must be $sn_arr[1]\"\n#exit 1\n#endif\n...\n\n\nWithout such bypass, generating a glazing system like the one described above seems impossible.\n\n\nThanks in advance for your help,\n\n\n_____________________________________________________________\nFran?ois Cantin, M Arch, MSc Arch\n\nHudon Julien associes,\n1175 Lavigerie, suite 400, Ste-Foy(Qu?bec) G1V 4P1\nT?l: (418) 653-8484 #224, Fax:(418) 653-6189\nE-mail: fcantin at hudonjulien.com<mailto:fcantin at hudonjulien.com>\nSite web: www.hudonjulien.com<http://www.hudonjulien.com/>\nP Avant d'imprimer, pensez ? l'environnement\n\nCe message ?lectronique et tous les fichiers attach?s qu'il contient sont confidentiels et destin?s exclusivement ? l'usage de la personne ? laquelle ils sont adress?s. Si vous avez re?u ce message par erreur, merci de le retourner ? son ?metteur. La publication, l'usage, la distribution, l'impression ou la copie non autoris?e de ce message et des attachements qu'il contient sont strictement interdits.\n\nThis e-mail and any files transmitted with it are confidential and intended solely for the use of the individual to whom it is addressed. If you have received this email in error please send it back to the person that sent it to you. Unauthorized publication, use, dissemination, forwarding, printing or copying of this email and its associated attachments is strictly prohibited.\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20101214/fc8efa17/attachment.html>\n\n", "replyTo": "", "sender": "=?iso-8859-1?Q?Fran=E7ois_Cantin?=", "isquestion": true, "tags": [], "id": "<F26BAA4A842DD94083472A0D31EBBB99273E5188D3@SRVHJA02.hja.local>", "refs": [], "datetime": "Tue, 14 Dec 2010 17:47:18 -0500", "email": "FCantin at hudonjulien.com", "subject": "[Radiance-general] glaze script limitation"}