{"body": "\nHi All,\n\nMerry Christmas and Happy New Year!\n\nI am a Master's thesis student and I am a beginner in Radiance. I would like to\nthank Alex Jacobs for LEARNIX and tutorials, and Greg Ward for the effort he put\ninto Radiance. I apologize in advance if there is something wrong with my\nEnglish or if I wrote something stupid related to Radiance.\nFor the purposes of my work, I need to calculate illuminance level in one point\nof working plane in a simple office (for clear sky and sunny day), for different\nluminaires output levels, different slat angles of exterior venetian blinds, and\nfor different times of the day (i.e. for different solar angles). I am not\ninterested in for image rendering, just for the illuminance calculation. I am\nstuck with window glass modeling. This is what I got from Optics5 for 2 layers\nglazing system (1. clear glass 6mm ; AIR gap 12mm ; 2. clear glass 4mm):\n\nvoid  glass       GlzSys1_glass\n0\n0\n3     0.832     0.884     0.859\n\nvoid  BRTDfunc    GlzSys1_front\n10\n0.136     0.147     0.146\n0.764     0.811     0.789\n0 0 0\n.\n0\n9 0 0 0 0 0 0 0 0 0\n\nvoid  BRTDfunc    GlzSys1_back\n10\n0.139     0.148     0.148\n0.764     0.811     0.789\n0 0 0\n.\n0\n9 0 0 0 0 0 0 0 0 0\n\nAnd this is what I got from Window6 for the same glazing system :\n\nAngle      0    10    20    30    40    50    60    70    80    90 Hemis\n\nVtc  : 0.798 0.798 0.796 0.791 0.779 0.748 0.675 0.521 0.261 0.000 0.695\nRf   : 0.144 0.144 0.144 0.147 0.157 0.185 0.255 0.405 0.664 1.000 0.230\nRb   : 0.146 0.146 0.146 0.149 0.159 0.188 0.258 0.411 0.674 1.000 0.233\n\nWhen I make a model of complex fenestration system with exterior venetian\nblinds, I have two different cases :\n\nCase 1. When sun rays don't pass directly between the venetian blind slats,\njust indirectly from slats (reflected from slats).\n\nQuestion 1. Because sun rays don't pass directly trough window glass, I suppose\nthat all the light that reaches the window glass is diffuse (light is reflected\nfrom ground, sky and slats). If this is so, which is the correct value for the\ndefinition of window glass material? Is it perhaps Vtc (visible tansmittance)\nvalue 0.695 for Hemis (hemispherical) multiplied by 1.09 to get the\ntransmissivity value, or maybe mean Vtc value for angles from 0 to 90\n[(0.798+0.798)/2+(0.798+0.796)/2+...+(0.261+0.000)/2]/9=0.639 also multiplied\nby 1.09 to get the transmissivity, or maybe some other value?\n\nI have noticed the following :\nThe second row of the BRTDfunc has the values:\t0.764     0.811     0.789.\nIf we multiply these values with 1.09, we get:\t0.832     0.884     0.859,\nwhich are the transmissivity values for glass. Also, if we put these values into\nthe expression:\n0.265*R + 0.670*G + 0.065*B, we get:\n0.265*0.832 + 0.670*0.884 + 0.065*0.859 = 0.868595. If we divide this value\nwith 1.09, we get value 0.797, which is the Vtc value at normal incidence (0).\n\nQuestion 2. Let us assume that correct Vtc (transmittance) value is 0.695. Is\nthis the right way to calculate RGB transmissivity for glass:\n0.832*(0.695/0.798)   0.884*(0.695/0.798)   0.859*(0.695/0.798),\nwhich is equal to:\n0.725                 0.770                 0.748\n\nQuestion 3. This may be a stupid question. Theoretically, if I should get the\nsame results in the following two cases:\n1. I create the distribution for the window with mkillum; window glass is\ndefined with transmissivity values:\n0.725   0.770   0.748\nI compile a new scene octree that includes the old one and adds the new illum\nwindow (new .rad file) to it. Then, I calculate lux level on working plane with\nrtrace.\n2. I don't create window polygon (there's nothing, i.e. there is air). But\ninstead, I can scale RGB values for light solar with the glass transmissivity\nvalues. For example:\nIstead:\nvoid light solar\n0\n0\n3 2.72e+06 2.72e+06 2.72e+06, I put:\nvoid light solar\n0\n0\n3 2.72e+06*0.725 2.72e+06*0.770 2.72e+06*0.748, i.e.:\nvoid light solar\n0\n0\n3 1.972e+06 2.094e+06 2.035e+06\nI compile a scene with changed .mat file, and then I calculate lux level on\nworking plane with rtrace. Of course, I will try to calculate this, but I'm\ndefinitely interested in the opinion of experts.\n\nQuestion 4. How can I scale the material of sky, if it is defined with:\n\nvoid brightfunc skyfunc\n2 skybr skybright.cal\n0\n7 1 3.76e+00 3.72e+00 2.98e-01 -0.489041 -0.851114 0.190903\nskyfunc glow skyglow\n0\n0\n4  .85 1.04 1.2  0\n\nI guess that is not allowed to scale the RGB values .85 1.04 1.2, because of\nthe equation:   1 = 0.265*R + 0.670*G + 0.065*B.\nMaybe I can scale the values from skyfunc: 3.76e+00 (zenith brightness) and\n3.72e+00 (ground plane brightness)?\n\nCase 2. When one part of the sun rays pass directly between the venetian blind\nslats, and the second part indirectly from slats.\n\nThis is perhaps the worst case for modeling. Let us assume that exterior\nvenetian blinds have 35 slats. If I want to make a proper model of window glass\npolygon, I suppose that I need to replace one glass polygon with 69 glass\npolygons. 34 are directly exposed to the sun and have some values for RGB\ntransmissivity (which depend from sun angle). Other 35 are in shade and have\nsome other values for RGB transmissivity (transmissivity for diffuse light). Of\ncourse, I need to do some trigonometry calculations. This model of window glass\nis valid only for one light source (solar source sun), but not for\nskyglow source sky. This seems very complicated, and because of that would be\ngreat if I could do what I asked in questions 3.2 and 4.\n\nQueation 5. I just need a short comment of paragraph above.\n\nCase 3. No venetian blinds - just window glass.\n\nLet us assume that octree (scene) includes 3 light sources (sun, sky and\nground), and sun incidence angle is 70 degrees. If I make a model of window\nglass with RGB transmissivity:\n0.725  0.770  0.748  (transmittance=0.695),\nthe model will be correct for sky and ground, but not for sun, because of\ntransmittance for angle of 70 degrees is 0.521.\nThus, whatever value that I take for RGB transmissivity, I make a some mistake,\nwhen I calculate illumination.\n\nQuestion 6. Does this problem can be solved in one of two ways:\n\n1. I scale values for sun, sky and ground, in the manner described in questions\n3.2 and 4.\n2. I compile an octree that includes an office, only one source of light (sun),\nand a model of window glass with transmissivity that corresponding to the sun\nangle. For this octree, I calculate illumination (I1).\nThen, I compile a new octree that includes a same office, two sources of light\n(sky and ground), and a model of window glass with transmissivity that\ncorresponding to the sky and ground. For this octree, I calculate illumination\n(I2).\nIn the end, I calculate I = I1 + I2, which actually represents the total\nillumination.\n\nI apologize for the long mail.\n\nThank in advance, Milan Cakanovic\n\n\n\n", "replyTo": "", "sender": "Milan Cakanovic", "isquestion": true, "tags": [], "id": "<loom.20101228T160819-777@post.gmane.org>", "refs": [], "datetime": "Tue, 28 Dec 2010 17:17:48 +0000 (UTC)", "email": "milan.cakanovic at hotmail.com", "subject": "[Radiance-general] window glass modeling"}