{"refs": [], "id": "<20050126122817.D860F1C00097@mwinf1202.wanadoo.fr>", "subject": "[Radiance-general] Re: graphing radiance raytrace paths", "email": "jelle.feringa at ezct.net", "body": "\nHi Greg,\n\nWow! Thanks for pointing that out to me, that seems quite close to what I\nintend to do. I think 'graph' wasn't necessarily the appropriate term, since\noften it implies 2d. In fact I'm looking for a way to capture the rays\ntraced in a rendering to a 3d (polygon) file, preferable colored according\nto their illumination value. Maybe you've seen the Maya 6 feauture where\nyour able to visualize the global illumination cache in coloured points. (if\nyou haven't it might be interesting that I upload an image to my server)\nI'd like to do something similar like that, but its important to trace the\nwhole path, right from the camera, all the way back to the light source it\nemitted (sure, a lot of them will end up at the wall, but the more rays can\nbe traced to the source, the better)\n\nAs I understood from the man pages, piping ximage (t) to rtrace is close to\nwhat xshowtrace does, except that its output is numbers instead of graphic\nlines superimposed on the rendering (by the way, there's no way to control\nthe interval of xshowtrace -s is there? Awesome soft! Thanks so much!)\n\nSo here's what I tried using this approach:\n\nximage someRendering.pic rtrace -ab 5 -oodLpnsm -h -x 1 -i   someOct.oct >\nrays.txt\n\nrays.txt:\n4.524520e+00\t5.080820e+00\t3.480030e+00\t-3.025107e-01\t3.848206e-01\n8.720094e-01\t5.183396e+00\t2.956487e+00\t7.075498e+00\t8.000000e+00\n0.000000e+00\t0.000000e+00\t-1.000000e+00\tboxSTri321\tbox321\n4.524520e+00\t5.080820e+00\t3.480030e+00\t-4.554681e-01\n-3.514263e-01\t-8.179538e-01\t4.254556e+00\t2.586706e+00\t3.585657e+00\n-3.348016e-16\t0.000000e+00\t0.000000e+00\t1.000000e+00\tbox0.b\tbox0\n\n4.524520e+00\t5.080820e+00\t3.480030e+00\t-9.447599e-02\n-6.675847e-01\t-7.385154e-01\t4.712197e+00\t4.079331e+00\t1.935029e+00\n-2.426444e-16\t0.000000e+00\t0.000000e+00\t1.000000e+00\tbox0.b\tbox0\n\n\n\nStill that type of data comes near, but wont be sufficient for the graph\nthat I intend to make. The kind of script would allow for:\n\n-setting the maximum number of rays traced\n-outputting the coordinated of each ray in XYZ values where rays intersect,\nall the way up to their source.\n-these rays would purely be casted from the camera, not selected points in\nspace as in the xshowtrace approach\n-what could be great is that rays will be coloured according to their\nluminance value.\n-the graph should be dense enough that the architecture from which the rays\nwere cast from becomes present in the graph.\n\nIn the end it'll be a very beautiful and powerful image, exposing radiance\ninner mechanism!\n\nCheers, and thanks again for your feedback!\n\nJelle\n\n\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Jelle Feringa // EZCT / Paris", "datetime": "Wed Jan 26 13:28:45 2005"}