{"body": "\nHi Claus,\n\nI am also a little puzzled by your results.  As Thomas mentioned, glow surfaces are included in the indirect calculation, so unless you specified a positive radius value for your glow materials, they should not light your scene at all with -ab 0.  The complexities of your command line are mostly unnecessary.  You should be able to simplify it to:\n\nvwrays -ff -x $XRES -y $YRES -vf $NAME.vp \\\n|rtrace -h -fff -opN $NAME.oct \\\n|rtrace -ffc -x $XRES -y $YRES -I -ab 1 -aa 0.1 -ad 4096 -ar 0 $NAME.oct > $NAME.irradiance.hdr\n\nRays with zero normals will be evaluated as (0 0 0) by the second rtrace, and an epsilon is always added to the origin in the direction of the normal when using the -I option, so your rcalc command, while clever, is unnecessary.  I changed your -ab to 1 and got rid of the other unnecessary options.  I set -ar to 0, since you seem to want a very high resolution result.  I added -aa 0.1 for the same reason.\n\nIf you are still getting this peculiar noise pattern after these changes, please post your scene description and I'll have a look at it.\n\nBest,\n-Greg\n\nP.S.  Regarding mailing list policy on attachments.  In general, I prefer that people not attach large files to e-mails, and people have been very good about this, posting larger images on websites, instead.  Small JPEGs (less than 100K or so) are acceptable; likewise small text attachments are OK.\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20101230/2f5c96ca/attachment.html>\n\n", "replyTo": "<E35477F1A321144D897D44CCAAFF202C091DE75D43@AD-MAILBOX01.aau.dk>", "sender": "Greg Ward", "isquestion": false, "tags": [], "id": "<75DEF7D5-96D6-4A65-ACCF-8FE0DBF5CB51@lmi.net>", "refs": ["<E35477F1A321144D897D44CCAAFF202C091DE75D43@AD-MAILBOX01.aau.dk>"], "datetime": "Thu, 30 Dec 2010 15:37:20 -0800", "email": "gregoryjward at gmail.com", "subject": "[Radiance-general] Noisy irradiance rendering from glowmaterials"}