{"body": "\nHi Martin,\nI have a couple of questions about your study:\nWhen you say that\n\"The error drops to around 5 % at 3 ambient bounces. \"\ndo you mean \"difference\"  between radiance and agi32?\ndid you calculate the analytical solution?\nIf you considered the agi32 solution to be the right one, what about\nchanging the mesh density or the number of iteration\ndoes the solution converge to a unique value?\n\nAbout the Radiance parameters you used:\n\"rtrace -ab 1/2/3/4/5  -ad 512 -as 256 -ar 5000 -ds .1 octree ...\"\ndid you tested the scene while changing -aa and -ad? which is the -aa value\nyou used?\nI personally would increase settings for -ad,-as,-aa and reduce -ar to keep\na balance speed/accuracy.\n(-ar seems to me a little too high for your scene, compared to ad)\nThat's also interesting: time vs accuracy.\n\nBut at the end of the day: is it your scene particularly general?\nI am thinking about what John recently wrote: probably the problem is not to\ncompare numbers for just one scene, but to understand the general validity\nof a method: it's ability to solve a wide spectrum of problems (fabrics,\nsmall windows, high number of interreflections, direct illumination,\npenumbras.... more scenarios).\nThe danger is to (as he said) test our ability to use the program rather the\nability of the program itself to solve the problem.\nI am really curious to read his new paper to find out something new in this\narea:\n\n\"Verification of Program Accuracy for Illuminance Modelling: Assumptions,\nMethodology and an Examination of Conflicting Findings\" (2004) Lighting Res.\nTechnol. (in press)\n\n\nregards,\ngiulio\n\n\n\n___________________________________________________________________\nElectronic mail messages entering and leaving Arup business\nsystems are scanned for acceptability of content and viruses.\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20040707/3805628a/attachment.html\n", "replyTo": "", "sender": "Giulio Antonutto", "isquestion": true, "tags": [], "id": "<DC0CAEEA090E984C911D3B85B16C3F90FAF676@l-gnts05>", "refs": [], "datetime": "Wed Jul  7 11:20:43 2004", "email": "Giulio.Antonutto at arup.com", "subject": "[Radiance-general] RE: Radiance accuracy: comparison with AGI32 V1.7"}