{"body": "\nGiulio,\n\nsee below.\n\nMartin\n\n\n-----Original Message-----\nSent: Wed 7/7/2004 5:20 AM\nTo: 'Radiance general discussion'\nCc:\n\n\"Hi Martin,\nI have a couple of questions about your study:\nWhen you say that\n\"The error drops to around 5 % at 3 ambient bounces. \"\ndo you mean \"difference\"  between radiance and agi32?\"\n\n\nError  calculation = 100*ABS(AGI_value - Radiance_value)/AGI_value\n\n\n\"did you calculate the analytical solution?\"\n\n\nThe cube has a reflectance of 0.5. Approximating a cube as a hemisphere, the total reflected flux can be approximated as follows:\n\nFlux reflected = rho * Flux emitted * (1 + rho + rho^2 + ... + rho^n) =   flux emitted * rho / ( 1 - rho)\n\nwhere\n\nrho = 0.5\nflux emitted = flux of PAR lamp = 860 lumens\n\nTherefore, the total reflected flux is also 860 lumens. Dividing by the total area of the cube: Illuminance due to reflected flux = 860 / (6*3*3) = 16 Lux. The ceiling illuminance must be a bit higher than this, as the floor opposite of the calculation points (insignificant cosine reduction) contains the bright spot caused by the PAR lamp. We can calculate it more precisely using the ring formula:\n\ndE = PI D^2 L 2 r dr / ( D^2 + r^2 )^2\n\nwhere\nPI = 3.14159\nD = 3.0 m\nL = Luminance of rings on floor, incl. interreflections (11, 14, 18.5, 25, 33.5, 42.6, 48.6, 51, 53, 56, 58)\nr = ring radius from 1.45 to .45\ndr = .1 m = ring spacing\n\nThis gives 19.4 Lux, almost in line with the AGI values.\n\n\n\"If you considered the agi32 solution to be the right one, what about changing the mesh density or the number of iteration\ndoes the solution converge to a unique value?\"\n\n\nYes, it converges very quickly. No need to change the mesh density to anything higher. I tried it with very small patches, and it gave the same values.\n\n\n\n\"About the Radiance parameters you used:\n\"rtrace -ab 1/2/3/4/5  -ad 512 -as 256 -ar 5000 -ds .1 octree ...\"\ndid you tested the scene while changing -aa and -ad? which is the -aa value you used?\"\n\n\nNot necessary. You can estimate what -ad needs to be. The probability that a few of 512 rays will hit the bright PAR spot on the floor is very high, no matter from what point in the cube. If it were Ronchamp by Le Corbusier with small deep windows, even -ad 10000 would not do. How many rays would you need from one secluded corner in that church to hit all or most of the small windows? That is fairly easy to guess. Subdivide the hemisphere surrounding the point in the corner into patches half the size of the windows, and you can derive the number of rays from the number of patches.\n\n\n\n\"I personally would increase settings for -ad,-as,-aa and reduce -ar to keep a balance speed/accuracy.\n(-ar seems to me a little too high for your scene, compared to ad)\nThat's also interesting: time vs accuracy.\"\n\n\nYes, the solution with -ab 5 took about an hour, I think. -ar does not matter too much here.\n\n\n\"But at the end of the day: is it your scene particularly general?\"\n\n\nNo. You might want to start with a scene that you can approximate with hand calculations.\n\n\n\"I am thinking about what John recently wrote: probably the problem is not to compare numbers for just one scene, but to understand the general validity of a method: it's ability to solve a wide spectrum of problems (fabrics, small windows, high number of interreflections, direct illumination, penumbras.... more scenarios).\nThe danger is to (as he said) test our ability to use the program rather the ability of the program itself to solve the problem.\nI am really curious to read his new paper to find out something new in this area:\"\n\n\n\n\nSure. You test the program for a variety of cases and find where it fails. You also have to use the Radiance parameters which, when increased, give the same results as the previous setting. I find them in general to  be -ab 3 -ad 4096 -as 2048 -ar 5000 -ds .1 -dr 3 if new users don't know which values to use. That is for a space with furniture and some small lights. The ambient value -av must be estimated very well, because -ab should be 5 as a general rule.\n\nOther than that, our ability to use a program and its output is proportional to our ability to estimate or calculate what the results should be, I think.\n\nMartin\n\n\n___________________________________________________________________\n\nElectronic mail messages entering and leaving Arup business\n\nsystems are scanned for acceptability of content and viruses.\n\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: not available\nType: application/ms-tnef\nSize: 13562 bytes\nDesc: not available\nUrl : http://radiance-online.org/pipermail/radiance-general/attachments/20040707/7201730c/attachment-0001.bin\n", "replyTo": "", "sender": "Giulio.Antonutto@arup.com", "isquestion": true, "tags": [], "id": "<84F05BA9118BBD4A8FC6409808CE266C113B13@ENGRMAIL2.engr.psu.edu>", "refs": [], "datetime": "Wed Jul  7 17:21:32 2004", "email": "Giulio Antonutto", "subject": "[Radiance-general] RE: Radiance accuracy: comparison with AGI32 V1.7"}