{"body": "\nInteresting answer - see my response below.\n\nMartin\n\n-----Original Message-----\nSent: Wed 7/7/2004 12:47 PM\nTo: 'Radiance general discussion'\nCc:\n\nMartin,\n\nI still think that you speak about differences and not error (even if you quote the relative error formula): you are comparing Radiance with AGI, not Radiance with Reality.\n\n\nRadiosity for luminous flux transfer for totally diffuse models, as the one modeled here, is \"correct\", if you are happy with a dense surface mesh. Insofar, AGI32 is correct, since it solves the radiosity matrix (almost), whereas software using Monte Carlo techniques such as Radiance are estimation tools for complex problems. Therefore, Radiance is an excellent tool to help lighting folks estimate the lighting distribution in complex environments, not calculate it.\n\nRegarding reality: Try to build a simple model with diffuse surfaces and one diffuse source for verification purposes. You can't do it unless you use an integrating sphere for the source. Try to make a surface black. Again, you can't do it unless you use caves or holes lined with black material. The effort is tremendous.\n\n\n\nIn this sense what about translucent fabrics or arbitrary BDTRFs, in future you should consider also these materials in your comparison to be exhaustive (**)...\n\n\nNo time, no money.\n\n\nIf you think about that, what does it means \"accuracy\" when you are not able to model the majority of the real life instances and you are forced to assume a huge amount of restriction (purely lambertian, omidirectional....)?\n\n\nThe majority of real life instances has characteristics that need to be estimated, whereas simple models have characteristics that are mostly known. That makes accurate calculation of real life instances not possible. Otherwise, we could predict the future.\n\n\nYou may argue that the differences aren't so big...    but as there are differences the results are still subject to accuracy.\nDo you need  a program that is less precise but more general or a program that is really precise but very specialized?\n\n\n\nYou need both, and we have both, and we use them depending on the problem.\n\n\n\nAbout the comparison itself:\nI still think that it would be worthy to try others radiance settings, may be quicker even if not as accurate as yours (you use a very high value of -ar, while you use the default -aa, not necessarily wrong or bad, just a little unusual to me).\nThere is a formula to estimate the -ar value you need depending on the scene complexity (see RWR), although I am pretty sure that you know it already.\nIf you do not want to spend a huge amount of time, you can always do the calcs with rtrace without picture (there is an example in RWR).\nThese of course are only suggestions, this is your research.\n\n\nAgain, these parameters are not very important for this comparison. The most important parameters for interreflection estimation are the number of ambient bounces, and the ambient density -ad.\n\n\nI agree with you (**) that an easy start consists in checking a program with simple scenarios in order to find main limitations and bugs, I just believe Radiance has gone further than that and it's time to define what does it mean to validate a program;\n\n\nValidation is just a comparison to known outcomes or results, isn't it? It does not really matter if they are complex or simple scenarios. However, we cannot validate very complex scenarios since we don't have enough accurate sensors and data.\n\nRegards,\n\nMartin\n\n\n___________________________________________________________________\n\nElectronic mail messages entering and leaving Arup business\n\nsystems are scanned for acceptability of content and viruses.\n\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: not available\nType: application/ms-tnef\nSize: 10950 bytes\nDesc: not available\nUrl : http://radiance-online.org/pipermail/radiance-general/attachments/20040707/63535a68/attachment-0001.bin\n", "replyTo": "", "sender": "Giulio.Antonutto@arup.com", "isquestion": true, "tags": [], "id": "<84F05BA9118BBD4A8FC6409808CE266C113B14@ENGRMAIL2.engr.psu.edu>", "refs": [], "datetime": "Wed Jul  7 19:21:15 2004", "email": "Giulio Antonutto", "subject": "RE: [Radiance-general] RE: Radiance accuracy: comparison with AGI32 V1.7"}