{"body": "\nThank you for all the replies sent through and sorry if didn?t thank yet.\n\nI reckon then that my memory issues were due to the ambient file... I always thought it was read from the HD (and this was slowing the process so that a balance between calculation time and disk access had to be made to optimize the calculation time) but apparently it is loaded entirely in memory, which makes sense speed wise and teaches me to always simplify my models.\n\nCan you please confirm my understanding is right?\n\nThank you once again for your great help!\n\n\n\nLucio Boscolo Mezzopan\n\nSent: 24 November 2010 12:43\nTo: Radiance general discussion\nHi Lucio,\n\nYes, instancing is a way to deploy an object multiple times for the relative memory price of one of the objects. We do this all the time for repetitive objects such as furniture or trees (for example).\n\nIt is possible to use xform or replmarks to deploy copies of geometry also (eg files that contain material and geometry definitions). This however will not result in memory saving. To get the memory saving the object needs to be an octree. A frozen octree is self contained whereas a regular (unfrozen octree) contains references to other data/files that must be read in at load time. I believe from an \"in-memory\" point of view (eg when running) the memory size would be the same. I think that one difference is that frozen octrees will load faster in addition they can be treated as library objects and moved around from project to project without having to move around a lot of other source files.\n\nAnother option from a memory saving point of view is to use mesh object (obj2mesh) which is another compiled representation that may even be more compact and can also be treated like an octree instance.\n\nHope that helps.\n\nRegards,\n\n-Jack\n\n\n\n--\n\n# Jack de Valpine\n\n# president\n\n#\n\n# visarc incorporated\n\n# http://www.visarc.com\n\n#\n\n# channeling technology for superior design and construction\n\nOn 11/24/2010 4:37 AM, Lucio Boscolo wrote:\n\nDera Roberto and Jack...\n\n\n\nI assume this was done to reduce the memory usage...\n\n\n\nJack, you were talking about a frozen octree... would this help saving memory? What would be, memory wise the difference between a frozen octree and a non-frozen one? Or, in other words, why do you suggest it should be a frozen one?\n\n\n\nSorry for so many questions ;-)\n\n\n\nLucio\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n\n\n\n\n\n_______________________________________________\n\nRadiance-general mailing list\n\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\n\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20101213/62d84d71/attachment.html>\n\n", "replyTo": "Subject: [Radiance-general] Instances", "sender": "radiance-general-bounces at radiance-online.org", "isquestion": false, "tags": [], "id": "<CC7B52EF0E443D45B11162FB554D97DF06B935FE90@EURXMBC02.global.arup.com>", "refs": ["<1773335.454131290542592530.JavaMail.defaultUser@defaultHost>", "<4CEC21B0.6060103@visarc.com>", "<CC7B52EF0E443D45B11162FB554D97DF06B915F81C@EURXMBC02.global.arup.com>", "<4CED0866.2080807@visarc.com>"], "datetime": "Mon, 13 Dec 2010 09:49:15 +0000", "email": "radiance-general-bounces at radiance-online.org", "subject": "Re: [Radiance-general] Instances"}