{"body": "\n\n\nHi Greg,\n\nRemoved -ds 0.02, replaced radius 100 with 0 in the glow materials (there are only pure glow materials in the scene, no mixtures, no diffuse), re-ran rendering (but kept 10 by 10 genbox tiled groundplane ... frankly I forgot to comment back in the old single large genbox groundplane). Rendering done in about 25 minutes on my 4 year old core duo laptop.\n\nBingo.jpg shows results ... just the way I always mentally pictured that it would/should.\n\nThanks. Also to Andy for providing an explanation on the subdivision.\n\nThis is so great 'cause now I can get on with what I needed the irradiances for ... I can hardly wait :)\n\nIn addition to being just what I was needing (and essentially have been needing since August 2010 but have been too busy to pursue) these renderings actually have a very pleasing aesthetic side to them.\n\nBest,\nClaus\n\n\nSent: 3. januar 2011 18:32\nTo: Radiance general discussion\nHi Claus,\n\nAt least this explains most of your artifacts.  The direct calculation really doesn't work very well for abutting surfaces, so you are better off using zero radii on your glow materials.  How are you even seeing a pattern, though?  Glow materials don't reflect light.  I thought you had some glow materials and some regular ones.  Are you using a mixture between a glow material and a diffuse material?  I could then understand your results.\n\nIf you use -ab 1 and zero radii for your glow materials, then your results should be much improved.  You don't need to break up your ground plane.  I don't think you will ever be satisfied with the output, otherwise.\n\nBest,\n-Greg\n\n\n\nHi Thomas and Greg,\n\nThanks a lot for your feedback to my post.\n\nHappy New Year to everybody.\n\nI spent a good part of my holiday evenings messing around with my problem ... very nerdy, but life with RADIANCE is so inspiring that you sometimes cannot wait until the next official work day :).\n\nStatus now is that the noise has \"gone\" and there is now a new artifact that I cannot get rid of. Thanks, Greg, for the revised and streamlined command line, which I am now using. I must admit that I was so proud of \"my own\" command line that accepting this revised one was like killing a darling.\n\nIn fact I have specified a positive radius for the glow materials. The rendering result I am after is the cosine weighted, hemi-spherical integral of the *direct* incident radiance (caused by the glow materials only). That's why I originally had -ab 0 and then positive radius on the materials. Is using -ab 1 in combination with positive radius going to result in any indirect computation?\n\nIn any case I have used Greg's command line verbatim for a new rendering attempt ... see result1.jpg.\n\nI results1.jpg there are 3 things \"I don't like\":\n\n\n1)      The odd \"hot spots\" at crease edges\n\n2)      The fact that the pole in the foreground does not receive the same irradiance on all sides (which it should since the pole sides facing the camera only receive illumination from the ground plane)\n\n3)      The vertical end-plane of the house gets brighter the further away from the groundplane you get ... I am sure it should be the other way around\n\nFor these reasons I replaced the single genbox groundplane object with a 10x10 tiling of genbox objects (auto-generated with a small matlab script). With the same command line I arrived at result2.jpg.\n\nWhile pretty (!) there are still several problems:\n\n\n1)      Weird hot spots at crease edges\n\n2)      Dark (under-illumination) at the foot of walls\n\nIn an attempt to combat this I tried adding a -ds 0.02 option. This multiplied rendering time by a factor of 5 but resulted in no visible changes (result3.jpg). All images show visible jpg compression artifacts but are in all essence true to the actual result.\n\nThe scene is a scale model of a dairy. The scene is modeled in meters, so for example the width of the dairy end wall is 0.07 meters and is one single 6 vertex polygon. As described the ground plane is a tiling of side-by-side genbox objects ... each genbox object is 0.3 meters square. This scene is merely a test scene. When I get to the proper experiments the geometry of a scene will be a triangle mesh generated from stereo camera scans of (parts of) real building exteriors ... kind of like trimesh.jpg where the triangle sizes will be very homogeneous.\n\nSo, what is the proper approach: subdivide the geometry (for the test scene or test with the tri-mesh real scenes), or add some rendering option to force a subdivision of whatever needs to be subdivided for the hot spots to disappear?\n\nBest,\nClaus\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20110103/eb7e1580/attachment-0001.html>\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: bingo.jpg\nType: image/jpeg\nSize: 9012 bytes\nDesc: bingo.jpg\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20110103/eb7e1580/attachment-0001.jpg>\n\n", "replyTo": "<76D22BEC-EBC8-4B44-8AFE-17E3B0517DFA@lmi.net>", "sender": "cbm at create.aau.dk", "isquestion": false, "tags": [], "id": "<E35477F1A321144D897D44CCAAFF202C091DE75FEC@AD-MAILBOX01.aau.dk>", "refs": ["<E35477F1A321144D897D44CCAAFF202C091DE75D43@AD-MAILBOX01.aau.dk>", "<75DEF7D5-96D6-4A65-ACCF-8FE0DBF5CB51@lmi.net>", "<E35477F1A321144D897D44CCAAFF202C091DE75F6D@AD-MAILBOX01.aau.dk>", "<76D22BEC-EBC8-4B44-8AFE-17E3B0517DFA@lmi.net>"], "datetime": "January 3, 2011 5:37:34 AM PST", "email": "Claus Br?ndgaard Madsen", "subject": "Re: [Radiance-general] Noisy irradiance rendering from glow materials"}