{"refs": [], "id": "", "subject": "[Radiance-general] Re: panoramic animationReferences: <200202011104.g11B42Q19574@darkside-animation.com>", "email": "adiance-general@radiance-online.org", "body": "Message-ID: <3C5AF767.CC168424@archenergy.com>\n\nPhil,\n\nThanks for the kind words!  The panoramic animations are really quite easy with\nRadiance.  I create a view that is cylindrical, has a horizontal view angle of\n360 degrees and a vertical view angle of 90.   So for example center.vf reads:\n\nrview -vtc -vp 875 855 141 -vd -1 0 0 -vu 0 0 1 -vh 360 -vv 90\n\nThis creates the full 360 deg view of the space....Radiance is simply amazing!\nI've tried having a vertical view angle of 180, which in theory could give you\na complete sphere of view angles allowing you to pan down and up as well, but\nthat does not seem to work and I'm not exactly sure why.  You get a very\nvertically elongated image.\n\nThen I convert the Radiance images to .jpg format....and I go through the gif\nformat to do this.\n\nThen there are two programs you can use to view these 360deg images as\npanaramic animations.\n\n1)  Pixaround.com provides a free panoramic viewer called PixScreen.  You just\nopen any jpg image in the program.  Viewing in full 360o mode adjusts the image\nto give the correct perspectives, otherwise you get these curvy lines that are\nnot realistic.  PixAround also has a program that I believe is $150US called\nPixMaker that then lets you publish these panoramics to a website or create\nstand alone executables....they call them \"postcards\".  The stand alone\nexecutables are nice because no programs or plugins are needed to view them.\n\n2)  The other option, and I prefer this format because allows some movement up\nand down and creates panoramics in the somewhat common quicktime *.mov format,\nis PanoWorx.  PanoWorx I believe is $200US.  This is the format posted on our\nwebsite.  This program will take any gif or jpg and convert it to .mov format\nwhich can then be viewed with Quicktime.\n\nBoth programs can also take any number of images and seam them together to\ncreate panoramics....at some point I would like to add actual photograph\nlandscape backgrounds to these images.  The animation of the new Fraunhofer ISE\nBuilding ( http://www.ise.fhg.de/radiance/ ) has a city backdrop that is really\ncool looking.  I would be interested to learn how this was done?\n\nI hope this helps!  I'm really excited about these panoramics and the\narchitects I work with have really liked them.  It really helps them visualize\nwhat the space will feel like.\n\nZack\n\n\nradiance-general-request@radiance-online.org wrote:\n\n\n--\nCelebrating 20 Years of Improving Building Energy Performance\n\nZack Rogers\nDaylighting Designer/Engineer\nArchitectural Energy Corporation\n2540 Frontier Avenue, Suite 201\nBoulder, CO 80301 USA\n\ntel (303)444-4149 ext.235\nfax (303)444-4304\nwww.archenergy.com\n\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Zack Rogers", "datetime": "Fri, 01 Feb 2002 13:15:35 -0700"}