{"body": "\nHello again.\n\nOn Mon, Feb 7, 2011 at 7:50 AM, caria.roberto at tiscali.it\n<caria.roberto at tiscali.it> wrote:\n\nWell, you mentioned London in your first email. The EPW\nfile for London contains illuminance data.\n\n\nFor Sicily +s might actually be appropriate :). If you have some\ncloudiness you can also use +i and -i. Sometimes you also get\na \"sky cover\" index in the EPW file which you could use to pick\nthe right sky model.\n\n\nHigher (or lower) values as such make no difference. But if\nthe difference is the same for various sky situations you can\nassume that it does not depend on your input and is due to\nthe different algorithms the two applications use. Is says\nnothing about the correctness of each program, though. You\nhave to work that out by comparing the calculated results\nwith real measurements.\n\n\n\nTo my knowledge Daysim also uses gendaylit (Perez model).\nThey may adjust their values to match the recorded input in a\nsecond step which you would have to do manually if you were\nto do the same calculations in Radiance.\n\n\nWhen you use Radiance and gendaylit you will find that in\nearly morning and evening hours the results from gendaylit\nare way off. This is either a shortcoming in the algorithm or\njust a problem of the implementation. If that happens you\ncan use gensky for this particular situation; it's better than\ndropping the record completely from the evaluation.\n\nSide note: I remember reading something about this being\na bug in gendaylit that was fixed with a patch. But that was\nin the 90s and I don't know if this patch is included in the\ncommonly available gendaylit source code.\n\n\nThere are two topics here:\n\n1) How do you get illuminance values if the EPW file\ndoesn't have them.\n\n2) Which sky model (and options) do you use to match\na given set of irradiance/illuminance values?\n\nFirst point:\n\nThe only reliable way to get illuminance is to measure it\non site under the real world conditions. Point. If you don't\nhave that you need the sky efficacy to convert irradiance\nto illuminance but that changes for any given location and\nsky condition!\n\nTherefore if you don't have measured illuminance values\nyou have to assume a reasonable sky efficacy. The built-in\nvalue in Radiance is 179 lm/W. This value is only used at\nthe end to convert calculated irradiance to illuminance (the\nmagic \"*179\" in the command line).\n\nIf you are more interested in a relative comparison over the\nyear and not so much in absolute illuminance values at a\nparticular date you don't have to worry much. You can still\ncompare the illuminance images even if they are say 15%\ntoo bright.\n\nHowever, if you want to calculate the energy savings for a\ndaylight liked artificial lighting system that switches off at\n500 lux you'd better get a set of real world measurement to\nhave some data you can use as calibration points.\n\nNow the second point:\n\nNo. If you use Radiance you have to check that the irradiance\nfrom your sky model matches that of the EPW for every given\nsky. It does not matter if you use gendaylit or gensky. Both\nwork with irradiance input (\"-P\" for gendaylit and \"-r\" and \"-B\"\nfor gensky). Gendaylit is commonly used because it creates\na more sophisticated sky distribution than gensky. You also\nhave to chose to add a sun or not (and which model you want\nto use in the case of gensky.\n\nYou now calculate the irradiance of a single point on a plane\nand compare that with the \"global horizontal irradiance\" from\nthe EPW file. If the two values differ this is just a sign that\nthe sky model does not fit perfectly the actual atmospheric\nconditions. Modify your sky description to compensate for\nthe difference and check that the global irradiance matches\nyour calculations.\n\nIf you don't have illuminance values you are set. Repeat the\nabove process for all dates of the year to find matching sky\ndescriptions which you can use in a Radiance simulation.\n\nIf you do have illuminance values you calculate the sky efficacy\nfrom the ratio of the irradiance and illuminance values and use\nthis factor to convert the rendered irradiance picture to a falsecolor\nilluminance picture (or anywhere else where you want to calculate\nilluminance values).\n\nIf you have a good estimate for the sky efficacy you should\nalso use that instead of the built in value.\n\n\nNo. If you think the results of Daysim are accurate enough\nthen you should use Daysim to calculate your images if it\nis not too limited for your purpose. It will save you all the\nsteps mentioned above and for a simulation covering the\nwhole year it might also be faster.\n\nThere is no need to use Daysim to calculate illuminance\nvalues. You (and I) have no idea which conversion factors\nare used to get to these values.\n\nIf you use Radiance you can (and should) modify the sky\ndescriptions generated by gensky or gendaylit until they\nmatch best the available data. Then you can use the sky\nin a simulation and be confident that the results will match\nthe reality within the limits of the simulation.\n\nThe replication of real world atmospheric conditions is quite\ntricky. Don't expect your results to be too accurate. For the\ntype of evaluation that's usually done on the basis of climate\ndata files this inaccuracy does not matter much (cumulative\nor relative evaluations). But don't depend too much on the\nresults of a single calculation out of a whole year's worth of\ndata.\n\nRegards,\nThomas\n\n\n", "replyTo": "Subject: [Radiance-general] R: Radiance-general Digest, Vol 84, Issue 6", "sender": "Thomas Bleicher", "isquestion": false, "tags": [], "id": "<AANLkTi=D+V=wN8SFr3Jm7p_YB-TEkp3CC-QrWLV5owrv@mail.gmail.com>", "refs": ["<13283164.1134831297083046116.JavaMail.defaultUser@defaultHost>"], "datetime": "Mon, 7 Feb 2011 10:24:08 -0500", "email": "tbleicher at googlemail.com", "subject": "[Radiance-general] R: Radiance-general Digest, Vol 84, Issue 6"}