{"body": "\nCiao Thomas,\nthank you for your reply.\n\n\nR: I know I can get the external illuminace from epw file but no all\nlocations have these data values (if you open ITA_Cagliari Elmas you\ncan see it is that)\n\nI think if I consider the Illuminance values taken from epw file I\ncan use gensky and insert them as -B and -R parameters (dividing them\nto 179, before) and add +s when I have both values and -c when I have\nonly the diffuse Illuminance. (Can you confirm it?)\n\n\n\n\nempty\nRadiance\n\nI did it as you write.\n\nneed to increase your \"-ab\" to 1 to get the \"diffuse\" part.\n\nI used -I option.\n\nwill\n(which\n\nWhy is good to get higher values?\n\n\nthis\nresults.\nthat.\n\nI did it and there is a small difference between epw and daysim data\nilluminance (about 2-3%), so I suppose I can use illuminance values\nprovided by Daysim.\n\nSo, using the same input (Irradiance values comes from epw file) the\nsky created by Daysim works better than a sky generated by gendaylit?\nIin which conditions can I use gendaylit?\n\nSo, if i want to show particular illuminance condition in radiance (i.\ne. 12:00 on 21 March) by mean a falsecolor image with illuminace\nvalues, is better to use gensky with +s or -c\ndepending on if there is direct and diffuse illuminance or only\ndiffuse one, using the illuminance data values from daysim or epw (if I\nhave it)?\n\nIf my weather file has not illuminance data values, I must use Daysim\nto generate the illuminace external values and use them in Radiance to\nmake analysis (by means gensky); I can`t use gendaylit (starting from\nIrradiance value provided by the weather file) because it provides\nilluminance values are not correct compared to measured ones.\n\nCan you confirm it?\n\ncalculations\n\nOk, I can do it if I have measured data.\n\n\nSorry for many questions and thanks a lot in advance.\n\nCiao\n\nRoberto\n\n\n\n\n------------------------------\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\nEnd of Radiance-general Digest, Vol 84, Issue 6\n***********************************************\n\n\n\n\n\nSupera i limiti: raddoppia la velocit? da 10 a 20 Mega! Risparmia con Tutto Incluso: telefono + adsl 20 mega a soli 29,95 ? al mese per due anni!SCONTO DI 240 EURO!http://abbonati.tiscali.it/telefono-adsl/prodotti/tc/tuttoincluso/?WT.mc_id=01fw\n\n\n", "replyTo": "", "sender": "caria.roberto at tiscali.it", "isquestion": true, "tags": [], "id": "<13283164.1134831297083046116.JavaMail.defaultUser@defaultHost>", "refs": [], "datetime": "Mon, 7 Feb 2011 13:50:46 +0100 (CET)", "email": "caria.roberto at tiscali.it", "subject": "[Radiance-general] R: Radiance-general Digest, Vol 84, Issue 6"}