{"body": "\nOn Tue, Feb 15, 2011 at 7:28 AM, Giovanni Betti <\ngbetti at fosterandpartners.com> wrote:\n\nI would be interested as well in seeing how other people approached the\n\nIn the UK you have to calculate sunlight hours on the ground for planning\npurposes.\n\nWe used a grid (as opposed to an image) and traced rays from each grid point\nto the sun (direction was calculated from the gensky sun angle information).\nWe modified the rtrace command to print the material of the surface it hits\ninstead of the radiance. If the ray hits the sky (or nothing) it returns\n\"*\", if it hits an obstruction it returns the material name. Then you just\nneed to count the \"*\"s in the output file to know your number of sunlight\nhours.\n\nFor planning this is done on one day only, so we ran it with a 5 minute\nresolution. It only took minutes for a reasonably sized grid and that\nincluded all the preparation and evaluation in Lua (Ecotect). This method\ngenerates a data array (x,y,n) which you have to visualise in a separate\nstep.\n\n[On second thought you can probably combine this method with an vwrays based\npreprocess to find all the surface points in the scene. For these scene\npoints you then evaluate the number of sunlight hours as above and return\nthe number as value for the image. Sounds like a longish simulation,\nthough.]\n\nIf you want pictures your idea with rtcontrib and optimised suns seems very\npromising. A Tregenza subdivision is not optimal because the sun only\noccupies about a quarter to a third of the sky. But you can run rtcontrib on\ndefined light sources so you just need to give all your suns a unique\nidentifier and you're set (the command line length might be somewhat\nexcessive, though). You can also interpolate between the sun positions\nwithout loosing too much accuracy so you really only need to evaluate a few\nhundred positions. It might be worth to split the summer from the winter.\n\nIf you want to read the sun light hours directly from the final image you\nhave to use a unified sun source and combine all the images with a cosine\ncorrected intensity for this particular surface which results in a 1 for\neach bright pixel on that surface. The final image gives you a direct\nrepresentation of the sunlight hours. If you have more than one surface\n(more than one surface orientation, that is) you should go with Lars'\nrecommendation and apply a threshold value to convert all bright pixels to a\n1 value, regardless of the intensity.\n\nRegards,\nThomas\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20110215/7bdadb40/attachment.html>\n\n", "replyTo": "Subject: [Radiance-general] Sunlight hours calculation in radiance", "sender": "Thomas Bleicher", "isquestion": false, "tags": [], "id": "<AANLkTimxBaTXGHnch_gCeM4sZNQ2ixGrum0wKUmEmB63@mail.gmail.com>", "refs": ["<AANLkTik9DO1qNL3sggYdUD4+6BGjuTBqOQkWW1E0bhW4@mail.gmail.com>", "<98EC0CDF-0531-40A6-A94A-367A5724EB4C@lmi.net>", "<AANLkTinunUUG5yNWncAY1K1=Jn7UTP793r5bWDH+0ZN2@mail.gmail.com>", "<6F5225D6E15F954BB4E58EC25F6736C30661E405@corp3005.CORPORATE.FOSTER.NETWORK>", "<4D5A5CE8.8000301@gmx.net>", "<6F5225D6E15F954BB4E58EC25F6736C30661E40F@corp3005.CORPORATE.FOSTER.NETWORK>", "<4D5A6E8F.4000105@gmx.net>", "<6F5225D6E15F954BB4E58EC25F6736C30661E415@corp3005.CORPORATE.FOSTER.NETWORK>"], "datetime": "Tue, 15 Feb 2011 10:02:18 -0500", "email": "tbleicher at googlemail.com", "subject": "[Radiance-general] Sunlight hours calculation in radiance"}