{"body": "\n\n\nLars,\nthe number of about 300 comes from subdividing each tregenza patch in 4\nto increase angular resolution and then looking only at the occupied\npatches, sorry for the confusion.\n\nI would be interested as well in seeing how other people approached the\nsame problem though.\n\nThanks,\n\nGiovanni\n\n-----Original Message-----\nSent: 15 February 2011 12:16\nTo: Radiance general discussion\nHi Giovanni!\n\nimages\n\nI guess it would not be impossible, as renderings should complete very\nfast when considering only direct.\n\n\nThe tregenza sky introduces limitations of the angular resolution. You\nmay try a two-step approach:\n\nFirst, for each patch, find out at how many time intervals the sun is\ncovered by the patch. So a patch containing the sun solid angle 20 times\n\na year, you would set the patch value to 20.\n\nSecond, run rtcontrib to find out which patch contributes to which\npixel. Here you can apply your threshold just as described in my former\nemail, so any pixel that is lid by a patch is set to the value (in\nhours) for the patch from step 1.\n\nWith a Tregenza grid, you would end up with 145 images, each pixel value\n\ncorresponding to the number of hours of direct sun exposure from the\nrelated patch. Adding up all the 145 images in the third step should\nresult in pixel values of direct sun exposure (hours) for all patches.\n\nBTW if you follow an approach as typically used when working with\nTregenza skies, and split the sun over n neighbouring patches, you would\n\nof course set the pixel value to 1/n instead.\n\nI am not sure about better ways to achieve what you want to do, this is\njust one idea... any other proposals? I am sure others have done that\nbefore...\n\nCheers, Lars.\n\n\n\n", "replyTo": "Subject: [Radiance-general] Sunlight hours calculation in radiance", "sender": "grobe at gmx.net", "isquestion": false, "tags": [], "id": "<6F5225D6E15F954BB4E58EC25F6736C30661E415@corp3005.CORPORATE.FOSTER.NETWORK>", "refs": ["<AANLkTik9DO1qNL3sggYdUD4+6BGjuTBqOQkWW1E0bhW4@mail.gmail.com><98EC0CDF-0531-40A6-A94A-367A5724EB4C@lmi.net>\t<AANLkTinunUUG5yNWncAY1K1=Jn7UTP793r5bWDH+0ZN2@mail.gmail.com><6F5225D6E15F954BB4E58EC25F6736C30661E405@corp3005.CORPORATE.FOSTER.NETWORK>\t<4D5A5CE8.8000301@gmx.net><6F5225D6E15F954BB4E58EC25F6736C30661E40F@corp3005.CORPORATE.FOSTER.NETWORK>", "<4D5A6E8F.4000105@gmx.net>"], "datetime": "Tue, 15 Feb 2011 12:28:56 -0000", "email": "Lars O. Grobe", "subject": "Re: [Radiance-general] Sunlight hours calculation in radiance"}