{"body": "\nAlthough the color information from the lamps won't affect the\nluminance results in a completely gray environment, it will have an\ninfluence in one where the reflecting surfaces are colored.  This is\nactually what you want, except that you also should perform a \"white\nbalance\" step during final image processing to avoid a nasty color cast\nin your output.  (See the related options of pfilt.)  A better, more\nacurate alternative requires spectral data, and is explained in the\nfollowing paper:\n\nhttp://www.anyhere.com/gward/papers/egwr02/\n\n-Greg\n\nHi Group,\n?\nWhat is the proper way to handle an electric lighting calc?(based on an\nIES file) in terms of color?? Does color even matter?? What I mean is\nmost lighting programs don't take color into account but Radiance\ndoes...? which could lead to problems if one were not aware of how\ncolor selection affects numerical results.??I have not tested this, but\nhere is what I'm thinking (or hoping) that?when ies2rad matches the\ncolor of a fluorescent light to that of a cool white lamp or?a warm\nwhite, or whatever color, that it will do so in a way that does not\nchange the calculation results.? (I guess it would do this by scaling\nthe RGB values accordingly) ?So if I were to run three calculations\nbased on one ies file (using three?different color options.. say warm\nwhite, pure white, and some crazy x & y CIE coordinates), I would get\nthe same numerical results if all other parameters were equal?\n?\nAny differences between falsecolor and rtrace results assuming one used\nthe accepted '$1=($1*.265+$2*.67+$3*.065)*179' ?\n?\nAs always, any feedback is greatly appreciated.\n?\nThanks!\n?\nThe novice.\n?\nPS\n?\nSince lamp.tab does not include some of the more recent fluorescent\ncolors, I?obtained a copy of the x & y CIE coordinates for?some\nPhillip's lamps from my local Phillips rep.? Not sure if there is any\ninterest in updating lamp.tab for future Radiance releases or even if\none manufacturer's data would be enough data to do this (perhaps an\naverage would be more appropriate?),?but I would be happy to share\nthe?information?for their 800 series lamps (3000K, 3500K, 4100K, &\n5000K) which are the?lamps typically specified these days (at least by\nme anyway).\n\n\n", "replyTo": "Subject: [Radiance-general] Electric Lighting Calculations", "sender": "Greg Ward", "isquestion": false, "tags": [], "id": "<E9BEB9A5-D54C-11D8-8294-000A95BB392A@lmi.net>", "refs": ["<s0f3e8bd.024@wmtao.com>"], "datetime": "Wed Jul 14 06:19:42 2004", "email": "gward at lmi.net", "subject": "[Radiance-general] Electric Lighting Calculations"}