{"body": "\nFirst of all it is important to explain total reflectance term. Total reflectance ( R ) depends on the spectral reflectance ( Rl ) of the material and spectral distribution of radiant flux ( Pl) in [W/m]. There is equation as follows:\n\nR = INTEGRAL( Rl * P1 * Vl * dl) / INTEGRAL( P1 * Vl * dl)\n\n\n\nWhere Vl - is spectral luminous efficiency (simply this is spectral efficiency of our eyes) , dl - is interval of wavelength of electromagnetic radiation. The range of the INTEGRAL is visible radiation (380 nm - 780 nm).\n\n\n\nThe next point is that when we have non gray (coloured) materials and the radiation interreflect many times between surfaces of materials that this interreflection changes its spectral distribution. The simple example: red wall and white light. When the light is reflected in this wall that after reflection light will not be white but will be red. What does it mean? During the second reflection total reflectance ( R ) of the wall is different than during the first reflection because spectral distribution of radiant flux ( Pl) is changed.\n\n\n\nThe very important question is how it influence on total reflectance ( R ). When we have commonly used decorative materials (not so coloured: reddish but not deep red) and popular white lamps (neutral white, warm white, cool white etc.) this influence is not so important. This is the reason that most popular lighting software use only total reflectance ( R ) but not spectral reflectance ( Rl ).\n\n\n\nRADIANCE has its own system of colour representation based on three band R G and B and in most cases it is enough.\n\n\n\n\n\nBest regards,\n\n\n\nKrzysztof Wandachowicz\n\n\n\n----- Original Message -----\nTo: radiance-general@radiance-online.org\nSent: Tuesday, July 13, 2004 8:50 PM\n\nHi Group,\n\nWhat is the proper way to handle an electric lighting calc (based on an IES file) in terms of color?  Does color even matter?  What I mean is most lighting programs don't take color into account but Radiance does...  which could lead to problems if one were not aware of how color selection affects numerical results.  I have not tested this, but here is what I'm thinking (or hoping) that when ies2rad matches the color of a fluorescent light to that of a cool white lamp or a warm white, or whatever color, that it will do so in a way that does not change the calculation results.  (I guess it would do this by scaling the RGB values accordingly)  So if I were to run three calculations based on one ies file (using three different color options.. say warm white, pure white, and some crazy x & y CIE coordinates), I would get the same numerical results if all other parameters were equal?\n\nAny differences between falsecolor and rtrace results assuming one used the accepted '$1=($1*.265+$2*.67+$3*.065)*179' ?\n\nAs always, any feedback is greatly appreciated.\n\nThanks!\n\nThe novice.\n\nPS\n\nSince lamp.tab does not include some of the more recent fluorescent colors, I obtained a copy of the x & y CIE coordinates for some Phillip's lamps from my local Phillips rep.  Not sure if there is any interest in updating lamp.tab for future Radiance releases or even if one manufacturer's data would be enough data to do this (perhaps an average would be more appropriate?), but I would be happy to share the information for their 800 series lamps (3000K, 3500K, 4100K, & 5000K) which are the lamps typically specified these days (at least by me anyway).\n\n\n------------------------------------------------------------------------------\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20040714/4695656b/attachment.html\n", "replyTo": "", "sender": "Mark de la Fuent", "isquestion": true, "tags": [], "id": "<006101c46977$611669a0$6d0cfe96@iee.put.poznan.pl>", "refs": [], "datetime": "Wed Jul 14 09:51:56 2004", "email": "Mark de la Fuente", "subject": "[Radiance-general] Electric Lighting Calculations"}