{"body": "\nHello Radiance Community,\n\nI'm having a problem with the metal material when it is both highly specular\nand rough. In my room model, I have a vertical array of specular louvers at\nthe top of a glazed facade which bounce light onto the ceiling. The ceiling\nfor the first 6 m from the facade has a bumpy specular surface, using the\nmetal material. Material description:\n\nvoid metal ceil_diff2\n0\n0\n5 .856 .856 .856 .95 .125\n\nThe problem I'm seeing is that as I increase the roughness of the metal\nceiling from 0 (I've tried 0, .125, .2, and .9) the total amount of light in\nthe room increases significantly. This should not happen as the ceiling is\nonly redistributing the light that enters through the louver array. I found\nthat metal with 0 roughness produces essentially the same results as if I\nused the mirror material on the ceiling, which we would expect. As I\nincrease the roughness, the area under the illuminance curve increases (to\nabsurd levels in the case of .9 roughness, but I know that .2 is about the\nmax for real objects). I  tested the illuminance profile at the centerline\nof the room as well as nearer to the side walls and saw the same pattern, so\nI don't think it's a matter of undersampling the room. The only thing I\nchanged between cases was the roughness of the ceiling.\n\nCan anyone think of what might be causing this effect? Are there any known\nproblems relating to the roughness of the metal material? I've searched the\narchives, but didn't find an answer to my problem.\n\nIf you are interested in helping, here is a link to the graph of the\nilluminance results for my test room. The values are the aggregate of\nindividual time steps from an annual simulation. The legend shows the\nroughness in parentheses.\n\nhttps://docs.google.com/leaf? <http://goog_618206457/>\nid=0B69GQAj_Aw_QNzZhNWMwOTktZjRjOS00NWJiLThhMTUtODNlNDQxYmMyYjJi&hl=en&authkey=CIC91fUF<https://docs.google.com/leaf?id=0B69GQAj_Aw_QNzZhNWMwOTktZjRjOS00NWJiLThhMTUtODNlNDQxYmMyYjJi&hl=en&authkey=CIC91fUF>\n\nThanks very much for your help. I can send more information on my model if\nrequested.\n\n-Kevin\n\n\n\n--\nKevin Thuot\nResearch Assistant\nMassachusetts Institute of Technology\nkthuot at gmail.com\n(512) 497-8168\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20110315/c941a5bc/attachment.html>\n\n", "replyTo": "", "sender": "Kevin Thuot", "isquestion": true, "tags": [], "id": "<AANLkTi=CVj6b6BdGJfmZ=SAOt3Be98=isdzh0UmJtpBH@mail.gmail.com>", "refs": [], "datetime": "Tue, 15 Mar 2011 11:45:37 -0400", "email": "kthuot at mit.edu", "subject": "[Radiance-general] Problem with Metal Roughness Parameter"}