{"body": "\nDear list\nI am trying to get transmission matrix of a shading system with genBSDF. The\nsystem is made from double glazed window and glass louvres with silk screen\nprint with coverage of 55%. For the window I could used optics2rad to get\nthe material description without problem but I got problem with the louvres\nbecause Optics5 does not have fritted glass. I guess that I should program\nglaze as Jack de Valpine presented 2year ago at the Radiance workshop for\nthe louvres. However I've got some problems with definition of the frit and\nunderstanding what glaze does.\nBriefly what I know about the louvres: glass is SGG Parsol green 8mm and\nsilk screen print is covering 55% and the colour of frit is RAL 9010 which\nis almost pure white.\nI am not sure what  \" Tr    Tg    Tb    Rcr    Rcg    Rcb    Rgr    Rgg\nRgb    Part \" should be used for frit. Does anyone was working with similar\nshading and have some values I can used, at least as assumption? Or is there\nany way to find those values without actual measurement? Maybe there is some\nsource which you can recommend me.\nAre those values for frit only or is it a glass together with frit? In the\ncase that it is including also a glass does the glass have to be same as the\nclear glass which is needed to be defined in glaze program?\n\nI was also wondering how the transmittance and reflectance is calculated\nexactly. As I understand it a transmittance is calculated in the way that\nthe part of transmittance of the glass with frit is add to the transmittance\nof the glass surface without the frit. Is anyhow included that the\ntransmittance through the frit is further reduced by the transmittance of\nthe glass if we assume that the frit is on exterior surface.\nIn the case of a reflectance on a glass surface opposite to the placement of\nfrit I am even more confused. When I looked into the code of glaze program\nthe glass reflection is calculated as reflection of the surface opposite to\nfrit multiplied by coverage plus reflectance of the clear glass which is not\ncovered by frit. Should I have the glass surface on the frit same as the\nclear glass and basically have the reflectance on the glass surface all over\nsame. Or should I define that the opposite site of the frit as same\nreflectance as frit since the ray should go first through the glass and then\nwill be reflected from the back side of frit?\nI guess that the program is simplifying the transmittance and reflectance,\ndo you know how much it will be different from the reality?\nI am not sure if I described my thoughts understandable since since I may\nmisunderstand several things in graze, so I will be very happy if someone\ncould clear it up for me.\n\nThank you very much for any ideas and suggestions.\nDavid\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20110318/c76214d6/attachment.html>\n\n", "replyTo": "", "sender": "David Appelfeld", "isquestion": true, "tags": [], "id": "<AANLkTimSY-iLV7n-7GJ2DDNQdis5_HMzuyx8_uupYUEt@mail.gmail.com>", "refs": [], "datetime": "Fri, 18 Mar 2011 20:45:45 -0700", "email": "d.appelfeld at gmail.com", "subject": "[Radiance-general] Modelling glass louvres with frit in GLAZE"}