{"body": "\nHello Greg,\nI am suspecting the machine little bit, because it stop after different\ntime, sometime it got calculation for 4points sometime for 10, etc.\n\nIn the beginning I had only one script for whole grid and run it on 8cores\non one node which was the maximum. But there was probably not enough memory\nand it gave me error message that there is not enough allocated memory and\nit went to waiting process but it never restarted. It stopped even though I\ncould still see that the the job which I submited to run the script was\nactive. Unfortunately I don't remember the whole error message correctly.\nThen I have split the calculation up to more scripts with less cores used to\nsave some time and to avoid previous problem. I have run several scripts\nwithout a problem. Then I have got this message and I have deleted the job\nand resubmitted it again without doing any  changes. Some of the jobs run\nsuccessfully but some just gave this error message and stopped. Again I\ncould see that the job was still active but nothing was coming out from\ncalculations.\nAs I am writing this I am thinking that the server is getting overloaded and\npause the calculation and then rtrace can not finish the process.\nI don't know if this make any sense, but I can try to submit it again and\nhope that it will finish.\n\nCould you please say more about signal 9 and if I can do anything with it.\n\nThank you\nDavid\n\n\nOn 19 May 2011 16:17, Greg Ward <gregoryjward at gmail.com> wrote:\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20110519/7152541b/attachment.html>\n\n", "replyTo": "<7333FB90-408B-4A10-8219-5C09E4A76CCE@lmi.net>", "sender": "David Appelfeld", "isquestion": false, "tags": [], "id": "<BANLkTik7a6+Y8_E_WONSpXgKDh8HV3NTzg@mail.gmail.com>", "refs": ["<BANLkTinV=7tVgV061N_9WPdNNNOqWxM+Ew@mail.gmail.com>", "<7333FB90-408B-4A10-8219-5C09E4A76CCE@lmi.net>"], "datetime": "Thu, 19 May 2011 16:41:33 -0700", "email": "d.appelfeld at gmail.com", "subject": "[Radiance-general] Error: rtcontrib: fatal - incomplete rayvalue from rtrace"}