{"body": "\nHi David,\n\nAndrew McNeil recently found a problem with rtcontrib running in 64-bit mode on a 32-bit operating system, where very complex ray trees would cause the process to hang.  It sounds a bit like what you're experiencing, so if you like you can download the latest HEAD release from www.radiance-online.org, and either recompile everything or (simpler) grab src/util/rtcontrib.c from the unpacked HEAD and substitute that for the copy in your existing source tree, recompiling just rtcontrib.  The code for rtrace hasn't changed in any important way, and this should fix it if your problem is the same.\n\nRegarding signal 9, some Unix implementations use this uncatchable signal to terminate processes that have exceeded their resource limits.  Other systems send a specialized signal saying what went wrong, and rtrace would catch this and report the problem (e.g., \"file size limit exceeded\").  If your system is just killing the process with signal 9, there's no way to really know what's going wrong.  All you can do is check that your resource limits are ample to your task.\n\nBy the way, Andy only ran into this error when he was using many bounces and some rather high parameters in rtcontrib, which caused the ray trees to occasionally exceed 2 GBytes in size -- from a single ray!  It's difficult to say if this is happening in your case without seeing your parameter settings, but it's worth trying to patch rtcontrib in any case as a first step.\n\nBest,\n-Greg\n\n\n\n", "replyTo": "<BANLkTik7a6+Y8_E_WONSpXgKDh8HV3NTzg@mail.gmail.com>", "sender": "Greg Ward", "isquestion": false, "tags": [], "id": "<7B80B5E8-C780-4A48-8894-7F9455CC705C@lmi.net>", "refs": ["<BANLkTinV=7tVgV061N_9WPdNNNOqWxM+Ew@mail.gmail.com>", "<7333FB90-408B-4A10-8219-5C09E4A76CCE@lmi.net>", "<BANLkTik7a6+Y8_E_WONSpXgKDh8HV3NTzg@mail.gmail.com>"], "datetime": "Thu, 19 May 2011 17:15:54 -0700", "email": "gregoryjward at gmail.com", "subject": "[Radiance-general] Error: rtcontrib: fatal - incomplete rayvalue from rtrace"}