{"body": "\nOn Thu, May 12, 2011 at 12:27 AM, Chien Si Harriman <CHarriman at gb-eng.com>wrote:\n\n\nRadiance is not the right tool to simulate the internal reflections of the\nfitting. You could do it with a lot of rendering time and high accuracy\nvalues. However due to inaccuracies in your material descriptions etc I\nexpect that the final result would not be more accurate than the IES data\nyou already have.\n\nSince you're focused on video conferencing you also have to model the video\nscreens accurately. You can look at the various workshop presentations on\nthis topic.\n\nAlso keep in mind that you may be able to \"prove\" that there is no glare\ncaused by the light fittings but your client will still be disappointed by\nthe reflections of the fitting. Glare is a subjective experience and all you\ncan do with Radiance is to show that you meet some existing standard.\n\nAs a lighting designer I would recommend to reduce the potential for glare\nas far a possible (different fitting, louvre accessories, different layout\nand fitting type etc). If your clients don't want to spend money on good\nlighting they have to live with the consequences.\n\n\n\nIES data (and LDT) does indeed not reflect the physical characteristics of\ncertain light fittings very well. If the light source is small and directly\nvisible (think LEDs, halogen or discharge lamps) you will almost certainly\nexperience glare when you look directly into the lamp. The intensity of a T5\nlamp can also be perceived as disturbing. However, if that is an issue here\nyou should look into diffusers etc. to cover the light source from direct\nviews.\n\nGlare that results from the average intensity of the fitting is accurately\nrepresented in the IES file and its geometry (disc, rectangle or box). Some\nlighting design apps can generate a UGR diagram from the IES file. If you\nuse the IES file in Radiance I think you will also loose some angular\nresolution because the conversion to a Radiance *.dat file has a fixed\nnumber of vertical angles (although I'm not sure about this).\n\n\n\nIf you are only interested in the source visibility you can use an extruded\ncross section to simulate the fitting. If you want to use a mirror material\nfor the extrusion you have to change the \"glow\" to a \"light\" or you won't\nget any secondary light sources. You can also reduce the ambient bounces a\nlot because you only want to simulate the visibility of the light source.\nThis should speed up your calculation but it requires that you have a good\nrepresentation of the reflector geometry.\n\n\n\nThere is no limit for the intensity you can define. Keep in mind that a\nglare analysis is done without depreciation of the lamp and fitting (new\nlamp and no dirt).\n\nYou are also less interested in ambient bounces than source reflections\n(\"direct relays\"). The bounces are only necessary if you want to show the\nfitting within the conference room ambience. For your video conferencing\nsituation it should be enough to produce a reflection of the light source on\nthe video screen.\n\n\n\nThis is exactly what ies2rad does.\n\n\n\nExactly. You will not only introduce some errors due to inaccurate\ninformation but you also have hardly a way to verify your model. If\nsomething is wrong with your calculation results you will have a hard time\nto prove it wasn't your hand made distribution. That's hardly worth it.\n\nRegards,\nThomas\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20110513/36a9edbd/attachment.html>\n\n", "replyTo": "Subject: [Radiance-general] Modeling glare from light fixtures", "sender": "Thomas Bleicher", "isquestion": false, "tags": [], "id": "<BANLkTin1soYjaqiv8hK70+qh3Mwe11TY2Q@mail.gmail.com>", "refs": ["<AE3526189BB78143B795EF9C45CB8CBB02ED6D83@gbsbs.GB-Eng.local>"], "datetime": "Fri, 13 May 2011 11:02:12 -0500", "email": "tbleicher at googlemail.com", "subject": "[Radiance-general] Modeling glare from light fixtures"}