{"body": "\nOn 2011-05-11 22:27:33 -0700, Chien Si Harriman said:\n\n\nIf the IES file is accurate and of sufficient resolution and you use\nthe Radiance glare tools, the IES file will be sufficient to find\nsources of glare, even though the lamps and internal elements of the\nfixture will not be rendered correctly.\n\nRadiance does not model rays emitted from a light source, and will not\nreliably compute the internal reflections of a fixture, even if the\ndetails of its materials and geometry are available.\n\nFor presentation, however, you may want to model the lamp and luminaire\nitself, as well as the IES file.  This will not be physically accurate,\nbut is helpful in visualizing the glare.  To do this, you wrap the\nluminaire geometry in an illum (for fluorescents this is usually a long\nnarrow box), to which you attach the IES data.  This is called an\n\"impostor surface,\" because it is an impostor for the actual luminaire.\nYou then use glows within the illum to provide a visual representation\nof light within the luminaire.  Light from a glow does not pass through\nan illum and hence does not affect the lighting of the scene geometry\nor the glare calculation.\n\nI wrote a program to do some of this work as part of my thesis.  It's\nnot very finished and I haven't open-sourced it, but take a look at the\nthesis; the issues involved are covered there.  See:\nhttp://dmg.caup.washington.edu/pdfs/Thesis.RandolphFritz.2010.pdf\nBe very careful, going through this process, to check your modeled\nluminaire against the IES data.  It is very easy to incorrectly place\nthe IES data or fail to relate it correctly to the luminaire geometry,\nand this must be carefully checked.  I describe my procedures for this\non pp. 53-57 of my thesis.\n\nI also have a Python script which reads IES files that might be helpful\nin working with this; I've been meaning to put it out for a while.  If\nyou think it might be helpful, drop me a note.\n\n--\nRandolph M. Fritz ? RFritz at lbl.gov\nEnvironmental Energy Technologies Division ? Lawrence Berkeley Labs\n\n\n\n\n", "replyTo": "", "sender": "Randolph M. Fritz", "isquestion": true, "tags": [], "id": "<iqh9eu$e8a$1@dough.gmane.org>", "refs": [], "datetime": "Thu, 12 May 2011 11:38:22 -0700", "email": "RFritz at lbl.gov", "subject": "[Radiance-general] Modeling glare from light fixturesReferences: <AE3526189BB78143B795EF9C45CB8CBB02ED6D83@gbsbs.GB-Eng.local>"}