{"body": "\nPhillip Greenup wrote:\n\n\nThe purpose is to map the illuminance/irradiance of one or\nseveral surfaces. So far, it's easy... ;)\n\n\n\nYes.\n\n\n\nI think the description in the manual is a little obscure,\ntalking more about the implementation than its result. The effect\nhappens on the very first surface that a ray hits, unless it\nhas a transparent material, which delays this step by one bounce.\nIn the computation, the material of this surface is temporarily\nreplaced by a lambertian material of the reflectivity PI. This\nmeans that the resulting value is indeed the irradiance resp.\nilluminance at that point.\n\nIn practise, however, you shouldn't have to worry about this\nmechanism, and I don't think it should be mentioned in the manual\nat all. Just read the description of the -i parameter without the\ntechnicalities, and its meaning will become crystal clear:\n\n-i  Boolean switch to compute irradiance rather than radiance\nvalues. Light sources still appear with their original\nradiance values, though the -dv option may be used to\noverride this.\n\nI had to check the sources myself to be sure (I just silently\nassumed it worked like that until now), but the trickeries\ninvolved really produce this simple and very useful result.\n\n\n\nNot reflected illuminance. Simply illuminance at that point.\nFrom a photometric point of view, this is very reasonable, from\nan imaging point of view, it is rather surrealistic. You have to\nknow that what you see is not something you'd be capable to see\nwithout smoking heavy stuff.\n\n\n\nIf you substitute \"real\" with \"conventional\", then I agree with\nthe first part. Saying that overlaying this information on a\nvisualization is \"unreal\"... well yes, maybe I agree with this too.\nFortunately, that doesn't make it less useful to those who\nunderstand what it means!\n\n\n-schorsch\n\n--\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch.com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n\n\n", "replyTo": "Subject: [Radiance-general] re: trans material with sunless sky", "sender": "Georg Mischler", "isquestion": false, "tags": [], "id": "<Pine.BSF.4.30.0112141458100.50210-100000@emancholl.pair.com>", "refs": [], "datetime": "Fri, 14 Dec 2001 15:04:05 -0500 (EST)", "email": "radiance-general@radiance-online.org", "subject": "[Radiance-general] re: trans material with sunless sky"}