{"body": "\nHi Jia!\n\nI have some unfinished work on this lying around for almost one year\nnow, and this topic arises again and again on this mailing list. It is\ntrue that the standard backwards-raytracing approach of Radiance is not\nsuitable for such systems. There are several ways to simulate these if\nyou are aware of what is happening, and, more important even, what kind\nof results you need.\n\nIn general, if you do not need high angular resolution, the tools\ndeveloped for patch-based sky models are working, and you can even\ncalculate the BDSF now using the Radiance-toolchain as long as you are\nmore interested in the integrated transmission then in high angular\nresolution. So - if you need to know how many hours a year you can reach\na certain illuminance on a work plane, that should work. If you want to\nperform glare studies, I would question such results.\n\nFor high angular resolution, switching from backwards to forward\nraytracing is more efficient, and here the photon map extension is what\nwe have available right now. Unfortunately, the development status is\nnot really clear, and at least the latest available versions had some\nbugs that can heavily influence results depending on sky conditions /\nmodels.\n\nOne entirely different approach is to use some optical modeling tool to\nget the transmission distribution or, even easier, to get luminaire\ndistributions for certain times of day / dates / weather conditions.\n\nAnd then, you are free to circumvent the whole ambient calculation and\ntry do keep everything in the direct calculation, which works fine with\nsuch setups. So for calculating horizontal irradiance, you would place a\nfisheye-type camera with a full hemisperical view on you point of\ninterest looking up and integrate the radiance - as long as you\nreflector is completely specular w/o roughness.\n\nCheers, Lars.\n\n\n", "replyTo": "Subject: [Radiance-general] Simulating light pipe performance", "sender": "Lars O. Grobe", "isquestion": false, "tags": [], "id": "<4E2BC990.2050109@gmx.net>", "refs": ["<CABzgtwrN-RvXdnzCDyf9ry=Pf0B-nTZ927FkwOsRfKQZKNS-zg@mail.gmail.com>"], "datetime": "Sun, 24 Jul 2011 09:28:16 +0200", "email": "grobe at gmx.net", "subject": "[Radiance-general] Simulating light pipe performance"}