{"body": "\nHi George,\n\n\nThat's a good suggestion, though you might want to wait until Francesco\ncompiles the latest 3.6.1 release, which just came out yesterday.  That\nway, you'll be sure to have the most recent additions.  I haven't used\nCygwin (or PC's) myself, but I guess it works.  FreeBSD is my favorite\noption on Intel hardware -- much easier to manage than Linux for most\nthings, though of course Linux comes with a friendlier desktop these\ndays.  If you can afford it, an Apple running OS X is a very good\ninvestment.  The time you save in administering it will more than\ncompensate for the higher price tag, and the G5 performance is quite\ncompetitive with Intel and AMD machines these days.  Plus, you'd get to\nrun all your Office applications and Photosphere to boot!\n\n\nYou didn't post your reply to radiance-general -- just to me.  Did you\nmean to post it?  I will post this reply in case others want to pipe\nin.  I don't have any experience with Optics 5, other than files people\nhave shown me.  From what I can tell, it does a pretty rudimentary job\nmodeling glazings in Radiance -- not even accounting for Fresnel\neffects on reflection and transmission.  The glaze script I wrote for\nVisarc does a more reasonable job in this regard, but lacks the\nextensive database of Optics 5.  I misunderstood and thought you had\nused it to compute the BRDF for the blinds, which I didn't think it\ncould do.  I guess from what you say, it can't.\n\n\nYes, that is correct.  Mkillum simply acts as a \"go-between,\" mediating\nand accelerating the window contributions in your model.  As I said in\nmy first reply, it doesn't help so much if all you're doing is\ncalculating a few illuminance values, but if what you want is a nice\npolished image, I've found it to be indispensible.  I only wish it were\na little easier to use.\n\n\nUnfortunately, a good cheer might not be quite enough motivation, but\nI'll give it a look.\n\n\nI know Kostantinos Papamichael did a fair amount of research on\nvenetian blinds for his Ph.D.  You should be able to find some of his\narticles.  Go to the following URL and type in Papamichael.  That name\nshouldn't create a lot of search collisions:\n\nhttp://www-library.lbl.gov/lbnl_reports/sf\n\n\nYes, it should be possible.  Of course, a BRTDfunc for venetian blinds\nwon't account for all that goes on outside a window, because Radiance\ndoes not sample the directional diffuse component of its BRDF types.\nThis is where mkillum and the photon mapping add-on will have the upper\nhand.\n\n-Greg\n\n\n", "replyTo": "<20041028111437.4603.qmail@web25202.mail.ukl.yahoo.com>", "sender": "Greg Ward", "isquestion": false, "tags": [], "id": "<28AD8CC7-2911-11D9-A953-000A95BB392A@lmi.net>", "refs": ["<20041028111437.4603.qmail@web25202.mail.ukl.yahoo.com>"], "datetime": "Thu Oct 28 20:43:58 2004", "email": "gward at lmi.net", "subject": "[Radiance-general] Approximating the gross daylight flux throughvenetian blinds."}