{"body": "\nChristopher, many thanks for your help. The manufacturer's catalogue displays the information according to EN 14501, so maybe they have this data; I'm waiting for an answer from them.\nI'm doing tis for a small competition, so resources are not large, if they don't provide me with data I'll have to guess approximate values and hope for resources to come in case we win :-)\nThe textile is a PVC coated polyester woven fabric, in a variety of colors, and yes it has open transparency, so if you are close enough you can see trhough it.\n\n\n\n-----Mensaje original-----\nDe: Christopher Rush [mailto:Christopher.Rush at arup.com]\nEnviado el: martes, 16 de agosto de 2011 15:14\nPara: Radiance general discussion\nAsunto: Re: [Radiance-general] Defining a textile facade\n\nA better start would be to obtain test results based on EN 14501 test standards. This would give the direct normal and hemispherical transmission values to help define a trans material. Or does the textile have an \"openness factor\" defined? This would give an approximation of the direct normal transmission in comparison to the total hemispherical transmission.\n\nHow critical is accuracy, and do you have resources and time to arrange for more detailed testing of the fabric and a complex material definition? Or are you just trying to get close enough for comfort?\n\nCan you give a verbal description of the textile? Is it a woven fabric with white threads and some open transparency (eg it is white but you can still see objects on the other side when it's hanging)?\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n\n\n\n\n\n", "replyTo": "Subject: [Radiance-general] Defining a textile facade", "sender": "=?iso-8859-1?Q?Rodriguez_P=E9rez-Curiel=2C_Francisco?=", "isquestion": false, "tags": [], "id": "<8D862FA96616154C90B250C3C35AF0CD080D2E7F@EXCSRVBAV05.tri.lan>", "refs": ["<8D862FA96616154C90B250C3C35AF0CD080D2CAA@EXCSRVBAV05.tri.lan>", "<28285BAEA8C0814DBF1B199C876EC5B04AB3C30C0C@AMXEXC01.global.arup.com>"], "datetime": "Wed, 17 Aug 2011 09:30:53 +0000", "email": "francisco.rodriguez at tecnalia.com", "subject": "[Radiance-general] Defining a textile facade"}