{"body": "\nHi,\n\nI'm getting strange results from rtcontrib on OSX. Firstly, the images combined with dctimestep are very speckly, and many of the patch images are very speckly as well, some with only a handful of dots. Do I need to direct rays from the sky patch directly to the windows and ignore all other directions? How can I do that? I'm unsure which parameters affect this most.\n\nThe other issue is that there are strange colours in different rays. The combined result has bands of colour whereas the model has almost no colour in it at all. The materials are all grey. What might cause this? Command sequence and image below.\n\nvwrays -ff -vf views/EIn.vf -x 800 -y 800 | rtcontrib -i -ab 4 -ds 0.05 -dj .7 -ad 4096 -lw 2e-4 -n 2 -ffc $(vwrays -d -vf views/EIn.vf -x 800 -y 800) -e MF:2 -f reinhart.cal -b rbin -V+ -fo -o images/patchesEI/p%03d.hdr -m sky_glow -w octrees/top1.oct\n\nThird issue: I've been running this successfully, but sometimes when I run it, the patch images are created, but then nothing seems to happen. There is one rtcontrib process and four rtrace processes visible in the activity monitor, but none of them are using any of the CPUs and the patch images are stuck on 4KB. Normally when I run it I get two rtrace processes using about 95% of the CPUs. (This is on a MacBook Pro with two cores). I cntrl-C out and then try again and get the same thing.\n\nThanks in advance.\n\nJohn.\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20111026/729c1e88/attachment-0001.html>\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: el_pc_div3.jpg\nType: image/jpg\nSize: 27883 bytes\nDesc: not available\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20111026/729c1e88/attachment-0001.jpg>\n\n", "replyTo": "", "sender": "John Ford", "isquestion": true, "tags": [], "id": "<3E63ED4B-4EF4-4278-A96D-582F2B8ABFD6@bb3.net.au>", "refs": [], "datetime": "Wed, 26 Oct 2011 17:13:52 +1100", "email": "johnford at bb3.net.au", "subject": "[Radiance-general] rtcontrib results (OSX)"}