{"body": "\nHi Marija!\n\n\nMy impression is that this will get quite complicated. gensurf would\nstill need the coordinates to come in the right ordering, and I do not\nknow how you could achieve that when exporting from Sketchup. Without\nthat, gensurf does not know which vertex locations to combine into one\nsurface. Also, you would again get lots of surfaces, as gensurf would\ncreate flat surfaces between the vertex locations.\n\nTwo alternatives:\n\na) If you exactly know the profile of your lamellas, you could use a\nfunctional description instead. This would still lead to quite a lot of\nsurfaces for each, but probably less. And (most important) you would\nhave great control on the resolution of the facetting. This would e.g.\nmake it possible to find out at what resolution you see no effect on\nyour results any more.\n\nb) If you need to rely on your exported Sketchup model, I would advice\nlooking into instances or the mesh object. Create a \"short\" lamella,\nsomething like one unit length, and export it. Make it a frozen instance\n(using oconv -f) or a mesh object (using obj2mesh). Create a small scene\nfile containing only the mesh or instance primitive for this compiled\ngeometry. Than build your blinds from this element using an xform array\nin your scene file. This will lead to very little memory consumption for\nthese objects.\n\nIf your shading systems consists of lots of blinds, I would even\nconsider using instances when creating geometry using gensurf (case a).\nHowever in typical scenes, you do not reach critical polygon counts yet.\nRadiance is very good in handling lots of surfaces, unless memory gets\nused up.\n\nCheers, Lars.\n\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: smime.p7s\nType: application/pkcs7-signature\nSize: 4438 bytes\nDesc: S/MIME Kryptografische Unterschrift\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20111109/69b15fcb/attachment.bin>\n\n", "replyTo": "Subject: [Radiance-general] How to generate surface with gensurf program?", "sender": "Lars O. Grobe", "isquestion": false, "tags": [], "id": "<4EBA9829.9020308@gmx.net>", "refs": ["<CAAZQWqggh69W5YtXXZQG4MuQQy3tV6Bavj_d_sBSYZ8VEs9Rwg@mail.gmail.com>"], "datetime": "Wed, 09 Nov 2011 16:11:37 +0100", "email": "grobe at gmx.net", "subject": "[Radiance-general] How to generate surface with gensurf program?"}