{"body": "\nHi Marija,\n\nI'll put some answers inline...\n\n\nIf the blind behavior is close to uniform over its surface, i.e., the blind spacing and width is small relative to all of your windows, then you are probably OK with a single distribution on all your windows.  It's easy enough to run a comparison to be sure.\n\nThis brings up an important point regarding genBSDF, which is how you treat the edge conditions.  The best approach when you are trying to get the general behavior of something like venetian blinds is to create a system much larger than the area you actually sample with genBSDF, then use the \"-dim\" option to specify the region over which to sample.  This region should be an even multiple of the blind spacing, or whatever other repeating structures your system contains.\n\nAnother approach, which works for a system of a specific size that is fully contained within a rectangular window opening, is to model the edges of the opening along with the system you give to genBSDF.  If you make the mistake of leaving the edges open, then light that would NOT leak into your room would get by the geometry you give to genBSDF, and the generated BSDF would have too much transmission.\n\n\nIf your lamellas (slats) are different, then I expect your BSDFs will be different and should be calculated separately.\n\n\nAll Radiance primitives need to be able to pass through the xform command and maintain correct behavior.  If you insert a BSDF into your model, later scaling and reorienting the model with xform, a transform will be added to the BSDF primitive to make sure the distribution is properly oriented and the thickness is correct in the new units.\n\nYou should specify the thickness in the units corresponding to the model or scene file your BSDF is used with.\n\n\nNo problem.\n-Greg\n\n", "replyTo": "Subject: [Radiance-general] genBSDF questions", "sender": "Greg Ward", "isquestion": false, "tags": [], "id": "<0BFA845A-72B7-4360-B2E7-B9B37E2CC617@lmi.net>", "refs": ["<CAAZQWqj95CAqkz3VYzzQ7kSaz-eQ_i8FqUR0gdN-QcVk2D1Uvg@mail.gmail.com>"], "datetime": "Thu, 24 Nov 2011 10:48:48 -0800", "email": "gregoryjward at gmail.com", "subject": "[Radiance-general] genBSDF questions"}