{"body": "\nRight; thanks for pointing that out Greg. I thought genskyvec and genklemsamp have been working for a little while, and I know falsecolor works. Didn't know about genBSDF, thanks for the heads up.\n\nI wonder if the same issues would happen with Ruby? Hate to reinvent the wheel but from an OpenStudio support perspective, we'd actually be eliminating one dependency (Perl) but I get that most Radiance scripters are in Python land first and foremost, probably Perl second, and Ruby third (and then you have Andrew Marsh using Lua ;) ). Something for us to think about on this end, but I'd rather spend time wrapping Ian Ashdown's Perez sky generator first?\n\n- Rob\n\n\nRob Guglielmetti  IESNA, LEED AP\nCommercial Buildings Research Group\nNational Renewable Energy Laboratory\n1617 Cole Blvd MS:RSF202\nGolden, CO 80401\nT. 303.275.4319\nF. 303.630.2055\nE. robert.guglielmetti at nrel.gov\n\n\nOn 11/17/11 8:06 AM, \"Greg Ward\" <gregoryjward at gmail.com<mailto:gregoryjward at gmail.com>> wrote:\n\nThere may be some issues with Perl scripts and Windows.  I don't think genBSDF will work in its current configuration.  Andy McNeil and I fixed genklemsamp and genskyvec, and I think Axel's falsecolor script works, so it may just be genBSDF that needs an update.\n\n-Greg\n\n\n\n\n\nHi Jia,\n\nYes, the Windows binary distribution is not quite finalized. I am working with our staff here to get all those last Perl scripts included in the binary distribution. We are also in the process of getting access to the Radiance source tree so we can automate the updates; when that is set up, we will share those links with the community. In the meantime I can send you falsecolor and genskyvec tomorrow.\n\nThanks for your patience, we're trying to get this all wrapped here shortly.\n\n- Rob\n\nOn Wed, Nov 16, 2011 at 10:03 PM, Jia Hu <hujia06 at gmail.com<mailto:hujia06 at gmail.com>> wrote:\nHi Rob:\n\nI try your programs under Win 7.I downloaded the Window version of Radiance 4.0 from OpenStudio NREL website. Some programs written in perl such as genskyvec are not included in the Radiance bin folder. I am not familiar with Perl and Ruby.If I want to run it under Window OS, where can I get these missing bin file?  or how can I compile the Radiance source files (4.0 or 4.1) under Windows OS?   I searched and found some related posts, but still do not know how to do it.\n\nThank you,\n\nJia\n\n\nOn Tue, Nov 8, 2011 at 3:47 PM, Guglielmetti, Robert <Robert.Guglielmetti at nrel.gov<mailto:Robert.Guglielmetti at nrel.gov>> wrote:\n\n\n", "replyTo": "Subject: [Radiance-general] OpenStudio-Radiance Demo Videos", "sender": "rob.guglielmetti at gmail.com", "isquestion": false, "tags": [], "id": "<CAEA7AB7.B22E%robert.guglielmetti@nrel.gov>", "refs": [], "datetime": "November 16, 2011 9:11:13 PM PST", "email": "Rob Guglielmetti", "subject": "[Radiance-general] OpenStudio-Radiance Demo Videos"}