{"body": "\nHi Tim,\n\nSeems a good answer to your question depends a bit on hearing some more\ndetails on your material.\nThere are quite a few degrees of freedom left for the answer:\n\nPolycarbonate itself is quite close to be ideal transparent, - and\ntherefore used for many optically clear and mechanically robust\napplications from CD/DVD discs to aircraft windows. A polycarbonate\nsingle pane (straight out of manufacturing, no dirt, no scratches) would\nbe best described by Radiance \"glass\".\n\nWhen used in double-walled extrusion panes (product name LEXAN and\nothers, which actually may have more than two internal walls for\nstructural reasons), the resulting light distribution is more complex\nthan a straight-through scattered beam plus a reflected beam: Due to\nmultiple internal reflections, the outgoing light is cone shaped. This\nmay cause unpleasant glare, if material orientation, sun position and\nviewer are aligned \"correctly\" (and there's a good chance for that).\nThis light distribution is more complex than what \"trans\" can do. In\nRadiance, it requires either a traditional cal file with a functional\nmodel or the new BSDF material. The latter has the advantage that the\nillumination calc may be more efficient. If you just want to analyse the\n\"correct\" alignment between sun-material-viewer, the cal file is pretty\nsimple. A more detailed and energy-correct model is a more complex. So\nfar, so hoopy, that's the situation for the *clear* standard material.\n\nHowever, during the extrusion, Titaniumdioxid (TiO2 or anything else\nthat is stable and scattering) may be added to the Polycarbonate base,\nleading to a varying degree of light scattering of the finished\nmaterial. This may range from \"a bit\" of scattering to nearly opaque,\ndepending on the amount of TiO_2 per volume.\nWith an increase of TiO2 , the light distribution is increasingly\ndominated by the scattering within the material. And the influence of\nthe inter-reflections between the walls decrease and so does the\ncone-shaped, glare creating part of the outgoing light distribution.\nDepending on TiO2 amount and internal structure, the material is then\nmostly forward scattering, and can be described by \"trans\".\n\nBtw, the TiO2 had been used to get the Sydney2000 stadium roof working\nwithout glare. The original plans with clear material would have created\nan unpleasant glare for folks in many rows.\n\nSo, the way in Radiance depends on your specific extrusion profile and\nmaterial, plus your intended use.\n\nbest regards\nPeter\n\n--\npab advanced technologies Ltd, http://www.pab.eu\n\n\n\n", "replyTo": "", "sender": "Peter Apian-Bennewitz", "isquestion": true, "tags": [], "id": "<201111061853.pA6Ir52h007826@mta2.lbl.gov>", "refs": [], "datetime": "Sun, 06 Nov 2011 19:52:42 +0100", "email": "apian at pab.eu", "subject": "[Radiance-general] Polycarbonite Radiance files (Tim Metcalfe)"}