{"body": "\nGreg, I think that it would be REALLY useful for daylight-coefficient-based\ndaylight simulations if someone (meaning you:)) came up with a BRTDFunc for\nblinds. This way one could simulate interior annual illuminance profiles\nwith the blinds opened and closed. This is already possible if one simulates\nthe blinds geometrically in gory detail (genblind), but the simulation times\nare horrendous. I assume the calculation time penalty would be less severe\nif one used \"BRTDFunc\" instead? To my knowledge, mkillum cannot  be used\nwith a daylight coefficient approach since mkillum is tied to a specific sky\ncondition?\n\nChristoph\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of Greg Ward\nSent: Thursday, October 28, 2004 11:28 PM\nTo: Radiance general discussion\n\nI gave it a little more thought, and I'm note sure how useful it would be to\nhave a BRTDfunc that approximates the aggregate behavior of venetian blinds.\nThe only context where this might prove useful is in performing daylight\nanalyses where you don't care about external reflections and the users\ndoesn't care to visualize the space.  Because a BRTDfunc doesn't include the\ndirectional-diffuse portion in its indirect component, it wouldn't get an\naccurate contribution from light reflected off external surfaces.  The best\nit could do is get a reasonable value for the indirect solar due to light\nhitting the blinds directly.  Mathematically, even this would be difficult\n-- I'm guessing it would take me a day or two  to work up a reasonable\napproximation.\nAs far as the appearance goes, one would see a semi-translucent material if\none was to visualize your model with this material, which wouldn't end up\nlooking like blinds at all.\n\nIn summary, I don't think this would be much of an improvement over a\nmkillum solution.  Does anyone else have some thoughts on this?\n\n-Greg\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n", "replyTo": "", "sender": "radiance-general-bounces@radiance-online.or", "isquestion": true, "tags": [], "id": "<10C94843061E094A98C02EB77CFC32870F436D68@nrcmrdex1d.imsb.nrc.ca>", "refs": [], "datetime": "Fri Oct 29 18:10:29 2004", "email": "radiance-general-bounces@radiance-online.org", "subject": "Re: [Radiance-general] Approximating the gross daylight fluxthrough venetian blinds."}