{"body": "\nDear Radiance and DIVA users,\n\nI am forwarding this message at the request of Holly Samuelson, president\nof IBPSA-Boston. On February 7th IBPSA-Boston is hosting an event on using\ndaylight simulations for design which will be of interest to many of you.\nFor those not in Boston, the event will be webcast online. Details can be\nfound in Holly's message below.\n\nKind regards,\nAlstan\n\n------- Forwarded message -------\n\nIBPSA Boston in conjunction with IES Boston is excited to present our next\nevent, Daylight Simulation in Design, on February 7th from 6:00-7:30pm EST\nat MIT, the Massachusetts Institute of Technology.  We have two groups of\nspeakers who will present some interesting applications of daylight\nsimulation in architecture projects.  As usual,  the event will be webcast\nand web-archived.  Please RSVP to ibpsa.boston at gmail.com if you plan to\nattend in person.  Details below.\n(Also, please save the date for our next event/webcast, a joint meeting\nthe evening of March 13 with ASHRAE and AEE.)\n\nDaylight Simulation in Design\nFebruary 7, 6:00-7:30pm EST\nMIT, building 7 (aka 77 Massachusetts Ave.) room 431 (aka the Long Lounge)\nSocial event to follow at a local pub TBD.  Munchies provided.\n\nPresentation Synopses:\nSchroepfer + Hee?s New Jurong Church (planned for completition in 2013) is\nan approximately 10,000 sqm religious and cultural facility located in the\ndensely populated western part of Singapore. The presenters will discuss\nhow, with the need to mitigate the harsh climate conditions of the tropics\nand yet not have a high dependence on mechanical cooling systems, the\nconception and design of the building envelope employed state-of-the-art\nlighting and energy use simulations to make full use of passive systems,\nleading to an understanding of architecture in that form, material,\nstructure and performance are not seen as separate elements, but rather as\ncomplex interrelations.\n\nDaylight modeling can be a powerful tool in the professional architectural\nworld, but it can also create various challenges. Using examples from\ntheir work at Lam Partners, the presenters will show ways in which\ndaylight modeling can be crafted strategically to support design ideas, as\nwell as some of the hurdles to using this type of analysis on projects.\nThe presentation will touch upon topics such as cost, efficiency and\nmarketing.\nSpeakers:\nThomas Schroepfer, Associate Professor at Singapore University of\nTechnology and Design and Principal at Schroepfer + Hee\nAlstan Jakubiec, PhD Candidate at MIT\nAzadeh Omidfar, Researcher at MIT, Designer at Einhorn Yaffee Prescott\nGlenn Heinmiller, Principal at Lam Partners\nKera Lagios, Designer at Lam Partners\n\nRemote Access Instructions:\nWe will broadcast the session using AnyMeeting. You may register ahead of\ntime, which would be helpful to us, or sign-in without registering once\nthe meeting starts.  The URL for the broadcast will be:\nhttp://www.anymeeting.com/ibpsaboston1 The registration URL is:\nhttp://www.anymeeting.com/PIID=EB56D7848847 You will be able to hear the\npresentation and discussion through your computer speakers, and to text\nquestions for the speakers (using AnyMeeting) to our webmaster, who will\nbe monitoring the remote attendees.\n\nMore information on the speakers as well as transportation and parking\nwill be posted on our website: http://ibpsa-boston.com/.\n\nMore Info on IBPSA Boston and IES Boston:\nIBPSA Boston http://ibpsa-boston.com/ is a local chapter of the\nInternational Building Performance Simulation Association, USA Regional\nAffiliate. Membership for individuals in IBPSA Boston is free. If you\nwould like to be notified of all our events, please join our mailing list\nby emailing \"Membership Request\" to ibpsa.boston at gmail.com.\nIES Boston http://www.iesnewengland.com/ is a section of the Illuminating\nEngineering Society of North America.  The IESNA is the recognized\ntechnical authority on illumination.\n\n--\n\nHolly W. Samuelson\nPresident, IBPSA Boston\nRegistered Architect | LEED AP BD+C\nDoctor of Design Candidate in Sustainable Design\nHarvard Graduate School of Design\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20120125/1c38b211/attachment.html>\n-------------- next part --------------\nAn embedded and charset-unspecified text was scrubbed...\nName: attachment810.txt\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20120125/1c38b211/attachment.txt>\n\n", "replyTo": "<CANSEwusGH0bLPdtO=usymbpUN243pucfchrLS0bJakuTjXCZiw@mail.gmail.com>", "sender": "hsamuelson at gsd.harvard.edu", "isquestion": false, "tags": [], "id": "<op.v8nlalm1c8ew1p@severian.seas.upenn.edu>", "refs": ["<CANSEwusGH0bLPdtO=usymbpUN243pucfchrLS0bJakuTjXCZiw@mail.gmail.com>"], "datetime": "Wed, 25 Jan 2012 13:50:35 -0500", "email": "\"Holly W. Samuelson\"", "subject": "Daylight Simulation in Design - Event and Webcast"}