{"body": "\nVil,\nyour is a very wide and general question.\nIt is difficult to help you without teaching you radiance from A to Z.\nSo I think the best advice is to look for tutorials over the internet and start from the basics.\nWIth the command line.\n\n\n\nThe 179 number is not intuitive, but has nothing to do with practical things.\nFor historic reasons (fee free to dig in the archive for an answer) we all divide the photometrical measures by 179 and use the converted radiometric values in Radiance.\nThen we get the radiometric results from Radiance and multiply them again by 179 to retrieve the photometrical equivalent;\nSo we all divide the input by 179 and multiply the output by 179 in a simulation that is linear.\nWe could do without multiplying?. and would be the same :-)\nIf you know what you are doing, then you can skip the above, but as we all collaborate with others it is not advisable? because your colleagues could be assuming that you are using the 179 conversion anyway?\nSo we all do it.\n:-)\n\n\nIf you are confused because there is a luminous efficacy of lamps and then the Radiance 179 value, be reassured:\nThere is anything to do between each other.\n\nTo get the luminance of a surface, knowing the geometry and the flux you should use the command line:\nlampcolor\nThis will spit out the radiometrical quantities that you need to use in the light/glow/illum primitives\n\nTo convert from a ies file to a radiance luminaire file you should use:\nies2rad\nThis will do all for you, all conversion, but beware that unless you force the lamp to be 'white' you could be using a lumen depreciation from the radiance library (as opposed to a lumen depreciation that you would like to use based on a particular design and cleaning/relamping regime).\n\nin all cases you should check what has come out of the commands.\nTo do this you should familiarise with the rcalc and rtrace commands.\nrcalc\nrtrace\nYou should for example measure the illuminance around the luminaire  to estimate the luminous intensity and check that the light fixture is pointing in the right way.\nEverybody has his own script/method to do this.\nWhen I started I found easy to create a big sphere around the fixture, and render two fisheye views of illuminance. if you divide by the square radius you get the intensity plot...\n\n\nAbout your issue, the 10 coefficient is a bit strange. Could it be a setting like lux vs Fc? Maybe this is something in Ecotect?\n\nGood luck,\nG\n\nOn 12 Jan 2012, at 12:50, Villian Wing-Lam LO wrote:\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20120112/5aadacde/attachment.html>\n\n", "replyTo": "Subject: [Radiance-general] Illuminance Values in Ecotect/Radiance", "sender": "giulio antonutto", "isquestion": false, "tags": [], "id": "<B1F35679-D249-4748-B54B-2FE200011D8F@yahoo.it>", "refs": ["<001a01ccd128$d068d510$713a7f30$@net>"], "datetime": "Thu, 12 Jan 2012 14:34:24 +0000", "email": "antonutto at yahoo.it", "subject": "[Radiance-general] Illuminance Values in Ecotect/Radiance"}