{"refs": ["<B8DD8375FCE2C94B9F170D9277C1FA2B8C5804@corvallis>", "<BAY22-DAV6153FBF5CF2EED9E627E090510@phx.gbl>"], "id": "<7cd64ed70f7697df889c7120d8d1a71d@biomechanicsinc.com>", "subject": "[Radiance-general] Digital Camera recommendations?", "email": "kthibault at biomechanicsinc.com", "body": "\nGreat tips!  I would also add that in addition to a remote camera\ntrigger (computer or camera-specific remote) you typically can also use\nthe timer function on cameras so equipped.  My camera, a Canon 300D\n(\"Digital Rebel\"), shoots 3 auto bracketed exposures from a single\ntimer triggered event.  This way you can change your exposure via the\nshutter speed, set the AEB to +/-1 and then hit the shutter release,\nrun out of the mirror ball environment and the camera will shoot all\nthree AEB images.  This is particularly useful for settings where\nlugging a laptop may be a pain, and it also allows you to get out of\nthe scene.\n\nAlso, i usually shoot overlapping exposures throughout the sequence and\nthen compare the exposures that have identical settings to make sure\nthat the light conditions were not changing significantly while\nshooting the mirror ball.  Otherwise, the recorded exposure and the\nactual exposure may differ - although I don't really know how\nsignificant this effect may be.  Obviously this would be more for\nnatural light sources like the sun behind clouds, etc.  I usually shoot\nabout 7 or 8 exposures worth of info and use HDRShop or Photosphere to\nmake the images.  Tripod is a must and white balance setting would\nprobably also be helpful so it does not change while shooting.\n\nHave fun - I'm sure there are already several compact point and shoot\ntype digital cameras out there that are already better than my digital\nSLR - for what it's worth, I have seen price drops on the 300D that are\ncoming close to your ball park for a camera, if you are entertaining\nthe notion of a digital SLR - I would highly recommend this camera to\namateur digital camera users.  Good luck!\n\nkirk\n\nOn Mar 9, 2005, at 9:23 AM, Despina Michael wrote:\n\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Digital Camera recommendations?", "tags": [], "sender": "Kirk Thibault", "datetime": "Wed Mar  9 17:46:04 2005"}