{"body": "\nHi Lars,\n\nSo in this case you used tools within Radiance or graphical interfaces which are running Radiance on the back?\nI've seen that Rhyno isn't free, so I would like to try with Daysim and some Python scripts to try to simulate my system. According to old posts in the mailing list this should work, am I right? Any suggestion avbout it?\n\nThanks, Stefano\n\n-----Original Message-----\nSent: Wednesday, February 29, 2012 12:40 AM\nTo: Radiance general discussion\nHi!\nHard to answer the first question. For the second, I used environment variable in my scene files for similar applications. That allows you to use any tool you could imagine (I used perl scripts in most cases) to calculate the transformation (if you want to use xform) and other parameters, assign these to environment variables and have these expanded in the scene file. You may build your own tools on the output of other Radiance programs, e.g. I used gensky to get the sun vector when I scripted a tracking mirror and only had to filter out the relevant information using regular expressions.\n\nOne step further would be to write a tool that writes not only these parameters, but the geometry description to stdout, so that it could be embedded in the scene file. Radiance is very flexible when it comes to integration with other, external tools.\n\nCheers, Lars.\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n", "replyTo": "Subject: [Radiance-general] Louvered skylights simulation", "sender": "grobe at gmx.net", "isquestion": false, "tags": [], "id": "<04B072E0E3317A4486513BB18D6579C0842306@exmbx10.ex.ad3.ucdavis.edu>", "refs": ["<04B072E0E3317A4486513BB18D6579C0841D70@exmbx10.ex.ad3.ucdavis.edu>", "<4F4DE46F.2080807@gmx.net>"], "datetime": "Wed, 29 Feb 2012 21:23:05 +0000", "email": "Lars O. Grobe", "subject": "Re: [Radiance-general] Louvered skylights simulation"}