{"body": "\nMarcus\n\nYour LUX values will be very low. With a trans material you are basically\nreducing the incoming light to about 1/8th of the available light. Your\nsimple trans material will also not account for indirect light reflected\noff the blinds. This can be a substantial part of the transmitted light.\n\nOn Wed, Feb 22, 2012 at 6:56 AM, Marcus <jones.0bj3 at gmail.com> wrote:\n\n\n\nThe transmittedSpecular part can be left at 1 (100%) because the light\npassing through the holes will not be modulated. As a result you should see\nthe projection of the window opening on the floor if direct sunlight hits\nit, just as you would see the shape of the window drawn in tiny dots in\nreal life. With trans you will not be able to model the angular dependent\ncut off that you get with small perforated panels.\n\n\n\n\nUnfortunately there is no golden rule because every system is different.\nYou have to look at the system and model it's shading effects as best as\npossible. Sometimes this needs more than one calculation:\n\nYou could, for example, use your trans material to model only the light\nthat passes through the holes. Then you model another scene with metal\nblinds in their actual size (or perhaps a bit larger) to capture the\nindirect reflected light. Add both results together and you have a\nreasonable approximation of the real system.\n\nRegards,\nThomas\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20120222/fd48ba06/attachment.html>\n\n", "replyTo": "Subject: [Radiance-general] Perforated window shading", "sender": "Thomas Bleicher", "isquestion": false, "tags": [], "id": "<CAKGV-k2-BU5a9KE7aaq_rCVS7QhBoTma4vAAHPy3HLocVRmLDg@mail.gmail.com>", "refs": ["<CAEzj1z6QpvgQ_ePO-8tZXUcimXwZp+xDWnMUVsMarn49jaunng@mail.gmail.com>", "<4F44C9B5.7020204@gmx.net>", "<CAEzj1z4UA+VMQi9aPTn3YPbqdZWwgjrzdK+eK=YLf=jn8_qznA@mail.gmail.com>"], "datetime": "Wed, 22 Feb 2012 08:19:05 -0500", "email": "tbleicher at googlemail.com", "subject": "[Radiance-general] Perforated window shading"}