{"body": "\nHi all,\n\nyou can use evalglare also without a fish-eye lens, but you have to be\naware of following:\n\nIf you want to use the DGP, then you need to have a vertical illuminance\nvalue. Per default, this value is calculated by evalglare by the use of\nthe image. But this can be done only, if you have a full fish-eye view.\nIf you don't have the fish-eye view, you can provide this value by the\n-i option (see the comment of Alstan). Then, you should measure the\nvalue by a luxmeter. If you haven't measured the illuminance, then it is\nproblematic. The smaller you view angle is the higher is the error you make.\nPlease be aware, that recent studies showed, that the glare caused by\ndaylight can be described best, if you take into account the vertical\nilluminance. So if you don't measure it (or measure it only partly by\nrestricted view), you might get far away from a real glare evaluation.\nIn other words: If you wanna do a daylight glare evaluation, you have to\nmeasure the vertical illuminance (either by a full fish eye or by a\nluxmeter).\n\nPrincipally, evalglare does not depend on the view type. So if you have\na smaller view (and you catch with your cam potential glare sources) +\nan additional luxmeter you can do a reliable daylight glare evaluation.\n\nUp to the current version(0.9f), some view types were not supported\n(like -vth), but this will change :\n\nThere will be a new version (1.0) released NEXT week, which will have\nfollowing new features (I will announce it, as soon as it is on the\nserver) :\n\n-all current view types will be supported (except parallel view) - that\nmeans also -vth !\n-valid view is checked (many problems occurred, because users treat the\nimage with programs like pcompos before putting into evalglare. But\nthen, the view got lost and a wrong view leads to totally wrong results!\nNow this will be handled by the new evalglare )\n-view options can be provided also per command line option\n-disability glare is also calculated\n-cut-out the \"Guth\" visual field\n\nJan\n\n\n\nJ. Alstan Jakubiec schrieb:\n\n\n--\nDr.-Ing. Jan Wienold\nHead of Team Passive Systems and Daylighting\nFraunhofer-Institut f?r Solare Energiesysteme\nThermal Systems and Buildings\nHeidenhofstr. 2, 79110 Freiburg, Germany\nPhone: +49(0)761 4588 5133 Fax:+49(0)761 4588 9133\njan.wienold at ise.fraunhofer.de\nhttp://www.ise.fraunhofer.de\n\nIn office:\nMo,Tue: 8:30-18:00\nWe,Thu: 8:30-16:00\nFr:  8:30-15:30\n\n\n\n", "replyTo": "Subject: [Radiance-general] evalglare with regular lens", "sender": "Jan Wienold", "isquestion": false, "tags": [], "id": "<4F316D28.5050904@ise.fraunhofer.de>", "refs": ["<4F308933.3080109@gmail.com>\t<CAKGV-k0zpJv+aFaZh6L13ySmTe-XtvbfF0t8=qbjvajmFL=s=g@mail.gmail.com>", "<op.v9afk9koc8ew1p@severian.hsd1.ma.comcast.net>"], "datetime": "Tue, 07 Feb 2012 19:27:52 +0100", "email": "jan.wienold at ise.fraunhofer.de", "subject": "[Radiance-general] evalglare with regular lens"}