{"body": "\nHi Andy, hi list!\n\n\nThis is a nice framework for an appealing site! I especially like the\nfact that the design of the \"good old\" site could be adopted.\n\nI started setting up something related recently. Not based on Plone but\nDrupal, not a complete \"Radiance Website\" but a concept focussing on\njust having a working FAQ one day. You may get an idea here:\n\nhttp://radiance.larsgrobe.de\n\nThe only part of interest on the site is the FAQ for now. I have spent\nsome time on thinking how to organize a FAQ, and abandoned the idea of\nhaving single categories per question. I believe a tag-system being much\nmore appropriate, e.g. a question/answer pair on mkillum might be\nrelated to \"commands\", \"diffuse indirect calculation\", \"complex glazing\"\nand \"optimizations\". One day one might decide to also tag the content on\nuser levels, so a tag \"advanced user\" might be added. Browsing the\nmailing lists, there is such a vast amount of information that I tend to\npay a lot of attention on the topic of marking it. Once a certain amount\nof content is available, tag clouds (which may occur in alphabetical\norder - I do not rely like the fancy cloud displays typically rendered\nwith lots of formatting) may be of more help then a fixed hierarchy.\n\nOne feature that I spent some time on was to integrate tex notation into\nthe content management. I added a test on the start page. You can embed\nany Latex code in the content, which will be rendered into inline\nimages, but also be available as pdf downloads. The need to display\nformulas and algorithms seams to be of importance. I am going to add\nsupport for describing geometry in the content management, too -\nbasically I want to keep content descriptive and avoid bitmap images as\nfar as possible, so that content can be reused (e.g. for copying the\nLatex source into a formula editor when writing an article), reformatted\nand extended at any time.\n\n\n\nOn sharing: I think that sharing models is an interesting part of a\ncommunity website, though I am not sure that much model content will\nbecome available. Most Radiance models are case-studies - buildings,\nrooms, facades. Objects to be shared are more like furniture and other\ndecorative stuff, not bound to a specific use case - which is already\navailable on the internat. Similar is true for textures.\n\n\n\nI see a need for sharing of cal-files. This would require an interface\nwhere I could check the parameters and get a preview of the results -\ndownloading the cal-file is easy, using it makes things difficult.\n\n\nThe gallery is a must....\n\n\nA Radiance material library would be great and is a topic on its own. I\nstarted a concept of holding material data in a database, with several\ninterfaces to access it. I would prefer the data to be independent of\nthe software using it, so e.g. I would want spectral resolutions\nsupported beyond the three RGB channels natively supported by Radiance.\n\nExtracting a Radiance material from this could be implemented in the\ninterface - combining the measured data from the database with the\nassumptions to be made when using it in Radiance (e.g. I would need to\nknow that the data from the spectrometer are to be used with a plastic\nmodifier). So a material record could contain a table \"models\", where I\ncould add proposed models for various software tools. So querying the\nmodel-table for \"Radiance\" for this material would return \"plastic\",\nwhile querying for \"MyOtherRenderer\" could return \"lambertianReflection\".\n\n\n\nI decided not to publicly announce this project so far, as there is\nlittle content right now. Maybe there is some potential for combining\nefforts, so I add this to the discussion.\n\nCheers, Lars.\n\n\n", "replyTo": "Subject: [Radiance-general] New Radiance Website", "sender": "Lars O. Grobe", "isquestion": false, "tags": [], "id": "<4F5552AC.1030503@gmx.net>", "refs": ["<773BB28F-61FE-492E-B7CE-8D30144BA192@lbl.gov>"], "datetime": "Tue, 06 Mar 2012 00:56:28 +0100", "email": "grobe at gmx.net", "subject": "[Radiance-general] New Radiance Website"}