{"body": "\nHi Andy, Rob, Lars\n\nI'd like to endorse the concept of an FAQ for Radiance, but ask for a slightly broader view of the material definitions. They might initially be listed in the Radiance FAQ listing, but preferably they would also be listed in a more general materials database. There is an increasingly intense need for this: http://www.ibpsa.org/proceedings/BS2005/BS05_0373_380.pdf\n\nWe regularly export from SketchUp today to Daysim/Radiance - EnergyPlus and CATT Acoustic. I would love to be able to be sure that what we do with an 'acoustic tile' and its manufacturer's data for our acoustic analysis carries reliable light properties to the Lighting simulation - and that it can be tracked back to its source: http://www.ibpsa.org/proceedings/BS2009/BS09_1405_1412.pdf Our role as users could well be to rank / rate via social media style techniques the reliability of the data.\n\nIf we get these basic steps right then http://www.ibpsa.org/proceedings/BS2001/BS01_0731_738.pdf we have the basis for quality assurance - believable - simulations in an increasingly integrated (BIM or not) world...\n\nM\n\nPS: XML formatting is an example of how the approach could be implemented. XML /IFC or other formatting is not the issue; associated annotation and internet services based serving of data and associated rating of quality level of the data is.\n\nMichael Donn\nDirector Centre for Building Performance Research\nSchool of Architecture\nVictoria University      +64 4 463 6221  work\nPO Box 600              +64 21 611 280  mobile\nWellington                +64 4 463 6204  work fax\nNew Zealand             +64 21 611 594  mobilefax\n\n\n-----Original Message-----\nSent: Wednesday, 7 March 2012 11:55 AM\nTo: radiance-general at radiance-online.org\nSend Radiance-general mailing list submissions to\nradiance-general at radiance-online.org\n\nTo subscribe or unsubscribe via the World Wide Web, visit\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\nor, via email, send a message with subject or body 'help' to\nradiance-general-request at radiance-online.org\n\nYou can reach the person managing the list at\nradiance-general-owner at radiance-online.org\n\nWhen replying, please edit your Subject line so it is more specific than \"Re: Contents of Radiance-general digest...\"\n\n\nToday's Topics:\n\n1. the disk of the sun (Michael Martinez)\n2. Re: New Radiance Website (Lars O. Grobe)\n3. Re: New Radiance Website (Andy McNeil)\n4. Re: the disk of the sun (John Mardaljevic)\n5. Re: New Radiance Website (Guglielmetti, Robert)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nTo: Radiance general discussion <radiance-general at radiance-online.org>\nContent-Type: text/plain; charset=us-ascii\n\nHi All -\n\nI'm working on a project in which the brightness of the disk of the sun has become a discussion topic.\n\nUsing gendaylit set for California's central valley, a view toward clear (smoggy-ish) sunny skies  at 8am on September 1 reveals a disk luminance of 987,365,074 cd/m2.\n\nThis seems perfectly reasonable, although when I find myself commenting \"oh yes, it's about a billion...\" I can't help but pause.\n\nDoes anyone know of a handy reference for disk luminance based on location and climate? Or better yet, anyone out there with greater math skills than I know how to derive disk luminance from direct normal radiation found in a weather file?\n\nThanks!\n\nMike\n\n\n\n\n\n\n\n\n\n\n------------------------------\n\nMessage: 2\nTo: Radiance general discussion <radiance-general at radiance-online.org>\nContent-Type: text/plain;\tcharset=us-ascii\n\nHi Andy,\n\nI agree that there is a demand for sharing models. Besides what you mentioned, it is great for educational purpose and for validation. It may even reduce the downloads - if we could remove example scenes from the auxiliary files (errr are they still in there?) and have a makefile not only running oconv and rpict, but fetch model data when needed from a known URL.\n\nFor integrating my FAQ-start, I'd be happy to support this. Maybe the formatting would need to be sent through your CSS. Sharing accounts should be rather easy, there are lots of interfaces available in times of social networks (opened? Huuuuh big brother Radiance ;)...). I think we can discuss this off-list (with everyone included who is interested).\n\nFor those starting to play around now - please forgive the user-unfriendliness (you may also call it rudeness) of the site in its current stage. I did not plan to make it public yet and posted the address more as a contribution to the discussion. I will do some polishing in the coming days, until then expect it to behave as what it is - still experimental ;)\n\nCheers, Lars.\n\n--\nDipl.-Ing. Architect Lars O. Grobe\n\nOn Mar 6, 2012, at 19:22, Andy McNeil <amcneil at lbl.gov> wrote:\n\n\n\n\n------------------------------\n\nMessage: 3\nTo: Radiance general discussion <radiance-general at radiance-online.org>\nContent-Type: text/plain; charset=us-ascii\n\nAbsolutely!  Let me know when it contains Radiance components and I will link to it.  Or better yet, register, I'll promote you, and you can add the link when it is time.\n\nAndy\n\nOn Mar 6, 2012, at 9:32 AM, Guglielmetti, Robert wrote:\n\n\n\n\n\n------------------------------\n\nMessage: 4\nTo: radiance-general at radiance-online.org\nContent-Type: text/plain; charset=us-ascii\n\nHi Mike,\n\nSee page (number) 60 in chapter 3 here for a description how to derive the luminance of the sun from direct normal illuminance:\n\nhttp://www.iesd.dmu.ac.uk/~jm/doku.php?id=resources:thesis\n\nIncludes a little discussion re: the inconsistency of applying a measurement taken with an acceptance angle of, say, 6 degrees to a source - the sun - that has an angle 0.5 degrees.  Note that the discussion is couched in terms of predicting illuminance.\n\nBest\nJohn Mardaljevic\n\nReader in Daylight Modelling\nInstitute of Energy and Sustainable Development De Montfort University, The Gateway, Leicester, LE1 9BH, UK\nTel: +44 (0) 116 257 7972\n\njm at dmu.ac.uk\nhttp://www.iesd.dmu.ac.uk/~jm\nhttp://dmu.academia.edu/JohnMardaljevic\n\n\n\n\n------------------------------\n\nMessage: 5\nTo: Radiance general discussion <radiance-general at radiance-online.org>\nContent-Type: text/plain; charset=\"us-ascii\"\n\nYes those example models are still in there, and we rely on them being there for testing our builds, so I'd hate to see those ones get moved...\n\n\nRob Guglielmetti  IESNA, LEED AP\nCommercial Buildings Research Group\nNational Renewable Energy Laboratory\n1617 Cole Blvd MS:RSF202\nGolden, CO 80401\nT. 303.275.4319\nF. 303.630.2055\nE. robert.guglielmetti at nrel.gov\n\n\n\n\n\nOn 3/6/12 3:03 PM, \"Lars O. Grobe\" <grobe at gmx.net> wrote:\n\n\n\n\n\n------------------------------\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\nEnd of Radiance-general Digest, Vol 97, Issue 4\n***********************************************\n\n\n", "replyTo": "Subject: [Radiance-general] Radiance-general Digest, Vol 97, Issue 4", "sender": "Robert.Guglielmetti at nrel.gov", "isquestion": false, "tags": [], "id": "<CB7BE33F.EAB0%robert.guglielmetti at nrel.gov>", "refs": ["<mailman.201.1331074492.98291.radiance-general@radiance-online.org>"], "datetime": "Tue, 6 Mar 2012 15:54:44 -0700", "email": "\"Guglielmetti, Robert\"", "subject": "Re: [Radiance-general] New Radiance Website"}