{"refs": ["<422637B8.2000305@t-online.de>", "<10203.213.58.101.145.1109806416.squirrel@213.58.101.145>", "<d72aaa476ff88748209362b91d299fba@gmail.com>", "<10222.213.58.100.96.1110471987.squirrel@213.58.100.96>", "<Pine.BSF.4.58.0503101146290.31300@emancholl.pair.com>", "<7265410cf4f75cfdaaa6bf59dc54654b@gmail.com>", "<10141.213.58.100.96.1110480630.squirrel@213.58.100.96>"], "id": "<9055f7a1537ba6f65261977d9351fcff@gmail.com>", "subject": "[Radiance-general] trans ma", "email": "gregoryjward at gmail.com", "body": "\nSorry, Axel -- I should have read through your original posting more\ncarefully.  I missed your questions and references at the end:\n\n\nI don't know of any *good* ways to measure these without some kind of\nphotometer.  A crude way to measure total transmittance would be to\nmeasure illuminance near a large white card, then again, covering the\nilluminance probe completely with your material.  The same trick will\nwork with a camera and Photosphere or hdrgen if you don't own a lux\nmeter.  Use your camera in the same way as the probe.  Divide the\naverage of the second image by the first using Photosphere (or hdrgen)\nand running \"pvalue -h -H -d -b -o capture.hdr | total -m\" (or \"Edit ->\nSelect All\" in the image viewer of Photosphere).\n\nFor reflectance, you can try a similar trick if you know the\nreflectance of your white card, and this is described in RwR, I think.\n\nSpecular is more difficult to measure, but you can usually guess with\nreasonable accuracy.  If a surface is a single dielectric interface\n(plastic or glass), it's specular reflectance will be around 4%.  If it\nis a double interface, as in a pane of glass, it will be about twice\nthat, unless the glass is very dark, where it will be somewhere between\n4% and 8% depending on the amount of absorption.\n\nAs for roughness, I have a nice little device with LEDs and a viewport\nthat allow me to estimate this value, but I don't know how to offer it\nto anyone as it's a piece of hardware, and requires a lot of experience\nto use effectively.\n\n\nI'm not sure I understand the question.  If you set A6 to 0, trans is\nthe same as plastic.\n\n\nIf you mean substituting trans for plastic to be general, there's no\nharm.\n\n-Greg\n\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] trans mat", "tags": [], "sender": "Greg Ward", "datetime": "Thu Mar 10 20:02:35 2005"}