{"refs": [], "id": "<20050311143419.15ED11C001C2@mwinf0402.wanadoo.fr>", "subject": "[Radiance-general] radiance graph", "email": "jelle.feringa at ezct.net", "body": "\nHi,\n\nCurrently I'm trying to construct a light-graph of a given scene by\nraytracing Radiance samples using rtrace, and dumping these to a polyline\ninstead of pixels. I think such a graph could give a lot of insight apart\nfrom an image as well. Also I like the idea of being able to construct\ngeometry instead of generating yet another pixel. I already have sooo many\nof these.\n\nThing is that my experiment has only been semi successful, and I'd like to\nhear what you think of it: I've made it available on my server:\nwww.ezct.net/radiance\n\nThe technique I used is simple, I have been using the following commandline:\n\nximage trace.pic | rtrace -ab 1 -ds 0.2 -dr 6  -dt 1 -otodp -h -x 1 -i\nok.oct  > raytrace_sample.dmp\n\nThe coordinates in raytrace_sample.dmp are converted to .dxf geometry.\nTo give you some insight, I've merged it with the original scene:\nradiance_graph_01_in_context.dxf\n\nThe problem so far is that 'graph' implies clarity, and as you'll see, my\nexperiments so far are rather noisy. Getting lots of rays isn't the point,\ngetting the ones that matter is another! The other thing is that I do not\nknow how I could generate such a point dump from a whole image instead of\nsampling a single pixel, as I'm doing now. I've done some experiments\nsampling many points, but that's not the way to do it. How could I have\nrtrace trace all pixels in a given picture?\n\nTo make the graph more clear, it would be interesting to color them for\ninstance accordingly to how often a ray bounced. What would be a good way\nfor scripting rtrace such that I'll be able to do so?\n\nAnother thing would be that the graph would be most coherent when a ray is\ntraced from camera all the way to the source. Would my best option be to\nrender with just a sun and to forget about the sky? I've tried a couple of\noption but it seems difficult to have many rays reach a light source.\n\nLove to hear what you think of it.\n\nCheers,\n\nJelle.\n\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Jelle Feringa / EZCT Architecture & Design Research", "datetime": "Fri Mar 11 15:34:37 2005"}