{"body": "\nHi Randolph,\n\nAll I have is Linux. Not sure what kernels at this point. But I have\nnoticed this over multiple kernels and distributions. Although I have\nnot run anything on the most recent kernels.\n\nI know that one thing I did was to disable the fork and wait\nfunctionality in rpiece to wait for a job to finish. I do not recall\nthough if this was related to this problem, nfs locking, or running on a\ncluster with job distribution queuing....? Sorry I do not remember more\nright now.\n\nJust thinking out loud here, but if you are running on a cluster then\ncould network latency also be an issue?\n\nHere is my suspicion/theory, which I have not been able to test. I think\nthat somehow there is a race condition in the way jobs get forked off\nand status of pieces gets recorded in the syncfile...\n\nFor testing/debugging purposes, a few things to look at compare might be:\n\n* big scene - slow load time\n* small scene - fast load time\n* \"fast\" parameters - small image size with lots of divisions\n* \"slow\" parameters - small image size with lots of divisions\n\nOn my cluster, I ended up setting up things so that any initial small\nimage run for building the ambient cache would actually just run as a\nsingle rpict process and then large images would get distributed across\nnodes/cores.\n\nAs an aside, perhaps Rob G. has some thoughts on Radiance/Clusters as I\nthink they have a large one also. What is the cluster set up at LBNL? I\nbelieve that at one point they were using a provisioning system called\nWarewulf which has now evolved to Perceus. I have the former setup and\nhave not gotten around to the latter. LBNL may also be using a job\nqueuing system called Slurm which they developed (or maybe that was at\nLLNL)?\n\nHopefully this is not leading you off on the wrong track though.\nProbably would be useful to figure out if the problem is indeed rpiece\nrelated or something else entirely.\n\n-Jack\n\n--\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n\n\nOn 4/11/2012 1:27 AM, Randolph M. Fritz wrote:\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20120411/ea195513/attachment-0001.html>\n\n", "replyTo": "<jm34ov$1n4$1@dough.gmane.org>", "sender": "Jack de Valpine", "isquestion": false, "tags": [], "id": "<4F857F22.1010403@visarc.com>", "refs": ["<iv5g21$jnc$1@dough.gmane.org>", "<4188C437-AE0A-48A6-A4C2-22D1AB992CEA@lmi.net>", "<iv5lit$hkp$1@dough.gmane.org> <jlvdb5$ljf$1@dough.gmane.org>", "<4F834A8B.7020704@visarc.com>", "<B7A9CAA2-4DFB-48A2-B0A9-5D811124465C@lmi.net>", "<jm34ov$1n4$1@dough.gmane.org>"], "datetime": "Wed, 11 Apr 2012 08:54:58 -0400", "email": "jedev at visarc.com", "subject": "[Radiance-general] \"Broken pipe\" message from rpiece onmulti-core Linux system"}