{"body": "\nHi Chris,\n\nI have used pcomb to blend different sky images that were capturing different luminance ranges. The result was never very good as the flare around the sun was always a problem.\n\nIebele's answer below is a great example, but please note this is merging two images (one with the sun and one with the sky) into one full sky. If you need the reverse, the command will be very similar, only that instead of using the input from the second image, you can just use a zero value.\n\nSo you can replace ri(2), bi(2), gi(2), etc. with 0, which will give you an image with only values that are above the threshold, and zero for the rest (or below the threshold, if you invert \"difr=sens-ri(1)\"... etc.)\n\npcomb -e 'sens=1.5;difr=ri(1)-sens;difg=gi(1)-sens; difb=bi(1)-sens; ro=if(difr,ri(1),0); go=if(difg,gi(1),0); bo=if(difb,bi(1),0); '  full_sky.hdr   |   ximage\n\nI can imagine the cloud edge can be difficult to separate. One solution might be to use the difference between blue and red channels to try and separate the blue sky from the rest (like using a red filter, as Axel suggested, this will probably also include the circumsolar region, which can be separated in a second step). It might look something like this:\n\npcomb -e 'sens=0.5; dif=bi(1)-ri(1)-sens; ro=if(dif,ri(1),0); go=if(dif,gi(1),0); bo=if(dif,bi(1),0); '  full_sky.hdr   |   ximage\n\nI've never tried something like this, so most probably there are some errors, also I have no idea what might be an appropriate threshold, but I hope this helps.\nCheers,\nSantiago\n\n\nSent: 30 March 2012 11:51\nTo: Radiance general discussion\nHi Chris,\n\nI had something similar a few weeks ago, and figured out this:\n\npcomb -e 'sens=1.5;difr=(ri(1)-sens)-ri(2);difg=(gi(1)-sens)-gi(2); difb=(bi(1)-sens)-bi(2); ro=if(difr,ri(1),ri(2)); go=if(difg,gi(1),gi(2)); bo=if(difb,bi(1),bi(2)); '  sun.hdr blue_sky.hdr   |   ximage\n\nYou can tweak the \"sens\" variable to get the result you want. In my case (which was not a sky picture) the value was around 0.9 to get the result I was after. The value you need to mask the sun out of the sun.hdr image must probably be higher. If the value is too low, the result will be just a copy of blue_sky.hdr.\n\nThe command first finds the difference between pixel values for red, green and blue in sun.hdr and blue_sky.hdr. The difference (tweaked by 'sens' ) determines from which input file the pixel component value is written to the output.\n\nIf you are only interested in changing the luminance values of blue_sky.hdr at those spots where the sun (or clouds) are bright in sun.hdr you may try something like this:\n\npcomb -e 'sens=1.5;difl=(li(1)-sens)-li(2);ro=if(difl, li(1)*ri(2),li(2)*ri(2) ); go=if(difl, li(1)*gi(2),li(2)*gi(2) ); bo=if(difl, li(1)*bi(2),li(2)*bi(2) );  ' sun.hdr blue_sky.hdr | image\n\nUsing these commands, the sun (and clouds) will appear with sharp boundary edges (not blurred) in the resulting composite image.\n\nHope this helps a bit,\n\nIebele\n\n\n\nOp 30 mrt. 2012, om 07:45 heeft Greg Ward het volgende geschreven:\n\n\nHi Chris,\n\nSeems no one answered this, but I believe there are experts out there who have played with sky blending techniques.  I won't name any names, you know who you are....\n\nI'm heading out on a little vacation tomorrow with a million things to do first, otherwise I'd take a crack at it.  Maybe you could explain a little more clearly the effect you are going for?\n\nBest,\n-Greg\n\n\n\nDear group,\n\nI'd like to be able to generate two separate images from an HDR image of the sky vault: one with blue sky; the other with clouds and sun (assuming it's not occluded).  I'm not well versed in the usage of 'pcomb' but I'm assuming I'll need to somehow create a mask based on both color and brightness thresholds.  It seems from my archive search that a call to 'pgblur' with a high radius might help in defining sharper boundaries between clouds and blue sky. (http://www.radiance-online.org/pipermail/radiance-general/2008-May/005046.html)\n\nHas anyone been successful in achieving something similar?\n\nAs always, thanks!\n\nChris\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20120418/08d03cea/attachment-0001.html>\n\n", "replyTo": "Subject: [Radiance-general] pcomb-masking color channels", "sender": "chris at coolshadow.com", "isquestion": false, "tags": [], "id": "<F680DBC15ACC484FA2089674923B4C8905F6B846@EURXMBS05.global.arup.com>", "refs": ["<jkfq67$rjv$1@dough.gmane.org>", "<427773F0-7BBD-4D33-85D2-9884B7264A98@lmi.net>", "<BAE8E899-19AB-4B1A-AFD1-E59176B0D353@coolshadow.com>", "<25CF3DB3-AD8D-42DA-BF7D-AE605519C092@lmi.net>", "<7F18F8EB-6171-437F-B48F-1FAC3FB4BC5F@iebele.nl>"], "datetime": "March 27, 2012 3:19:15 PM PDT", "email": "Humann Chris", "subject": "Re: [Radiance-general] pcomb-masking color channels"}