{"refs": [], "id": "<4240864B.1020007@archenergy.com>", "subject": "[Radiance-general] SPOT Beta 2.1 Releas", "email": "zrogers at archenergy.com", "body": "\nDear Colleagues,\n\nThe California Energy Commission's Public Interest Energy Research\n(PIER) program has provided funding for the development of the Sensor\nPlacement & Orientation Tool (SPOT).  SPOT is a free software program\nthat assists in the design and installation of photosensor systems in\ndaylit environments.  In addition, SPOT is a useful tool for general\ndaylighting and daylight and electric light integration analysis.  The\nprogram consists of a Microsoft Excel based user interface with a\nRadiance engine performing the calculations in the background.  The\nnewest version SPOT Beta 2.1 can be downloaded from the SPOT website\nat:  (please uninstall any previous versions of SPOT)\n\nwww.archenergy.com/SPOT <http://www.archenergy.com/SPOT>\n\nThe main forum for Q & A, bug reports, product updates, and other\nannouncements will be through a SPOT discussion list.  If you plan on\nusing the program, please consider signing up for this list.  The home\nwebsite, where you can sign up and access postings, is accessible\nthrough the main site or with the following URL:\n\nhttp://www.archenergy.com/mailman/listinfo/spot\n\nPrevious list postings can be accessed with the SPOT Archives link on\nthis website.  You can also choose to recieve various forms of e-mail\nreports containing the lists postings.\n\nNote that SPOT is still in the Beta stages as further development will\ncontinue to occur.  We have been working hard getting out all the kinks,\nbut bugs are inevitable, so please report any program errors, erroneous\nor suspicious data, or other awkward / misleading behavior to either the\ndiscussion list or to spotsupport@archenergy.com\n<mailto:spotsupport@archenergy.com> .  Feel free to submit any positive\nfindings as well!  We welcome any comments, suggestions, interesting\ncase studies!\n\nYou have recieved this e-mail cause either: a) you have downloaded the\nBeta v2.0 version b.) you are part of the SPOT Technical Advisory Group\nc.) you are on the Radiance online group d.) you have expressed interest\ne.) you are a photosensor manufacturer and we are interested in better\nintegrating your system into the program f.) the SPOT Design Team just\nwants your feedback.  We apologize for any cross postings!\n\nThank you for your time!\nZack Rogers and the\nSPOT Development Team\n\n--\nZack Rogers\nStaff Engineer\nArchitectural Energy Corporation\n2540 Frontier Avenue, Suite 201\nBoulder, CO 80301 USA\n\ntel (303)444-4149 ext.235\nfax (303)444-4304\nwww.archenergy.com\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20050322/76d1c694/attachment.htm\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Zack Rogers", "datetime": "Tue Mar 22 21:57:09 2005"}