{"body": "\nDear Rob,\n\nThanks for clarifying this. So which would be the best way of getting a good image with a \"correct\" exposure if I want, for example, to automate the images production process with a script?\nMy question ultimately ends up referring to the Ruby script Daylightsim.rb for Openstudio exported models (which was probably written by you?) which is giving me in output very dark/bad quality .hdr images.\n\nThanks,\nStefano\n\n--\n\nStefano Moret\nCalifornia Lighting Technology Center<http://cltc.ucdavis.edu/>\nUniversity of California, Davis\n633 Pena Drive\nDavis, CA 95618\n\n530-747-3846\nsmoret at ucdavis.edu<mailto:smoret at ucdavis.edu>\n\nOn 14/mag/2012, at 18.47, Guglielmetti, Robert wrote:\n\nHi Stefano,\n\nThe ambient value is used as a proxy estimate for the interreflected light, to be used for pixels when the other ambient investigation methods have been exhausted (ab, as, ad, lw, etc). It's a \"value of last resort\", if you will. So in one sense, if you drive the simulation with aggressive ambient parameters, the av setting becomes fairly irrelevant because a \"good\" av will be derived deterministically. Of course in keeping with the \"there's no such thing as a free lunch\" theme, cranking up the other ambient parameters results in long simulation times. There are some rules of thumb regarding \"good\" av settings for indoor and outdoor scenes that you can start with (consultation of the \"rad\" manual page will reveal these), but for a good image or numeric result you should be asking Radiance to do some raytracing to tease these values out for all the little corners of your space.\n\nAs far as using rvu for a testbed, this is an excellent way to interactively see the effects of the various parameters on appearance and render time. If you change a setting though, you need to redraw the image with the \"new\" command, or by clicking \"redraw\" on the new Qt-based rvu that comes with the NREL installers, to see the effect. Speaking of the NREL Radiance installers, we are posting updated packages tomorrow that address the missing .cal files issue that is present in the current installers.\n\n- Rob\n\n________________________________________\nSent: Monday, May 14, 2012 6:47 PM\nTo: radiance-general at radiance-online.org<mailto:radiance-general at radiance-online.org>\nHi,\n\nI?ve a basic question which I haven?t really succeeded to get answer to from the different tutorials. When I visualize an octree with rvu I usually set ?av and ?ab as first parameters.\nAs far as I understand, the ?ambient value? should set the brightness of the scene, but I don?t see any change by setting it to different values, and to get a nice image I usually use the ?pe option to set the exposure.\nCould you please enlighten me on the usage of ?ambient vale? option to get a good exposure in my images?\n\nThanks,\nStefano\n\n--\n\nStefano Moret\nCalifornia Lighting Technology Center<http://cltc.ucdavis.edu/>\nUniversity of California, Davis\n633 Pena Drive\nDavis, CA 95618\n\n530-747-3846\nsmoret at ucdavis.edu<mailto:smoret at ad3.ucdavis.edu>\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20120515/6ba24af9/attachment.html>\n\n", "replyTo": "Subject: [Radiance-general] rvu exposure setting", "sender": "smoret at ucdavis.edu", "isquestion": false, "tags": [], "id": "<E4347ABE-01A2-4D26-AE77-DDC9A10C6503@ucdavis.edu>", "refs": ["<04B072E0E3317A4486513BB18D6579C00728D83D@exmbx10.ex.ad3.ucdavis.edu>", "<FFF56A6D37A3A54F91A03601AC22DA32233EE1AB44@MAILBOX2.nrel.gov>"], "datetime": "Tue, 15 May 2012 19:49:32 +0000", "email": "Stefano Moret", "subject": "[Radiance-general] rvu exposure setting"}