{"body": "\nHi Imene,\n\n\n\nJust to add to Jack's and Thomas' replies to your question (I'm assuming\nyou're using a UNIX version of Radiance). You're probably wondering now\nhow this view file was created in the first place.\n\nIf you run\n$ rvu scene.oct\nthe interactive Radiance scene viewer rvu is launched with your scene in\nit. BTW: If you are reading some VERY old documentation which is still\nout there on the Internet, the command would be 'rview', not 'rvu'. You\ncan now use the command prompt at the bottom of the rvu window to move\nthe camera around. A list of the most useful rvu commands is in the\ntable on p18 of the Tutorial. Apart from 'aim', which is always handy,\nthe commands I use most often are:\n\n- when inside a room: 'rotate'\n- when looking from the outside: 'pivot'\n\nThe tricky bit is always to get the view point right. If you are inside\na room, a good starting point is to identify a good view point (think\ntripod and camera) by looking at your plan and elevations/sections\nwhich, of course, you have at least as scribble on a bit of paper.\n\nFor external views, a good start is to first run\n$ objview scene.mat scene.rad etc\n\nobjview takes the material and scene files, adds a few light sources,\ncompiles an octree, and then calls rvu. Now use 'pivot' (and the other\nrvu commands to move around the model. Once you have a good view, save\nit like this from the rvu prompt:\n: view views/nice.vf\n: q\n\nYou can now run rvu to look at the scene under your proper light\nsources, rather than the ones objview puts in:\n$ rvu -vf views/nice.vf scene.oct\n\nOr, you can run\n$ rvu scene.oct\nand\n: last views/nice.vf\n\nHope this helps\n\nRegards\n\nAxel\n\n\n", "replyTo": "Subject: [Radiance-general] about file *.vf in radiance software", "sender": "Axel Jacobs", "isquestion": false, "tags": [], "id": "<5005D0B4.5070908@gmail.com>", "refs": ["<mailman.1.1342551600.20707.radiance-general@radiance-online.org>"], "datetime": "Tue, 17 Jul 2012 21:53:08 +0100", "email": "jacobs.axel at gmail.com", "subject": "[Radiance-general] about file *.vf in radiance software"}