{"body": "\nHi Andy, hi list-subscribers,\n\nI just came across this recent message about the usability of the bsdf\nmaterial type with patch-based models of the sky including direct sun\nand complex fenestration. To avoid misunderstandings, I will try a short\nsummary for others to comment on available options for annual\nsimulations with complex glazing:\n\n\n1) classic radiance tools (rpict, rtrace), complemented by mkillum to\nrelax ambient setting.\n\nAdvantages: low noise, validated.\n\nDisadvantages: very slow for annual simulations, no support when\nnon-planar specular reflective surfaces are involved.\n\n\n2) rtcontrib and patch-based model.\n\nAdvantages: faster for annual simulations.\n\nDisadvantages: noise, nice images require high (slow) -ad and cannot be\noptimized using mkillum, limitations about specular non-planar\nreflectors apply.\n\n\n3) rtcontrib and patch-based model, bsdf.\n\nAdvantages: support for non-planar reflectors, should be slightly faster\nthen 2) as the fenestration system does not have to be traces internally\n- did anyone compare?\n\nDisadvantages: still high -ad settings required leading to extended\nrendering times and still no way to get mkillum in, tends to\nunderestimate direct sun (according Andy's message).\n\n\n4) three-phase-method.\n\nAdvantages: very fast, can also be used with non-planar specular\nreflectors as bsdf data is supported.\n\nDisadvantages: requires quite a lot of set-up work, e.g. subdivisions to\nreflect external obstructions. Patches visible in the results,\nfenestration geometry is not visible.\n\n\n5) pmap.\n\nAdvantages: can be used with non-planar reflectors and multi-peak\ntransmission.\n\nDisadvantages: unknown status (any news?), not integrated with rtcontrib\n(contributions would need to be rendered manually).\n\n\nSo if I need a way to generate images with visible fenestration\ngeometry, the only reliable option would be 2), which requires very\nhight settings for -ad and thud will still be rather time-consuming, if\nnoise is to be controlled.\n\nCheers, Lars.\n\nOn Tue, 2012-06-12 at 08:43 -0700, Andrew McNeil wrote:\n\n\n\n\n\n", "replyTo": "Subject: [Radiance-general] BSDF xml into Radiance", "sender": "Lars O. Grobe", "isquestion": false, "tags": [], "id": "<1343204322.19263.24.camel@ccmse-sim>", "refs": ["<CAOQvQdktSHbMb-HiQiTpNAhLfU-jL28BUfuA6pBh1=Y0yX7jow@mail.gmail.com>", "<CAOG+Nizc0-+xrNry_qVJh6-hoA0C-=P5EVTYuc7AiZuD9yqyVQ@mail.gmail.com>"], "datetime": "Wed, 25 Jul 2012 10:18:42 +0200", "email": "grobe at gmx.net", "subject": "[Radiance-general] BSDF xml into Radiance"}