{"body": "\nHowdy folks,\n\nJust wanted to let the community know there are updated Radiance\ninstallers posted on the NREL OpenStudio website, on the Radiance\nsupport page (sorry for the wrapped/busted links, you gotta copy/paste):\n\nhttps://openstudio.nrel.gov/getting-started-developer/getting-started-\nradiance\n\nA couple of recent additions are support for the planispheric view type\nin the Qtrvu application (thanks to Zack Rogers for pointing out the\ndeficiency), and the addition of a rewrite of the objview.csh script in\nRuby, so now Windows users have access to that utility. The Ruby version\nof objview also has a luminaire viewer option (-l) which takes an\nies2rad-generated luminaire description and places it in a box so that\nthe luminous distribution can be evaluated visually. See the man page\nfor details.\n\nNote also there is a new Sheriff in town, vis a vis contribution\ncounting. Greg has added a new version of rtcontrib, called ?rcontrib?.\nIt?s way faster than rtcontrib, and should be used as a direct\nreplacement for rtcontrib in your daylight coefficient investigations.\nThe makeall script actually doesn?t even compile rtcontrib anymore,\ninstead creating a symlink called rtcontrib that points to the new\nrcontrib. We have decided to compile both programs in the NREL\ninstallers, in case anyone wants to do some comparisons or validations\nbetween the two. Point being if you use the NREL Radiance installers,\nWhen you call rtcontrib, you are in fact getting rtcontrib! So, there.\n\nBTW, we have also posted documentation on how to use the\nRadiance-related functionality in OpenStudio, which is currently\nimplemented in a series of Ruby scripts. You can check that out here:\n\nhttps://openstudio.nrel.gov/getting-started-developer/getting-started-\nradia nce/openstudio%E2%80%99s-radiance-functionality-documentation\n\nHave fun, kids.\n\n- Rob\n\n\nRob Guglielmetti\nNational Renewable Energy Laboratory (NREL)\nCommercial Buildings Research Group\n15013 Denver West Parkway MS:RSF202\nGolden, CO 80401\n303.275.4319\nrobert.guglielmetti at nrel.gov\n\n\n\n\n\n\n", "replyTo": "", "sender": "Guglielmetti, Robert", "isquestion": true, "tags": [], "id": "<CC496CA2.13440%robert.guglielmetti@nrel.gov>", "refs": [], "datetime": "Thu, 9 Aug 2012 13:33:23 -0600", "email": "Robert.Guglielmetti at nrel.gov", "subject": "[Radiance-general] Updated Radiance Installers Available"}