{"refs": [], "id": "<B8DD8375FCE2C94B9F170D9277C1FA2B1919E7@corvallis>", "subject": "RE: [Radiance-general] mksource program", "email": "Santiago Torres", "body": "\nOkay,\nII'll be the guy sitting in the corner with the cone hat\n\nWhat should the octree consist of exactly?\n\nI tried a rnl box - projected with angmap.cal\nMade an octree and used it with mkillum.\nBut it produced no output.\nprobably because geometry is ignored...\n\nI don't  get how it can derive anything from a probe without geometry -  the\nprobe image has to be projected onto something - right?\n\nI can't make an octree directly of a probe pic - can I?\n\nRob \"another question\" Fitz\n\n\n-----Original Message-----\nTo: Radiance general discussion\nSent: 4/20/2005 1:12 AM\n\nHi Greg and all,\nI`ve tried mksource a bit and it works wonderfully, it`s a great program\n(and just what I needed)\nI put a page with the first sample renders:\nhttp://home.att.ne.jp/banana/tiago/radiance/mksource.htm\nrpict was only with -ab 1, and all the rest defaults since I just wanted\nto\ntest the sources\n\nfirst I tried mksource with the default settings but it seemed to\nproduce\ntoo few sources, and the render looked unnatural\n(don`t think this could be fixed with rpict settings)\nI tried changing the max angle to 0.5 (-a .5) but that was too small,\nand\nthe render took too long (at least for my laptop)\nso I tried other three values (5 deg, 2 and 1, after moving to a faster\ncomputer) and the differences are visible. The render with -a 1 took\nabout\n15 hours, so I don`t want to imagine what would happen with -ab 3 -ad\n5000\netc...\nI guess it`s a compromise, and maybe making the threshold higher would\nreduce the number of sources and allow a smaller -a?\nI will keep trying other settings and let you know how it goes.\nRegards\n\nSantiago\n\n\n\n\nillum\nartifacts.\n\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Santiago Torre", "datetime": "Wed Apr 20 20:46:02 2005"}