{"body": "\nHi all,\n\nI found the reply below from an old thread (12-15-2011). Would this help?\n\nAlso, how about defining a sensor with all coefficients 1, and getting the weighted illuminance, would that work?\n\nRegards,\nSantiago\n\n\n=========\n\n\nHi Minki,\n\n\n\nIf this quantity is equal to the integral of luminance over the full sphere, then it would be the same as 4*PI times the average luminance in all directions.  You can compute the latter quantity by averaging the output of an appropriate rtrace calculation of random rays over the sphere.  Something like the following should work:\n\n\n\nset N=10000\n\nset orig=(0 0 0)\n\ncnt $N | rcalc -of -e 'Dz=1-2*($1+rand(.77-.61*recno))/'$N -e 'phi=2*PI*($1+rand(-.10+.39*recno))'/$N \\\n\n-e 'rxy=sqrt(1-Dz*Dz);Dx=rxy*cos(phi);Dy=rxy*sin(phi)' \\\n\n-e \"Ox:$orig[1];Oy:$orig[2];Oz:$orig[3]\" \\\n\n-e '$1=Ox;$2=Oy;$3=Oz;$4=Dx;$5=Dy;$6=Dz' \\\n\n| rtrace -h -ff [options] scene.oct \\\n\n| total -if3 -m \\\n\n| rcalc -e '$1=179*4*PI*($1*.265+$2*.670+$3*.065)'\n\n\n\nThis should take ray samples in a stratified random spiral over the sphere.  The 3 averaged radiance values (RGB) output should be multiplied by 179 and 4*PI as above, unless I misunderstand the definition of spherical illuminance.\n\n\n\nBest,\n\n-Greg\n\n\n\n\nSent: 2012?10?20? 15:45\nTo: radiance-general at radiance-online.org\nHi all,\n\nI have an urban model with many windows, and I would like to calculate % visible sky for each window. I define a point at the centre of the window with a viewing direction normal to the window, and I would like to calculate how much (i.e. what %) of the sky dome is visible from that point, assuming a 180 degree cone of vision.  Note that I do not want to apply the cosine-law, and I want to treat each part of the sky dome equally. For a vertical window, the maximum value should be 50%, which would mean that there are no obstructions.\n\nWhat is the best (i.e. fastest) way of calculating this?\n\nI tried rtrace (1 bounce, uniform sky)  but that applies the cosine law. I have been looking at rsensor, but if I have lots of windows, it seems  I would have to run rsensor lots of times, which would be rather slow. Any suggestions?\n\nPatrick\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20121022/a78b144e/attachment.html>\n\n", "replyTo": "Subject: [Radiance-general] sky visibility", "sender": "patrick at janssen.name", "isquestion": false, "tags": [], "id": "<F680DBC15ACC484FA2089674923B4C8920517104@EURXMBS05.global.arup.com>", "refs": ["<CAMxTbri9-2+CYCjBe0O80GN9NDWvhnsWT=TTheAKi96faYM-uA@mail.gmail.com>"], "datetime": "Mon, 22 Oct 2012 03:38:53 +0000", "email": "Patrick Janssen", "subject": "[Radiance-general] sky visibility"}