{"body": "\nSoA/ACEE Search Fall 2012\nAssistant Professor in Architecture https://jobs.princeton.edu/applicants/jsp/shared/position/JobDetails_css.jsp?postingId=191809\n\nDear Radiance community,\n\nThe School of Architecture (http://soa.princeton.edu/) and the Andlinger Center for Energy and the Environment (http://www.princeton.edu/acee) seek outstanding applicants for a tenure track appointment at the Assistant Professor level effective as early as September 1, 2013.  The search is open to candidates specializing in energy and sustainability, with research areas ranging from energy-efficient building and urban design, from urban planning to typological analysis of buildings, their material constitution and constructive systems.  Potential areas of research and experience include: urban energy consumption, distribution and production; the interplay of energy and water use and distribution; the interactions of cities, climate, and microclimates, including the influence of buildings, parks and infrastructure and their effects on climate change; the geometrical and physical properties of building envelopes and their energy and climatic performance; the integration of passive energy systems into building typologies; the use of geographic information systems, computational modeling and monitoring using fluid dynamics, experimental analysis and sensors, as well as the use of synthetic techniques and methods for the design of a sustainable environment.\n\nThe candidate should have a PhD in Architecture, Building Sciences or Technology, or Civil or Mechanical Engineering or related field, demonstrated excellence in academic research, and a strong commitment to teaching and advising undergraduate and graduate students.  Candidates must complete an online faculty application at https://jobs.princeton.edu<https://jobs.princeton.edu/> position # 1200716; curriculum vitae, detailed descriptions of teaching and research interests, reprints of selected publications, and the names and addresses of at least three references should be attached as PDF documents to the on-line application.  Candidates are encouraged to apply before December 1, 2012.  Princeton University is an equal opportunity employer and complies with applicable EEO and affirmative action regulations.\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20121026/511d5fc4/attachment.html>\n\n", "replyTo": "", "sender": "Axel Kilian", "isquestion": true, "tags": [], "id": "<456408D4D3AC714CB92CBE6420B116B3042129A2@CSGMBX203W.pu.win.princeton.edu>", "refs": [], "datetime": "Fri, 26 Oct 2012 17:25:49 -0000", "email": "akilian at princeton.edu", "subject": "[Radiance-general] Position for an assistant professor inarchitecture specializing in energy and sustainability"}