{"body": "\nHi Jia,\n\nIt is confusing, because WINDOW 6 defines the front of a window as the outward-looking face, whereas Radiance faces window surfaces inwards when they are used as light sources.  Thus, the notion of front and back get reversed between the WINDOW 6 XML file and Radiance.\n\nIn addition to this, there is the fact that Radiance generally follows rays backwards from their destination (the point of measurement) to their source.  Therefore, calculations in the interior of the space trace light rays backwards to the window surface, then use the WINDOW 6 \"Transmission Back\" data to compute light contributions from the other side.\n\nOne more thing that bears mentioning is that if only one of \"Front Transmission\" or \"Back Transmission\" is available in the XML file, the BSDF library knows how to apply reciprocity to estimate the opposite direction.  Thus, using only one of \"+forward\" or \"+backward\" in genBSDF still works for transmission.  For reflection, you need to compute the distribution for the side(s) in which you are interested.\n\nTo be absolutely clear, the \"+forward\" computes the WINDOW 6 \"Front Transmission\" and \"Front Reflection\" components, whereas the \"+backward\" option computes \"Back Transmission\" and \"Back Reflection.\"  The back/front confusion is why I chose to call these options \"forward\" and \"backward\" rather than \"front\" and \"back,\" which would be ambiguous.  Forward means rays entering the space from the outside, and backward means they are going the other way, which is generally what we are interested in with Radiance (hence the default \"+backward\" and \"-forward\" options.)\n\nI hope this helps.\n-Greg\n\n\n\n", "replyTo": "Subject: [Radiance-general] front and back transmission in BSDF", "sender": "Greg Ward", "isquestion": false, "tags": [], "id": "<94E468D4-E4B1-4C01-BEEF-759972BBC99F@lmi.net>", "refs": ["<CABzgtwpKsKQfax7D4Qd8xR8E6YY_OowtNaXs0=0w83A52rtK8A@mail.gmail.com>"], "datetime": "Mon, 15 Oct 2012 21:47:47 -0700", "email": "gregoryjward at gmail.com", "subject": "[Radiance-general] front and back transmission in BSDF"}