{"refs": [], "id": "", "subject": "Re: [Radiance-general] oconv question", "email": "adiance-general-bounces@radiance-online.org", "body": "Message-ID: <000201c548d2$950fa650$3d1b4742@jdm341work>\n\nThanks for the helpful info and the warm welcome! I had tried to export the\npath before but it apparently didn't work for some reason (probably put a\ncolon in the wrong place or something, heh), so I did it again and it works\nfine now.\n\nOn a side note, I would highly recommend Debian if you are thinking about\nswitching. I haven't had much experience with too many other distributions\n(only RedHat and Mandrake), but I like Debian the best out of them, mostly\nfor it's package management system (to answer your question, yes, the deb\nfiles are like rpms).\n\nThanks again,\n\nDave\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of Rob\nGuglielmetti\nSent: Sunday, April 24, 2005 12:17 AM\nTo: Radiance general discussion\n\nOn Apr 23, 2005, at 5:42 PM, J. David Maino wrote:\n\nHi David,\n\nWelcome to the world of Radiance!  From the base of the learning curve,\nit can seem like a long way to the top.  I'm about 25% of the way up\nthe slope and it was totally worth every grey hair.  =8-)\n\nI'm not familiar with debian (tho my friend keeps telling me to ditch\nFedora and use Debian instead), but I'd assume that the .deb thingy is\nlike an .rpm distro?  Regardless, I'd bet that the problem is that the\n.deb installer is just not setting your PATH correctly, if at all.\n\nUsually the Radiance binaries are installed to /usr/local/bin; probably\nthe .deb installer placed all the binaries properly, but didn't set the\nPATH.  As a test you could try typing /usr/local/bin/oconv instead of\noconv (along with the rest of the command you intended).  If that\nworks, you can be sure that oconv is alive and well in the proper\nplace, it's just that your \"environment\" doesn't know where to look for\nit.  You need to set your PATH (search path) to look in the\n/usr/local/bin directory.  There are actually a couple of search paths\n& variables that need to get set.  The way you do this is add a few\ninstructions to your .bash_profile file.  Add these lines:\n\nPATH=/usr/local/bin:$PATH\nRAYPATH=.:/usr/local/lib/ray\nexport PATH RAYPATH\n\n... to your .bash_profile file (this is always located in your home\ndirectory), and you should be good to go.  Let us know if you have\ntrouble editing this file.  I know what it's like to arrive at a bash\nprompt after years of using windows PCs or macs, and trying to do the\nmost basic of tasks.\n\nHopefully this will get you up and running and on your way to Radiance\nenlightenment. Good luck, have fun, and report back on this frequency\nif you have more questions!\n\n=================\nRob Guglielmetti\nwww.rumblestrip.org\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] oconv questi", "tags": [], "sender": "adiance-general-bounces@radiance-online.or", "datetime": "Sun Apr 24 15:36:40 2005"}