{"body": "\nMarcus\n\nYou can find some advanced scripts on Francesco's web site:\n\nhttp://www.bozzograo.net/radiance/index.php?module=Downloads&func=view&cid=2&start=0\n\nThese are complete scripts that create new features on top of the Radiance\ntool set. If you don't mind digging a bit you can look for the b/rad script\non his web site. It is a Radiance exporter for the 3D modeller Blender\n(outdated though, won't work with the current Blender version). This\nexporter has also a lot of import features and so the scripts modules show\nhow to read Radiance files.\n\nAs far as an \"official\" Radiance Python module goes there was some\ndiscussion about it quite a while ago but that pretty much was it. I wrote\n(or re-wrote) the base image class for wxfalsecolor specifically to allow a\nreuse in other scripts but I don't think anyone has ever used it. I think\none of the reasons is that with Radiance even trivial scripting can go a\nlong way in terms of automation. Most scripts will be written quick and\ndirty and don't need big complicated wrappers to serve their purpose.\nRadiance encourages this because it's composed of numerous command line\ntools, each with a simple task.\n\nI don't know too much about EnergyPlus and the options to use it on the\ncommand line. Perhaps there is not much to do about the actual calculation\npart of the process and the automation comes in when the input is created\nor the output is processed. In both cases a parser library for the file\nformats used by EP would come in quite handy.\n\nRegards,\nThomas\n\n\n\n\nOn Mon, Dec 3, 2012 at 9:10 AM, info info <info at pythonpoweredbuilding.com>wrote:\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20121203/41f3d87f/attachment.html>\n\n", "replyTo": "<CA+9aNUV+gM+LnsAS9tU74nnxHKvFPk+gR3=qGV7xp1cnuaF5Ag@mail.gmail.com>", "sender": "Thomas Bleicher", "isquestion": false, "tags": [], "id": "<CAKGV-k3UEwv31dN00K4VMHVF+5q75BnQyW=RqOWUdsc5M9J9bw@mail.gmail.com>", "refs": ["<CA+9aNUWkTu8uKZ_eABsFj=PJ_wrQLDARvqAcZfpwA2FLbYq23A@mail.gmail.com>", "<1966E9C2-8D7C-4975-983F-F972FFAE478C@gobo.io>", "<CA+9aNUV+gM+LnsAS9tU74nnxHKvFPk+gR3=qGV7xp1cnuaF5Ag@mail.gmail.com>"], "datetime": "Mon, 3 Dec 2012 20:41:31 -0500", "email": "tbleicher at googlemail.com", "subject": "[Radiance-general] Leveraging the Python language in BuildingPerformance Simulation"}