{"body": "\nAndrew,\n\nI guess the outcome then starts to depend strongly on what you consider to be an acceptable value for UDI-exceeded.  As the HMG work has indicated, that's a difficult one to determine empirically, and I for one can't suggest a 'target' value for the occurrence of UDI-e.  I'd like to see a UDI sensitivity study carried for a large number of spaces covering a wide range of space types (i.e. glazing orientation, single-sided, multi-aspect, etc.) [1].  If, as you say, extending the UDI upper bound to 3,000 lux results in designs that we suspect are less good than using 2,000 lux, then we really do need to pause and scratch our heads a little to nail this one.  However, your question suggests that going for UDI-a (300 - 3,000 lux) rather than 100 - 3,000 lux makes it less likely that the outcome is what we might have had with daylight factors.  Seems plausible -- do we have anything yet to support this hypothesis?\n\nI'd assumed that the 100 to 2,000 lux UDI range adopted in the FOS was simply taken from the Mk. 1 UDI formulation.  Do you know if, instead, it was actually the result of some testing of range limits?  By way of pedantry, suggest we use the term UDI to describe the complete range (e.g. 100 to 2,000 or, more recently, 100 to 3,000 lux), and UDI-autonomous for the occurrence between the design level (300 lux) and the upper limit (3,000 lux).\n\nBy the way, there is now a PDF available of the Lighting Supplement for the Dec 2012 CIBSE Journal:\n\nhttp://www.cibsejournal.com/archive/PDFs/CIBSE-Supplement-2012-12.pdf\n\nCheers\nJohn\n\n[1] I do have a suitable a building, but need to clear it with the clients.\n\nJohn Mardaljevic\nProfessor of Building Daylight Modelling\nSchool of Civil & Building Engineering\nLoughborough University\nLoughborough\nLeicestershire\nLE11 3TU, UK\n\nTel: +44 1509 222630 (Direct)\nTel: +44 1509 228529 (Pam Allen, secretary)\n\nj.mardaljevic at lboro.ac.uk<mailto:j.mardaljevic at lboro.ac.uk>\nhttp://www.lboro.ac.uk/departments/cv/staff/profile/367.html<http://www.lboro.ac.uk/departments/cv/>\n\nPersonal daylighting website:\nhttp://climate-based-daylighting.com<http://climate-based-daylighting.com/>\n\nOn 11 Dec 2012, at 21:57, \"Bissell, Andrew\" <a.bissell at cundall.com<mailto:a.bissell at cundall.com>>\nwrote:\n\nJohn,\n\nA very timely and useful response thank you.  As you know the EFA (Education Funding Agency) in the UK has released its FOS (Facilities Output Specification) for the next generation of schools.  The directive from the government was a higher standard of space for lower cost / m2.\n\nWe made the decision to drop daylight factors and move to CBDM for the next generation of schools and the topic of the UDI exceed level came up during the writing and testing of the baseline design and indeed it has come up again since as people try and create standard designs.  As it stands the UDI autonomous was set at 100-2000 in the FOS.  What this means for designers when you look at a balanced design, (thermal and lighting), you need to control heat gain with smaller external windows and therefore supplement the daylight from a secondary source.  However, this costs money.  E.g. Atria, lightwells, lightpipes etc.\n\nWhat is interesting when you raise the UDI exceed from 2000 to 3000 then you can start again to design single sided lit spaces just as we had with DF?s (indeed the type of rooms we are trying to stop building as the blinds are typically pulled down and the lights are turned on).  My thought therefore is whether in raising UDIe to 3000 because say a person can typically accept that level of light, then means we have significantly increased the contrast in a single sided lit space.  If we have, have we increased it to a level where parts of the space feel gloomy?   Is the answer to move UDIa to 300-3000, does that matter much?\n\nRegards\n\nAndrew\n__________________________\nAndrew Bissell\nB.Eng(Hons) C.Eng MSLL MCIBSE MIET\nLighting Design Director\nCundall Light4\nDirect: +44 (0)161 200 1235\nMobile: +44 (0)7899 907 978\nOffice: +44 (0)161 244 5660\nP Please consider the environment before printing this e-mail\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20121211/11c75349/attachment.html>\n\n", "replyTo": "Subject: [Radiance-general] UDI upper limits", "sender": "John Mardaljevic", "isquestion": false, "tags": [], "id": "<AE2C06A5D4A79244AA0AB930A5BFD04B147BB315@ITSMBX-4.lunet.lboro.ac.uk>", "refs": ["<AE2C06A5D4A79244AA0AB930A5BFD04B147BB231@ITSMBX-4.lunet.lboro.ac.uk>", "<E84227E844F81D4FB21778D0BEB82172017D84@CLOEMB2.cjp.co.uk>"], "datetime": "Tue, 11 Dec 2012 22:55:42 +0000", "email": "J.Mardaljevic at lboro.ac.uk", "subject": "[Radiance-general] UDI upper limits"}