{"body": "\nDoes John M. wanna weigh in on this?\n\nI believe Mardaljevic has been considering higher alternative thresholds as well.\n\nYes, on both counts.\n\nOriginal UDI of 100-2,000 lux was conceived around 2004, and was, with hindsight, a little too conservative regarding the upper limit.  I suspect now that those studies giving preferred maxima less than 2,000 lux could well have been the older articles in our sample.  Quite possible that work environments of around 20 years ago were less forgiving of high daylight illuminances, e.g. curved CRT screens, etc.  It seems that the more recent studies are all nudging-up the preferred / tolerated upper limit.\n\nSplitting the UDI range at the design level (e.g. 300 lux) was done in 2007 and applied to the (1st) VELUX study.  For the past few years I've been using the values 100, 300 and 3,000 lux to define the four UDI ranges: fell-short (<100); supplementary (100 - 300); autonomous (300 - 3,000); and, exceeded (>3,000).  For general daylighting use I don't see any need to alter the 100 and 300 lux bounds, but there may be good cause to increase the upper limit to 3,500 or 4,000 lux (greater?).  I'll be doing some sensitivity tests on that seeing how it affects annual totals for the autonomous and exceeded ranges.  It may not make much difference for many designs, at least in terms of UDI-autonomous and UDI-exceeded.  Though that's not to say that it wouldn't have knock-on consequences for, say, annual predictions of DGP.\n\nI do find the four range UDI scheme very useful to help evaluate (and communicate) the daylighting performance of a space -- especially when there are several facade variants to be considered and a simple slide transition reveals the impact of the design change in a manner that is very readily assimilated.  For other, more specialist applications, I see no problem in adjusting the three defining lux levels to suit, e.g. 20, 50 and 200 for a gallery space where conservation is an issue.\n\nSo, UDI -- no fixed rules.  Though a consensus for general daylighting applications may be forming around the 100, 300 and 3,000 (or 4,000?) lux values.\n\nCheers\nJohn\n\nJohn Mardaljevic\nProfessor of Building Daylight Modelling\nSchool of Civil & Building Engineering\nLoughborough University\nLoughborough\nLeicestershire\nLE11 3TU, UK\n\nTel: +44 1509 222630 (Direct)\nTel: +44 1509 228529 (Pam Allen, secretary)\n\nj.mardaljevic at lboro.ac.uk<mailto:j.mardaljevic at lboro.ac.uk>\nhttp://www.lboro.ac.uk/departments/cv/staff/profile/367.html<http://www.lboro.ac.uk/departments/cv/>\n\nPersonal daylighting website:\nhttp://climate-based-daylighting.com<http://climate-based-daylighting.com/>\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20121211/0cf99568/attachment.html>\n\n", "replyTo": "", "sender": "John Mardaljevic", "isquestion": true, "tags": [], "id": "<AE2C06A5D4A79244AA0AB930A5BFD04B147BB231@ITSMBX-4.lunet.lboro.ac.uk>", "refs": [], "datetime": "Tue, 11 Dec 2012 20:26:49 +0000", "email": "J.Mardaljevic at lboro.ac.uk", "subject": "[Radiance-general] UDI upper limits"}