{"body": "\nHi Everybody,\n\nI've just returned from a trip to Europe, so I'm up in the middle of the\nnight reading e-mails since my  brain thinks it's noontime....\n\nI must say that I'm really impressed with the quality (and quantity) of\ndiscussions going on in this list, and I haven't seen a single wrong or\nmisinterpreted factoid coming from any of the discussants.   Schorsch is\nparticularly on the ball -- someone should pay this guy!  The discussion\nof the -i option for irradiance calculation was particularly\ninteresting.  This really is just a way to turn all the surfaces into\nilluminance sensors, oriented according to their normals.  This didn't\nmake sense to me for windows or light sources, so I left them out of the\nhack.  I find the information useful, but it does require better\nexplanation than I left in the manual.  Sorry about that --\ndocumentation was never my speciality.\n\nI just wanted to respond to the following message:\n\n\nI apologize for being remiss in my maintenance of the Unix version of\nRadiance.  I've actually been working on it all along, but unable to\ndistribute it due to license ownership by LBNL.  Fortunately, that seems\nto finally be changing, and they've hired me for a little consulting to\nput Radiance back on the Unix map.\n\nAt SGI, I spent a fair bit of time developing the holodeck addition to\nRadiance, which is sort of like rview on steroids -- allowing users to\nmove freely about a space while an interactive rendering goes on.  This\nenhancement is explained in the following paper, available from my\nwebsite:\n\nWard, Gregory and Maryann Simmons, `` The Holodeck Ray Cache: An\nInteractive Rendering System for Global Illumination in Nondiffuse\nEnvironments,'' ACM Transactions on Graphics, 18(4):361-98, October 1999.\n\nhttp://viz.cs.berkeley.edu/~gwlarson/papers.html\n\nNevermind that, though, the real news is that I would like to offer beta\ntesters a new Radiance distribution for Unix, which I need som help in\nmaking sure it compiles OK on various machines.  It may be found at:\n\nhttp://viz.cs.berkeley.edu/~gwlarson/pickup/Radiance3R4b.tar.gz\n\nThis release is being called 3.4 to avoid conflict with previous (LBNL)\nreleases, but it will become the official Unix release once it's been\ntested and verified.  I have compiled and tested it myself on Mac OS X,\nand you can take a shortcut to the binaries by picking up the following\nfile as well:\n\nhttp://viz.cs.berkeley.edu/~gwlarson/pickup/radbin_osx.tar.gz\n\nUnfortunately, I have not had time to get rview working under Aqua at\nthis point, and you are stuck with using the pdisp script (included) to\nrun ra_tiff or normtiff followed by the Mac Preview program to display\nimages under Aqua.  I am working on a high dynamic-range image browser\nthat will facilitate looking at Radiance (as well as other) image\nformats, but an alpha version of this software is still months away,\nsince it's an after-hours project.\n\nIf you're interested in checking out the new holodeck program, you can\ndrop into the ray/obj/cabin directory and try running the following\ncommands:\n\n% make nightcabin.oct\n% rholo -o x11 -n 1 night.hdk night.hif &\n\nThis starts up rholo with the X11 driver and one rtrace process.  Read\nthe rholo manual page for information on how to use the mouse to\nnavigate once the calculation is running.  If you're on a Sun or SGI\nworkstation, you should even be able to run the -o ogl driver, which\nlooks and works much nicer, especially if you run the following\nbeforehand:\n\n% make living.oct bed.oct bath.oct\n\nTo restart rholo in a subsequent run, leave of the .hif file, since it\nwill reuse the values stored in the holodeck.  I really should write a\nprimer on using this program, because it's operation is a bit\ncomplicated and obtuse, but Radiance users are used to that....\n\nPlease give me feedback on compile problems you run across, and share\nthe output of your \"makeall install\" if you get stuck.  I know there are\na couple of hitches on Mac OS X and Solaris having to do with missing\nheaders or broken things in the TIFF library, and I'm a bit baffled as\nto how to fix those.  You may have to compile or install a few files\nmanually there until I get those issues resolved, but I am aware of them.\n\nThanks in advance for your help!\n-Greg\n\nP.S.  Raphael Compagnon and I are hoping to hold an advanced Radiance\nworkshop next Fall, and I'd be interested to hear from interested\nparties.\n\n\n", "replyTo": "Subject: [Radiance-general] Beta Radiance Unix distribution", "sender": "Greg Ward", "isquestion": false, "tags": [], "id": "<05D8402D-F611-11D5-AB16-00306540F848@lmi.net>", "refs": [], "datetime": "Fri, 21 Dec 2001 04:48:24 -0800", "email": "radiance-general@radiance-online.org", "subject": "[Radiance-general] Beta Radiance Unix distribution"}