{"body": "\nGreetings simulationists,\n\nA couple months ago I polled these lists for consensus on dates for the\n2013 International Radiance Workshop (which we are hosting here at NREL),\nand we have settled on August 12-14 (Mon-Wed). The three-day format --\nwith tutorials on day one and presentations on days two and three -- seems\nto have become the standard, so at this time I'd like to get some ideas\nfrom you on what exactly the tutorial content should be.\n\nIn the past, the tutorial day has ranged from an HDR imaging workshop\n(e.g. 2009-Boston), in-depth dives into new Radiance code additions (e.g.\n2011-Berkeley), and in 2003 there were actually *two* tutorial tracks to\npick from: new feature deep dive with Greg Ward, and Radiance 101 with\nJohn Mardaljevic (decisions, decisions!).\n\nNow's our chance to flesh out what this year's tutorial day will look\nlike. A couple of folks contacted me off-list(s) to inquire about the\npossibility of holding an OpenStudio training on that day, particularly\nfocusing on the use of OpenStudio for Radiance-informed energy analysis.\nSo, there's one idea. What else ya'll got? DAYSIM show & tell? HDR imaging\nagain? Feats of strength? Seriously, I'm interested in hearing your ideas\n(and your intentions of attending) so we can decide if we're to have one\nor more tracks, and what the content will be. So please, lemmeknow. I'll\nprobably gather up all of your responses and then put it to a vote.\n\nLooking forward to seeing many of you in August!\n\n- Googs\n\nP.S. We will definitely offer tours of our new energy efficient campus\nbuildings as well. We have a 330,000 ft^2 net zero office building (where\nthe workshop will be held), super-efficient (and daylit) parking garage\nand cafeteria, and, by the time of the workshop, a grid-scale test\nfacility with the most energy-efficient petascale supercomputer in the\nworld (PUE <= 1.06). And we have lots of mountains right next door!\n</hardsell>\n\nRob Guglielmetti\nNational Renewable Energy Laboratory (NREL)\nCommercial Buildings Research Group\n15013 Denver West Parkway MS:RSF202\nGolden, CO 80401\n303.275.4319\nrobert.guglielmetti at nrel.gov\n\n\n\n\n\n\n", "replyTo": "", "sender": "Guglielmetti, Robert", "isquestion": true, "tags": [], "id": "<CD1DD838.18FDF%robert.guglielmetti@nrel.gov>", "refs": [], "datetime": "Thu, 17 Jan 2013 16:32:56 -0700", "email": "Robert.Guglielmetti at nrel.gov", "subject": "[Radiance-general] Radiance International Workshop 2013"}