{"refs": [], "id": "<E83FC9AC306BD34B993F651FC8D772F82241C3@ldcexc01.global.arup.com>", "subject": "[Radiance-general] Redirecting+scattering", "email": "adiance-general-bounces@radiance-online.org", "body": "\nyou may also consider to have a look to radzilla\n\n;-)\n\nThis is a not official, not bullet proof, version of radiance that incorporates all new additions + some really crazy Carsten optimisations/changes/addons...\n\nIt seems really consistent and stable and I already modelled some prisms with pmap within it (like a 500 modular prisms wall).\n\nIt works well!\n\nI believe it's worthy to try and I have been really impressed by the latest development.\n\nThe advantage over traditional radiance for me is that photon mapping is performed through the rpict command without having to use mkpmap... but they might be some bugs here of there.... watch out!\n\nciao,\n\ngiulio\n\n\n\n________________________________\n\nSent: 19 May 2005 14:24\nTo: radiance-general@radiance-online.org\n\n\nHallo Greg Ward, hallo Radiance Community!\n\n\n\nI've been learning Radiance for a couple of weeks and i have to work intensively with it in the next weeks, as I?m investigating the energy saving potential and visual comfort of systems combining angular selective and diffusing panes.\n\n\n\nNow I have to simulate a simple test-room with a complex fenestration, which includes an exterior prismatic structure as shading device and a diffusing pane for glare control. I try to find out the best way to model the system so as to get quantitative accurate results (RwR Chapters 10-13 and mails archive) but i?m still a little bit confused....\n\n\n\n- As to the prismatic structure, i will use the PRISM2 material as virtual source. No redirection of diffuse incoming light and no dispersion are the only limitations of this material. And it would make no sense to use the PhotoMap port, because these materials are not implemented in this tool.  Is it right?\n\n\n\n- As to the diffuser, i would intuitively treat it as an ILLUM with a BRTDF function as alternate material (I?m measuring, modelling and comparing different kind of diffusers) and run  MKILLUM.  If i understood correctly, the BRTDF materials are only considered in the direct calculation and indirect specular, but not in the indirect diffuse, where they are approssimate to lambertian diffusers. Should i try another material?\n\n\n\n- How are PRISM materials computed in the MKILLUM calculation of the window light output? Should I better try to run the simulation without MKILLUM and high ambient parameters (-ab, -ad, -as)?\n\n\n\n- What if i measure the BRTDF of the complete system and i model it as a normal light source? It is really difficult (or impossible) to get sharp peaks in light output with  high subsampling and jittering of the source?\n\n\n\nAny other suggestion to simulate this system correctly (quantitative)?\n\n\n\nSorry for so many questions and THANKS A LOT for any contribution.\n\n\n\nRegards,\n\nFederico Giovannetti\n\n\n\n---------------------------------------------------------\nFederico Giovannetti\nInstitut f?r Solarenergieforschung GmbH\nAm Ohrberg 1\nD-31860 Emmerthal\n\n\n\ntel:        +49(0)5151-999-501\nfax:       +49(0)5151-999-500\ne-mail:   f.giovannetti@isfh.de\ninternet: www.isfh.de\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20050519/20a30c86/attachment.htm\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "radiance-general-bounces@radiance-online.org", "datetime": "Thu May 19 17:33:34 2005"}