{"body": "\nHi Nassif!\n\n\n-ab X increases the number of bounces that will be considered in the diffuse-indirect calculation. So increasing it will lead to higher results, at any time. However, this increase will become less and, at a certain point, insignificant. It is up to you to decide when this point is reached. In a setup with dark surfaces and a lot of direct light reaching your sensor, -ab 1 may be enough, in a scene where light reaches the sensor only by reflections due to bright, diffuse surfaces, -ab 3 and more will be needed. Do a plot of the sensor value against the -ab setting to find where the increase becomes insignificant.\n\n-ar X increases the number of sample directions when the indirect-diffuse calculation sends out random samples. Your setting is very high... and this makes the process probably very slow. Usually, -ad is set together with -as. Making use of genBSDF to replace e.g. detailed geometry (which would require to be \"scanned\" at a high angular resolution) in the indirect-diffuse calculation may allow you to use lower settings. Another good way to achieve quick results is to lower -ad and increase -c. This does basically the same as -ad does for the first ambient bounce (where the impact on the sensor tends to be highest). The lower -ad however speeds up subsequent bounces, and should help you decrease rendering times especially with high -ab settings. Again you should find out when results start to stabilize. This time it would be worth finding the level of noise against the -ad/-c value. Mark Stock suggested the file-size of the compressed images as an indicator for noise: http://markjstock.org/radmisc/aa0_ps1_test/final.html This works if you produce images, not single point sensors. Note that at that time, the -c parameter was not available yet, so he had to achieve oversampling by increasing the resolution. The histogram tools of Radiance may also be helpful.\n\nI hope this somehow helps. Cheers, Lars.\n\n", "replyTo": "Subject: [Radiance-general] rcontrib rtc options", "sender": "Lars O. Grobe", "isquestion": false, "tags": [], "id": "<7EC147A3-E9AC-483E-9615-64C887E20840@gmx.net>", "refs": ["<CAOQvQdk6vWKDLrQGZK--S0aSBXM3daWLn+XXzwgAtiwAML_pFQ@mail.gmail.com>"], "datetime": "Tue, 22 Jan 2013 21:33:57 +0800", "email": "grobe at gmx.net", "subject": "[Radiance-general] rcontrib rtc options"}