{"body": "\nDear Radiancers,\n\nSince I have been posting here just problems that many of you have kindly\nread and answered, I decided to publish a pre-version of my MSc project,\nhoping that it can be useful for some of you.\n\nMy project is to develop an as-friendly-as-possible tool for the design and\nevaluation of the performance of shading systems for different facades,\nweathers, etc. The idea is to design in SketchUp, then use Radiance to\nassess the Visible Transmittance (genBSDF), the solar heat gain coefficient\n(genSHGC, still in development), and to use the Three-Phase Method (I have\nheard it is becoming a more-than-three-phases method...??) to compute the\nIlluminance distribution as well as the solar gains, for each window.\n\nFor now I have managed to export geometry with their respective modifiers\nin an organized way (the standard Sunlite directories), and create a\nScenario file that has the information of the systems \"installed\" on each\nwindow, and the normal direction of it. That way, a script called SL_presim\ngenerates the Daylight and View Matrices for each window, storing them in\nthe appropriate directory, for a posterior SL_sim script to simulate the\nyear out of an EnergyPlus weather file.\n\nAnyway, you can see a 3 min. video\nHERE<http://www.youtube.com/watch?v=er8gm1kusvQ&feature=youtu.be>,\nI had trouble with the audio.... and a web site\nHERE<https://www.sites.google.com/site/sunliteproject/home>\n.\n\nTHANKS EVERYONE,\n\nGerman\n\nPS: Just for you to know, for now, both the video and the webpage can only\nbe seen by the people who have the Link.\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20130118/77d521fb/attachment-0001.html>\n\n", "replyTo": "", "sender": "=?ISO-8859-1?Q?Germ=E1n_Molina_Larrain?=", "isquestion": true, "tags": [], "id": "<CAF-iH4+wEEomSqXBO2UBdwiusJQVRGvi+5ni-0Lp1dhoDECNjw@mail.gmail.com>", "refs": [], "datetime": "Fri, 18 Jan 2013 09:19:19 -0500", "email": "gmolina1 at uc.cl", "subject": "[Radiance-general] Sunlite - A Sketchup Plugin for fast and easy3phase method implementation"}