{"refs": ["<!~!UENERkVCMDkAAQACAAAAAAAAAAAAAAAAABgAAAAAAAAACJWbgafz6UaL6G5F22Jwe8KAAAAQAAAA3IJOyPEbAUqAHs1OlP+wyQEAAAAA@dit.ie>"], "id": "<A507183C-2C47-4F9A-BB2B-D76B5A7BFDCD@gmail.com>", "subject": "[Radiance-general] RE: Lamp colour", "email": "gregoryjward at gmail.com", "body": "\nHello Anthony,\n\nYour question is a bit confusing.  I don't know what lamp .fmt file\nyou're talking about, and the numbers you give don't seem to make\nsense.  The CIE (x,y) chromaticity coordinates corresponding to 2200K\nand 6000K sources are:\n\nCT (K)    CIE x    CIE y\n--------    --------    -------\n2200    0.5056    0.4152\n6000    0.3221    0.3318\n\nConverting these to Radiance RGB values with Y=1.0, we get:\n\nCT    R    G    B\n-----    --    --    --\n2200    1.881    0.7420    0.0636\n6000    0.9078    1.032    1.049\n\nIf you use the \"-t default\" option and give these to the \"-c\" option\nof ies2rad, it will produce sources with the corresponding color\ntemperature.  However, I don't really believe this is what you want.\n\nApplying a color to your light sources will yield a color cast in\nyour rendered images, which is almost never desirable.  Your eye\ntends to ignore such color casts in an environment -- this is called\n\"color constancy\" or \"white balance\" in photography.\n\nIf your true purpose is to determine how the color of your light\nsource affects the visible colors of the objects in your scene, you\nneed to start from the actual spectral power distribution of your\nilluminant (not just the color temperatures) and the spectral\nreflectances of your objects.  The former may be obtained from the\nmanufacturer in some cases.  The latter must be obtained by\nmeasurements with a suitable spectroreflectometer.  Then, rather than\ndealing with CIE (x,y) chromaticities, you need to apply a technique\nlike the one described in the following paper:\n\nhttp://www.anyhere.com/gward/egwr02/\n\nThis paper describes the simplest and most economical approach if you\nwant to know what your colors will look like under different\nilluminants.  Any shortcut shorter than this will simply not work.\n\n-Greg\n\nP.S.  In future, please be careful not to include an entire mailing\nlist digest in your posting.  It's an easy mistake to make with\nmodern mailers -- they are ever so helpful and eager to please.\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] RE: Lamp colour", "tags": [], "sender": "Greg Ward", "datetime": "Tue May 24 00:29:46 2005"}