{"body": "\nHi Allison,\n\nNice to see you on the list! So what you have here is two different ways of specifying the sky. The first form (\"Software 1\"), the gensky command is given inline (hence the '!' that precedes the gensky command), and the STDOUT (which contains the skyfunc and the sun source description) are then passed on to the celestial hemisphere sky and ground primitives. In the second form, that STDOUT is explicitly listed in the sky description. If you simply try the \"Software 1\" sky description's gensky command at the command line, you get:\n\ncommand:\ngensky 3 21 12.01 +s -a 40.03 -o 105.28 -m 105.00\n\noutput (STDOUT):\n# gensky 3 21 12.01 +s -a 40.03 -o 105.28 -m 105.00\n# Local solar time: 11.87\n# Solar altitude and azimuth: 49.5 -3.1\n# Ground ambient level: 15.0\n\nvoid light solar\n0\n0\n3 6.88e+06 6.88e+06 6.88e+06\n\nsolar source sun\n0\n0\n4 0.034560 -0.648139 0.760737 0.5\n\nvoid brightfunc skyfunc\n2 skybr skybright.cal\n0\n7 1 1.09e+01 2.30e+01 6.50e-01 0.034560 -0.648139 0.760737\n\n\nYou can see that these sections bear a resemblance to the first sections in your \"Software 2\" sky description in format, but not in value(s). Again, these are the bits that define the luminous sky and ground hemispheres, as well as the position and intensity of the sun. So clearly the Software 2 gensky input is different from the Software 1 gensky input. I can't back out what Software 2's gensky input must have looked like, although I'm sure a few people on this list may be able to. THe bigger issue is we need to know some more details about your test case, and the relative differences in the reported values from one software tool to the next. It would also be helpful to know what tools you are using, and how you are using them, rather than just trying to reverse engineer the inputs.\n\n- Rob\n\n\n\n\n\nOn Feb 26, 2013, at 5:31 PM, Allison Bygott <Allison.Bygott at megroup.com> wrote:\n\n\n\n\n", "replyTo": "Subject: [Radiance-general] Randance and different sky descriptions", "sender": "Rob Guglielmetti", "isquestion": false, "tags": [], "id": "<3834D500-2676-4C9C-B6D1-589B0C0889E8@gmail.com>", "refs": ["<56E12CDDB5240046AE58C03053BBF162389F63AE@Exchange-oma.meg.local>"], "datetime": "Tue, 26 Feb 2013 18:56:59 -0700", "email": "rob.guglielmetti at gmail.com", "subject": "[Radiance-general] Randance and different sky descriptions"}