{"body": "\nDear colleagues:\n\nIn Short\n\n\n?         We have new DAYSIM version (4.0) plus web site. Check it out at http://daysim.ning.com/.\n\n?         Andy McNeil from LBNL kindly added a new DAYSIM discussion list to Radiance Online at http://www.radiance-online.org/community/mailing-lists/archives/radiance-daysim.\n\n\nFor those interested in the details\n\nApart from offering a download link for the latest DAYSIM version, the new site also offers an interactive API documentation that describe all DAYSIM subprograms and header file keywords<http://daysim.ning.com/page/daysim-header-file>. Focus users of the site are Daysim expert users who want to go beyond the capabilities of the various DAYSIM GUIs (see below) as well as third party GUI developers who want to implement DAYSIM into their programs. The development of the site was supported by the US Department of Energy Energy-Efficiency HUB<http://www.eebhub.org/about-eebhub>. (Thank you to all US tax payers among you.) The current DAYSIM development team includes MIT, the Fraunhofer Institute for Solar Energy Systems (ISE) and Penn State University (PSU). With the new version come a few  changes and new features.\n\nDAYSIM GUIs\nGiven the rising number of DAYSIM GUIs, we decided to phase out the old, rather unattractive JAVA GUI that came with the old Daysim and instead rely on third parties to develop plug-ins. In case you are still interested in using the old GUI, you can still  download Daysim 3.1e from the new web site. DAYSIM GUIs that I am aware are listed below. If your GUI is missing or if the table below misrepresents a software, please let me know.\n\n\nTable 1. Overview of DAYSIM Plug-in Capabilities\n\nFeature\n\n\nDAYSIM JAVA GUI\n\n\nPENN STATE JAVA GUI#\n\n\nSU2RAD<http://code.google.com/p/su2rad/>\n\n\nSU2DS<http://code.google.com/p/su2ds/>\n\n\nAUTODESK ECOTECT<http://usa.autodesk.com/ecotect-analysis/>\n\n\nDIVA-FOR-RHINO<http://diva4rhino.com/>\n\n\nClimate-based Illuminance Metrics\n\n\n?\n\n\n?\n\n\n?\n\n\n?\n\n\n?\n\n\n?\n\n\nAnnual Glare Analysis\n\n\n?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n?\n\n\nElectric Lighting Control\n\n\n?\n\n\n?\n\n\n\n\n\n\n\n\n?\n\n\nElectric lighting Systems (IES files)\n\n\n\n\n\n?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPhoto Sensor Placement\n\n\n\n\n\n?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n#Modified JAVA GUI developed by Rick Mistrick at Penn State.\n\n\nAnnual Glare Analysis\nDaysim 4.0 includes and improved, more robust version of gen_dgp_profile<http://daysim.ning.com/subprogramgendgpprofile> written by Jan Wienold (ISE). The program calculates annual daylight glare probabilities profiles at selected view points within a scene based on a Radiance scene file, a Radiance View File and an epw weather file.\n\n\nDYNAMIC SHADING MODULE\nWith support from SAGE Electrochromic we implemented the capability to model show shading groups independently in Daysim. This allows users to model a variety of rather complicated dynamic facades<http://daysim.ning.com/page/daysim-header-file-keyword-advanced-dynamic-shading>.\n\n\nElectric Lighting\nThe shading module can be integrated with various electric lighting controls. Rick Mistrick (PSU) is currently expanding the list of supported controls. PSU is also working on a new DAYSIM program that allows to explicitly model and control electric light sources using IES files. There will also be a module that supports the placement of photo sensors within a scene. We expect these new programs to make their way into DAYSIM later this year.\n\n\nHappy Daylight Simulations,\n\nChristoph\nChristoph Reinhart\nAssociate Professor\nDepartment of Architecture\nMassachusetts Institute of Technology\n77 Massachusetts Ave, Rm 5-418, Cambridge, MA 02139, USA\nt: 617 253 7714, f: 617 253 6152, creinhart at mit.edu<mailto:creinhart at mit.edu>\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20130204/0ecc15dd/attachment-0001.html>\n\n", "replyTo": "", "sender": "Christoph Reinhart", "isquestion": true, "tags": [], "id": "<1B23446CBF250648A2FC775DE3FE7E800FDFA8E5@OC11expo28.exchange.mit.edu>", "refs": [], "datetime": "Mon, 04 Feb 2013 16:15:09 -0000", "email": "tito_ at mit.edu", "subject": "[Radiance-general] DAYSIM 4.0 plus new web site"}