{"refs": [], "id": "<E83FC9AC306BD34B993F651FC8D772F8224B8B@ldcexc01.global.arup.com>", "subject": "[Radiance-general] simulation of a lightpip", "email": "adiance-general-bounces@radiance-online.org", "body": "\nStefano,\nit may sound too simple but unless you are about to design the optic\nitself you should be considering to use some assumptions, just to make\nlife easier....\n\nIf your aim is to have a nice series of images, some daylight assessment\nwith daylight factor plots, luminance maps...\nthere are good tricks to save time and give reasonable answers:\n\nyou may use just a big glowing cylinder.\n\nall you need to do is calculate manually the relation between input and\noutput for different time of the year, therefore link the external light\nlevels to the cylinder glow material radiance.\n\nyou may also use excel, just one calculation with one cylinder then\nscale up and down based on external illuminance...\n\nIf you need to consider also the extinction within the cylinder you may\nuse a brightfunc that changes radiance with the length of the\ncylinder....\n\nbut all these are really simplified things...\n\nthe ultimate option, as you say, is to go for photon mapping... or\nphotonmapping + radzilla but it is a little longer\n\nciao,\nin bocca al lupo ;-)\n\ngiulio\n\n\n\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of\ns.ponzetti@libero.it\nSent: 26 May 2005 10:43\nTo: radiance-general\nHi group,\n\nI am modelling a lightpipe in Desktop radiance and as I read in the\ne-mail archive the best way to simulate it is the use of photon map so I\nam going to install Cgwin, Radiance and Photon map but I have, I think,\na foundamental problem that is: I don't know how to draw and simulate\nthe lens inside the dome of the lightpipe.\nIs there somebody who  can help me?\nIt is very urgent as I am preparing my degree thesis and I have little\ntime to finish my work.\nPlease help me!!!\n\nStefano\n\n\n\n____________________________________________________________\n6X velocizzare la tua navigazione a 56k? 6X Web Accelerator di Libero!\nScaricalo su INTERNET GRATIS 6X http://www.libero.it\n\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "adiance-general-bounces@radiance-online.or", "datetime": "Thu May 26 12:16:41 2005"}