{"body": "\nPeter Apian-Bennewitz wrote:\n\n\n\nThe pigments on a print will almost always be cymk (sometimes\naugmented with additional colors). This has nothing to do with\n\"big machines of former time\", but simply with the laws of\nphysics.\n\n\n\nThe only difference is that *you* don't need the printer's color\nprofile for doing the conversion yourself. The conversion module\nof the printer has that built in. To think that there will be no\nconversion at all (not sure if you really do think so) would be\nnaive. This is even the case for machines that directly expose\nphotographic paper with rgb lasers (which of course will activate\ncym[k] pigments in the paper, introducing yet another \"conversion\").\n\n\n\nIf you're really picky, then that would be the most accurate\nmethod to generate the color profile for a printer. In practise,\nvisual comparisons against a reference print may be good enough\nin most cases.\n\n\n\nThat's what color profiles are there for. In the times of color\nprofiles, the mechanics of how that reflectance gets on paper\nshould be irrelevant to the user.\n\nAll of this of course assumes that you know the color space of\nyour own data. It seems that the Radiance color space is quite\nclose to SRGB, which is highly convenient. Once you know that,\nyou either use the color profile of your printer to do a\n(SRGB->\"printer rgb\" or SRGB->\"Printer cymk\") conversion\nyourself, or you let the printer know that it will get SRGB data\nand have it do the same conversion internally. If you get bad\nresults that way, then either the color profile is wrong or the\nprinter is broken.\n\nAt least that's how I understand the theory... ;)\n\n\n-schorsch\n\n--\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n\n", "replyTo": "Subject: [Radiance-general] printing floating point images", "sender": "Georg Mischler", "isquestion": false, "tags": [], "id": "<Pine.BSF.4.58.0412021052530.36845@emancholl.pair.com>", "refs": ["<41AE0026.1070407@visarc.com> <15651.1101932589@www23.gmx.net>", "<41AE3AD2.3070402@visarc.com> <41AEF201.7020901@t-online.de>", "<41AEE66C.7090704@pab-opto.de>"], "datetime": "Thu Dec  2 16:58:42 2004", "email": "schorsch at schorsch.com", "subject": "[Radiance-general] printing floating point images"}