{"body": "\nThe genBSDF program produces a limited resolution matrix representation using the options you've given.  This is appropriate if you want to use it with WINDOW (although I think some modifications to the output are still required) or if your material is fairly diffusing.  It will not resolve the direct peak to anything finer than 10 degrees, which is the resolution of the full Klems matrix basis.  Some spreading of the direct is unavoidable.\n\nYou can improve upon this using the tensor tree formulation by setting the -t3 or -t4 option.  If your system produces an isotropic distribution (i.e., you can rotate the system about its center with no change to the output), you can try \"genBSDF -t3 6\" or so.  In the more general case, you can use \"genBSDF -t4 6\", which will resolve the direct component to within a few degrees.  You can increase to \"-t4 7\" to get twice the resolution, but you'll have to increase the -c parameter as well, and I can't predict when the calculation will finish.\n\nThe real solution is to incorporate and employ the actual system geometry using the proxy method described near slide 7 in my 2011 workshop presentation:\n\nhttp://www.radiance-online.org/community/workshops/2011-berkeley-ca/presentations/day2/GW5_BSDFFirstClass.pdf\n\nCheers,\n-Greg\n\n\n---------------------------\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20130216/aef1d801/attachment.html>\n\n", "replyTo": "Subject: [Radiance-general] better results on genBSDF", "sender": "Greg Ward", "isquestion": false, "tags": [], "id": "<5332036B-F8B6-4108-B508-E1F0428A195E@lmi.net>", "refs": ["<CAF-iH4+TvX4AkHctaYfaaDYpgdSBWMNasddO7HAHXMxys-Q5Tw@mail.gmail.com>", "<511FDDA4.1070000@gmx.net>", "<CAF-iH4Lm=nQjCTKOK-f6enWhNRozXmX=tRxv+REuJCP6yDXOwg@mail.gmail.com>"], "datetime": "Sat, 16 Feb 2013 12:07:02 -0800", "email": "gregoryjward at gmail.com", "subject": "[Radiance-general] better results on genBSDF"}