{"body": "\nRadiance-folk!-\n\nWe are less than a month away from the University of Idaho Integrated\nDesign Lab's week long EnergyPlus and Radiance Workshop: Modeling Energy\nEfficient Buildings.  There are slots still available for the full training\nand half day options.  We will be closing registration post February 15th\nat 5.00pm MST, and reserve the right to cancel the training on or before\nthis date due to insufficient enrollment.\n\nThis is a great opportunity for beginners just learning how to use\nOpenStudio, EnergyPlus, and Radiance for whole building energy and daylight\nsimulation.  Additionally, intermediate users will gain new, valuable\nskills and insights into the workflow used by the University of Idaho\nIntegrated Design Lab on consulting and research projects.  Everything from\ngeometry creation, night flush ventilation, daylight rendering/simulation,\nand advanced HVAC system definition will be covered!  Advanced users are\nwelcome to attend the training and hone their existing modeling skill\nsets while hopefully learning something new.\n\nThe City of Boise is also boasts a pedestrian-friendly urban environment\nthat is packed full of diverse amenities including: abundant local\nrestaurants and craft breweries, beautiful desert wilderness adjacent to\nthe city, and a charming, walkable downtown.\n\nPlease email jdunn at uidaho.edu with any inquiries and questions!\n\nCheck out the full flyer here:\nhttp://www.idlboise.com/pdf/uiidl_eplus_radiance_training.pdf\n\nCheck out a full description of the workshop, its sessions, and pricing\noptions here: http://idlboise.com/energyplus-radiance-workshop-2013\n\nHope you can make it!\n\n\n*Jacob Dunn - LEED AP\n*Architectural Simulation Specialist\nUniversity of Idaho Integrated Design Lab\n\np_208.401.0645\na_306 S 6th Street, Boise ID 83702\n*\n\"Building services today are essentially mechanical compensations for the\nfact that buildings are bad for what they are designed for--human life\"  -\nBjarke Ingels*\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20130201/75f54f45/attachment.html>\n\n", "replyTo": "", "sender": "Jacob Dunn", "isquestion": true, "tags": [], "id": "<CALPn_+atp-zirDGVO0Xi_PCPdN5pS70x54KOLAnu=xBw6n5pHg@mail.gmail.com>", "refs": [], "datetime": "Fri, 1 Feb 2013 17:34:21 -0700", "email": "jdunn at uidaho.edu", "subject": "[Radiance-general] University of Idaho EnergyPlus and RadianceTraining"}