{"body": "\nJelle,\n\nLike Mark I will add in what I know and what we have done in the past to\nget the best quality prints possible (for a reasonable cost).\n\nIn general you need to print to a print device that goes direct rgb. I\nthink that a fair amount of progress has been made for printing digital\nimages (rgb) direct to photographic quality paper (paper makes a huge\ndifference). We have had good success with two devices and one service:\n\n1. Lambda Printer - this is a big fancy printer that only a large\nservice bureau would have (I think that the cost around $500,000\nUS). They can print to very large paper sizes (photo paper). I do\nnot remember what the resolution is, although we found that you\ncould have quite good image quality even at 100dpi. Cost - expensive.\n2. Kodak Pegasus Printer- cannot print as large as the lambda but is\ndirect to photo paper. Is more sensitive to image resolution, I\nthink they prefer 250dpi. Cost - medium to expensive.\n3. Online Service Bureaus - we have also used Ofoto on occasion.\nAgain the print is direct to photo paper. Cost - INEXPENSIVE!\n\nDepending on the device selected, I expect that one could also prepare\nsome kind of calibration to make sure the images are calibrated to the\ndevice (which means that you have to make sure your other output devices\nsuch as monitors are correctly calibrated as well).\n\nOf course none of this answers your question about bit depth. I guess\none question to ask is how much is needed to achieve what you want.\nAlternatively, another way to look at it is to learn what professional\nphotographers using high end digital cameras do for printing, I can only\nimagine that this could get quite expensive however.\n\n-Jack\n\nMark Stock wrote:\n\n\n--\n#\tJohn E. de Valpine\n#\tpresident\n#\n#\tvisarc incorporated\n#\thttp://www.visarc.com\n#\n#\tchanneling technology for superior design and construction\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20041201/e7dc78df/attachment.html\n", "replyTo": "Subject: [Radiance-general] printing floating point images", "sender": "Jack de Valpine", "isquestion": false, "tags": [], "id": "<41AE0026.1070407@visarc.com>", "refs": ["<20041201131401.F117118000F8@mwinf0208.wanadoo.fr>", "<Pine.SOL.4.58.0412010906260.17389@tetris.gpcc.itd.umich.edu>"], "datetime": "Wed Dec  1 18:32:37 2004", "email": "jedev at visarc.com", "subject": "[Radiance-general] printing floating point images"}