{"body": "\nAll,\n\nThanks for the comments.\n\nA bit more background information. We are doing a coupled\nEnergyPlus-Radiance simulation on blinds control. The blinds control is\nin EnergyPlus, and we use Radiance to calculate the illuminance in the\nspace.\n\nOne of the blinds control algorithm that we tested uses the vertical\nilluminance at the exterior facade. As you said, there is no easy way to\ncalculate this in EnergyPlus. So we need to have another Radiance run\njust to calculate the vertical illuminance at the external facade. I am\nnot happy with having to call Radiance twice, because it adds a bit of\ncomplexity and a bit of time to the whole scheme. So that is why I was\nwondering about simple calculation of vertical illuminance if we know\nthe total solar irradiance on the surface.\n\nSo I dig further. The file below contains some graphs with simple\nregression on irradiance and illuminance on external facade:\nhttps://www.dropbox.com/s/mqs4vycp1vc01w7/vertical_illum_solar.zip\n\n\nThe irradiance is the total solar incidence (direct, diffuse plus ground\nreflection) calculated by EnergyPlus and the vertical illuminance is\ncalculated by Radiance (gendaylit and rtrace). They both came from the\nsame weather file (Boise TMY3 EPW).\n\nApart from anomalies on the some points on West and North facade, the\nslope is about 100-110 lm/W. I will dig deeper to look at some outliers\nin the data.\n\nAny thoughts?\n\nEry\n\n\n\nOn 03/20/2013 05:54 PM, Andrew McNeil wrote:\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20130322/58f551e0/attachment.html>\n\n", "replyTo": "Subject: [Radiance-general] illuminance on external facade", "sender": "Ery Djunaedy", "isquestion": false, "tags": [], "id": "<514CE6EE.10807@gmail.com>", "refs": ["<514B347B.7020202@gmail.com>"], "datetime": "Fri, 22 Mar 2013 17:19:10 -0600", "email": "ery.mailinglist at gmail.com", "subject": "[Radiance-general] illuminance on external facade"}