{"refs": [], "id": "", "subject": "[Radiance-general] 10 minutes of your time: Survey on the role ofdaylighting in sus tainable design", "email": "Christoph.Reinhart at nrc-cnrc.gc.ca", "body": "Message-ID: <10C94843061E094A98C02EB77CFC328714F5E117@nrcmrdex1d.imsb.nrc.ca>\n\nDear colleague,\n\nYou are invited to participate in an online survey on the role of daylighting in sustainable building design practice. The survey is carried out as part of an international effort led by the National Research Council Canada (NRC) and Lawrence Berkeley National Laboratory (LBNL) to develop a new online design guide that will help design practitioners with an interest in daylighting and sustainable design to effectively implement daylighting within their projects. The survey is administered by the NRC  and will be opened until July 8th 2005. The outcome of the survey will be used to:\n\n*\tunderstand which daylight performance indicators, rules-of-thumb, and design tools practitioners are currently using to integrate daylighting\n\n*\tto identify the additional information needed by design practitioners with an interest in daylighting, beyond what is in the current generation of design guides\n\n*\tto propose content and format for a daylighting design guide that addresses these needs.\n\nWe would like you to fill out the following online questionnaire according to your daylighting design experience. Please respond to all of the items as openly and honestly as possible. There are no right or wrong answers; it is only your opinions that are important.\n\nIf you are interested in participating in this survey, please go to http://irc.nrc-cnrc.gc.ca/ie/lighting/daylight/docs/OriginalSurveyInvitation.html <http://irc.nrc-cnrc.gc.ca/ie/lighting/daylight/docs/OriginalSurveyInvitation.html> . Thank you in advance for your participation.\n\nShould you have any concerns, questions or suggestions, please contact Dr. Christoph Reinhart at  <mailto:christoph.reinhart@nrc-cnrc.gc.ca> christoph.reinhart@nrc-cnrc.gc.ca or +1(613)993 9703.\n\nWe would appreciate it if you circulated this invitation within your company/department as the success of this initiative clearly depends on the number of participating design professionals.\n\nChristoph Reinhart, Ph.D.\nAssociate Research Officer                     National Research Council Canada         Institute for Research in Construction\nAdjunct Professor                                    McGill University                                      School of Architecture\n1200 Montreal Road M-24, Ottawa         Ontario K1A 0R6, Canada\ntel: (613) 993-9703                                  fax: (613) 954 3733                                  <blocked::mailto:christoph.reinhart@nrc-cnrc.gc.ca> christoph.reinhart@nrc-cnrc.gc.ca\n\nLightswitch Wizard (initial design)            <blocked::http://www.buildwiz.com/> www.buildwiz.com\nDAYSIM (expert software)                         <blocked::http://www.daysim.com/> www.daysim.com\nRadiance Workshop 2005                         <blocked::http://irc.nrc-cnrc.gc.ca/ie/light/RadianceWorkshop2005> http://irc.nrc-cnrc.gc.ca/ie/light/RadianceWorkshop2005\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20050606/e915b965/attachment-0001.htm\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Reinhart, Christoph", "datetime": "Tue Jun  7 01:59:58 2005"}