{"body": "\nHi Lars,\n\n\n\nYes, you cantered the point of what I am trying to do. Render different light sources separately potentially change their intensity and colour temperature and compose them together to get a combined result.\n\nThe tricky bit is to calculate the right coefficients to change CCT of the light source, which Greg explained with a method of an elegance I wouldn?t have reached on my own!\n\n\n\nThanks again!\n\n\n\nG\n\n\n\n\n\nSent: 22 April 2013 23:24\nTo: Radiance general discussion\n\n\nHi Giovanni!\n\n\n\nIn this case you may white-balance the combined contributions of the colored sources. pcomb would do that job quite easily. The procedure is similar to the daylight coefficient approach based on rcontrib. You render one image for each light source (using rtrace, rpict or rcontrib) first with normalized radiance for each source (say RGB 100,100,100). Than you use pcomb to \"scale\" the images according to the desired source output, and finally add the images for each source.\n\n\n\nCheers, Lars.\n\n\n\nThanks Greg,\n\n\n\nYes, I?m expecting orange results!\n\n\n\nThe idea is to merge different images (with different light sources) together.\n\nEach light source will have a different colour temperature; as our eye can?t adjust simultaneously to all of them, my assumption is (crude, I admit!) that it will adjust to the main light source/colour temperature, while the other will look coloured (just as a lightbulb looks orange in daylight).\n\n\n\nThanks for sharing this, I?ll get into understanding the code now (and translating for windows)\n\n\n\n\n\nGiovanni\n\n\n\n\n\n\n\n\n\nSent: 22 April 2013 18:05\nTo: Radiance general discussion\n\n\nHi Giovanni,\n\n\n\nYour question is difficult to answer.  You have not said whether you want to show what a \"white balanced\" image would look like, in which case you are better off doing nothing.  If you want to show what the image would have looked like had you used your 6500K white balance on a scene with 3000K illumination, then the answer may be computable.  The way I would do it is in the following stages:\n\n\n\n1) Convert to a sharpened RGB color space using:\n\n\n\n$ ra_xyze -r -p .6898 .3206 .0736 .9003 .1166 .0374 .3333 .3333 orig.hdr > sharp.hdr\n\n\n\n2) Compute the (x,y) chromaticities for your two color spaces using src/cal/cal/blackbody.cal and convert to Sharpened RGB space and get the ratios between RGB at 3000K to RGB at 6500K:\n\n\n\n$ icalc blackbody.cal xyz_rgb.cal\n\nCIE_pri(i) = CIE_Sharp(i)\n\nx65=cct_x(6500); y65=cct_y(6500)\n\nx30=cct_x(3000); y30=cct_y(3000)\n\nR(x30,y30,1-x30-y30)/R(x65,y65,1-x65-y65)\n\n$1=1.6033242\n\nG(x30,y30,1-x30-y30)/G(x65,y65,1-x65-y65)\n\n$2=1.10306009\n\nB(x30,y30,1-x30-y30)/B(x65,y65,1-x65-y65)\n\n$3=0.439966014\n\n\n\n3) Apply these RGB ratios to the Sharpened version of the image and convert back to standard RGB:\n\n\n\npfilt -1 -er 1.6033 -eg 1.1031 -eb 0.4400 sharp.hdr | ra_xyze -r > shift3000.hdr\n\n\n\nIf your result looks horribly orange, then you know you've succeeded.  That's just what happens when you shoot indoors with a daylight whit balance!\n\n\n\nCheers,\n\n-Greg\n\n\n\nP.S.  You could of course combine steps #1 and #3 if you like really long command lines:\n\n\n\nra_xyze -r -p .6898 .3206 .0736 .9003 .1166 .0374 .3333 .3333 orig.hdr | pfilt -1 -er 1.6033 -eg 1.1031 -eb 0.4400 | ra_xyze -r > shift3000.hdr\n\n\n\nP.P.S.  The reason for converting to a sharpened RGB color space is that this does a better job simulating adaptation in your eye.  You could skip this step and get similar results using the standard RGB color space.\n\n\n\n\n\n\n\nDear List,\n\n\n\nI have a problem that I hope the radiance community can help me understand.\n\n\n\nAssume you have simulated a scene with artificial light and you have set the colour of the light to true white (R=G=B; approximate colour temperature 6500k).\n\nI assume it should be possible in postprocessing to alter the colour temperature of the light source and of the scene (assuming that?s the only light source) using some pcomb expression (different coefficients for the RGB coordinates).\n\nDoes anybody have any pointer to the math required to calculate the coefficient to change the light source from, say, 6500K to 3000K?\n\n\n\nThanks in advance,\n\n\n\nGiovanni\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20130423/e7ed00b1/attachment-0001.html>\n\n", "replyTo": "Subject: [Radiance-general] change image color temperature", "sender": "gbetti at fosterandpartners.com", "isquestion": false, "tags": [], "id": "<6F5225D6E15F954BB4E58EC25F6736C30ABD698A@corp3005.CORPORATE.FOSTER.NETWORK>", "refs": ["<6F5225D6E15F954BB4E58EC25F6736C30ABD686B@corp3005.CORPORATE.FOSTER.NETWORK><62108A03-71AB-4593-BDF2-111981765F27@lmi.net><6F5225D6E15F954BB4E58EC25F6736C30ABD68C5@corp3005.CORPORATE.FOSTER.NETWORK>", "<20EA9F54-4F7E-4E1E-B0B3-F63C673BAE29@gmx.net>"], "datetime": "April 22, 2013 7:35:01 AM PDT", "email": "\"Giovanni Betti\"", "subject": "Re: [Radiance-general] change image color temperature"}