{"body": "\nHey German,\n\nFor sure it looks like there is some color bleeding, and also the fact that you have modeled the entire mountain ? making your model extents fairly large relative to the area of interest (your building interior) is likely causing you some pain here too. It would be helpful to see your material definitions, and also your rendering parameters (particularly the ambient (-a*) ones).\n\nRob Guglielmetti\nNational Renewable Energy Laboratory (NREL)\nCommercial Buildings Research Group\n15013 Denver West Parkway MS:RSF202\nGolden, CO 80401\n303.275.4319\nrobert.guglielmetti at nrel.gov\n\n\n\nOn 4/17/13 10:12 AM, \"Germ?n Molina Larrain\" <gmolina1 at uc.cl<mailto:gmolina1 at uc.cl>> wrote:\n\nDear List,\n\nSo I have been rendering with some interesting features in SketchUp, like exporting landscapes (hills and mountains) from GoogleEarth.\n\nHere is a link for you to understand what I am talking about<https://www.dropbox.com/sh/ltv125db6hjp74a/hsnL6S-_JI>\n\nAnyway, I have been rendering some stuff and I have two doubts:\n\n1.- My environment is basically grey, but only the mountain near my building is brown; but everything has turned to be brown (as can be seen in Image2)... is that the \"color bleeding\" (or something like that)? Is that a good result? or there is a problem with my modeling?\n\n2.- As can be seen in Image (the one that shows the interior of the building, looking out), there are some weird effects, making my image to look as it was painted with a brush or something. What is the parameter that would help me reduce that?\n\nI am not sure why in Dropbox the images look much more darker than in my PC. They were created using rpict, and then filtered with \"pfilt -x /2 -y /2 image.hdr > image.tiff\"\n\nTHANKS VERY MUCH\n\nGerman\n\n\n", "replyTo": "Subject: [Radiance-general] Rendering parameters help and weird colors", "sender": "Guglielmetti, Robert", "isquestion": false, "tags": [], "id": "<CD942852.1D284%robert.guglielmetti@nrel.gov>", "refs": [], "datetime": "Wed, 17 Apr 2013 10:24:52 -0600", "email": "Robert.Guglielmetti at nrel.gov", "subject": "[Radiance-general] Rendering parameters help and weird colors"}