{"body": "\nHi,\n\nI'm trying to calculate luminance contrast between various surfaces or\nRadiance image, and compare it to recommended values.\nIdea is to calculate for each suface (eg. paper, desk, walls, floor etc)\naverage luminance, and obtain contrast as ratio between these luminances\n\n\nQuestion: How to calculate average luminance for a surface on Radiance\nimage?\nMy first idea was to identify pixels for each surface, and calculate their\naverage luminance as simple average value:\n*Average_lum = sum(pixel_luminance)/num_of_surface_pixels,*\nwhere only pixels for specific surface are taken into account.\n\nBut after some thinking, maybe that wouldn't be correct approach.\nMaybe solid angle of each pixel should be taken into account to have\nphysically correct value\n*Average_lum =\nsum(pixel_luminance*pixel_solid_angle)/sum(pixel_solid_angle), *\nwhere only pixels for specific surface are taken into account.\n\nSo my real question would be: if we calculate average luminance for some\npart of radiance image, should we take into account size of each pixel\n(solid angle) or not?\n\n###\nRelated to contrast calculation I'm still thinking if images I'm rendering\nand analysing should be hemispherical (like for evalglare) or have some\nhuman-like field of vision (-vtv -vh 110 -vv 70 for example)\nSuggestions?\n\n###\nAnother question is more theoretical - when we are talking about contrasts,\nshould we take into account average values (for work task, environment\nsurfaces etc), or extreme values like maximal luminance.\n\nI know this question is somewhat close to glare calculation, so maybe Jan\nhas some experience with luminance calculation for various surfaces on the\nscene.\n\nThanks in advance,\nMarija\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20130618/a4c3f7ab/attachment.html>\n\n", "replyTo": "", "sender": "Marija Velickovic", "isquestion": true, "tags": [], "id": "<CAAZQWqjGFjDxnUEGA0itjt-f78E_cPBSKfVPobdsjSutX4=pSg@mail.gmail.com>", "refs": [], "datetime": "Tue, 18 Jun 2013 12:16:21 +0200", "email": "maricanis at gmail.com", "subject": "[Radiance-general] Luminance contrast calculation"}