{"body": "objects in heritage buildings\n\nPhD Studentship: A novel camera-based approach to measure daylight exposure for conservation/management of light-sensitive objects in heritage buildings\n\nLoughborough University - School of Civil and Building Engineering\n\nhttp://www.jobs.ac.uk/job/AGV407/phd-studentship/\n\nBackground to the research\n=================\n\nMany heritage buildings contain light sensitive objects, e.g. paintings, fabrics, wallpapers, furnishings etc. Management of the long-term exposure of these objects to daylight is a key issue for the bodies that have responsibility for managing the buildings and preserving their contents, e.g. The National Trust. It is acknowledged that systematic monitoring of light exposure is very sparse, and also that many valuable objects are at risk. Monitoring, if carried out at all, is usually just at one or two points in a space. However, the spatial variation in long-term exposure is believed to be great- typically several orders of magnitude depending on the geometry and reflective properties of the space. The installation of commonly used measurement apparatus can be invasive, expensive and/or impractical.\n\nAim\n===\n\nThis project will employ a novel combination of measurement, GPS, photogrammetry and modeling to quantify the spatial distribution of cumulative daylight exposure in spaces, with a particular application to the management and conservation of light sensitive objects in heritage buildings. The research will include the following tasks:\n\nDemonstrate and validate in the laboratory that long-term cumulative light exposure can be determined by proxy means using automated high dynamic range (HDR) image capture.\n\nCombine HDR and photogrammetry to recreate the full 3D illumination field from the 2D images.\n\nReplicate and validate the approach ?in the field', i.e. in a suitable heritage space.\n\nDevelop visualisation tools to analyse, reduce and present cumulative illuminance data for conservators and building managers.\n\nThe position\n========\n\nThe School of Civil and Building Engineering at Loughborough University invites applications for a PhD studentship from individuals interested in fusing light modelling with modern spatial measurement techniques. A background in physics/engineering/mathematics or related discipline will be required, combined with some expertise in software development using Matlab/IDL. As part of a large, growing and supportive research community within the School, the successful candidate will benefit from the University?s Graduate School and their extensive and targeted skills training for research students. The successful candidate will be joining a lively community of research students and staff, where doctoral students are given great academic and administrative support and are an integral part of the University's research culture.\n\nLoughborough University\n================\n\nVoted Sunday Times 'University of the Year' 2008-2009, winner of The Times Higher 'Best Student Experience' poll for five years running (2006, 2007, 2008, 2009 and 2010) and with over 3,200 staff and in excess of 16,000 students, Loughborough University is one of the top 20 Universities in the UK. The University has an impressive and pleasant campus in the heart of the East Midlands - the largest single site campus in the UK. Its world-class sports and educational facilities, combined with its lively, diverse student community, make it a fantastic place to study, socialise and play.\n\nFunding and eligibility\n==============\n\nThe studentship is open to mathematically literate graduates with experience in numerate subjects such as mathematical modelling, statistics or those with a strong engineering background provided that they are good communicators, well qualified and highly motivated. The minimum entry qualification is a 2.1 Honours degree or equivalent. A lower qualification is acceptable if supplemented with an appropriate postgraduate (MSc) qualification and relevant experience. The studentship is for 3 years and covers fees and a tax-exempt stipend of ?13,726 for the 2013/2014 academic year with cost of living adjustments in years 2 and 3. Tuition fees will be paid at the UK/EU rate.\n\nStudentships must start on the 1st October 2013.\n\nAdditional Information: Applications can be made on-line:\n\nhttp://www.lboro.ac.uk/study/apply/research/\n\nFor an informal discussion on the broad topic area, please contact Prof John Mardaljevic (School of Civil and Building Engineering), on +44 1509 222630 or J.Mardaljevic at lboro.ac.uk.\n\nFor enquiries about the application process, please contact Ms Helen Newbold, H.Newbold at lboro.ac.uk.\n\nClosing date for applications: Applications will be accepted until 20th August 2013, or until the post is filled.\n\n===========================================\n\nJohn Mardaljevic PhD FSLL\nProfessor of Building Daylight Modelling\nSchool of Civil & Building Engineering\nLoughborough University\nLoughborough\nLeicestershire\nLE11 3TU, UK\n\nTel: +44 1509 222630 (Direct)\nTel: +44 1509 228529 (Pam Allen, secretary)\n\nj.mardaljevic at lboro.ac.uk\nhttp://www.lboro.ac.uk/departments/cv/staff/profile/367.html\n\nPersonal daylighting website:\nhttp://climate-based-daylighting.com\n\n\n", "replyTo": "", "sender": "John Mardaljevic", "isquestion": true, "tags": [], "id": "<3A8CC20D-7C6C-4C0D-A2F5-4E44EED08540@lboro.ac.uk>", "refs": [], "datetime": "Mon, 8 Jul 2013 15:02:00 +0000", "email": "J.Mardaljevic at lboro.ac.uk", "subject": "[Radiance-general] PhD Studentship: A novel camera-based approachto measure daylight exposure for conservation/management of light-sensitive"}