{"body": "\nHi Mostapha\n\nas Lars said, it depends on the required exactness of your simulation.\nBtw, 'glass' has the index of refraction as an optional 4th parameter.\n\nAs an approximation, choose a material and its parameters and/or use function\nfiles \"by eye\". If the resulting image looks right, - job done. However, that\nleaves the question why bother with Radiance and its complexity in the first\nplace, considering that other renderers are perceived as being much friendlier\nto the user.\n\nMeasurements on the light scattering (BSDF) of a material take out the guess\nwork, but are generally associated with costs. A number of companies sell\ndifferent equipment and a number of companies offer measurement services (me\nincluded). Choosing a Radiance material is then based on solid data and the\nresulting model comes with a known error budget.\n\nOr you can enquire about existing scattering data with the manufacturer of the\nproduct,- which you probably already have done in your case.\n\nOtherwise, LBNL is building a database on window materials, so your product may\nalready be in it.\n\nAnd, if I may say so, the recently posted review\n(http://www.pab.eu/docs/Review_of_simulating_four_classes_of_window_materials_for_daylighting_with_non-standard_BSDF_using_simulation_program_Radiance.pdf)\nhas all currently available Radiance window materials in one place. Including\nthe every-now-and-then asked question about the difference between trans and\ntransfunc. \"Window\" materials in this context means anything transmissive or\ntranslucent, so it is not specific to the usual coated, non-scattering panes .\nThis compilation was started in March, when I realized I had already asked the\nsame specific question to Greg in April 1995. So it started as a notebook to\nremind me of details, - maybe this list is useful to others too.\n\nhope that helps, have a nice weekend,\nbest\nPeter\n\n\nOn 07/19/13 10:16, Lars O. Grobe wrote:\n\n--\npab advanced technologies Ltd, http://www.pab.eu\n\n\n\n", "replyTo": "<5790BFB4-DDA5-42F4-9F2C-E669D2E245FF@gmx.net>", "sender": "Peter Apian-Bennewitz", "isquestion": false, "tags": [], "id": "<201307201101.r6KB1YGl005601@mta2.lbl.gov>", "refs": ["<CAAd_PgR86AfWh_XCVZv7YnS2cUJBZQb4H8Fdho9BqGK2CgGRxg@mail.gmail.com>", "<5790BFB4-DDA5-42F4-9F2C-E669D2E245FF@gmx.net>"], "datetime": "Sat, 20 Jul 2013 13:01:07 +0200", "email": "apian at pab.eu", "subject": "[Radiance-general] material models [Was: Daylight simulation forMulti-Layer ETFE Pillows]"}