{"body": "\nWow, Axel.  I hadn't seen these tutorials before.  They're amazing!\nWith your permission, I'd like to add them to the list of documents on\nradsite, which is unfortunately down at the moment.  This also\ndovetails with a discussion we've been having on the dev list about\nproviding an interactive repository (or Wiki) for Radiance user\ndocumentation.  I know a lot of people don't subscribe to that list, so\nI'll summarize:\n\nIt started as a rehash of why Radiance authorship is restricted, and if\nthere were any decent guidelines for code modifications, which is how\nit got on the dev list.  Then, people started suggesting things about\nhow to set up documentation for the software, and it eventually came\nback to some kind of FAQ service for beginners.  The general feeling is\nthat a lot of people who might otherwise be interested in Radiance are\nput off by the command-line structure, the scattered documentation, and\nthe lack of any clear place to begin (aside from the book of course).\nAfter all, not everyone wants to order a book and wait for it to be\nshipped to their door just to decide whether or not it's worth the\neffort to learn something.\n\nThe current line of reasoning is to provide a forum where more\nexperienced users could answer beginner's questions and have their\nanswers continually available and editable.  There would also be a\nplace for people to write essays on how they got started with Radiance,\nthings to avoid, and things to pay attention to.  How-to manuals and\ntutorials such as Axel's would be a perfect jumping off point for a lot\nof newbies, I would think.  The current set of tutorials on radsite are\ngetting a little \"long in the tooth\" so to speak, even if they still\nhave a lot of useful information.\n\nI think we're going back and forth right now trying to come up with the\nbest way to set this up.  Some people have already set up their own\nresource centers, and we could either link to them or take some of\ntheir content into our own organization.  (See Georg Mischler's\nLighting Wiki example at <http://lightingwiki.com/> as an example of\nwhat's already out there.)  Probably the best way to start is to write\nto me if you have some materials to offer, and I'll talk with Peter A-B\nabout setting something up at radiance-online.\n\nThanks,\n-Greg\n\n\n\n", "replyTo": "<35089.193.137.43.137.1105979964.squirrel@193.137.43.137>", "sender": "Greg Ward", "isquestion": false, "tags": [], "id": "<8D2429F2-68B4-11D9-B6F0-000A95BB392A@gmail.com>", "refs": ["<DC0CAEEA090E984C911D3B85B16C3F900302C37B@l-gnts05>", "<BE0D9EBA.52CC%johannes@itara.org>", "<35089.193.137.43.137.1105979964.squirrel@193.137.43.137>"], "datetime": "Mon Jan 17 19:21:53 2005", "email": "gregoryjward at gmail.com", "subject": "[Radiance-general] Radiance tutorial (Was: MacosX and X11 andradiance and blender and brad)"}