{"body": "\nYo:\n\nWe are less than one month away from the annual Radiance Workshop, and I for one am excited! Jennifer Scheib and I will be your warm and convivial hosts here at NREL, and we are planning the agenda now. For those of you who have been under a rock, here are the details once again: http://www.nrel.gov/buildings/2013_radiance_workshop.html\n\nWith the free registration this year, I must admit the registration process has been pretty informal. As a result, I feel the need to confirm the guest list. I apologize for having to do this publicly, but I don't really see any other way to ensure that everyone who is planning to attend is on our guest list (which we need to clear with security). Sooooo, please take a sec to look at the following list. If you don't see your name, and are planning on attending the workshop *in person*, please send me an email immediately.(!)\n\nOtherwise, we'll see you in a few weeks. Please don't hesitate to let me (rob.guglielmetti at nrel.gov) or Jennifer Scheib (Jennifer.scheib at nrel.gov) know if you have any questions regarding travel or whatever, and by all means if you've decided last-minute to attend, let us know, as it's not too late (but that train is leaving the station)!\n\nWe are planning the presentation agenda now and will post it -- along with the webcast access info -- as soon as that's been fleshed out. And don't forget, there will also be tours of NREL's campus buildings, software demos, a trip to Boulder, and possibly a feats of strength competition as well. Stay tuned!\n\nOK, here comes the list. Get back to us if you need to!\n\n- Rob & Jennifer\n\n2013 Radiance Workshop, Golden, CO\nIn-person Attendee List (tentative)\n#############################\nBatool, Ayesha\nBhave, Shrikar\nDjunaedy, Ery\nGeisler-Moroder, David\nMolina Larrain, German\nSaxena, Mudit\nSethi, Amarpreet\nSingh, Sukreet\nTorres, Santiago\nGadelhak, Mahmoud\nWeinold, Jan\nBaldy, Chris J.\nBurrell, Galen\nBygott, Allison\nDalglish, Jill\nDeValpine, Jack\nDiDio, Joe\nFritz, Randolph\nGillmor, Elizabeth\nGolden, Narada\nHumann, Chris\nLagios, Kera\nLeBlanc, Daniel\nMagnusen, Kristen\nMartinez, Michael\nMcNeil, Andy\nRogers, Zack\nSparks, Devon\nTheriot, Alison\nVan Den Wymelenberg, Kevin\nWard, Greg\nWratten, Jay\nZofchak, Jessica\n##############################\n\n\n", "replyTo": "", "sender": "Guglielmetti, Robert", "isquestion": true, "tags": [], "id": "<FFF56A6D37A3A54F91A03601AC22DA322630D7D499@MAILBOX2.nrel.gov>", "refs": [], "datetime": "Wed, 24 Jul 2013 15:29:38 -0600", "email": "Robert.Guglielmetti at nrel.gov", "subject": "[Radiance-general] 2013 International Radiance Workshop AttendeeConfirmation"}