{"body": "\nHi Alexa,\n\n\nOK, so I guess I'll go first.  But I'm not standing out here all by\nmyself; I'd love to hear from the rest of you...\n\n\nGood question.  Radiance itself has been the subject of many validation\nstudies, and has been proven to be quite capable of coming up with the\n\"true values\" for most scenes, assuming valid, high-quality input.\nThere's the rub though; skies are variable, and every project brings with\nit new materials -- often materials unavailable for accurate sampling at\nthe time of the simulation.  So, often I *don't* know I'm looking at \"true\nvalues\", but I do know (hope) that the values are close enough with which\nto make evaluations.  Many times, we are evaluating several different\nschemes, and when they are all simulated in Radiance with the same kind of\nwhat I call \"accuracy settings\" -- you know, the myriad values used for\nrpict & rtrace -- I know for certain that I can say scheme-a is (insert\ncriteria here, brightness, uniformity, whathaveyou) than scheme-b.  Often\nthis is all that is needed, is for Radiance to guide us in a direction\nthat can be explored more fully, either with Radiance or with physical\nmockups.\n\nBut yes, the temptation is there, to treat the numbers generated by\nRadiance as THE numbers.  I have to fight it all the time; I submit a\nreport showing 290 Lux on a plan, and people go \"oh, this doesn't work, we\ncan't have more than 270 Lux there.\"  That's my cue to ease into the\ndiscussion of how a mathematical model of the sky's luminance distribution\nis NOT /the sky's/ luminance distribution, etc.\n\n\nMany of the validation studies do just that.  My first big project\nsimulated with Radiance is still under construction, but we have done\nsimilar tests with projects simulated with Lightscape and AGI and have\nbeen generally pleased with the outcome.  Typically, the light levels are\nnot the same, but neither is the real space as compared to the simulation\nmodel.  But the values are all in the ballpark and the clients have been\nhappy. Indeed, the last big museum project I did with Lightscape at my\nprevious firm was astonishingly accurate, I believe the light levels on\nthe day my boss measured them were within 5% of the caluclation.  But I\nalso know a thing or two about luck.  I don't tell clients to expect 5%\naccuracy and neither should you.  Barring luck, the only way to get that\nclose is to do a simulation with measured sky data (and take readings of\nthe space under that same sky that you are measuring).  Right, John M.?\nThis of course requires a finished building, which sorta misses the point\nof the simulation!  But John's thesis work provides the basis for many of\nus using Radiance to achieve real restful sleep at night. =8-)\n\n\nIan Ashdown says it better than I can, in his (excellent) \"Thinking\nPhotometrically\" coursenotes:\n\n\"As for daylighting calculations, it is likely that Jongewaard (1993) is\ncorrect ? the results are only as accurate as the accuracy of the input\ndata. Done with care, it should be possible to obtain ?20 percent accuracy\nin the photometric predictions. However, this requires detailed knowledge\nand accurate modeling of both the indoor and outdoor environments. If this\ncannot be done, it may be advisable to walk softly and carry a calibrated\nphotometer.\"\n\n\nPhotometry data from the manufacturers is a far better way to describe the\nperformance of a luminaire than most of the built-in tools in simulation\nprograms.  But yes, there are still problems.  Primarily, the issue of\nfar-field photometry.  Linear cove fixtures are trated as point sources\nwhen photometred, and misuse of these IES files in a simulation can lead\nto very inaccurate simulations.  Of course in Radiance you can increase\nthe -ds value to at least help the situation, by taking that \"point\"\ndistribution and sort-of arraying it along the fixture's axis.  As long as\nthe distribution is the same along the length of the luminaire, and your\n-ds is suitably fine, you can get good results this way with\nmanufacturer-supplied data.  The other big lighting simulation packages\nlike AGI & Lumen Micro (and dear departed Lightscape) also allow you to do\nthis, in their own ways.\n\nBut sometimes the boast of accuracy simply because manufacturer-supplied\nphotometry is being used should be a warning sign...  I recently received\na mailer from one of the manufacturers of a popular lighting simulation\nprogram, featuring a rendering on it that was supposed to impress upon me\nhow amazing and accurate the software is.  The thing is, the linear\nuplight pendants in the image were casting this ridiculous round spot on\nthe ceiling, bearing no resemblance to the linear nature of the fixture --\nin fact, it looked a heck of a lot like the operator knew nothing about\nfar-field photometry and the workarounds one must use when using\nphotometry files based on that method.  And this was the featured\nrendering for the product's promotional literature -- worse, the rendering\nwas created by one of the company's in-house tech support/training people.\n(!)\n\nI think there is a big naivete in the industry -- when you get beyond this\ngroup, who is obviously much more concerned with accuracy -- when it comes\nto these photometry files, many designers just download the files and plug\nthem into their programs and hit the \"do my job\" button. In fact, these\nfiles are really just ASCII dumps of a test report, a test that used a\ncertain lamp, with a certain lumen depreciation factor, which may be\ndifferent than the one in your spec; other light loss factors need to be\nconsidered, the orientation may not even be what you expected.  So I guess\nit just goes back to garbage in, garbage out.  Those manufacturer-supplied\nfiles are only as good as the person integrating them into the simulation.\n\n- Rob Guglielmetti\nwww.rumblestrip.org\n\n", "replyTo": "Subject: [Radiance-general] Evaluation", "sender": "Rob Guglielmetti", "isquestion": false, "tags": [], "id": "<38932.209.212.87.250.1106242290.squirrel@209.212.87.250>", "refs": ["<41EF80A1.6090400@ise.fraunhofer.de>", "<41EF925C.6010306@bradford.ac.uk>"], "datetime": "Thu Jan 20 18:31:50 2005", "email": "rpg at rumblestrip.org", "subject": "[Radiance-general] Evaluation"}