{"body": "\nA while ago, I compared radiance with agi32 for a very simple room with a PAR lamp on the ceiling.  The results are at\n\nwww.personal.psu.edu/mum13/comparison_Radiance_AGI32.pdf\nand\nwww.personal.psu.edu/mum13/agi_rad.pdf\n\nThe errors for 1 and 2 ambient bounces, as shown in www.personal.psu.edu/mum13/agi_rad.pdf,  are somewhat significant and will be worse for complex environments.\n\nIt is best to do validations where the results are known a priori. Otherwise, you have too many voltage fluctuations, contractor changes and errors, reflectances are off, locations are off, material BRDFs are not known, etc.\n\nMartin Moeck\n\n\n\n\n-----Original Message-----\nFrom:\tAlexa I. Ruppertsberg [mailto:a.i.ruppertsberg@Bradford.ac.uk]\nSent:\tFri 1/21/2005 11:09 AM\nTo:\tRadiance general discussion\nCc:\nSubject:\tRe: [Radiance-general] Evaluation\nHi Rob, Jack, Martin and Christoph,\n\nthanks very much for your replies. Together with Christoph's survey I\nhave now a better understanding of the usage. I would term this more\nlike a 'relative' use: how do two (or more) design solutions compare to\neach other. A will give you more light on the desk than B, e.g.\n\nThe other emerging topic seems to me that of 'nice' pictures for the\nclients. Once you have a tool with which you can simulate the building\nand can produce a picture, there is the danger that clients\n'over'-interprete the image ('this is how it's going to look like'). Or\nput the other way, the image they can see either on a CRT or in a\nprinted version does not reflect truely what the building is probably\ngoing to look because of the limited dynamic range of the medium (CRT or\npaper).\n\nMay I challenge this? Validation studies I am aware of are (if anyone\nknows of more then please tell me):\n\nGrynberg, A.,?Validation of Radiance?, LBID 1575, LBL Technical\nInformation Department, Lawrence Berkeley National Laboratory, Berkeley,\nCalifornia, July 1989.\nThis technical report proved to be inaccessible for me. If anyone has a\ncopy, I would be more than happy to read it.\n\nKhodulev, A. and E. Kopylov, ?Physically accurate lighting simulation in\ncomputer graphics software?, 6. International conference on Computer\nGraphics and Visualization, St. Petersburg, Russia, July 1-5, 1996.\nhttp://www.keldysh.ru/pages/cgraph/articles/pals/\nThis is a website and describes a white-box scenario, i.e a scenario for\nwhich you can actually calculate the solution analytically. But how much\nis this a valid scenario for complex illumination situations?\nI have my own opinion about website-only references.\n\nHouser, K.W., D.K. Tiller, and I.C. Pasini, ?Toward the accuracy of\nlighting simulations in physically based computer graphics software?,\nJournal of the Illuminating Engineering Society, 28(1), Winter 1999,\n117-129.\nthe conclusion is that RADIANCE does not do what it says on the package\n(I have my own opinion about this paper)\n\nUbbelohde, M.S. and Humann, C. ?Comparative evaluation of four\ndaylighting software programs?, 1998 ACEEE Summer Study on Energy\nEfficiency in Buildings Proceedings, American Council for an\nEnergy-Efficient Economy, 1998.\nI asked the author to send me a copy of the paper about 18 months ago\nand I am still waiting.\n\n\nMardaljevic, J., ?Validation of a lighting simulation program under real\nsky conditions?, Lighting research and Technology, 27(4), 1995, 181-188.\nThat is what I call validation: comparison of simulation output and\nmeasurements from the real environment.\nIn my personal opinion there is no validation study apart from John\nMardaljevic's work.\n\nChristoph, I saw your 2001 paper with Walkenhorst in the reference\nsection of the survey. Is that a validation?\n\nRushmeier,Ward,Piatko,Sanders,Rust, 1995,Comparing Real and Synthetic\nImages: Some Ideas About Metrics, 6th Eurographics Workshop on Rendering.\nthis paper appears on the Radiance site and may I cite from the paper\n(p. 3, section 1.2): 'There are clearly very high levels of uncertainty\nin the measurements made in this experiment.' Now, that paper didn't set\nout as a validation for Radiance, but tried to do soemthing else, so in\na way it's not an appropriate reference for a validation study, but it\ncould have been, if measurements would have been taken more carefully\nand compared to the real room.\n\nCan you please tell me whose work I'm missing here? Or do we mean\ndifferent things when we talk about 'validaton'?\nI hope I haven't upset anyone, because that's not what I intended to do.\nI am just in the pursuit of evidence and if it is out there, then\nplease tell me.\n\nI understand that the 'unpredictability' of the sky is the biggest\nproblem basically.\n\n\nThanks again,\n\nAlexa\n\n--\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nDr. Alexa I. Ruppertsberg\nDepartment of Optometry\nUniversity of Bradford\nBradford\nBD7 1DP\nUK\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: not available\nType: application/ms-tnef\nSize: 5578 bytes\nDesc: not available\nUrl : http://radiance-online.org/pipermail/radiance-general/attachments/20050121/5655668f/attachment.bin\n", "replyTo": "", "sender": "Martin Moeck", "isquestion": true, "tags": [], "id": "<84F05BA9118BBD4A8FC6409808CE266C23413B@ENGRMAIL2.engr.psu.edu>", "refs": [], "datetime": "Fri Jan 21 17:33:43 2005", "email": "MMoeck at engr.psu.edu", "subject": "[Radiance-general] Evaluation"}