{"refs": ["<200507091228.j69CS0L01393@reaktie14.xlserver.net>"], "id": "<42D11AC0.4090307@iebele.nl>", "subject": "[Radiance-general] dxfimpor", "email": "atelier at iebele.nl", "body": "\nHi Jelle,\n\nNice to hear that you have so much fun with that tiny little tool! Now\nthat you have 'announced' it in this group, it should also be available\nsomewhere in public space.\nBecause of this, I run through the source and made it a little more\ndecent as it was. Now, for those who are interested, the source can be\ndownloaded from http:://www.toren.com/radiance/dxfimport_so.tar ( \"so\"\nstands for stand-alone, because the original class was written as part\nof a never finished Qt-app. )\nType \"g++ -o dxfimport dxfimport_so.cpp\" to compile it.\n\ndxfimport handles only 3DFACES.\n\nAccording to the autodesk website, the DXF file format documentation\nregarding 3DFACES applies to all versions of autocad's dxf, so dxfimport\nshould also support all versions. Wishfull thinking?\n\nWhat exectly do you mean with unreasonable large models? There should be\nno limit in the size of the imported dxf file, except that dxfimport\ndoes not count more as 999.999.999 polygons, which is very, very much in\nmy opinion.\n\nSometing about the usage:\nYou can specify a filename as the first argument of dxfimport, or type a\n'-' to read data from stdin.\nFor example, to convert each .dxf file in a directory and create an\noctree, type\n$cat *.dxf | dxfimport - | oconv materials.mat sky.rad - > model.oct\nOr for a single given file, type:\n$dxfimport model.dxf | oconv materials.mat sky.rad - > model.oct\n\ndxfimport without arguments gives you some basic explanation and help.\n\nThe output (stdout) of dxfimport is a line like this for each converted\nface :\nLAYER002 polygon LAYER002_000001117 0 0 9 1.650004 36.700264 14.223996\n1.650004 36.710262 13.099998 1.650005 36.710262 14.223996\nTalking about workflow: imagine that a similar program can produce\nsimilar lines for Radiance lightsources, using LINE entities from a DXF\nfile.\nWe use just such a program (not reading dxf however, but the very exotic\n.gs1 files from Arc+ modelling software) to convert lines into\nlightsources, where the startpoint of a line is the origin of a\nlightsource, and its endpoint can be translated as a direction vector\nfor spotlights, or to transform IES data. Do you get the idea?\nBut this is going to be a little off-topic for now.\n\nDxf2rad from Georg,however, has much more options, and supports much\nmore entities than dxfimport probably ever will.\n\nIebele\n\n\n\nJelle Feringa / EZCT Architecture & Design Research wrote:\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] dxfimport", "tags": [], "sender": "atelier iebele abel", "datetime": "Sun Jul 10 14:53:33 2005"}