{"body": "\nYep, it's a tonemapped jpg that retains (in a lossy way) the HDR info, so you can share these with people sans HDR image viewers and still retain backward compatibility (and enjoy a smaller file size). The paper is here:\n\nhttp://www.anyhere.com/gward/papers/cic05.pdf\n\nI do not know exactly what operator is used by hdr2jpeg...\n\n- Rob\n\n\nSent: Tuesday, October 22, 2013 9:50 AM\nTo: Radiance general discussion\nHi Jack,\nI guess Greg is the only one to answer that question.\nHowever, I guess some tone mapping has to be done as the HDR-JPG format is backwards compatible and all viewers that read JPGs also read that. So somehow they need to get get the tonemapped information...\nCheers,\nDavid\n\n2013/10/22 Jack de Valpine <jedev at visarc.com<mailto:jedev at visarc.com>>\nHi David,\n\nGreat, glad it helped!\n\nI have not used the hdr2jpeg utility so I am not really sure what it does. My impression is that it converts to a jpeg that contains hdr information. I do not think that it does tone mapping though. Perhaps others can weigh in...\n\n\nBest,\n\n-Jack\n\n\n--\n\nJack de Valpine\n\nPresident\n\n\n\nVisarc Incorporated\n\nwww.visarc.com<http://www.visarc.com>\n\n\n\nchanneling technology for superior design and construction\nOn 10/22/2013 11:14 AM, David Geisler-Moroder wrote:\nHi Jack, hi Lars,\nthanks a lot for the quick response!\nJack, your second hint exactly did what I was looking for. I tried to use pcond first, but didn't think of the possibility to use a histogram...\nSorry, if my description was somehow cryptic, but you exactly found what I wanted...\nJust for information: the pfilt exposure corrections do not help in my case because the tone-mapping that is done in the HDR2LDR conversion (with hdr2jpeg / ra_tiff or similar) does the tone mapping for each single frame independent from the other images. (But maybe I just got something terribly wrong here...!?)\nThanks!\nDavid\n\n\n2013/10/22 Jack de Valpine <jedev at visarc.com<mailto:jedev at visarc.com>>\nHi David,\n\nI am a little unclear on what you want to accomplish but here are a few thoughts.\n\n1.  time series animation with constant exposure on successive frames - use pfilt -1 -e [constant exposure setting] for each frame\n2.  time series animation with tone mapping function on successive frames - use pcond and phisto, phisto will compute a histogram across a series of frames pcond can then use the results from phisto to tone map the frames according to selected tone mapping operator, there is a an example in the man page for pcond\n\nI think that maybe where I am confused by your description is that since Radiance output is already HDR, setting exposure is really a post process. I think that what you are looking for is the second option that I describe above.\nNot sure if this answers your questions, but perhaps gives you some things to look into.\n\nBest,\n\n-Jack\n\n\n--\n\nJack de Valpine\n\nPresident\n\n\n\nVisarc Incorporated\n\nwww.visarc.com<http://www.visarc.com>\n\n\n\nchanneling technology for superior design and construction\nOn 10/22/2013 9:45 AM, David Geisler-Moroder wrote:\nHi all,\nI have a question concerning the tone mapping procedures implemented in the Radiance tools.\nFor an animation of a full day I would like to get something similar that a camera would do that just takes a picture every 5 minutes with the same settings (exposure time and aperture). Rendering the images for every 5 minutes is not a problem, however, I stuck when trying to convert the HDRs to some tonemapped images. As far as I got it, In ra_jpeg/hdr2jpeg no exposure can be given at all, in ra_tiff/ra_bmp only relative exposures can be applied.\n\nThus my question: is it possible to explicitly set the exposure used in the tonemapping process with any tool in Radiance?\nThanks in advance!\nDavid\n\n\n\n_______________________________________________\n\nRadiance-general mailing list\n\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\n\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\n_______________________________________________\n\nRadiance-general mailing list\n\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\n\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20131022/bdcbb815/attachment.html>\n\n", "replyTo": "Subject: [Radiance-general] Tone mapping for animation", "sender": "david.moroder at gmail.com", "isquestion": false, "tags": [], "id": "<FFF56A6D37A3A54F91A03601AC22DA32263ABB8925@MAILBOX2.nrel.gov>", "refs": ["<CAL-bo5EWL=NjbOrBTQcxpF-Q=FSqU=C_fjSL+Cx-gYWtfAqjOQ@mail.gmail.com>", "<5266861B.5090302@visarc.com>", "<CAL-bo5FiX2kZwzHXKcK8CLrr5eqydD6ffNELXW-pBKUPdnJDaQ@mail.gmail.com>", "<52669A7B.7040602@visarc.com>", "<CAL-bo5HeAAsf5nHtrHaV1tZc340SyGuWOvCSOSk3r9YN0jMKhg@mail.gmail.com>"], "datetime": "Tue, 22 Oct 2013 09:58:47 -0600", "email": "David Geisler-Moroder", "subject": "Re: [Radiance-general] Tone mapping for animation"}