{"body": "\nThanks Greg and German for your comments. As I mentioned in my email, I'm considering only a simple double-pane window, without any concentrating system.\n\nFinally, the problem was not the 3pm but the shading effect of the\nreveal, which we included in the 3pm but not in EnergyPlus. The\nthickness of the wall was 0.35 m, the glass was located at 0.05 m from\ninside and there were three windows on a south-facing facade. With this\nconfiguration, the solar transmission decreased up to 30% due to shading\neffects from the reveal for high incidence angles.\n\nWe've compared the solar transmission from the 3pm with classic\nRadiance, and they match well.\n\nCheers,\nBruno\n\n----------------------------------------------------------------------\n\nMessage: 1\nTo: Radiance general discussion<radiance-general at radiance-online.org>\nMessage-ID:<7F84A013-978E-4E0F-9B17-C777BD7E959D at lmi.net>\nContent-Type: text/plain; charset=us-ascii\n\nHi Bruno,\n\nThe underprediction is expected for fenestration systems with any concentrated through component, as the Klems matrix representation will spread out any transmission to the resolution of its patch sizes, which is around 15 degrees or so (square).  In other words, the direct component will be spread out by the resolution of the Klems BTDF.  I don't know whether or not EnergyPlus is using the Klems BTDF, and if it does, it might use it differently so there isn't this spreading of irradiation, but that's a trade-off between different types of errors.  Radiance spreads the light based on BTDF angular accuracy, but the integrated value (and therefore the subsequent interreflections) will carry the correct amount of energy.  A different energy sampling approach might dump the energy into a smaller area with higher concentration, just not get it in the right place.  It's difficult to say which approach is better.\n\nCheers,\n-Greg\n\n\n\n\n------------------------------\n\nMessage: 2\nTo: Radiance general discussion<radiance-general at radiance-online.org>\nMessage-ID:\n<CAF-iH4LqC+TxMVUsxbk0yeE_D01d1U07KXLq=sGUUn7XfeP0TQ at mail.gmail.com>\nContent-Type: text/plain; charset=\"iso-8859-1\"\n\nI think I can add something else that S. Vidanovic told me:\n\n\"Well, main limitation is that integration is not really done patch by\npatch (at least not for solar part)...  If you for example take a look at\nequation 280 you will notice that integration is averaged over sky and\nground elements.  In solar calculations, I do not care from which part of\nthe sky radiation is coming, I simply do averaging over entire sky and just\napply that into equations.  I have no idea how much error that will\nintroduce into calculations.  One important note is that I do care what is\ncurrent sun position and therefore I do know what is incoming patch at\ngiven time, and will know really precisely to calculate absorbed solar\nradiation on interior sides.\"\n\nmeaning that only the beam radation is passed thorugh the BSDF, and the\nrest is averaged.\nAlso, EnergyPlus should add the absorbed and reemited radiation...? are you\nconsidering that?\n\nI am not sure about what EnergyPlus does about the Basis issue that Greg\nmentioned...\n\nGerman\n\n--\nDr.-Ing. Bruno Bueno\nSolar Facades\nDivision Thermal Systems and Buildings\nFraunhofer Institute for Solar Energy Systems ISE\nHeidenhofstr. 2, 79110 Freiburg, Germany\nPhone: +49(0)761 4588 5377\nbruno.bueno at ise.fraunhofer.de\nwww.ise.fraunhofer.de\n\n\n\n\n\n\n", "replyTo": "", "sender": "gmolina1 at uc.cl", "isquestion": true, "tags": [], "id": "<52986815.80202@ise.fraunhofer.de>", "refs": [], "datetime": "Sat, 23 Nov 2013 20:03:53 -0300", "email": "Germ?n Molina Larrain", "subject": "Re: [Radiance-general] 3pm to calculate indoor solartransmission"}