{"refs": ["<a932f51195d061d856d96814b21d928e@gmx.net>", "<A5662C01-B0B1-4B30-92C2-D098CA4D51F7@gmail.com>", "<4469a270441082ca2a06e1860a55bcb6@gmx.net>", "<BE949BCD-9EBF-4F7C-9D1F-906487F14017@gmail.com>", "<a21064ffac25d2264e0e62cade2f3820@gmx.net>", "<D50BE2C9-DF24-4F96-A535-F413648337A5@gmail.com>", "<7064b329f33eae3d1c756455ec2472b3@gmx.net>", "<2cb014fc6bad376e1f47ca4682c4db21@gmx.net>"], "id": "<36FADA24-5E3C-4E16-945C-13FA1CECCC0A@gmail.com>", "subject": "[Radiance-general] rvu: too many modifiers in ambient lis", "email": "gregoryjward at gmail.com", "body": "\nHi Lars,\n\nIf you don't use a material or set of materials for an object, then\nincluding the unused material is a waste of space.  Thus, including a\nwhole material library with each object, which uses at most a few of\nthese materials, is a huge tax on memory during rendering.  Don't do\nit.  Find another way, even if it's less convenient.\n\nMy earlier suggestion was to include the colorpict in each object\nfile as needed to move coordinates around with your geometry, and\nalias'ing the material the colorpict is applied to.  That way, you\nduplicate only what is needed for correct rendering, and can still\nuse a library.  The alias also takes up space, but not as much as a\nwhole library of materials.  It is about the same as putting just the\nmaterials used in each geometry file.  Giving each alias a unique\nname also avoids the generation of excess id's with the -ae option\nyou are currently experiencing.  Each unique modifier name generates\nas many id's as there are appearances in your scene.  (Instancing a\nmesh or octree counts as a single appearance, where xform'ing counts\nfor multiple appearances.)\n\nIf you can avoid duplicating your entire material library with each\nobject, this should solve all your problems.\n\n-Greg\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] rvu: too many modifiers in ambient list", "tags": [], "sender": "Greg Ward", "datetime": "Mon Jul 11 20:10:18 2005"}