{"body": "\nHi Vaibhav,\n\nThis is probably in the archives, somewhere, but I wouldn't want the task of trying to find it myself, so I won't insist you look, either.\n\nIf you have a list of (x,y) pixel coordinates (where x is horizontal position from the left and y is vertical position from the bottom), you can use vwrays to generate rays and compute illuminance values to composite into your image.  You can generate such a list using the 't' command in ximage:\n\nximage -tp myrendering.hdr > positions.txt\n\nJust move the cursor over each place you want to compute illuminance and type 't'.  Don't expect a beep or anything, and don't hold down the 't' or you'll get a whole list of identical values when it repeats.  (If you prefer, you can click the middle mouse button instead of typing 't'.)\n\nThe list of positions can then be used in the following manner to generate illuminance values and output them via psign and pcompos:\n\n$ echo pcompos myrendering.hdr 0 0 \\\\ > pcom.sh\n$ vwrays -i myrendering.hdr < positions.txt \\\n| rtrace -h [rendering options] -i+ myscene.oct \\\n| rlam positions.txt - \\\n| rcalc -e 'lux=47*$3+120*$4+12*$5' -o '=00 \"!psign -h 25 -s -.1 ${lux}\" ${$1} ${$2} \\' >> pcom.sh\n$ sh pcom.sh > myluxvalues.hdr\n$ rm pcom.sh\n\nIf the text is too large or too small, adjust the psign -h value downwards or upwards as desired.\n\nI haven't fully tested this, so I hope I didn't make any goofs.  Of course, it assumes you are using Unix.  Otherwise, you'll have more difficulty getting the quotes to work properly since Windows only allows double-quotes....\n\nBest,\n-Greg\n\n\n\n", "replyTo": "<CAD7gt0XvXjdLP50W5bvVK3dGsgWjFsZDnNd+zRgB-cCXzo88QA@mail.gmail.com>", "sender": "Greg Ward", "isquestion": false, "tags": [], "id": "<4FEF9234-7F64-43BA-B665-567C5CCD5492@lmi.net>", "refs": ["<CAD7gt0XvXjdLP50W5bvVK3dGsgWjFsZDnNd+zRgB-cCXzo88QA@mail.gmail.com>"], "datetime": "Tue, 10 Dec 2013 21:44:38 -0800", "email": "gregoryjward at gmail.com", "subject": "[Radiance-general] Insert text in Radiance images at specificlocation (x y z)"}