{"body": "\nHello list,\nI have a small request, or question that I hope you can help me answer, or\nguide me to some literature on the topic.\nI'll try to do it short ;-)\nI'm currently working on a project were we are designing a new head quarter\nfor a bank in Copenhagen. In this bank there is a huge trading floor, which\nis located under an atrium roof! This location gives some fantastic\nchallenges with regard to the visual environment ;-).\n\n\nWe are now trying to delve into the topic on glare and visibility on the\ncomputer screens in the atrium. The traders should be able to read info on\ntheir computer screens at all times and not at any point in time experience\nglare from daylight. We have a full Radiance model ready. With regard to\nevaluation of glare from daylight, we will run Radiance simulations and\nevaluate the scene both with respect to UDI (zero area with UDI > 3000 lx)\nand DGP (threshold 0.35).\nHowever, I'm in doubt of what to do with regard to experienced glare and\nvisibility on the computer screens. I have skimmed through Niloofar Mogbels\ndissertation, and can read that she has developed a model for visibility\nglare on computer screens.\nDo you have any information/comments with regard to this model ?\nHow far are you with the implementation of the tool gen_vf and gen_vfd ?\nDoes there exist more information on the programs somewhere ? A small\ntutorial ? Are typical Radiance descriptions of different types of computer\nscreens available ?\n\nWould you guide me to other methods ?\n\nThanks  in advance for any guidance.\nAll the best,\nAnne\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140130/e90578c0/attachment.html>\n\n", "replyTo": "", "sender": "Anne Iversen", "isquestion": true, "tags": [], "id": "<CADq2N7NNVS0nJf=4cNsu5atTSRVTJci1S8jnteepnVDf--rJjA@mail.gmail.com>", "refs": [], "datetime": "Thu, 30 Jan 2014 15:36:18 +0100", "email": "iversen.anne at gmail.com", "subject": "[Radiance-general] Visibility of computer screens in rooms withdaylight?"}