{"refs": [], "id": "<CC0B19F4C6132F4D9FDDEBF194200FB5234C6E@ldcexc02.global.arup.com>", "subject": "[Radiance-general] Reflection vs specularity", "email": "adiance-general-bounces@radiance-online.org", "body": "\nIebele,\nhave you tried with -sj, just to jitter the specular component?\n\nan alternative trick is to generate just an image without specular\ncomponent\nand another one with it (you may use lower settings for this, may be\njust -av something something something -ab 0).\nthen photoshop will help doing the trick... but I wouldn't define it a\nphysically accurate technique :-)\n\nciao\ngiulio\n\n\n\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of\natelier iebele abel\nSent: 20 July 2005 12:39\nTo: Radiance general discussion\nHi,\n\nI have a problem modelling a reflective floor of a large museum hall.\nThe specular and roughness components (0.08 and 0.01) in the material of\n\nthe floor  result in smooth reflections of the walls, paintings, windows\n\netc.\nThe problem arises when adding some lightsources. The lightsources cause\n\nspecular reflections with very bright specular spots (highlights) on the\n\nfloor. These specular spots do not look realistic (better said: these\nhighlights disturb in the image, because there are so many of them).\nI have tweaked the specular, roughness and rendering parameters also,\nbut I can't  get rid of these specular reflection highlights, apart from\n\nmaking the roughnes very small or 0. But with low or zero rougness the\nrelections of the other geometry become too sharp.\nIs there a way to model a reflective material (or lightsource?) without\na ( or a dimmed) specular reflection highlight ?\nOr any other suggestion?\n\nIebele\n\n\n\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "adiance-general-bounces@radiance-online.or", "datetime": "Wed Jul 20 15:03:12 2005"}