{"body": "\nHi Chris,\n\nWhat Andy said! To that end, I would add that tools like objview (for visualizing your CFS geometry) and bsdf2rad (for visualizing the BSDF distribution) are very useful for getting comfortable with your generated BSDFs. I am working on a little ?test room? model, a la the ltview script but for CFS instead of luminaries. When it?s sensible I?ll post some results. It?s very helpful to visualize these things; Andy?s BSDFviewer is awesome, but I also like to mock these things up in Radiance proper so I am certain the functions and the models are are being implemented and oriented correctly, you know what I mean?\n\n- Rob\n\nReply-To: Radiance discussion <radiance-general at radiance-online.org<mailto:radiance-general at radiance-online.org>>\nTo: Radiance discussion <radiance-general at radiance-online.org<mailto:radiance-general at radiance-online.org>>\nHi Chris,\n\na short note from my side:\nYes, you can import BSDFs of systems into WINDOW and generate new BSDFs including the glass panes of your IGU. Therefore my approach is usually to simulate only the system without any glazing and put the overall system together in WINDOW with the right glass.\nConcerning the generation of BSDFs for various applications of a single system you should decide if the kind of system you are simulating is representative for your application. I tend to simulate typical periods of a systems (e.g. for a lamella system you can use the -dim settings to get that right) and model any frame in the geometric model. However, in cases where e.g. the ratio of system thickness to system size dimension is quite high and thus the frame will significantly influence the BSDF, it is better to include the real geometry in the BSDF simulation model. However, you then probably end up generating more than a single BSDF for the same system depending on the applications.\n\nI hope it's somehow clear... if not, let me know and I'll try again ;-)\n\nCheers,\nDavid\n\n\n\n2014-02-26 1:03 GMT+01:00 Andrew McNeil <amcneil at lbl.gov<mailto:amcneil at lbl.gov>>:\nChris,\nEverything you write seems correct. One whatch-it I can offer is to make sure you're system is situated properly for the genBSDF run. +Z is into the space, +Y is up.  All of the geometry should be in the -Z space. If you don't follow these guidelines you're BSDF will be strange.\nAndy\n\n\nOn Tue, Feb 25, 2014 at 8:06 AM, Chris Coulter <Chris.Coulter at burohappold.com<mailto:Chris.Coulter at burohappold.com>> wrote:\nGood morning Gurus!\n\nI have worked through the 3- and 5-phase tutorials in hopes of being able to apply a BSDF to one of my projects. This project will be using micro-louver cellular structures imbedded within an IGU, in both skylights and vertical windows. I think I understand the general process, but wanted to ask a few questions before getting too far down the road?\n\nThe skylights and windows are all different sizes and the windows are in multiple orientations (of course). My understanding of the BSDF and seemingly from this mail (http://www.radiance-online.org/pipermail/radiance-general/2011-November/008248.html), I should be able to calculate the BSDF once for my system. I was planning model the louvers as 1m by 1m, but run genBSDF with the ?dim arguments smaller than this. Is this the correct approach? Ideally I would not calculate the BSDF for each orientation, assuming that micro-louver geometry does not change.\n\nIn my BSDF material definition, I would alter the up vector according to the surface being applied ? the up vector matches the BSDF orientation (calculated in xy space) to the specific geometry?s orientation (0 0 1 for a window). If the louver are rotated within the IGU assembly (rz -45) for a skylight, I can account for this with the up vector of 1 1 0 (surface normal is 0 0 1). This would hold true for rotation within the vertical apertures as well. Each different up vector would be a different BSDF material.\n\nLastly, if the glazing properties (VLT) are not defined yet, can I import the BSDF file into Window and create multiple options for IGU?s with varying properties? It seems so from David Geisler-Moroder?s presentation at the 2012 Workshop (http://radiance-online.org/community/workshops/2012-copenhagen/Day1/Geisler-Moroder/geisler-moroder_BSDF_tutorial_s.pdf). Certainly skylights and windows will have different VLT and it would again be nice to not be required to run genBSDF multiple times.\n\nI am in the process of working through the steps on my own, but wanted to ask these questions while I?m waiting on genBSDF.\n\n\nAny help is much appreciated, as always.\n\nChris Coulter\nSenior Lighting Designer\nBuro Happold Consulting Engineers\n100 Broadway, 23rd Floor\nNew York, NY 10005\nTel: 212.334.2025<tel:212.334.2025>\nDirect: 212.616.0254<tel:212.616.0254>\nEmail: chris.coulter at burohappold.com<mailto:chris.coulter at burohappold.com>\nWebsite: www.burohappold.com<http://www.burohappold.com>\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\n--\nDipl.-Ing. Dr. David Geisler-Moroder\nHofwaldweg 14/20\n6020 Innsbruck\nAustria\n\n\n", "replyTo": "Subject: [Radiance-general] BSDF orientation and implementation", "sender": "david.moroder at gmail.com", "isquestion": false, "tags": [], "id": "<CF340DB6.3B68%robert.guglielmetti@nrel.gov>", "refs": ["<CBDA7B0F3FC5354F986B71977E204BEC20EDF9EF@EX-MBX01.burohappold.com>", "<CAOG+Niz40ULk2xGWoKCKZ7MPRU21jUJABzip77SG_mU8_av1tQ@mail.gmail.com>", "<CAL-bo5G7G713kOt=EfhEBGVs6qwHiXg0R_3DstCdUj-taiN+hQ@mail.gmail.com>"], "datetime": "Wednesday, February 26, 2014 at 10:34 AM", "email": "David Geisler-Moroder", "subject": "Re: [Radiance-general] BSDF orientation and implementation"}