{"body": "\nDear colleagues,\n\nplease forward this announcement for an internship at our Competence\nCentre in Lucerne to whoever might be interested.\n\nMany thanks & best regards,\n\n--Roland\n\n\n------- Forwarded message -------\nFrom:\nTo:\nCc:\n\nWe are looking for motivated candidates for a 2-month student internship\nin our interdisciplinary team to contribute to our project Daylight\nRedirecting Components (http://p3.snf.ch/project-147053) and further our\ndevelopment of in-house simulation software within the framework of the\nRADIANCE rendering system.\n\nAs part of our research agenda, we plan to investigate the application of\nQuasi-Monte-Carlo raytracing (including photon-mapping) for improved\nconvergence of our simulations. The intern is tasked with the development\nand evaluation of a low-discrepancy series  generator as a drop-in\nreplacement for the standard random number generator used in the RADIANCE\nsoftware. The intern is expected to conduct preliminary research in the\nfield, be self-organised, and complete assigned tasks independently.\n\nThe candidate should have a background in mathematics and/or computer\nscience, and be knowledgeable in the following fields:\n- Monte-Carlo techniques and statistics\n- Raytracing, path tracing, photon mapping\nIn addition, familiarity with the RADIANCE rendering system and BSDF\nrepresentations is desirable.\n\nCandidates can apply directly by replying to the address below and\nforwarding their CV, list of related projects, recent transcript, and\nmotivational letter.\n\n--Roland Schregle\n\n\n--\nDr. Roland Schregle\nSenior Research Associate\n\nT direct: +41 41 349 39 77\nroland.schregle at hslu.ch\n\nLucerne University of Applied Sciences and Arts\nSchool of Engineering and Architecture\nCC Envelopes and Solar Energy (EASE)\nTechnikumstrasse 21, CH-6048 Horw\nT +41 41 349 33 11, F +41 41 349 39 60\nwww.hslu.ch/ccease\n\n\n", "replyTo": "", "sender": "Schregle Roland HSLU T&A", "isquestion": true, "tags": [], "id": "<op.xbv6a00hgbjfop@ccmse-sim>", "refs": [], "datetime": "Wed, 26 Feb 2014 14:55:38 +0100", "email": "roland.schregle at hslu.ch", "subject": "Internship at Lucerne University of Applied Sciences and ArtsDate: Fri, 31 Jan 2014 12:15:03 +0100"}