{"body": "\nAle,\n\nYou should take a look at the \"understanding rtcontrib\" tutorial, by Axel\nJacobs. It is available on the radiance-online.org/learn/tutorials section.\n\nYou use rtcontrib (now you use rcontrib, which I understand is basically\nthe same, but faster) for calculating the contributions of each patch on\nthe scene. Genskyvec or gendaymtx, on their part, will generate the actual\nvectors that represent the sky, including the sun unless you tell them\notherwise.\n\nBye\n\nGerm?n\n\n\n\n2014-02-25 5:27 GMT-03:00 Alejandro Pacheco Di?guez <paxeco2205 at hotmail.com>\n:\n\n\n\n--\n*Germ?n Molina L.*\nIngeniero Trainee\nHunter Douglas Chile S.A.\nCelular +569 89224445\n\n--\n\n\n*Nota de Confidencialidad:* Este mensaje inclu?do los archivos adjuntos son\nconfidenciales y pueden contener informacion privilegiada protegida por\nley. Si Ud. no es el destinatario, deberia abstenerse de copiarlo,\ndistribuirlo, divulgarlo o usar la informacion contenida. Por favor, avise\ninmediatamente al emisor y borre este mensaje de su sistema. Los mensajes\nelectronicos son susceptibles de ser cambiados, infectados o adulterados\nsin autorizacion. No asumimos responsabilidad alguna por ninguna clase de\ncambios o sus consecuencias. Usted debe estar informado que la compania\npuede hacer un seguimiento de sus mensajes electronicos y su contenido,\ngracias.\n\n*Confidentiality Notice:* The information contained in this email message,\nincluding any attachment, is confidential and is intended only for the\nperson or entity to which it is addressed. If you are neither the intended\nrecipient nor the employee or agent responsible for delivering this message\nto the intended recipient, you are hereby notified that you may not review,\nretransmit, convert to hard copy, copy, use or distribute this email\nmessage or any attachments to it. If you have received this email in error,\nplease contact the sender immediately and delete this message from any\ncomputer or other data bank, Thank you.\n\nA informa??o transmitida ? confidencial e para conhecimento exclusivo do\ndestinat?rio. Sua utiliza??o, n?o autorizada, constitui crime pass?vel de\npris?o. Todas as precau??es poss?veis foram tomadas para garantir que este\ne-mail n?o contenha v?rus. Uma vez que nossa empresa n?o pode assumir\nresponsabilidade por nenhuma perda ou dano causado por este e-mail ou de\nseus anexos, recomendamos que o destinat?rio utilize seus procedimentos de\nantiv?rus antes de qualquer uso.\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140225/7c4bc9f5/attachment.html>\n\n", "replyTo": "<DUB128-W1117D7428A4BC3B3098325CA810@phx.gbl>", "sender": "CHI-German Molina", "isquestion": false, "tags": [], "id": "<CAK+g53BGqZpbxoMRaL4cVMtUD3Xm-vjh1-dQ+whf9BQU7_9SpQ@mail.gmail.com>", "refs": ["<DUB128-W1117D7428A4BC3B3098325CA810@phx.gbl>"], "datetime": "Tue, 25 Feb 2014 08:36:44 -0300", "email": "gmolina at hdlao.com", "subject": "[Radiance-general] Distribute the brightness of the sun over asky patch"}