{"body": "\nHi Jia,\n\nIt seems that you posted this question twice to the mailing list.\n\nThe main effect of a \"parallel\" source is that its intensity does not diminish with distance.  The closest you can come to a parallel local light source in Radiance is to use the \"spotlight\" material with a very long direction vector, indicating that the virtual source is far behind the emitting area.\n\nSpotlight\nSpotlight is used for self-luminous surfaces having directed output. As well as radiance, the full cone angle (in degrees) and orientation (output direction) vector are given. The length of the orientation vector is the distance of the effective focus behind the source center (i.e., the focal length).\nmod spotlight id\n0\n0\n7 red green blue angle xdir ydir zdir\n\nSomething like:\n\nvoid spotlight long_throw\n0\n0\n7 1e5 1e5 1e5 1.0 0 0 -1000\n\nlong_throw ring spot\n0\n0\n9\n0\t0\t3\n0\t0\t-1\n0\t.1\n\nThe above will create a 1-degree spread spotlight with a 1000-meter focal length, meaning that the effective emitting position is 1000 meters behind the emitting surface (a 10cm disk in the ceiling in this case).  This should give you the effect you want, even if the sample rays to the source are not always parallel.\n\nIf your actual purpose instead is to generate perfectly sharp shadows, you can do this by shrinking the size of the emitting area (and increasing the RGB arguments of spotlight to compensate).\n\n-Greg\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140220/2cef0076/attachment-0001.html>\n\n", "replyTo": "Subject: [Radiance-general] How to generate parallel light", "sender": "Greg Ward", "isquestion": false, "tags": [], "id": "<81E4BDB2-C8C5-4310-A3B9-DA56046D4FC3@lmi.net>", "refs": ["<CABzgtwpBVUC8W6oGCFdRG1cqE7dQ4CsfJxxTmdWtiO645ReEzw@mail.gmail.com>"], "datetime": "Thu, 20 Feb 2014 10:01:46 +0100", "email": "gregoryjward at gmail.com", "subject": "[Radiance-general] How to generate parallel light"}