{"body": "\nHello List,\n\nAs some of you might remember, some (a long) time ago, I uploeaded a Video\nof an extention that I was developing for exporting SketchUp models to\nRadiance.... I know there is another (very respected) one, but I did not\nreally like it. I felt it was not really prepared for working with\nthickness, illums, and some other stuff... at least it did not work for me.\n\nNow, we (Germ?n Molina, Sergio Vera and Waldo Bustamante, from Pontificia\nUniversidad Cat?lica de Chile) are proud to anounce that we have finally\nfinished registering our extension: *Groundhog*. The name comes from the\nGroundhog day tradition (not my tradition, but I found it interesting).\n\nWhat does it do, for now?\n\nAllows Working with thick walls (easy window creation).\nExporting complex polygons as one polygon (window openings are not a\nproblem)... there are still issues with the \"non plane polygon\")\nAssigning materials from a library of auto-contained Radiance Material\nfiles.\nMaterials not existing in the library will be \"guessed\" by defining a\nplastic material with no specularity or roughness, with the same color. If\nthe material is semi-transparent, a colored glass material will be assigned.\nAdding workplanes, which will be exported as a set of sensors that can be\nused by rcontrib and rtrace programs.\nAdding Illums.\nGrouping windows in order to make more efficient lighting simulations.\nExporting by layers, separating (or not) the windows from the rest of the\ngeometry, allowing 3 and 5 phase simulations.\nExport multiple views, corresponding to the Scenes (pages) saved within the\nSketchUp model.\nEvery exported scene file comes with a CIE clear sky with the sun located\naccording to the sun direction in the model. We are using Geolocation.\n\nI have been using this for about two years now... and now, I think, is a\nuseful tool, and I see a lot of potential in it.\n\nWe would really like to count with your feedback, ideas, and hopefully with\nsome contributions to the code.\n\nWe have worked on the documentation, although we know there are some things\nwe need to do.\n\nWeb page: http://groundhoglabs.github.io/Groundhog/\nSource Code: https://github.com/GroundhogLabs/Groundhog\nDocumentation: http://groundhoglabs.github.io/Groundhog/doc/doc_index.html\n\nBYE\n\nGerm?n Molina\n\n--\n\n\n*Nota de Confidencialidad:* Este mensaje inclu?do los archivos adjuntos son\nconfidenciales y pueden contener informacion privilegiada protegida por\nley. Si Ud. no es el destinatario, deberia abstenerse de copiarlo,\ndistribuirlo, divulgarlo o usar la informacion contenida. Por favor, avise\ninmediatamente al emisor y borre este mensaje de su sistema. Los mensajes\nelectronicos son susceptibles de ser cambiados, infectados o adulterados\nsin autorizacion. No asumimos responsabilidad alguna por ninguna clase de\ncambios o sus consecuencias. Usted debe estar informado que la compania\npuede hacer un seguimiento de sus mensajes electronicos y su contenido,\ngracias.\n\n*Confidentiality Notice:* The information contained in this email message,\nincluding any attachment, is confidential and is intended only for the\nperson or entity to which it is addressed. If you are neither the intended\nrecipient nor the employee or agent responsible for delivering this message\nto the intended recipient, you are hereby notified that you may not review,\nretransmit, convert to hard copy, copy, use or distribute this email\nmessage or any attachments to it. If you have received this email in error,\nplease contact the sender immediately and delete this message from any\ncomputer or other data bank, Thank you.\n\nA informa??o transmitida ? confidencial e para conhecimento exclusivo do\ndestinat?rio. Sua utiliza??o, n?o autorizada, constitui crime pass?vel de\npris?o. Todas as precau??es poss?veis foram tomadas para garantir que este\ne-mail n?o contenha v?rus. Uma vez que nossa empresa n?o pode assumir\nresponsabilidade por nenhuma perda ou dano causado por este e-mail ou de\nseus anexos, recomendamos que o destinat?rio utilize seus procedimentos de\nantiv?rus antes de qualquer uso.\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140321/75a94f46/attachment.html>\n\n", "replyTo": "", "sender": "CHI-German Molina", "isquestion": true, "tags": [], "id": "<CAK+g53C85r8U35-fdNWZAUhATq4iKuafBmuEXZ=NBp35+tq8jg@mail.gmail.com>", "refs": [], "datetime": "Fri, 21 Mar 2014 10:34:05 -0300", "email": "gmolina at hdlao.com", "subject": "[Radiance-general] Groundhog project: OpenSource SketchUp 2Radiance exporing, focused on annual daylight simulations"}