{"body": "\n\nThanks Christopher,\n\nMy situation is a little different, I think.\n\nI point to SIGMA 180 degree field-of-view lens vertically upwards and make a full hemisphere HDR image (radiance map) from that. I then integrate to get the vertical irradiance in each of the three color channels. These values are calibrated so they are in W/m^2.\n\nSimultaneously, I place a light meter flat (sensor pointing vertically upwards) and take a reading. This reading is a single value in Lux.\n\nSo, how do I convert the three irradiances to a Lux value? Spectral integration, yes, but how exactly?\n\nCheers\n\nSent: 27. marts 2014 15:45\nTo: Radiance general discussion\nIf I understand your situation correctly, I believe you would need to know the reflectance of the material at the point of the irradiance measurement to backtrack to illuminance for calibration. This works when the surface is Lambertian (diffuse), and much more difficult if there's any glossiness. For calibration purposes, people often include a photographic grey card of known reflectance in their scene and take actual luminance or illuminance meter measurements at the grey card.\n\n\nI use hemi-spherical HDR images to compute a vertical irradiance value (W/m^2) for each color channel.\n\nIf I wish to compare/calibrate these numbers to a reading from a light meter (giving illuminance in Lux) how do I go about converting the three (RGB) irradiances to illuminance?\n\nCheers,\nClaus\n\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140327/e2b6f059/attachment.html>\n\n", "replyTo": "<88079A360FAC7441AE93ECBF61998236113B3055@AMXExMb01.global.arup.com>", "sender": "cbm at create.aau.dk", "isquestion": false, "tags": [], "id": "<9013E154BAB3F24D97C18A4FEAB61036BF353F85@ad-exchmbx2-2.aau.dk>", "refs": ["<9013E154BAB3F24D97C18A4FEAB61036BF353D19@ad-exchmbx2-2.aau.dk>", "<88079A360FAC7441AE93ECBF61998236113B3055@AMXExMb01.global.arup.com>"], "datetime": "Thu, 27 Mar 2014 14:59:41 +0000", "email": "Claus Br?ndgaard Madsen", "subject": "Re: [Radiance-general] Conversion of RGB irradiance values to a illuminance value"}