{"body": "\nA short add to Andy's post, you will notice Andy is defining the sky and ground hemispheres as a single 360-degree source, called \"skyball\".  This works because skyfunc will automatically use the ground ambient value (adjusted with the ?g option to gensky) when the ray direction vector has a negative zed value.\n\nThis is, in a word, cool.\n\nSome more words: this means Radiance will automatically derate the \"sky\" luminance when a traced ray hits below the horizon, knowing that it's actually hitting the \"ground\", and not the sky. The default for ?g is 0.20, for a 20% reflectance ground \"plane\". Reasonable enough, but be advised you should really also have actual geometry to define the local exterior environment ? this includes the ground as well as neighboring buildings, so that your local ground is shaded by your building and its neighbors.\n\n- Rob\n\nOn 4/2/14, 11:24 AM, \"Andrew McNeil\" <amcneil at lbl.gov<mailto:amcneil at lbl.gov>> wrote:\n\nHi Vaib,\n\nI believe you have a more fundamental error in your model. gendaylit and gensky do not create the sky source, you have to manually add a sky material and source to your model. If you append the text at the end of this email to your sky description I believe you will have non zero illuminance for the north facing window. Though you will still need to adjust ambient parameters to suit your model as Lars describes.\n\nBest,\nAndy\n\n### Add the following to the end your sky sky description:\nskyfunc glow skymat\n0\n0\n4 1 1 1 0\n\nskymat source skyball\n0\n0\n4 0 0 1 360\n\n\n\n\nOn Wed, Apr 2, 2014 at 6:07 AM, Vaib <vaibhavjain.co at gmail.com<mailto:vaibhavjain.co at gmail.com>> wrote:\nHello Everyone!\n\nFor my master thesis project, I have conducted an experiment to measure daylighting/lighting illuminance on the last Equinox days in Vienna. The room is a small hall (7mx9m), has white walls/ceilings, and only North facing windows. I have measured reflectivity of all the surface to come closer to the reality.\n\nNow I have to calibrate my simulation model to match its illuminance output with the measured illuminance, for both daylight and artificial light condition.\n\nFor daylight, gendaylit sky model is used (listed below), and all artificials lights are off. For this case, I have tried a number of ambient parameter combinations (listed below), but since all windows are facing North, the simulation model only results in 0 illuminance. When I rotated the North offset, to face windows towards South then I get some illuminance. From this it seems that windows North orientation is the reason behind 0 illuminance. In measurements, these values are approx. 1500 lux.\n\nMy question is: What ambient parameters should be tweaked so that the model behaves reasonably (especially for daylight)?\n\nI am following Dr.John Mardaljevic's PhD for ambient parameters combination. But I don't have much time to do an extensive parametric analysis of these parameters.\n\nGlobal, and Diffuse irradiance (for gendaylit) are taken from weather station in place.\n\nI have tried only rtrace. May be I shall use rsensor now ??\n\nThank you for your time.\n\nBest regards,\nVaib\n\nAmbient parameter combinations:\n1. rtrace -w -as 512 -ar 512 -aa 0.15 -ab 2 -I -h foo.oct | rcalc -e '$1=($1*.265+$2*.67+$3*.065)*179'\n\n2. cat allSens.txt | rtrace -w -ab 7 -ad 2048 -as 32 -I -h foo.oct | rcalc -e '$1=($1*.265+$2*.67+$3*.065)*179'\n\n3. cat allSens.txt | rtrace -w -ab 7 -ad 2048 -ar 2 -aa 0.10 -as 32 -I -h foo.oct | rcalc -e '$1=($1*.265+$2*.67+$3*.065)*179'\n\n4. cat allSens.txt | rtrace -w -ab 7 -ad 2048 -ar 64 -aa 0.15 -as 512 -I -h foo.oct | rcalc -e '$1=($1*.265+$2*.67+$3*.065)*179'\n\nGendaylit model for (12:00 time):\n# xform -rz 30\n# gendaylit 03 22 12:00 -a 48.198724 -o -16.369458 -m -15.00 -W 967.3 187.2\n# Ground ambient level: 33.9\n\nvoid light solar\n0\n0\n3            7791000            7791000            7791000\n\nsolar source sun\n0\n0\n4     0.378842567554    -0.642038575073           0.666532              0.533\n\nvoid brightfunc skyfunc\n6 skybright perezlum.cal -i 1 -rz 30\n0\n10              38.97              29.25          -0.878528          -0.366494          12.997644           -3.44062           0.249106           0.007068\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\n", "replyTo": "Subject: [Radiance-general] Ambient parameters optimization/tweaking", "sender": "Guglielmetti, Robert", "isquestion": false, "tags": [], "id": "<CF61A6F7.5321%robert.guglielmetti@nrel.gov>", "refs": ["<CAD7gt0XsN2Gc5cJykUj0PmOi218pRrMgn0S_okSUcGFocXKzMg@mail.gmail.com>", "<CAOG+NiwEFM=o1cwXtSaTKXXr7uwFdrsj+15kDFtN_Coox3GiWw@mail.gmail.com>"], "datetime": "Wed, 2 Apr 2014 11:47:49 -0600", "email": "Robert.Guglielmetti at nrel.gov", "subject": "[Radiance-general] Ambient parameters optimization/tweaking"}