{"body": "\nHello Radiance community,\n\nMy work partner and I are attempting to run EnergyPlus simulations with\nintegrated daylight and solar heat gain for a dynamic CFS. After some\nprevious discussions it was believed that we would use Radiance for the\ndaylight simulation and then use EnergyPlus' built in\nConstruction:ComplexFenestrationState module to input the BSDF. The\ndaylight would be plugged into the EnergyPlus building model through the\nlighting load schedule. And the ComplexFenestrationState would be\ndynamically changed (using the same control logic) with the EnergyPlus'\nenergy management system (EMS).\n\nRecently we found the presentation from the 2011 International Radiance\nWorkshop by Andy McNeil, \"Using Radiance to Generate Lighting and Solar\nSurface Heat Gain Schedules for EnergyPlus\". The presentation appears to\nuse a different method that is more integrated with Radiance but we're\nnot sure how this is done.\n\ngenBSDF \"change wavelength tag from visible to NIR\":\nHow would one go about running genBSDF for NIR? I read somewhere that\nthe material properties should be changed for NIR, but we're not sure\nhow to do that. Is there a hidden function that can be added to genBSDF\nto run for NIR? Should the two XMLs be integrated or kept separate?\n\nCreating Surface Heat Gain Schedule:\nHow would the radiance results be used to calculate the heat gain on\neach surface? How could this be used to generate a schedule that can be\napplied to EnergyPlus?\n\nUsing Schedules in EnergyPlus:\n\"EnergyPls code modified to allow schedule of surface heat gains\"\n(modification by Thierry Nouidui and Brian Coffey). I was wondering if\nthis has be implemented, if so how? I saw in the EnergyPlus EMS manual\nthat the EMS system can be used to control exterior building variable,\nis this the same system?\n\nSorry for the question overload, I always try to keep it short but there\nis just so much I want to learn.\n\nThank you for your time,\nJustin\n\n\n\n", "replyTo": "", "sender": "Justin Shultz", "isquestion": true, "tags": [], "id": "<53441772.6030802@gmail.com>", "refs": [], "datetime": "Tue, 08 Apr 2014 11:36:18 -0400", "email": "jss5237 at gmail.com", "subject": "[Radiance-general] Using Radiance to Generate Lighting and SolarSurface Heat Gain Schedules for EnergyPlus"}