{"body": "\nGreg-\nThanks for the quick response.  Yes, it all makes sense and works. I was expecting -h to suppress the header rather than not to expect it.\n\nRcollate is still a bit confusing (especially at this lovely hour on the east coast). Is there a quick way I can take the single column of 52560 values (8760hrs * 6pts) and place them in a matrix/array that is 8760 hours long/rows and the data points read across the columns? This would help me import the illuminance profiles into Excel templates I had already created using the 2-phase method. I'm sure I can write a script to clip the files into 8760 rows each then rlam them back together, but if I can just manage it on output from rcollate that would be better/cleaner. I see the note in the man page about it being inflexible - maybe this is the only behavior.\n\nThanks again!\nChris\n\nSent: Wednesday, April 16, 2014 1:15 AM\nTo: Radiance general discussion\nSorry -- this is probably my fault.  To make dctimestep work for multiplying matrices together, I altered it to output a header if and only if there was more than one column being produced.  This is pretty non-standard behavior for a Radiance tool, and wasn't documented by Andy because he wrote the scripts before the change.\n\nThe -h option of rcollate means don't expect a header on input AND don't produce one on output.  To get what you want, you need to take away the -h option to rcollate and/or insert \"getinfo -\" somewhere to strip the header.  This should work for your last command:\n\ndctimestep -n 8760 -if matrices/directsun.dsmx matrices/OakLand_direct_m6.smx | \\\nrcollate -oc 1 | getinfo - > i_ds5ph.txt\n\nOr this:\n\ndctimestep -n 8760 -if matrices/directsun.dsmx matrices/OakLand_direct_m6.smx | \\\n| getinfo - | rcollate -h -oc 1 > i_ds5ph.txt\n\nIf you are OK with having a header in the output, use the first command above without the getinfo call.  Does this make sense?\n\n-Greg\n\n\n\n\n\n\nAll,\n\nI'm having some issues running through Andy's Five-Phase CFS tutorial, specifically the last stages of combining all of the matrices into readable illuminance data. I'm using the bash script that was included in the downloadable files. I can get through section 6.7 without any errors (so it seems). I start to get errors in 6.8 Putting it all together.\n\nThe epw2wea and gendaymtx seem to work just fine. I get errors of \"Incomplete record / unexpected EOF\" when running the dctimestep commands for the base 3-phase and direct 3-phase pieces. I also receive a \"Bad transpose specification - check dimension(s)\" error on output of the direct sun dctimestep. The commands I've executed are as follows:\n\ntime dctimestep -n 8760 -if matrices/viewmatrix.vmx bsdf/fullwindow.xml  \\\nmatrices/daylightmatrix.dmx matrices/OakLand.smx | \\\nrcollate -h -oc 1 > i_3ph.txt\ntime dctimestep -n 8760 -if  matrices/viewmatrix_direct.vmx bsdf/fullwindow.xml  \\\nmatrices/daylightmatrix_direct.dmx matrices/OakLand_direct.smx | \\\nrcollate -h -oc 1 > i_ds3ph.txt\ntime dctimestep -n 8760 -if matrices/directsun.dsmx matrices/OakLand_direct_m6.smx | \\\nrcollate -h -oc 1 > i_ds5ph.txt\n\nHas anyone else run into these errors? I tried to separate dctimestep from piping directly into rcollate to see if I could track down the problem. Seems as if dctimestep creates a file the has a header, then 6 rows of data (corresponding to photocells.pts), with each row containing RGB triplets in floating point format. Counting up columns, looks like there are 8760 triplets. This is what I would expect.\nI then would expect rcollate to transform the matrix and strip off the header (-h). I was expecting the output matrix to be 8760 rows by 6 column, I've tried playing around w/ various -oc -ic -or -ir options in multiple combinations, but keep getting errors.\n\nAny help would be greatly appreciated. I feel like I've managed to understand things to this point and am now getting hung up on some minutia...(such is life w/ Radiance)!\n\nChris\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140416/262041ee/attachment.html>\n\n", "replyTo": "Subject: [Radiance-general] rcollate troubles in Five-Phase CFS tutorial", "sender": "Chris.Coulter at BuroHappold.com", "isquestion": false, "tags": [], "id": "<CBDA7B0F3FC5354F986B71977E204BEC212FD67D@EX-MBX01.burohappold.com>", "refs": ["<CBDA7B0F3FC5354F986B71977E204BEC212FC649@EX-MBX01.burohappold.com>", "<DE9A1AB0-11B5-49B7-B935-311860702D4B@lmi.net>"], "datetime": "April 15, 2014 9:16:25 PM PDT", "email": "Chris Coulter", "subject": "[Radiance-general] rcollate troubles in Five-Phase CFS tutorial"}