{"body": "\nAll,\n\nI?m having some issues running through Andy?s Five-Phase CFS tutorial, specifically the last stages of combining all of the matrices into readable illuminance data. I?m using the bash script that was included in the downloadable files. I can get through section 6.7 without any errors (so it seems). I start to get errors in 6.8 Putting it all together.\n\nThe epw2wea and gendaymtx seem to work just fine. I get errors of ?Incomplete record / unexpected EOF? when running the dctimestep commands for the base 3-phase and direct 3-phase pieces. I also receive a ?Bad transpose specification ? check dimension(s)? error on output of the direct sun dctimestep. The commands I?ve executed are as follows:\n\ntime dctimestep -n 8760 -if matrices/viewmatrix.vmx bsdf/fullwindow.xml  \\\nmatrices/daylightmatrix.dmx matrices/OakLand.smx | \\\nrcollate -h -oc 1 > i_3ph.txt\ntime dctimestep -n 8760 -if  matrices/viewmatrix_direct.vmx bsdf/fullwindow.xml  \\\nmatrices/daylightmatrix_direct.dmx matrices/OakLand_direct.smx | \\\nrcollate -h -oc 1 > i_ds3ph.txt\ntime dctimestep -n 8760 -if matrices/directsun.dsmx matrices/OakLand_direct_m6.smx | \\\nrcollate -h -oc 1 > i_ds5ph.txt\n\nHas anyone else run into these errors? I tried to separate dctimestep from piping directly into rcollate to see if I could track down the problem. Seems as if dctimestep creates a file the has a header, then 6 rows of data (corresponding to photocells.pts), with each row containing RGB triplets in floating point format. Counting up columns, looks like there are 8760 triplets. This is what I would expect.\nI then would expect rcollate to transform the matrix and strip off the header (-h). I was expecting the output matrix to be 8760 rows by 6 column, I?ve tried playing around w/ various ?oc ?ic ?or ?ir options in multiple combinations, but keep getting errors.\n\nAny help would be greatly appreciated. I feel like I?ve managed to understand things to this point and am now getting hung up on some minutia?(such is life w/ Radiance)!\n\nChris\n\nChris Coulter\nSenior Lighting Designer\nBuro Happold Consulting Engineers\n100 Broadway, 23rd Floor\nNew York, NY 10005\nTel: 212.334.2025\nDirect: 212.616.0254\nEmail: chris.coulter at burohappold.com\nWebsite: www.burohappold.com\n\n\nThis transmission is confidential and intended solely for the person or organization to whom it is correctly addressed. If you are not the intended recipient of this transmission, you should not take any action in reliance on it. Further, this transmission may contain confidential design and other information owned by Buro Happold LtdConsulting Engineers, P.C. (?Buro Happold?). You should not copy, distribute, use, offer for sale or hire such information or in any way infringe the design and intellectual property rights of Buro Happold Ltd. It is intended that communication by email from Buro Happold .Ltd or its employees is limited to communications connected to the services provided by Buro Happold Ltd. Buro Happold Ltd accepts no liability for any communications not connected to the services it provides. Computer viruses may be transmitted or downloaded onto your computer system via email communication. It is the recipient?s responsibility to take any action necessary to prevent computer viruses being transmitted in this way. Accordingly, Buro Happold Ltd disclaims all responsibility which arises directly or indirectly from such transmission of computer viruses. Buro Happold Consulting Engineers, P.C.Ltd.. Registered in England: 2049511 New York State, USA. Registered Office: 100 Broadway 23rd Floor, New York, NY 10005. If you receive this message in error, please notify the sender by return e-mail immediately and delete this message, any attachments and all copies from your system.\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140416/080347f5/attachment.html>\n\n", "replyTo": "", "sender": "Chris Coulter", "isquestion": true, "tags": [], "id": "<CBDA7B0F3FC5354F986B71977E204BEC212FC649@EX-MBX01.burohappold.com>", "refs": [], "datetime": "Wed, 16 Apr 2014 04:16:25 +0000", "email": "Chris.Coulter at BuroHappold.com", "subject": "[Radiance-general] rcollate troubles in Five-Phase CFS tutorial"}