{"body": "\nHi Alpana,\n\nTypically, the first day of the workshop is devoted to some form of tutorial, training, or software demo(s). The other days are for presentations by the attendees, on work they've done using Radiance, or tools they've developed that extend Radiance or use it in some way. Rarely has any of the content fit what I would call \"systematic training\", and I don't believe there's enough time in a three day workshop that is 2/3 devoted to user presentations and case studies to really do a top to bottom job of accomplishing such a thing. I will say that the workshops are truly inspiring, and spending three days with the inspiring people tends to spawn all kinds of impromptu meetings and discussions of the educational variety!\n\nWhile it's probably not precisely what you are looking for, I would say that the workshop *is* quite valuable.\n\n-Rob\n\n\n\nRob Guglielmetti\nNREL Commercial Buildings Research Group\nGolden, CO 80401\nrobert.guglielmetti at nrel.gov\n\n-----Original Message-----\nSent: Sunday, May 11, 2014 11:32 AM Mountain Standard Time\nTo: Radiance general discussion\nDear Greg,\n\nHi,\n\nI am a beginner with Radiance and am working with the head release. I teach in a school of Architecture in India. I was looking for a systematic training. Will attending the workshop help me in this regards. I have gone through the basic tutorials on the web, as well as the book Rendering with Radiance. I have also gone through the earlier web uploads of previous workshops.\n\nKindly advise.\n\nAlpana\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140511/0f0dc2bb/attachment.html>\n\n", "replyTo": "", "sender": "alpanadongre at gmail.com>", "isquestion": true, "tags": [], "id": "<FFF56A6D37A3A54F91A03601AC22DA32263FE961DA@MAILBOX2.nrel.gov>", "refs": [], "datetime": "Sun, 11 May 2014 18:08:00 -0600", "email": "Alpana dongre", "subject": "Re: [Radiance-general] Workshop dates discussion"}