{"body": "\nHi Rob and Alexa,\n\nI will follow-on Rob's excellent comments with a few thoughts of my own.\n\nAs  Rob has indicated the \"accuracy\" of a given simulation is highly\ndependent on the accuracy of the input data (geometry, materials and\nlighting). But I think that accuracy also has to be evaluated in terms\nof project scope/objectives. A simulation project early in the design\nprocess will necessarily have less resolved information to work with\n(i.e. decision have not been made on a lot of things), whereas a\nsimulation later in the design process will potentially have a different\ndegree of accuracy due to design decisions at that point.\n\nAnother thing to consider is what is being compared against, while the\nreal world is what we ultimately try to measure against, studying design\nscenarios is another way to use a simulation tool such a radiance. In\ncomparative studies, that is one design scenario to another, most things\ncan be held as constant with a few things varying (geometry, materials,\nor lighting). The question I would be inclined to ask in this case is\nwhether we can make reasonable judgments about design scenarios even\nthough we may not be using the most accurate data (for a variety of\nreasons), for example if we are using a simple sky model (e.g. gensky)\ncan we still make reasonable design judgments. I would suggest that even\nwith unknowns or limited data performing a radiance based simulation is\ngoing to be far more useful from a design evaluation standpoint that\nusing one of the multitude of shrink wrap renderers that are out in the\nmarket.\n\nBest,\n\n-Jack de Valpine\n\n\nRob Guglielmetti wrote:\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20050120/faa20928/attachment.html\n", "replyTo": "Subject: [Radiance-general] Evaluation", "sender": "Jack de Valpine", "isquestion": false, "tags": [], "id": "<41EFF7FE.9090306@visarc.com>", "refs": ["<41EF80A1.6090400@ise.fraunhofer.de>\t<41EF925C.6010306@bradford.ac.uk>", "<38932.209.212.87.250.1106242290.squirrel@209.212.87.250>"], "datetime": "Thu Jan 20 19:27:40 2005", "email": "jedev at visarc.com", "subject": "[Radiance-general] Evaluation"}