{"body": "\nHi Vaib,\n\nDid you ever get this sorted? All I meant by the logarithmic scale is that by using one, you can get more mileage out of the falsecolor mapping, especially for scenes where there is a huge dynamic range, and especially when the gradients are all crammed into one or two small bands of the total DR. You can try it out by adding a \"-log 2\" or \"-log 3\" (whatever decades you need, really, but generally 2 works fine for most scenes) to you falsecolor command.\n\nOn 5/23/14, 12:57 PM, \"Vaib\" <vaibhavjain.co at gmail.com<mailto:vaibhavjain.co at gmail.com>> wrote:\n\nHi Rob,\n\nI missed to mentioned that I tried -s a (auto) also. Also I tried to get the peak value from pextrem. But I got skeptical as these values were about 100 times more (for sunny sky) than what I saw in some research papers; and the image was just one color. :)\n\nThat's why I came back to manually tracing the brightest pixel approach.\n\nCan you please elaborate on the \"log 2\" scale approach ? Thank you for your time!\n\nBEst regards,\nVaib\n\n\n\nOn 23 May 2014 23:56, Guglielmetti, Robert <Robert.Guglielmetti at nrel.gov<mailto:Robert.Guglielmetti at nrel.gov>> wrote:\nHi Vaib,\n\nFalsecolor now has an \"auto\" option to the ?s parameter, which will automatically set the top of the scale to the peak value found in the image. Note the peak value will not necessarily be at the zenith (which, yes, is where the vector 0,0,1 points to in a hemispherical fisheye view).\n\nI also find that for other than overcast skies, using a logarithmic scale (-log 2) is very useful for getting the most value out of a falsecolor representation of a sky's luminous distribution.\n\nOn 5/23/14, 12:14 PM, \"Vaib\" <vaibhavjain.co at gmail.com<mailto:vaibhavjain.co at gmail.com><mailto:vaibhavjain.co at gmail.com<mailto:vaibhavjain.co at gmail.com>>> wrote:\n\nHello Everyone,\n\nI am trying to create falsecolor fish-eye image of just the sky. For that I am using:\n\nrpict -vta -vp 0 0 0 -vd 0 0 1 -vu 0 1 0 -vh 180 -vv 180 sky.oct | falsecolor -s XYZ -l cd/m2 > sky.hdr\n\nDr.Mardaljevic in his dissertation said to set -s argument of falsecolor close to the Zenith luminance, that can be obtained by rvu's trace command.\n\nTo get the Zenith luminance, I am tracing the ray (using rvu) that is approximately at the centre of the image created with the above view parameters, and setting this ray's luminance value as the -s option of falsecolor.\n\nIs this the right way to show/cover the whole luminance spectrum in the sky ? (It doesn't look so in the image..)\n\nOr shall I trace the ray at the apparently at the brightest pixel ? (by reducing the exposure, and figuring out that pixel)\n\nI think the term Zenith Luminance may mean the luminance at the centre of the sky, but I must take your opinion before concluding. Thank you!\n\nBest regards,\nVaib\n\n\n\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n", "replyTo": "Subject: [Radiance-general] Zenith Luminance from rvu", "sender": "Guglielmetti, Robert", "isquestion": false, "tags": [], "id": "<CFAA16AB.8007%robert.guglielmetti@nrel.gov>", "refs": ["<CAD7gt0XcRRJQJAK-uqSVOZNtY3g9LLb-7_Tq2o1_j=NBwWmF8g@mail.gmail.com>", "<CFA4ED75.7EFC%robert.guglielmetti@nrel.gov>", "<CAD7gt0VqHapvkj+u_VVAHCqrG57AM7G+h+5MRyDCU8F_q80-zg@mail.gmail.com>"], "datetime": "Tue, 27 May 2014 10:21:07 -0600", "email": "Robert.Guglielmetti at nrel.gov", "subject": "[Radiance-general] Zenith Luminance from rvu"}