{"body": "\nHi Maria\n\nThanks for giving su2rad a try. I have recently updated the installer\npackage and it's now available as a SketchUp extension as well. It's not\navailable in the Extension Warehouse yet but you can download it here:\n\nhttps://www.dropbox.com/s/pewocv4df0i2i05/su2rad_2014.0.0.rbz\n\nI think that all the features that you require are already in the \"alpha\"\nrelease although they are not fully tested. Now to your questions:\n\n1) *By layer vs. by color vs. by group*: The \"by layer\" mode is useful for\nmodels that have been imported from a CAD application and have the elements\nseparated by layers. You don't need to reorganize your model to separate\nthe model components like floors and walls etc. \"By color\" separates the\nelements based on their SketchUp color or material. You would use this for\nmodels created in SketchUp to separate the building elements for Radiance\nto study for example different wall reflectivity values. Finally the \"by\ngroup\" option keeps the SketchUp scene structure with groups and components\nand translates it to nested *.rad files. This is the most efficient way to\nexport complex scenes that have many detailed components like chairs or\nother furniture. The simplest option is probably \"by color\".\n\n2) You can create a single file by passing the scene *.rad file that is\ncreated for a scene through xform:\n\nxform scene_1.rad > scene_1_expanded.rad\n\n\nXform reads all the referenced files and combines their content into a\nsingle file, including any optional transformations.\n\n3) To create an analysis grid you have to create a layer called \"numeric\".\nThen create a polygon on this layer to represent your work plane (for\nexample copy the floor to the work plane height, then \"shrink\" the boundary\nwith the offset tool and delete the outer ring). Create a group for this\npolygon (or more than one) and give it a name. That's the name the *.pts\nfile will get. During the export this polygon will be exported to a *.pts\nfile with points in the global coordinate system (i.e. suitable to use in\nRadiance). The grid spacing is fixed to 0.25m in x an y and the direction\nof the ray is fixed to (0,0,1).\n\n4) I don't know how you could \"optimize\" the results. You can optimize the\nrendering time but that depends largely on your scene and the purpose of\nyour calculations. You can ask on the Radiance mailing list for\noptimization tips. Please provide details about your scene and your render\nsettings. In terms of modeling you should avoid large differences in scale.\nIf you are modeling an entire building don't go into too much detail, just\nmake holes for the windows and a rough shape for the window frames, but\nnothing too sophisticated. A simple rectangular section will do. Also try\nto model a clean and well structured SketchUp model. It's good to model the\ninterior walls of a room separate from the exterior to avoid any issues\nwith interpolation. To avoid issues with surface materials I would group\nelements with the same material together and apply the color to the group\nand not an individual polygon. That will avoid problems where surfaces can\nhave different front and back materials. Radiance can only use one.\n\nIn general the exporter does not care about the quality of the model. It\nwill take whatever there is in SU and export it to Radiance as accurate as\npossible.\n\nRegards,\nThomas\n\n\n\n\n\n\n\nOn Tue, Jun 10, 2014 at 9:50 AM, Mar?a Beatriz Piderit <mpiderit at ubiobio.cl>\nwrote:\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140610/f0e21d44/attachment.html>\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: Archivo adjunto al mensaje.jpeg\nType: image/jpeg\nSize: 5939 bytes\nDesc: not available\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140610/f0e21d44/attachment.jpeg>\n\n", "replyTo": "Subject: [Radiance-general] su2rad update for SketchUp 2014", "sender": "Thomas Bleicher", "isquestion": false, "tags": [], "id": "<CAKGV-k31-OhaepOA_GXXZ7+2FRFeVLVo5Y=ANP1xmgvxWNcVMQ@mail.gmail.com>", "refs": ["<3B1958D3-F4EB-42F3-9BAA-366095167084@ubiobio.cl>"], "datetime": "Tue, 10 Jun 2014 13:20:25 -0500", "email": "tbleicher at gmail.com", "subject": "[Radiance-general] su2rad update for SketchUp 2014"}