{"refs": [], "id": "<B2E7A4E49B892841A8027F6D196AC6650653AE90@exchange12.utility.pge.com>", "subject": "[Radiance-general] HDR Image Accuracy Problem", "email": "HDF2 at pge.com", "body": "\n\nHello! This is my first post/question...\n\nI have been using Radiance on and off for about a year and a half, and\nnow I am delving into high dynamic range images. I am trying to create\naccurate and precise false color luminance maps from HDR images. I took\na series of pictures each with 5 exposures, and found out quickly that\nwas not enough for what I am trying to accomplish. The luminance values\n(as displayed by photosphere and the false color I created) looked about\nright, with the exception of particularly bright portions of the image,\nwhich were damped by not having enough exposures. The extreme values are\nquite important to me.\n\nI decided to start over, and took 11 exposures of a scene: 5\nunderexposed, 5 overexposed, 1 properly exposed (each a full f-stop\napart) with a Nikon D100. The proper exposure was determined by the\ncamera using matrix metering. The most underexposed image had a small\nportion that seemed to be washed out with white, but I can't take any\nmore underexposed due to my camera (I don't think this is causing my\nproblem, anyway). I created an HDR image using photosphere, and chose\n'save new response' and 'align images', leaving the rest of the fields\nunchecked. Clicked go, and created the hdr image. The image _looks_\ngood, but I think that the values are likely quite a bit off.\n\nI measured several values in the scene with a luminance meter (recently\ncalibrated Minolta LS-110) and all of them are 15-20 times less than the\nvalues suggested by photosphere. The values I was seeing with 5\nexposures were closer to the actual luminance meter values, but I have a\nfeeling now, that was a coincidence.\n\nI will be happy to provide the jpegs and/or the hdr that I created if\nthey will serve to discover my problem.\n\nAny help or insight would be greatly appreciated. Thank you!\n\nHalley Fitzpatrick              [ Program Engineer ]\nThe Pacific Energy Center       [ p. 415 972 5238  ]\n851 Howard Street               [ f. 415 896 1290  ]\nSan Francisco, CA 94103         [ e. hdf2@pge.com  ]\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20050824/813e9025/attachment.htm\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Fitzpatrick, Halley D", "datetime": "Thu Aug 25 03:14:36 2005"}