{"refs": ["<B2E7A4E49B892841A8027F6D196AC6650653AE90@exchange12.utility.pge.com>"], "id": "<430DDB70.6080704@rumblestrip.org>", "subject": "[Radiance-general] HDR Image Accuracy Problem", "email": "pg at rumblestrip.org", "body": "\nFitzpatrick, Halley D wrote:\n\nHi Halley,\n\nDon't know if you remember me, but I met you at AEC a couple months ago\nwhen I interviewed here...\n\nAnyhoo, have you read the photosphere intro?  I know Photosphere is an\nOSX application, but you should download it (from www.anyhere.com)\nanyway just for the \"getting started\" guide. It is an excellent\nreference for, well, getting started with HDR photography.  The first\nthing you need to do is shoot a good scene and use that for capturing\nyour camera response curve.  Come to think of it, what *are* you using\nto create the HDRs?  I highly recommend Greg's Photosphere, or if you\ndon't have a Mac handy, the linux-based hdrgen.  Once you have the\ncamera response saved, you can try to get some more hdr sequences and\ntest the accuracy again.  Bear in mind that really high dynamic range\nscenes are difficult if not impossible to capture in their entirety.  In\nparticular, direct sun is the real challenge.  Also make sure that auto\nwhite balance is switched off, and that you are using aperture priority\nto control the exposures.\n\nThe way to test if you are capturing the entire dynamic range is that\nyour darkest image should have no white pixels, and your brightest image\nshould have no black pixels.  Also bear in mind that if you are\ncomparing luminances at areas of very high contrast, you will also have\ntrouble getting accurate samples from your luminance meter, and thus\nwill have trouble getting numbers to match up.  If you follow the\ngetting started guide, shoot a good scene for the camera response curve,\nand take sufficient images to capture the dynamic range of your scenes,\nyou *can* get accurate HDR images. I've got some crap around here\nsomewhere that shows what happens when you don't take enough shots of\nthe scene, and I also have my calibration image sequence, I just have to\nfind them.  They may be useful to you, so if you want them I'll send\nthem to you (when I find them).\n\nHave fun.\n\n- Rob Guglielmetti\nwww.rumblestrip.org\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] HDR Image Accuracy Problem", "tags": [], "sender": "Rob Guglielmetti", "datetime": "Thu Aug 25 16:54:52 2005"}