{"body": "\n\nOn Jan 6, 2005, at 12:07 PM, Despina Michael wrote:\n\n\nDepends on the camera you use as to which method is easiest.  I use a\nCanon 300D digital SLR with Auto Exposure Bracketing (AEB).  I set a\nfixed aperture and shoot a sequence of three images, one at the base\nshutter speed, one at the shutter speed which produces +1 stop of\nexposure and one that produces an image with -1 stop exposure.  I\nrepeat this process to get the range I'm looking for (say, 7 or 8 stops\nworth.)  I use overlapping exposures so that I can compare the lighting\nconditions in identical exposures to make sure that the light is not\nchanging radically throughout the picture taking process.\n\nI use a fixed aperture so that the Depth of Field does not change\nthroughout the image sequence.  I shoot \"mirror ball\" images and choose\nan aperture and focal length that produce sharp focus of the ball and\nvery blurred focus on the distant background so that the edges of the\nmirror ball are easy to see and define.\n\nFor example:\n\nI would shoot a mirror ball on a stand using my camera fixed to a\ntripod.  I use the timer on my camera to expose the 3 image AEB\nsequence so that the image registration is as close as possible (i.e.,\ni don't touch the shutter release, to minimize camera shake) and also\nso that i do not appear in the images.  I set the desired aperture, say\nf/8 and let the metered exposure tell me which shutter speed\n\"correctly\" exposes the FIRST base image - here let's say it is 1/60\nsecond,\n\nI would then set the AEB for +/- 1 stop, the aperture to f/8 and shoot\nthe following sequence:\n\n1) FIRST base exposure =  @ 1/60, -1 = @1/125 (faster shutter, less\nlight), +1 = @ 1/30 (slower shutter, more light)\n\nthen i would manually reset the shutter speed to 1/15 and shoot\n2) NEXT base exposure = @ 1/15, -1 = @1/30, +1 = @ 1/8\n\nthen set the shutter speed manually to 1/250\n3) NEXT base exposure = @ 1/250, -1 = @1/500, +1 =@1/125\n\netc. to cover the dynamic range you want to expose.  Each image is 1\nstop away from its neighbor.  In this example I have:\n\nMOST EXPOSURE < 1/8, 1/15, 1/30, 1/60, 1/125, 1/250, 1/500 > LEAST\nEXPOSURE\n\nseven exposures worth of images, which may be an acceptable dynamic\nrange for certain lighting conditions.\n\nNotice the \"overlap\" at 1/30 and 1/125 - I would compare the two images\ngenerated at identical exposures to make sure they are not drastically\ndifferent - if they are, that means the lighting is changing and the\nexposures likely are not really 1 stop apart.\n\n\n\nDo a google on these terms or see one of the many sites about basic\nphotographic principles.  These terms are not identical but in general\ndescribe the parameters one may vary to determine how much light hits\nthe film or sensor (exposure).  A \"stop\" is essentially an increment of\nexposure, with successive stops being related by half or twice as much\nlight as its lower or higher neighbor.\n\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: not available\nType: text/enriched\nSize: 7450 bytes\nDesc: not available\nUrl : http://radiance-online.org/pipermail/radiance-general/attachments/20050106/f7b084bf/attachment.bin\n", "replyTo": "Subject: [Radiance-general] Problems using hdrgen for hdri generation", "sender": "Kirk Thibault", "isquestion": false, "tags": [], "id": "<4549EE1D-600D-11D9-BE1E-000A956A0F62@biomechanicsinc.com>", "refs": ["<BAY22-DAV7A0E5D631C9A893588A5990930@phx.gbl>"], "datetime": "Thu Jan  6 19:04:10 2005", "email": "kthibault at biomechanicsinc.com", "subject": "[Radiance-general] Problems using hdrgen for hdri generation"}