{"body": "\nHi,\nhere something:\n\n-1- you need to change time and NOT aperture, since depth of field changes\nwith aperture settings.\n(depth of field could be simply explained as the parameter that indicates\nhow we are able to see more things in focus other than just the foreground)\nfurthermore close apertures eliminate some lens artefacts like coma (light\nsources are elongated when close to the frame of the picture, expensive\nlenses have not this problem though)...\nas a general suggestion for luminance measurement I would recommend to use\nbig F numbers.\n\n-2- aperture=F stop=F number   <> time, exposure time,shutter speed\n\nbasically there is a curtain inside the camera that moves:\nthis is the shutter and takes care of let in the light\n(speed is indicated in seconds and fraction of seconds, 1/60 is 1/60 of\nsecond sometimes it is written as 60)\n\nthere is a diaphragm inside lenses,\nthis close  when the picture is being taken, leaving just an hole in the\nmiddle, the hole dimension is the aperture.\nthe smaller the hole the bigger is aperture number (it's a fraction 1/1.4\n1/2 1/2.8 .... 1/16 1/22 1/32 ... 1/64)\nthe smaller the hole the bigger depth of field\n\n\n\n-3a- 'trouble about HDR patches' doesn't seem to be a problem, it is a\nwarning and results are always fine... sounds like 'warning no light source\nfound' and you are calculating a DF... ;-))\n\n-3b- this happens when images have not enough data to create the camera\ncalibration curves...\nmay be others can explain in depth....\n\n-4- this could be because the images are too different or some exif data are\nmissing (sometimes this happens because the software that imports images\noverwrite exif data)\n\n-5- no idea\n\n-6- I found the same thing, however a good tripod 'fixed' all my problems\n;-))\n\nHope it helps,\ncheers,\npillo\n\n\n\n\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org]On Behalf Of Despina\nMichael\nSent: 06 January 2005 17:08\nTo: radiance-general@radiance-online.org\n\nHi all,\n\nI am a student and I am new to hdri generation or processing so I need your\nhelp:)\n\nI am trying to use hdrgen (for linux) for generating an hdr image from a\nseries of photographs with different exposure each, of a static scene .\nI faced some problems and I have some questions for the whole process..\n\n1) First of all, I would like to know which is the best way to take\nphotographs with different exposure.\nIf I understand correctly there are two ways. Either by changing F-number\nand let fixed the shutter speed or either by varying shutter speed and let\nthe f-number fixed.\nI would like to know witch of two ways is the best?\n\n2) Are \"Lens Aperture\", \"F-number\" and \"F-stop\" same thing?\nAre \"exposure time\" and \"shutter speed\" same thing?\nI know that these questions may seem to be \"stupid\" to most of you.. but as\nI said I am not familiar at all, with all these ..\n\n\nThe following questions are for hdrgen software..\nI used it with different combinations of image...\nSome times the hdr image is generated but it's not clear at all and \"scene\"\nare not aligned... and some other times the hdr image is not generated at\nall..\n\n3) Where is the fault\nwhen there is a warning:  Trouble finding HDR patches***** ?\nwhen ther is a warning: Poor convergence for order 1 fit? (is 1 or any other\nnumber X appear there refers to a problem with the Xth image in command\narguments?)\n\n4) Where is the fault when there is an error:\n\"Cannot solve for response function\" ?\nIs that because it can not generate file for response function of camera,\nwith specific series of photographs?\n\n5) One problem of resulting hdr images (in cases that there was a generation\nof image)\nwas that they were somehow \"green\". What can cause that?\n\n6) My photographs are not perfectly aligned.\nAs I understood, the hdrgen uses an algorithm to align the photographs.\nBut as I noticed when the uses of alighnment algorithm is enable (NOT use of\n-a option) the \"alignment\" getting worst..\nand when I disabled it (Using -a option) the result is better.. but still no\ngood (I guess because that original photographs are not aligned)\n\nIs there anything I can do for that???\nDoes the algorithm has \"limits\" on how much dis-aligned can the original\nimages be?\n\nI would appreciate it if you can answer some (or all;-)  ), of these\nquestions.\nRegards,\nDespina\n\n\n\n___________________________________________________________________\nElectronic mail messages entering and leaving Arup business\nsystems are scanned for acceptability of content and viruses.\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20050106/bb1c7429/attachment-0001.html\n", "replyTo": "", "sender": "radiance-general-bounces@radiance-online.or", "isquestion": true, "tags": [], "id": "<DC0CAEEA090E984C911D3B85B16C3F900302C338@l-gnts05>", "refs": [], "datetime": "Thu Jan  6 18:34:32 2005", "email": "radiance-general-bounces@radiance-online.org", "subject": "[Radiance-general] Problems using hdrgen for hdri generation"}