{"body": "\nThank you very much for your answer Andrew.\nCan you explain me more in detail about the required \"conversion\" for BSDF xml ?\nThank you\n\nJinsook\n\n-----Original Message-----\nTo: \"Radiance general discussion\"&lt;radiance-general at radiance-online.org&gt;;\nCc: \"jinsook kang\"&lt;kjstotoro at naver.com&gt;;\nSent: 2014-08-29 (?) 03:26:22\nWhen dctimestep reads the BSDF xml, there is a conversion required for it to be a true coefficient matrix. If you're giving it a BSDF, I suspect this might be one of the causes of the discrepency you're observing.\n\nAndy\n\nOn Thu, Aug 28, 2014 at 9:39 AM, CHI-German Molina &lt;gmolina at hdlao.com&gt; wrote:\n\n\nJinsook,  DCTIMESTEP does multiply matrices, a pretty naive method, actually. I have no idea what might be causing the dismatch between your results and DCTIMESTEP's.\n\n\nNothing too helpful... sorry. Bye!\n\n2014-08-28 12:27 GMT-04:00 jinsook kang &lt;kjstotoro at naver.com&gt;:\n\n\n\nHi everyone.\nIs there anybody who knows how dctimestep works in three phase method?\n\n\n\nWhen I tried to multiply as a normal matrix (with python language), the illuminance result is not matched with dctimestep result.\nSo, I wonder if dctimestep doesn't use normal matrix multiplication.\n\n\n\nIf there is a specific method in dctimestep, please teach me.\n* let you know,\n\n\n\n1. I picked up one column out of the every RGB(view matrix and daylight matrix), so that I made a simple matrix multiplication.\n2. I created daylight matrix as a ASCII data instead of binary.\nThank you.\n\n\n\nJinsook\n\n_______________________________________________\n\nRadiance-general mailing list\n\nRadiance-general at radiance-online.org\n\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n--\nGerm?n Molina L.\n\n\nIngeniero Trainee\nHunter Douglas Chile S.A.Celular +569 89224445\n\n\n\n\n\n\nNota de Confidencialidad: Este mensaje inclu?do los archivos adjuntos son confidenciales y pueden contener informacion privilegiada protegida por ley. Si Ud. no es el destinatario, deberia abstenerse de copiarlo, distribuirlo, divulgarlo o usar la informacion contenida. Por favor, avise inmediatamente al emisor y borre este mensaje de su sistema. Los mensajes electronicos son susceptibles de ser cambiados, infectados o adulterados sin autorizacion. No asumimos responsabilidad alguna por ninguna clase de cambios o sus consecuencias. Usted debe estar informado que la compania puede hacer un seguimiento de sus mensajes electronicos y su contenido, gracias.\n\n\nConfidentiality Notice: The information contained in this email message, including any attachment, is confidential and is intended only for the person or entity to which it is addressed. If you are neither the intended recipient nor the employee or agent responsible for delivering this message to the intended recipient, you are hereby notified that you may not review, retransmit, convert to hard copy, copy, use or distribute this email message or any attachments to it. If you have received this email in error, please contact the sender immediately and delete this message from any computer or other data bank, Thank you.\n\n\nA informa??o transmitida ? confidencial e para conhecimento exclusivo do destinat?rio. Sua utiliza??o, n?o autorizada, constitui crime pass?vel de pris?o. Todas as precau??es poss?veis foram tomadas para garantir que este e-mail n?o contenha v?rus. Uma vez que nossa empresa n?o pode assumir responsabilidade por nenhuma perda ou dano causado por este e-mail ou de seus anexos, recomendamos que o destinat?rio utilize seus procedimentos de antiv?rus antes de qualquer uso.\n\n\n\n_______________________________________________\n\nRadiance-general mailing list\n\nRadiance-general at radiance-online.org\n\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140901/851cb90c/attachment.html>\n\n", "replyTo": "Subject: [Radiance-general] =?utf-8?q?Three-phase_Method_dctimestep?=", "sender": "\"Andrew McNeil\"&lt;amcneil at lbl.gov&gt", "isquestion": false, "tags": [], "id": "<28d7b74e28cfdda4807fe4c1337dfa9@cweb17.nm.nhnsystem.com>", "refs": ["<569b51d05f7b3e7b2ad6444aaeec9c9@cweb18.nm.nhnsystem.com>", "<CAK+g53DivBrRXQmzm=He3+7E5HO-71A9URvk4D8=ZvMoBuDrEw@mail.gmail.com>", "<CAOG+NixbDh5Wp4j_BD0B7JQa1M5=ZOJLY4nQPuD8fwFmG5=YMw@mail.gmail.com>"], "datetime": "Mon, 1 Sep 2014 19:14:56 +0900 (KST)", "email": "\"Andrew McNeil\"&lt;amcneil at lbl.gov&gt;", "subject": "Re: [Radiance-general] Three-phase Method dctimestep"}