{"body": "\nSuperinitiative Peter! Diana und ich wuenschen Dir ein Frohens Neues Jahr.\nHast Du vor im August nach Montreal zu kommen? Liebe Gruesse,\n\nTito\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of Peter\nApian-Bennewitz\nSent: Friday, December 31, 2004 6:01 PM\nTo: radiance-general@radiance-online.org\nDear coworkers,\n\nhope you all got through the wintertime holiday period well !\n\nThose of you already back at the PC, - you could be the first to try the new\nonline feedback form at\n\nhttp://www.radiance-online.org/survey1/\n\nMy motivation for it was to get more info on the Radiance community,\nespecially from the silent majority of users who read the mailing list, use\nRadiance and may have some views and ideas just below their level of active\nposting to the list.\nE.g.: There's got to be a couple of students at Universities worldwide who\nare confronted with Radiance each course and from which we never hear.\nEspecially when they _don't_ liked it.\nLikewise there are probably consultants using Radiance, whose opinion is\nvaluable and should influence Radiance future.\n\nWhether the idea works out, depends on your input. Which in turn may give\nthe folks at the research labs and universities some indication as to what\nis needed next.\nThe number of questions is kept at a minimum (8) and the answers are\nselectable multiple choice. So the entry is fast and further more, it's\nanonymous.\n\nThe whole thing is planned to be used continuously over the next years,\nrather than being a one-time snapshot. The current state of the survey is\nlisted on a second webpage, so anyone can monitor its progress.\n\nTechnically each entry is stored in a MySQL database, together with a time\nstamp and the client IP number. The latter is handy in case some bored bad\nguy on the Internet floods the entry form, otherwise it won't be made\npublic. The time stamp allows for analysis over the next years, while the\ndatabase structure allows for correlations like \"what do architects see as\nmissing\".\n\na happy start into 2005 to all of you\n\n-Peter Apian-Bennewitz\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n", "replyTo": "", "sender": "radiance-general-bounces@radiance-online.or", "isquestion": true, "tags": [], "id": "<10C94843061E094A98C02EB77CFC328710DE9F80@nrcmrdex1d.imsb.nrc.ca>", "refs": [], "datetime": "Sun Jan  2 19:17:42 2005", "email": "radiance-general-bounces@radiance-online.org", "subject": "[Radiance-general] Radiance feedback-form now online"}