{"refs": ["<43340242.5090500@esru.strath.ac.uk>"], "id": "<69FC71D6-0F7E-4197-AC8C-EB1F4E93133F@gmail.com>", "subject": "[Radiance-general] rtcontrib & daylight coefficients", "email": "gregoryjward at gmail.com", "body": "\nHi Iain,\n\nThanks for giving rtcontrib a try.  Here are some hints for you:\n\n\nYes, I felt some more testing and work was needed on Tregenza.cal and\nits associated support.   It works, but it's a bit painful to use\nright now and I'd like to create some scripts to make it more\nstraightforward, particularly the combining of images at the end.  I\nhave done some experiments to good effect on this already, and when I\ncreate a script it will install Tregenza.cal appropriately.\n\n\nRtcontrib always writes out the earlier bin values starting from 0,\neven if they are all zeroes.  If your sky material covers only the\nupper hemisphere, then yes, your first bin should all be zeroes\nindicating no contribution.  I sometimes employ a script that checks\nfor all zero values and removes such files after rtcontrib has finished.\n\n\nThe different sets are due to the fact that rtcontrib outputs from\nbin 0 to the number of bins actually read from rtrace, and this will\ndepend on the sampling pattern.  If you're only sampling the sky and\nground directly (no geometry to bounce light around), then you may\nonly see some of the bins.  However, I don't know why you would get a\n\"bad expression\" error.  Let me give it a go here.  (Hold on...)\n\nWell, unfortunately for you, it works for me!  This could be a side-\neffect of the bug I discovered earlier this week where rtcontrib\nwasn't writing (or allocating) the last bin, and could be writing\nover unallocated memory.  This has unpredictable consequences, and\nwill depend on your compiler, your machine, what else is running, the\nweather, etc.  Make sure you're using version 1.27 or later of\nrtcontrib.c, which you can get from CVS if you don't have it.  (See\nmy posting earlier this week.)\n\nLet me know if your problems persist.\n-Greg\n\n---------------------\nIce Cream Koan:  If a ice cream drops on the sidewalk, and there is\nno one there to cry, does it melt?\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] rtcontrib & daylight coefficients", "tags": [], "sender": "Greg Ward", "datetime": "Fri Sep 23 19:35:54 2005"}