{"body": "\nHi Axel,\n\nRegarding MGF, I wasn't aware that IES ever gave it's official support to the LUMINOUSGEOMETRY tag, and I don't know of any manufacturer's that included this information.  After working on the format for many months, I was rather disappointed that they declined to use it, so I'd be very happy to know otherwise.  The intent of MGF was to provide detail geometry for the fixture's appearance, but it does not technically interact with the photometry.  That would be handled by \"imposter\" geometry (an illum sphere or similar) enclosing the MGF description.\n\nRegarding your actual problem of representing your luminous geometry as an open cylinder rather than two disks, you will need to do this by hand.  The IES luminaire standard had some odd ways of specifying geometry, involving negative dimensions in the (height,width,depth) fields, and all geometry was assumed to be closed.  The current source.cal file has projection calculations needed to convert candelas (as given in the IES file) to radiance (watts/sr/m^2) as needed for rendering, but only for closed cylinders.  You would have to roll your own if you wanted to remove the end caps to have the correct factors in there.  The current projected area is approximated as:\n\ncylprojection = A2*A3*sqrt(1-Dz*Dz) + PI/4*A2*A2*abs(Dz);\n\nThis is only valid for far-field -- I don't have a local projection factor for cylinders in there, like I do for boxes.  You probably need one in your case, but I'm not sure off-hand how to compute it.  The far-field approximation for just the cylinder section would be the first term, above.\n\nHope this helps!\n\nCheers,\n-Greg\n\n\n++++++\n\n\n-----Original Message-----\n\n\n\n\n", "replyTo": "Subject: [Radiance-general] IES files and MGF geometry", "sender": "Greg Ward", "isquestion": false, "tags": [], "id": "<657090B4-17D9-4B9A-AE76-7B9C69F33ED9@lmi.net>", "refs": ["<CA+dqh63eZpsBikW9kJh4FDv_5QTybPi2z6EQkUecqZLOoKKVvg@mail.gmail.com>", "<D07F80A9.124A6%Robert.Guglielmetti@nrel.gov>", "<CA+dqh61B+CeWTpG7qP2wrNCfzijmBcnCtyYfYTZcYMVdVE99_A@mail.gmail.com>", "<88079A360FAC7441AE93ECBF61998236272B26B7@AMXExMb02.global.arup.com>"], "datetime": "Wed, 5 Nov 2014 08:00:21 -0800", "email": "gregoryjward at gmail.com", "subject": "[Radiance-general] IES files and MGF geometry"}