{"body": "\nFor another datapoint, the Research Support Facility here at NREL is rather well daylit, and is 60' deep, but receives light from the north side as well as the south, in addition to heavy use of daylight redirection from the south. From experience (I've had a desk in the  middle of this building for the last few years), I'd say that the daylight redirection devices provide useful daylight as far back as 35' under ideal conditions, and on average to 25' from the south wall. These devices can also paint the back wall - 60' away from the source - with daylight! While impressive, I still say that *useful* daylight from those things (i.e. horizontal task illuminance >=250 lux) penetrates 35' or so at most; pretty much about as deep as LBNL's new test space (FLEXLAB).\n\nI also like Christoph's idea for a standard office reference model for simulation; liked it the first time when it was called CIE 171:2006, too. ;) In all seriousness, I believe this Reinhart et al. model is a great idea -- especially product comparisons in simulation, across climates.\n\n- Rob\n\nOn 1/22/15, 11:24 AM, \"Andrew McNeil\" <amcneil at lbl.gov<mailto:amcneil at lbl.gov>> wrote:\n\nHi Giuseppe,\n\nAt LBNL we find that our window test bed (10 feet wide by 15 feet deep) isn't deep enough to demonstrate all the full benefits of daylight redirection. In this facility the redirected daylight often hits the back wall.\n\nOur new FLEXLAB (20 feet wide by 30 feet deep) we believe these dimensions are deep enough, but we haven't yet tested daylight redirecting systems in FLEXLAB (coming this spring!).\n\nI like Christoph's suggestion of a standard reference office for testing systems via simulation. And if physical test cells match the dimensions of the simulation standard, all the better. A global network of identical test cells at different institutions would be amazing.\n\nAndy\n\n\nOn Thu, Jan 22, 2015 at 8:36 AM, Christoph Reinhart <tito_ at mit.edu<mailto:tito_ at mit.edu>> wrote:\nHi Giuseppe,\n\nYou might want to have a look at this document http://mit.edu/sustainabledesignlab/projects/ReferenceOffice/index.html which describe a reference office that can be used for the purposes described by you.\n\nBest,\n\nChristoph\n\nSent: Thursday, January 22, 2015 11:28 AM\nTo: Radiance general discussion\nDear experts,\n\nI am involved in the design of an outdoor daylighting test facility.\n\nI am trying to evaluate the minimum depth of the lab in order to be able to study redirecting daylight systems (i.e. light shelves or complex lamella).\nCell height: 2.7 m and cell width: 5.5 m.\n\nOur idea is to cover, let's say, \"90%\" of the applications of these systems.\n\nDo you have experience in that field? Or can you suggest a modeling approach to answer this question?\n\nThank you in advance.\n\nCheers,\nGiuseppe.\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\n", "replyTo": "Subject: [Radiance-general] Depth outdoor daylighting test facility", "sender": "giudm.87 at gmail.com>", "isquestion": false, "tags": [], "id": "<D0E68F2B.1526A%Robert.Guglielmetti@nrel.gov>", "refs": ["<CAOn=hKEa1zntuALKa+mfkP70X1UmMVWw_dvixS85=9XOCptJNQ@mail.gmail.com>", "<1B23446CBF250648A2FC775DE3FE7E80C7191908@OC11expo28.exchange.mit.edu>", "<CAOG+Niyd8Ucnwqw5R_ubKYzGBe5gfDMXC5KSLB4k9y9yRQxYtA@mail.gmail.com>"], "datetime": "Thu, 22 Jan 2015 18:47:58 +0000", "email": "Giuseppe De Michele", "subject": "[Radiance-general] Depth outdoor daylighting test facility"}