{"refs": [], "id": "<s34a47d8.040@wmtao.com>", "subject": "Re: [Radiance-general] mkillum with 400 sources?To: Radiance general discussion <radiance-general@radiance-online.org>", "email": "\"Lars O. Grobe\"", "body": "\nOne small trick I use (during the mkillum source creation) to speed up the process is to exclude interior geometry that does not affect the light coming into the space.  Also, if there is no exterior geometry, I've created arrays of processed illum planes rather than create many identical illums.\n\nHope that helps.\n\nMark\n\nMessage: 2\nMessage-ID: <f8f01cff620221b261a4f8bbb2b90710@gmx.net>\nContent-Type: text/plain; charset=US-ASCII; format=flowed\n\nHello again.\n\nI have to ask this in a more general way. I have used mkillum to add\nsome illum planes in front of the windows of my scene, and sealed the\nsides using zero-radiance illums. I am rendering the illums with -s=8\n-d=8, and in total there are about 400 calculated illums (and many more\nzero-radiance illums).\n\nNow, I am experiencing even slower calculation with rpict. I guess it\nis because of all the illum sources. I think that I can reduce the -ab\nbounces because of the illum useage, which will give faster rendering\ntimes. But still I wonder if there is some kind of a magic limit of the\nnumber of illums to use. I mean, is there a number of illums where\nrendering speed decreases instead of increasing by the useage of the\nmkillum-tool ?\n\nAre there any other ambient-parameters that I can change now that I\nhave illums? I am thinking of ad, ar, aa, as the light environment is\nquite different now?\n\nYou see, I am still quite a beginner in this mkillum stuff, and a bit\nworried. Thanks for any help and hints, CU\n\nLars.\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20051010/e6ec3356/attachment.htm\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "grobe@gmx.net", "datetime": "Sun, 9 Oct 2005 18:22:57 +0200"}