{"refs": ["<3CDA629A.13873.83396C@localhost>"], "id": "<3CDAA563.26962.1881A2A@localhost>", "subject": "[Radiance-general] Too many questions to fit in the s", "email": "adiance-general@radiance-online.org", "body": "\nOn 9 May 2002, at 14:16, Georg Mischler wrote:\n\n\nHi Georg, how ya doin'?  Did you get a chance to see that\nmovie \"Pi\" I was telling you about?\n\nYes, I heeded your advice about SuSE a number of years\nago, and that was indeed the closest I got to really doing\nsomething with Radiance on the PC.  That was the first\ndistro that I got installed and was able to compile\nRadiance.  There were some utilities not working correctly\nthough, and I never got a chance to troubleshoot them,\nbecause about a week after my first radiance compile\nsuccess, a fire broke out in my apartment building.  The\ngood news was the fire did not destroy my apartment;\nthe bad news was, mine was was on the top floor and\nthe fire department cut a cole in my ceiling to vent the\nsmoke.  They cut a 4'x4' hole in the ceiling.  Guess what\nwas under it -- my computer!!  Grrr.  Yes, I had countless\nproblems with Red Hat, and no, I'm not familiar with it.  I\nexpect that soon I will need to go out & buy the latest\nSuSE and try installing it on my PC at home.  The Mac has\nbeen a good jump-starter for me though.\n\n\nInteresting.  Well, since you have confirmed that normals\ndon't matter (except for mkillum), I guess I shouldn't\nworry about it.  I can use that switch to confirm that\nmkillum polygons are correct though.  Thanks.\n\n\nI agree with you.  It is a bit late in the game to fix it at the\nrview stage.  You wouldn't happen to know the name of\nthe lisp utility that comes with DR, that shows normals?  I\nsuppose I could use that too...\n\n\nYes, I have heard of rshow and it looks good.  But as\nsoon as I saw that it was OGL, I assumed I'd need Mesa,\nand compiling, and well you know my experience is not\nquite up to that yet.  Maybe that's a good challenge for\nme though, since Greg already took care of compiling Rad\nfor us OS X users.\n\n\nOK then, my modelling chores are getting easier!\n\n\n\nOK, so validity goes out the window when you map the\npretty pictures.  For serious daylighting analysys I should\nstick to the gensky primitives.\n\nYeah, maybe I need to have a look at your demo.  Since I\ndon't have a Linux system running (yet), what will I be\nmissing by using the NT version?  See, the whole reason\nI'm trying to learn Radiance from the Unix side is because\nI'm amazed by all the scripting possibilities (the time of\nday image sequence in \"Rendering With Radiance\" for\nexample) it affords.  Just wondering if there are things\nthat just aren't possible on the NT side.\n\n\nHmmm.  I was thinking of only using it for importing\nluminaire layouts and lighting analysis points.  In fact, I do\nthis all the time in Lightscape, using their block\nsubstitution routine.   How do you get your luminaires\nfrom AutoCAD into Radiance scene descriptions?\n\n\nI know very little AutoLISP.  But maybe I'll have a look.\n\n\nI figured, I was just wondering if there was a way to\nscript it with the basic package.\n\n\nYes, I saw on their website that there is a tree generator -\n- you sort-of build your own tree by selecting from a menu\nof choices, and then you download a DW file, which can\nthen be exported to Radiance format from DW.  I had DW\nat my old office but found it very buggy, crash-prone.\n\n\n\nHmmm.  I ran it while on battery, and figured the CPU was\nramping down to conserve juice and that that was the\ncause, but I plugged it in and re ran it, and the first three\ncheckpoints were all identical (i.e. same percentage\ncomplete).  It's a small scene and the laptop has 512MB\nof RAM, so I didn't think it could be paging/disk access.\nI'm still not up on all the tweaks one can do in unix to give\njobs priority; perhaps that's the problem.  Dunno.  That's\nwhy I didn't bother to send the timing to Paul Bourke,\nbecause I suspect it's inaccurate (or unfair).\n\n====================\nRob Guglielmetti <rpg777@earthlink.net>\nhttp://home.earthlink.net/~rpg777\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Too many questions to fit in the subject", "tags": [], "sender": "Rob Guglielmetti", "datetime": "Thu, 9 May 2002 16:35:47 -0400"}