{"body": "\nHello,\n\nThank you for your input. I was not aware of the bsdfquery program, I looked in my Radiance/bin folder & couldn't locate this program in my Windows or Linux installs. I'm using Radiance 4.2. Can you please tell me the location of the bsdfquery program?\n\nThank you for explaining the difference between -i & -I rtrace input args. The values L1 and L2 are now equal, and I feel like I have a better understanding of rtrace.\n\nBest Regards,\nAndrei Kolomenski\n\n-----Original Message-----\nSent: Thursday, April 09, 2015 11:45 AM\nTo: Radiance general discussion\nComments inline, but I agree with the general sentiment that it's simpler (and more accurate) to apply genBSDF and other tools already suited to the purpose.  (Note that the \"bsdfquery\" program can be used to extract any desired BSDF angles.)  The genBSDF program employs rcontrib, which is much more powerful (and efficient) than using rtrace.  For single materials with no texture and no geometry, what you are doing should work.\n\n\nYou should actually point the direction vector \"straight up\" along the normal of your surface, not towards the light source.  This is the cause of your discrepancy between L1 and L2.  Illuminance is measured at the surface, and should account for the cosine angle to the light source(s).\n\n\nSee above.  L2 should match L1 when L1's vector matches surface normal, provided your other calculation options match.\n\n\nIlluminance = Irradiance convolved with Vlambda using a peak efficacy of 683 lumens/watt at 555 nm.  Same for luminance and radiance.\n\n\nSince the BRDF is a differential quantity, it can evaluate to greater than 1.0.  Theoretically, it can even be infinite if the surface is purely specular, although the integrated value will be less than 100%\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n", "replyTo": "Subject: [Radiance-general] Rtrace for Radiance & Irradiance Calc.", "sender": "gregoryjward at gmail.com", "isquestion": false, "tags": [], "id": "<AE55A995167B224DBBFA16500E3AB9B3047C1349@NDJSMBX202.ndc.nasa.gov>", "refs": ["<AE55A995167B224DBBFA16500E3AB9B3047C1283@NDJSMBX202.ndc.nasa.gov>", "<783CFECA-A7DF-4A4B-953F-1F2C6FB2AB25@lmi.net>"], "datetime": "Thu, 9 Apr 2015 21:26:06 +0000", "email": "Greg Ward", "subject": "Re: [Radiance-general] Rtrace for Radiance & Irradiance Calc."}