{"body": "\n\n\n\n\n\n\n<http://us10.campaign-archive2.com/?u=a6339f4bf11e3c3b5d88a7911&id=c8f7f9a258&e=e5ecfc4592> View this email in your browser\n\n\n\n\n\n<https://gallery.mailchimp.com/a6339f4bf11e3c3b5d88a7911/images/53057144-6c9e-47e0-a3c9-05809b20c494.jpg>\n\n\n\n\n\n\nDesignBuilder USA training registration underway.\n\n\nDon't miss this opportunity to be trained in the easiest to use/learn, most powerful building energy performance tool available.\n\n\nDesignBuilder is an elegant, seamless integration of building energy performance tools encompassing the totality of building energy use, including whole building energy simulation, daylighting and internal/external CFD (computational fluid dynamics). Suitable for both residential and commercial applications, DesignBuilder was the first graphical user interface (GUI) to EnergyPlus, the 'gold standard' for whole building energy simulation. With more than ten years of development invested, DesignBuilder is the building energy performance tool of choice for today's architects and engineers.\n\nDeveloped to simplify the process of building simulation, DesignBuilder allows you to rapidly compare the function and performance of building designs and deliver early stage thru final results on time and on budget. Unlike other products that generate results that are broad and indefinite, or do not address daylighting or airflow and 3-D temperature distribution data in and around buildings, DesignBuilder provides a total solution with data results you can have complete confidence in.\n\nThe training will be run using version 4 of DesignBuilder and will cover many of the new and enhanced features such as the new geometric modeler with enhanced block geometry editing, the ability to mirror blocks, add individual surfaces, and produce cut-away/section visualizations. Version 4 can produce ASHRAE 90.1 standards compliant baseline models required of various certification and credit programs including LEED, IRS, etc.\n\nThe training is suitable for new and experienced users alike. It is fully modular so that people can attend just one or any number of the days.\n\nThe course is organized so that architects could attend only the first 2-3 days and the last 2 days are specific to engineers. The focus on day 3 is low energy and passive design modelling and it would therefore be valuable for both architects and engineers.\n\nLocations & Dates\n\n*\tDurham, North Carolina; May 11-15, 2015\n*\tSan Francisco, California; September 21-25, 2015\n\nDiscounts are available for students/researchers/faculty and multiple company attendees booking 4 or more days.\n\nSpace is limited so we encourage early registration.\n\n<http://designbuilderusa.us10.list-manage.com/track/click?u=a6339f4bf11e3c3b5d88a7911&id=2bce83479c&e=e5ecfc4592> Additional course information and registration.\n\nAre you designing and modeling net zero buildings? What are you waiting for? DesignBuilder is the best software on the market today for that job!\n\n\n\n\n\nCopyright ? 2015 DesignBuilder USA, All rights reserved.\nYou are receiving this email because you created an account on our website\n\nOur mailing address is:\n\nDesignBuilder USA\n\nPO Box 4477\n\nSanta Rosa, CA 95402\n\n\n<http://designbuilderusa.us10.list-manage.com/vcard?u=a6339f4bf11e3c3b5d88a7911&id=e1c0a16f3a> Add us to your address book\n\n<http://designbuilderusa.us10.list-manage.com/track/open.php?u=a6339f4bf11e3c3b5d88a7911&id=c8f7f9a258&e=e5ecfc4592>\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20150416/5f8b31fa/attachment-0001.html>\n\n", "replyTo": "", "sender": "Christian Stalberg", "isquestion": true, "tags": [], "id": "<37ec01d07862$c912b940$5b382bc0$@naturalintelligence.us>", "refs": [], "datetime": "Thu, 16 Apr 2015 09:31:23 -0700", "email": "christian at naturalintelligence.us", "subject": "[Radiance-general] DesignBuilder training (DesignBuilder usesRadiance)"}