{"body": "\nThanks for your reply. I will try that. Ouhh its very chalenging and dificult also. Hope i can do it.\n\n-----Original Message-----\nSent: ?05/?05/?2015 22:39\nTo: \"Radiance general discussion\" <radiance-general at radiance-online.org>\nHi Christy,\n\n\nThis is a case where you may need to use genBSDF to create a virtual system using your prismatic panel, which can be modeled with the genprism command.  You need to pay careful attention to the man page:\n\n\nhttp://www.radiance-online.org/learning/documentation/manual-pages/pdfs/genprism.pdf\n\n\nIn particular, the direction you extrude the surface determines the orientation of the normals, which matters for the dielectric material type.\n\n\nFollowing genprism, you can use the xform command with a -a option to repeat the extruded prism as many times as needed with the appropriate positioning (-t option).\n\n\nThe genBSDF command can be used with pkgBSDF to place the final system into your scene.\n\n\nYou could also try rendering using the new photon map routines that have been recently added to the Radiance HEAD by Roland Schregle, but this is only if you have the most up-to-date binaries.\n\n\nUnfortunately, none of these steps are simple, and this is a good challenge for an advanced Radiance user.  It would probably take me several hours to do, myself.\n\n\nCheers,\n-Greg\n\n\n\n\nHello,\nI have a question about acrylic materials. i wanna to modelling a trapezoidal shape with acrylic material. I hope Radiance can simulate the behaviour of light direction, such as refraction dan internal reflection.\n\n\n\n\nI have tried to give dielectric material, but failed.\n\nand then i wanna give a prism material, but in prism materials the shape must be a planar shape. but the shape that i want is trapezoidal.\n\nthe image of example room with shading acrylic can be downloaded in https://www.dropbox.com/s/2kswj2ws0x0e6ni/room.jpg?dl=0\n\n\nthe image of shading acrylic that i want can be downloaded in https://www.dropbox.com/s/qk2ozpjktc3k1ol/acrylic%20material.jpg?dl=0\n\n-----------------------------------------------------------\n\nBest Regars,\nChristy Vidiyanti\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20150505/9cf74028/attachment-0001.html>\n\n", "replyTo": "Subject: [Radiance-general] Acrylic Material", "sender": "christy.vidiyanti at gmail.com", "isquestion": false, "tags": [], "id": "<5548e583.c7be440a.44d1.20c0@mx.google.com>", "refs": ["<CABYweP3JgBM6uB3C2EN6m_nBYCk5BzMVOsWsWQ31rxGKqpgPYA@mail.gmail.com>", "<24ADEC44-9588-4E63-92FB-3FC71CB8F8F6@lmi.net>"], "datetime": "Tue, 5 May 2015 22:45:05 +0700", "email": "christy vidiyanti", "subject": "[Radiance-general] Acrylic MaterialDate: May 4, 2015 8:31:57 PM PDT"}