{"body": "\nHi Ikrima,\n\nOne Windows-based user interface that might fit your needs is the Sensor\nPlacement + Optimization Tool (SPOT)\n<http://www.daylightinginnovations.com/spot-home>\n\ndaylighting software.  A new version, SPOT Pro, was just released and is\nnow available for download at the above website.\n\nSPOT Pro provides an interface to Radiance and has the capability to\nperform annual daylighting simulation using BSDF files to describe Complex\nFenestration Systems (CFS) and allowing you to schedule automated and/or\nmanual control of the window treatments.  The SPOT interface allows you to\nbuild simpler orthogonal geometry, assign materials and render or simulate\nthroughout the year.  Importing from sketchup can be done behind the scenes\nand will be available soon.  SPOT also allows for further analysis and\noptimization and photosensor systems in your daylit space if desired.\nCalculation of vertical illuminance grids, or other directional illuminance\npoints, if needed, are not built into the program but can certainly be\ncalculated behind the scenes of a SPOT model without too much command line\ninterface.\n\nThe software is in a final Beta testing stage where we are testing\ndownloads, installation and operation on different machine types, operating\nsystems, and MS Office versions.  If the trial version downloads, installs,\nand starts up on your machine - chances are you are good to go.  If not,\nplease report issues to spot at daylightinginnovations.com.\n\nGood timing for your questions - SPOT Pro was just posted and I was just\nabout to send out such an announcement to the list.\n\nRegards,\nZack\n\nOn Tue, May 12, 2015 at 8:40 AM, Ikrima Amaireh <ezxia at nottingham.ac.uk>\nwrote:\n\n\n\n--\nZack Rogers, P.E., LEED AP BD+C\nDaylighting Innovations, LLC\n808 S. Public Road, Suite 200\nLafayette, CO 80026\n(303)946-2310\n\n\nwww.daylightinginnovations.com\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20150512/3ce4df00/attachment.html>\n\n", "replyTo": "", "sender": "Zack Rogers", "isquestion": true, "tags": [], "id": "<CAAP856zvGniQ_jtBztN7O5jOy12bvp5O+_Fy67zvjRp2cb=RgA@mail.gmail.com>", "refs": [], "datetime": "Tue, 12 May 2015 21:45:42 -0600", "email": "zrogers at daylightinginnovations.com", "subject": "[Radiance-general] Rendering using Radiance_As Beginners - SPOTPro released"}