{"refs": ["<00b601c5d641$a47fe2b0$0100a8c0@mallah>"], "id": "<4358F6C5.2060008@visarc.com>", "subject": "[Radiance-general] Import from Optics5", "email": "jedev at visarc.com", "body": "\nHi Marija,\n\nAlthough Optics5 is a great resource for glazing information. The\nradiance materials that get exported are perhaps too simplistic\ndepending on how they are to be used. The three definitions that are\noutput are 3 options to be chosen from, you do not use them all at the\nsame time.\n\nThe glass definition (GlzSys_glass) really only represents the correct\ntransmittance for the exported glazing system, the front and backside\nreflectance are equal and relatively low, ~7% (I do not remember for\nsure, so Greg will have to provide the authoritative answer on this one).\n\nThe two BRTDfunc definitions are really only useful for the selected\ncondition (eg if you are inside or if you are outside). These two\nmaterials are dependent on the geometry being built with the surface\nnormal pointing the correct way and uniformly for that class of\ngeometry. A simpler way  to combine these two materials into one\ndefinition is as follows:\n\nvoid BRTDfunc GlzSys_front_and_back\n10\nif(Rdot, 0.134, 0.134) if(Rdot, 0.147, 0.147) if(Rdot, 0.147, 0.147)\n0.740 0.803 0.779\n0   0   0\n.\n0\n9 0 0 0 0 0 0 0 0 0\n\nIn the case of your exported example, it looks like the front and\nbackside reflectances are the same. Here is how to interpret this\ndefinition:\n\nvoid BRTDfunc GlzSys_front_and_back\n10\nif(Rdot, <r_front_refl>, <r_back_ref>l) if(Rdot, <g_front_refl>,\n<g_back_refl>) if(Rdot, <b_front_refl>, <b_back_refl>)\n<r_trans> <g_trans> <b_trans>\n0   0   0\n.\n0\n9 0 0 0 0 0 0 0 0 0\n\nThe \"if\" statement determines if the ray hits the front or back of the\ngeometry, if it is positive then it takes the first value, if negative\nit takes the second value. You need to determine what front/back means\nthough (eg front==exterior and back==interior).\n\nNOTE that these BRTDfunc definitions do NOT account for angular\ndependencies of transmittance/reflectance of the material.\n\nAnother options is to take the transmittances and reflectances for the\nvarious surfaces (eg s1 through s4) and use them with the \"glaze\" script\nfound in radiance. This creates a more sophisticated material\nrepresentation for single and double pane type of glazing systems. To do\nthis though you need to export radiance files from Optic5 not for the\nfinal assembly of the glazing system but for the individual sub layers.\n\nRegards,\n\n-Jack de Valpine\n\nMarija Cvetkovic wrote:\n\n\n--\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Import from Optics5", "tags": [], "sender": "Jack de Valpine", "datetime": "Fri Oct 21 16:13:22 2005"}