{"body": "\nHi Andrei,\n\nYour color conversions look mostly correct, except you have the wrong coefficients for the color efficacy at the end.  You used the XYZ coefficients for Green when you actually want the RGB coefficients for Y:\n\n(e_R, e_G, e_B) = (.265 .670 .065)\n\nI don't know if this will make up the difference in appearance, but remember if you are looking at the results on a standard sRGB display that Radiance primaries are slightly different and a color transformation is needed.  If you are using Photosphere, the necessary transform is applied automatically, or you can use the ra_xyze program to get back to an sRGB color space before converting to a standard image format such as TIFF:\n\nra_xyze -r -p .64 .33 .30 .60 .15 .06 .3127 .3290 result.hdr | ra_tiff - result.tif\n\nThe ra_bmp program can perform the conversion directly:\n\nra_bmp -p .64 .33 .30 .60 .15 .06 .3127 .3290 result.hdr result.bmp\n\nAlternatively, you can perform your rendering in the 709 color primary space, avoiding the need to convert back-and-forth.  Some of these alternatives are described in the following paper, which it seems you may have already read:\n\nWard, Greg, Elena Eydelberg-Vileshin, \"Picture Perfect RGB Rendering Using Spectral Prefiltering and Sharp Color Primaries,\" Thirteenth Eurographics Workshop on Rendering (2002), P. Debevec and S. Gibson (Editors), June 2002.\n\nCheers,\n-Greg\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20150609/f3f38809/attachment-0001.html>\n\n", "replyTo": "<AE55A995167B224DBBFA16500E3AB9B3047E09DF@NDJSMBX202.ndc.nasa.gov>", "sender": "Greg Ward", "isquestion": false, "tags": [], "id": "<DB7A168D-DCDB-4A7F-B20B-5EF11A58C48E@lmi.net>", "refs": ["<AE55A995167B224DBBFA16500E3AB9B3047E09DF@NDJSMBX202.ndc.nasa.gov>"], "datetime": "Tue, 9 Jun 2015 14:05:42 -0700", "email": "gregoryjward at gmail.com", "subject": "[Radiance-general] Confirm Procedure to Convert Spectral (SPD)Data to Radiance rgb color triplet"}