{"refs": [], "id": "<08DA0487-2E8C-4E95-B967-E9CEB703D56F@tkh.att.ne.jp>", "subject": "Re: [Radiance-general] rtcontri", "email": "adiance-general-bounces@radiance-online.org", "body": "\nHello Greg,\n\nThank you for your reply. Unfortunately I`m short of time, so if\npossible I would like to see your scripts, thank you.\nI`ve also uploaded a couple of (very noisy) images that I`m getting.\nProbably this is because I`m not using the right scripts, but just as\nan illustration.\nThe images are in:\nhttp://home.att.ne.jp/banana/tiago/radiance/c_79.jpg    (example of\none patch)\nhttp://home.att.ne.jp/banana/tiago/radiance/output.jpg    (result\ncombining all patches)\nRegards,\n\nSantiago\n\n\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org]On Behalf Of\nGregory J.\nWard\nSent: Monday, October 31, 2005 11:59 AM\nTo: Radiance general discussion\n\nHi Santiago,\n\nI wish I could offer you some words of encouragement, because I\nappreciate the difficulty you face applying rtcontrib to daylight\ncoefficients.  The truth is, you really need some scripts to help out\nwith the task, and I haven't yet had a chance to write a general set\nof scripts or an executive program for DC analysis.  I am working on\nthis project currently, as a matter of fact.\n\nAll I have at this point is a few test scripts I assembled for a\ndaylight simulation study, and I can make these available for you if\nyou need an early start on this.  If you can wait a few weeks, I will\nhave something much better, I hope.\n\nJust to answer your question, adding together the rtcontrib outputs\ndirectly gives you the result for a uniform sky.  To get a particular\nsky, you must multiply each image by the average radiance of the\ncorresponding sky patch.  To compute this, a simple rtrace\ncalculation using the desired sky model and a set of randomly\ndistributed rays over the hemisphere will do the trick.  Such a set\nof rays is given in the file \"ray/lib/tregsamp.dat\", where there are\n64 rays per sky patch.  The command to compute pcomb arguments from\nthis file is:\n\nrtrace -h skymodel.oct < tregsamp.dat \\\n| total -64 -m \\\n| rcalc -o '-s ${$2} c_${recno-1}.pic'\n\nI realize this is just a clue, but if you wait a few weeks, hopefully\nI can provide a complete solution.\n\n-Greg\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20051101/09de3686/attachment.html\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "adiance-general-bounces@radiance-online.or", "datetime": "Tue Nov  1 06:35:25 2005"}