{"body": "\nHi all,\n\nI was just writing an reply when David sent his mail...\nSo I just wanna add, that for a full spectral simulation you definitely should add the spectral transmission of the glazing (and also the spectral behaviour of all other materials) and to be sure about the used sun and sky spectrum. In my point of view, the spectral sky model is the largest uncertainty at the moment (besides the general discussion about the c(lambda) itself).\n@Mark and Greg: Did the Utah sky model undergo a validation by the use of spectral and luminance data?  I know that currently TU Berlin is acquiring a huge dataset containing such data in order to develop a spectral sky model.\n\nJan\n\n\n\n\n________________________________\nSent: Thursday, June 25, 2015 9:12 AM\nTo: Radiance general discussion\nHi Parisa,\n\nwhen we worked on the spectral evaluations back then, we were testing our spectral version of Radiance (which is unfortunately based on Radiance 3.8 and has not been updated since then...). Our idea back then was to check whether there are RGB coefficients that provide reasonable results for calculating spectrally weighted values. With the coefficients as given in the paper you can definitely get an estimation, but there are already deviations from the correct spectral calculations if you only look at the light source spectra themselves. This might even get worse if interreflections significantly contribute to the illumination. This is also true for illuminances and color, which in fact are nothing else but special spectral weighting functions (see therefore Greg's paper \"Picture Perfect RGB Rendering Using Spectral Prefiltering and Sharp Color Primaries\" at http://www.anyhere.com/gward/papers/egwr02/index.html or Arne's and mine \"Color-rendering indices in global illumination methods\" at http://dx.doi.org/10.1117/1.3274623)\n\nSo, if you really need to be sure about your values (as far as this is possible within a simulation...), I would always suggest to use spectral rendering and use the c(lambda) weighting function (as also stated in the conclusion of the paper). Following the proposal by Ruppertsberg&Bloj you can just run several 3-channel runs with a recent version of RADIANCE and put them together to you spectral result.\n\nBest,\nDavid\n\n\n\n2015-06-24 19:15 GMT+02:00 Greg Ward <gregoryjward at gmail.com<mailto:gregoryjward at gmail.com>>:\nHi Parisa,\n\nIf you are only comparing one set of C-lambda values to another, then the scaling does not matter.  If, on the other hand, the RGB coefficients from David & Arne's paper were somehow computed to correlate with other aspects of irradiance, such as photopic adaptation, then you probably should use them as given.  I guess I need to read their paper....\n\nA full spectral calculation probably is not needed in this case, but it would help to have a good estimate of the sky color either way.  You should check out Mark Stock's implementation of the Utah sky model using Radiance:\n\nhttp://markjstock.org/radiance\n\nBest,\n-Greg\n\n\n\n\n\nHi Greg and Jan,\n\nThank you for your detailed replies!\n\nHere is my precise application: I want to use Radiance to estimate/simulate the effective irradiance with respect to the C-lambda.\n\nFirst option is to use different (-0.034 IR + 0.323 IG + 0.558 IB) weighting functions for C-lambda as suggested by Geisler-Moroder & Dur (2010) in their paper (entitled ?Estimating melatonin suppression and photosynthesis activity in real-world scenes from computer generated images?). My question is whether using these C-lambda weighting functions is a correct way of getting effective irradiance with respect to C-lambda in W/m2 or not?\n\nSecond option is to use the spectral rendering as suggested by Ruppertsberg & Bloj (2008) in their paper (entitled ?Creating physically accurate visual stimuli for free: Spectral rendering with RADIANCE?) . In this case my question is how can I spectrally model the sky?\n\nCheers,\n\nParisa\n\nOn 22 June 2015 at 23:57, Greg Ward <gregoryjward at gmail.com<mailto:gregoryjward at gmail.com>> wrote:\nIf I may jump in, here...\n\nUltimately the 179 lumens/watt conversion derives from the peak defined efficacy of 683 lumens/watt at 555nm and my particular choice of endpoints for the visible spectrum in integrating an equal energy source.  Since the power-to-photopic conversion is very sensitive to the choice of endpoints (for the very reason that viewers are *not* sensitive to those endpoints), I thought to standardize it at some point and end the confusion.  Divide by 179 going from photometric units and multiply by 179 going to and the two factors cancel, problem solved.\n\nThat said, the factor is somewhat arbitrary and Radiance does not really care what lighting units it works in.  This is why Jan's trick of substituting solar reflectances and solar radiances works just fine.  If you dig through most of the Radiance code, you will find very few references to wavelength, and in the end you can compute in infrared and ultraviolet and nothing will go wrong, so long as you can get by with 3 channels or don't mind doing multiple runs.\n\nThe RGB coefficients for luminance (ignoring the 179 conversion factor) add up to 1.0 again as a convention, but it's a common one for conversion between color spaces.  In this case, we're converting RGB to one channel of CIE XYZ, the Y channel.  The other matrix coefficients can be found in ray/src/cal/cal/xyz_rgb.cal, or ray/src/common/spec_rgb.c if you prefer C code.\n\nIf you would tell us your precise application, what you have as input and what you expect as output, it would help us to better answer your question.\n\nCheers,\n-Greg\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\n--\nDipl.-Ing. Dr. David Geisler-Moroder\nHofwaldweg 14/20\n6020 Innsbruck\nAustria\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20150625/718291cf/attachment.html>\n\n", "replyTo": "<CAL-bo5FsEjAtJZMMX06uJMhaBBexJN4B=DV-irDxSieUJWbD0Q@mail.gmail.com>", "sender": "p.khademagha at gmail.com", "isquestion": false, "tags": [], "id": "<268DFF6716487845B5DE11F03099A8EE61A527CC@REXME.intranet.epfl.ch>", "refs": ["<CAPysv6D_mcUiAH8xXWcZkEKrnnd+F-5EB4XLmaZZ86i24tx_2A@mail.gmail.com>", "<D1AD8C3F.1A632%Robert.Guglielmetti@nrel.gov>", "<91E74B04-4F27-49F7-81EB-BF45AB5BFE9F@gmail.com>", "<CF0B4046-DA6E-482B-8BB0-19F64EA4D069@lmi.net>", "<CAPysv6D4ruQ6x1FHvHZ6q-dFVwpzikMVLsMyF85wgJWEQeRGQA@mail.gmail.com>", "<9181524C-52E9-4130-AA55-E86077CC97C1@lmi.net>,", "<CAL-bo5FsEjAtJZMMX06uJMhaBBexJN4B=DV-irDxSieUJWbD0Q@mail.gmail.com>"], "datetime": "June 24, 2015 6:04:12 AM PDT", "email": "parisa khademagha", "subject": "Re: [Radiance-general] Weighting factors used in the irradiance calculation"}