{"body": "\nDear List,\n\nIt was kind of Lars to forward the message to the list and here are the details and requirements for the position.\n\nWe are looking for a young talent individual to join our London based team as Lighting Specialist in the Specialist Modelling Group (SMG) at Foster and Partners. A solid knowledge of lighting and daylighting simulation techniques is required for this position and you will be involved in a number of world class projects .\nSMG is a very creative and interdisciplinary team, which forms the core of R&D at Foster and Partners and that drives innovation on a number of high profile and unconventional projects. Our work constantly challenges the boundaries between architectural and engineering disciplines, striving for the achievement of tightly integrated, high performance building designs.\nOur work includes projects of all scales from luminaire design to daylight availability assessment at a master planning scale, through lighting and daylighting assessment and design for a number of building typologies.\n\nDetailed description for this position as below:\n\nRole Definition\n\nJob Title:              Lighting Specialist\nReporting to:     Head of Specialist Modelling Group (SMG) on a day to day basis and ultimately to the Senior Partner\nObjective:           To assist on the Practice?s environmental simulation and analysis work with a strong focus on the assessment and development of lighting and daylighting aspects of a project, balancing the aesthetic and technical requirements.\n\nResponsibilities:\n?             Conduct research and simulation on the solar, daylight and artificial light aspects of building design\n?             Advice and support design teams in the lighting design concepts and assessment of building performances, striving for the achievement of tightly integrated, high performance building designs\n?             Support design teams in the use of environmental simulation tools\n?             Device methodologies for analysis and visualisation of specific environmental design problems\n?             Liaise with the other members of the Specialist Modelling Group towards the integration of environmental parameters on the generation of architectural form\n?             Analyse and recommend environmental design strategies for individual projects\n?             Thorough knowledge of and compliance with Foster + Partners procedures and standards\n?             Contribute, or otherwise assist, as required\n\nGeneral Requirements:\n?             A solid knowledge of lighting and daylighting simulation techniques\n?             Degree in Architecture or Engineering disciplines\n?             Ability to understand and formulate design decisions and present them for discussion\n?             Ability to use a variety of media in the development and documentation of a design project\n?             Good interpersonal skills and the ability to work well in a team\n?             Ability to take initiative in response to direction or instruction\n?             Ability to work well under pressure and meet deadlines efficiently\n?             A ?exible and open attitude towards new ways of working and commitment to independent, lifelong learning\n?             Fluent English, written and spoken\n\nSoftware Requirements:\n?             Advanced knowledge of Radiance and/or other lighting simulation tool\n?             Proficiency in Rhinoceros and/or Microstation\n?             Adobe Creative Suite\n?             Ms Office\n?             Scripting abilities a plus\n\nIf you are interested, please send me your C.V. and portfolio of works. For large portfolios (above 3MB) please send a link from a web based service as they could otherwise be blocked by the mailing system.\n\nBest regards,\n\nXiaoming Yang\nEnvironmental Analyst\n\nFoster + Partners\nRiverside, 22 Hester Road\nLondon\nSW11 4AN\nT +44 (0)20 7738 0455\nD +44 (0)20 3147 5401\nF +44 (0)20 7738 1107\nE: xiyang at fosterandpartners.com<mailto:xiyang at fosterandpartners.com>\nW: www.fosterandpartners.com<http://www.fosterandpartners.com/>\n\n\n\nSent: 19 June 2015 22:02\nTo: Randolph M. Fritz; Xiaoming Yang\nHi Randolph, hi Xiaoming,\n\nI am sorry but I did not get the attachments neither ;) Xiaoming, could you please provide some details?\n\nCheers,\nLars.\n\n\"The general requirements for this position is attached.\"\n\nPlease, would you forward the attachment? I'm going to write Mr. Yang, but just in case.\n\n--\nRandolph M. Fritz, Lighting Design and Simulation\n+1 206 390 4477 || rmfritz3 at gmail.com<mailto:rmfritz3 at panix.com>\n\n\n\nFoster + Partners is the trading name of Foster + Partners Limited, a limited liability company registered in England and Wales with number 01644989, and is part of the international practice Foster + Partners which operates worldwide through a number of separate legal entities. Please contact info at fosterandpartners.com for further information.\n\nThis email is confidential. If you are not the intended recipient, please do not copy or disclose its content but contact the sender immediately upon receipt.\n\n? Foster + Partners. All rights reserved.\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20150622/a6aa1f58/attachment-0001.html>\n\n", "replyTo": "", "sender": "grobe at gmx.net", "isquestion": true, "tags": [], "id": "<DB4PR02MB035156F562921C69F010248CDAA10@DB4PR02MB0351.eurprd02.prod.outlook.com>", "refs": ["<CANeAMo+on21cvZkuvr+4y7N9mb496wDQ+tCMUCEwDFrPtHDMsg@mail.gmail.com>", "<58E2DDC3-638E-46CD-A613-5C80971E6345@gmx.net>"], "datetime": "Mon, 22 Jun 2015 11:01:21 +0000", "email": "Lars O. Grobe", "subject": "Re: [Radiance-general] Position open for daylighting simulation expert"}