{"body": "\nHi Axel,\n\nI have tried to boot from UBUNTU DVD but cannot manage to install radiance yet? do you have any advices please?\n\nRegards\nIkrima\n\n\n\n\n-----Original Message-----\nSent: 16 June 2015 23:01\nTo: radiance-general at radiance-online.org\nSend Radiance-general mailing list submissions to\nradiance-general at radiance-online.org\n\nTo subscribe or unsubscribe via the World Wide Web, visit\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\nor, via email, send a message with subject or body 'help' to\nradiance-general-request at radiance-online.org\n\nYou can reach the person managing the list at\nradiance-general-owner at radiance-online.org\n\nWhen replying, please edit your Subject line so it is more specific than \"Re: Contents of Radiance-general digest...\"\n\n\nToday's Topics:\n\n1. Re: Errors while transposing with Rcollate. (Greg Ward)\n2. Re: learnix installation (Axel Jacobs)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nTo: Radiance general discussion <radiance-general at radiance-online.org>\nContent-Type: text/plain; charset=\"windows-1252\"\n\nWell, that was quicker than expected.  Just after sending this e-mail, Sarith wrote again and the problem seems to be resolved.  He had an old version of rcollate that didn't work when stdin was redirected from a file, but the latest works in that mode with -t but not from a file under Windows.  This was easy enough to fix, and the next NREL release should behave properly.  Meanwhile, Windows folks may have to redirect the input when transposing ASCII files with rcollate.\n\nA tempest in a teacup, really....\n\nCheers,\n-Greg\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20150616/846a1090/attachment-0001.html>\n\n------------------------------\n\nMessage: 2\nTo: radiance-general at radiance-online.org\nContent-Type: text/plain; charset=windows-1252; format=flowed\n\nHi Ikrima,\n\nI'm afraid LEARNIX is no longer maintained.  You can still download the ISO image from here: http://www.jaloxa.eu/mirrors/learnix/index.shtml\nbut be aware that the latest release is from 2011.\n\nChances are that if you run it on hardware later than 2011, you will get problems, which are most likely to show up with weird display issues, or networking hardware not working.\n\nTo add insult to injury, the copy of Radiance that comes with this old LEARNIX CD-ROM is from, well... 2011.\n\nYou are much better off trying out a bootable UBUNTU CD-ROM or DVD.  If you read the 'Running LEARNIX' PDF, available under 'Documentation', you'll find a number of different ways of running LINUX alongside or within Windows.\n\nInstalling Radiance from the standard Debian or Ubuntu repositories is fairly straight-forward.\n\nHope you will succeed with you endeavour.\n\nBest\n\nAxel\n\n\nOn 16/06/15 17:32, Ikrima Amaireh wrote:\n\n\n\n\n------------------------------\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\nEnd of Radiance-general Digest, Vol 136, Issue 22\n*************************************************\n\n\n\n\nThis message and any attachment are intended solely for the addressee\nand may contain confidential information. If you have received this\nmessage in error, please send it back to me, and immediately delete it.\n\nPlease do not use, copy or disclose the information contained in this\nmessage or in any attachment.  Any views or opinions expressed by the\nauthor of this email do not necessarily reflect the views of the\nUniversity of Nottingham.\n\nThis message has been checked for viruses but the contents of an\nattachment may still contain software viruses which could damage your\ncomputer system, you are advised to perform your own checks. Email\ncommunications with the University of Nottingham may be monitored as\npermitted by UK legislation.\n\n\n\n", "replyTo": "Subject: [Radiance-general] Radiance-general Digest, Vol 136, Issue 22", "sender": "jacobs.axel at gmail.com", "isquestion": false, "tags": [], "id": "<55809C93.6080900 at gmail.com>", "refs": ["<mailman.117.1434492063.6973.radiance-general@radiance-online.org>"], "datetime": "Tue, 16 Jun 2015 23:00:51 +0100", "email": "Axel Jacobs", "subject": "Re: [Radiance-general] learnix installation"}