{"body": "\nHi Chris,\n\nVersion 4.2.2 is tagged as the \"latest release\" because it's the latest\n*official* release. It's unfortunate wording, I suppose, but that's always\nthe way GitHub rolls. Indeed, there have been 144 commits as of this\nwriting since the official release:\n\nhttps://github.com/NREL/Radiance/releases/tag/4.2.2\n\n\nSo, yeah, ya probably want something fresher. =/ The latest builds, from\nany source, will generally be based on what is technically alpha code\n(hence the current 5.0.a releases); the Radiance source tree is never\ntagged as beta for more than a day or so, and again when it's at \"official\nrelease\" status, then it's back to \"alpha\" status. At NREL we append a\nnumber after the code status (e.g. 5.0.a.1) when we tag for our alpha/beta\nrelease packages, just to keep everything straight.\n\nRadiance was incremented to version 5.0 recently in light of some major\nfeature inclusions such as the photon map, but there was never an official\nblessing, so the latest \"official release\" remains the patched 4.2.2. But\nfor sure, v5.0 has some nice features, and Windows support caught up to\nthem ? and 64-bit support was (finally) added ? in the last month or so.\nNREL will be releasing another round of 5.0 packages soon in light of a\nbug fix that was checked in the other day which may affect more than a\ncouple of users:\n\nhttps://github.com/NREL/Radiance/commit/aa4541445b3988563331067f6b6e643bd73\n33466\n\n\nAs we do not have automated builds set up (yet), we try and just roll out\nnew packages as-needed. For now, the version most Radiance users will want\nis 5.0.a.3:\n\nhttps://github.com/NREL/Radiance/releases/tag/5.0.a.3\n\n\n?5.0.a.4 to follow RealSoonNow.\n\n- Rob\n\nOn 6/17/15, 7:13 AM, \"Christopher Rush\" <Christopher.Rush at arup.com> wrote:\n\n\n\n", "replyTo": "", "sender": "Guglielmetti, Robert", "isquestion": true, "tags": [], "id": "<D1A73905.1A4C6%Robert.Guglielmetti@nrel.gov>", "refs": [], "datetime": "Wed, 17 Jun 2015 21:13:38 +0000", "email": "Robert.Guglielmetti at nrel.gov", "subject": "[Radiance-general] Radiance Versioning (WAS: Re: learnixinstallation)"}