{"body": "\nHi G. Larrain,\n\nThanks for your detailed clarification (below).\n\nI wonder if you kindly can help me toward better understanding and answering the following:\n\nWe agreed that for daylight modelling of spaces with CFS, Radiance is a suitable tool as it applies ray-tracing method. And for annual and/or climate-based daylight calculations, as calculation time becomes a critical factor, using BSDF data for CFS is highly recommended to tackle the task with radiance (using phases methods). However:\n\n- if someone needs to perform daylight calculations for given space with different CFS (different cases for comparison purposes) to get illumination levels for horizontal grid points (and not pictures nor scenes), is Radiance still the most convenient option?\n- is it still needed to use any of the phase methods (2, 3 or 5)?\n- most importantly, is it still needed to get BSDF data for CFS or just can model the detailed CFS in Radiance (and, if yes, how?)\n\n\nMany thanks for your kind help :)\n\nRegards\nIkrima\n\n\n\"Ikrima,\n\nI am going to try to build the puzzle of CFS, Phases, BSDF and calculations.... at least the way I understand it.\n\n*CFS* are those systems that, via interreflection or other light transport phenomena, redirect light (or solar radiation). Thus, in order to get a reliable result you will have to consider all the phenomena involved.\nThen, *common\nsimple performance indexes*, such as the miss-used Shading Coefficient and the Aperture Percentage, *always loose a lot of information, trying to reduce all the complex behavior of a CFS to one single number*. We all know that venetian blinds are more \"transparent\" from certain viewing directions than from others, but these performance indexes do not tell you that.\n\nNow... Radiance can certainly perform calculations of spaces with CFS using its \"common\" Ray-tracing. However, this may be slow for some purposes (i.e.\nannual simulations and climate-based daylight modelling), and *this is why 2, 3 and 5 phase methods have been developed*. The *BSDF* representation, I would say, goes in the same direction... It allow summarizing all the bounces, reflections, refractions, etc.  that occure withing the CFS in a single matrix or tensor.* By using BSDFs*, Radiance itself and other tools (i.e. EnergyPlus) can treat CFS as blackboxes, avoiding all the opcits within the system. A BSDF that uses the Klems Full representation has\n21,045 numbers (instead of one, such as the Shading Coefficient).\n\nBeing said all that, I would not trust a calculation method unless it can actually deal with the optics of a CFS that is drawn and/or it can use BSDF (or similar) information.\n\nLets remember that a perforated screen, a venetian blind, a light diffusing device can all have a Shading Coefficient of 50%, but all of them will behave very differently. I made some presentations about this on my previous work (we sold complex Shading Devices), trying to promote the use of BSDF in EnergyPlus calculations... the differences (in solar heat gains) were more than considerable.\n\nI hope that someone else gives us his/her perspective on this topic...\nthere are a lot of concepts that I might be misunderstanding.\n\nBest!\"\n\n\n\n\nThis message and any attachment are intended solely for the addressee\nand may contain confidential information. If you have received this\nmessage in error, please send it back to me, and immediately delete it.\n\nPlease do not use, copy or disclose the information contained in this\nmessage or in any attachment.  Any views or opinions expressed by the\nauthor of this email do not necessarily reflect the views of the\nUniversity of Nottingham.\n\nThis message has been checked for viruses but the contents of an\nattachment may still contain software viruses which could damage your\ncomputer system, you are advised to perform your own checks. Email\ncommunications with the University of Nottingham may be monitored as\npermitted by UK legislation.\n\n\n\n", "replyTo": "", "sender": "Ikrima Amaireh", "isquestion": true, "tags": [], "id": "<D697763F9F216044A99BC674C00561961358CA9710@EXCHANGE1.ad.nottingham.ac.uk>", "refs": [], "datetime": "Thu, 9 Jul 2015 17:26:29 +0100", "email": "ezxia at nottingham.ac.uk", "subject": "[Radiance-general] CFS with Radiance"}