{"body": "\nHi Robert,\n\nMy PC is running on Windows 7 Enterprise.\nInitially, I installed Radiance for Window using its installer but I found that most of the tutorials are provided for pc with Linux and/or Linux-like operating systems; So I had to install try learnix (that did not work) and Ubuntu (also did not work)!\nFinally, I tried to use Cygwin to run Radiance on Window OS. I could install Cygwin (works fine), Xming (not sure if working) and Radiance (not all its programs are working!).\n\nI'm a bit confused as I'm not sure if running Radiance on windows using Cygwin will be enough for carrying my work. For example, can I work out phases methods and generate BSDF data?\n\nI wish if you can help me to do that.\n\nMany thanks\nikrima\n\n\n\n------------------------------\n\nMessage: 3\nTo: \"radiance-general at radiance-online.org\"\n<radiance-general at radiance-online.org>\nContent-Type: text/plain; charset=\"us-ascii\"\n\nHi Ikrima,\n\nWe'll need a bit more info, here. What OS are you on? How are you attempting to install it (using an installer, compiling from source, or what)? What happens when you try??\n\nOn 7/9/15, 10:38 AM, \"Ikrima Amaireh\" <ezxia at nottingham.ac.uk> wrote:\n\n\n\n\n\nThis message and any attachment are intended solely for the addressee\nand may contain confidential information. If you have received this\nmessage in error, please send it back to me, and immediately delete it.\n\nPlease do not use, copy or disclose the information contained in this\nmessage or in any attachment.  Any views or opinions expressed by the\nauthor of this email do not necessarily reflect the views of the\nUniversity of Nottingham.\n\nThis message has been checked for viruses but the contents of an\nattachment may still contain software viruses which could damage your\ncomputer system, you are advised to perform your own checks. Email\ncommunications with the University of Nottingham may be monitored as\npermitted by UK legislation.\n\n\n\n", "replyTo": "Subject: [Radiance-general] Radiance-general Digest, Vol 137, Issue 8", "sender": "Robert.Guglielmetti at nrel.gov", "isquestion": false, "tags": [], "id": "<D1C400AC.1ADAC%Robert.Guglielmetti at nrel.gov>", "refs": ["<mailman.203.1436468180.6973.radiance-general@radiance-online.org>"], "datetime": "Thu, 9 Jul 2015 16:44:49 +0000", "email": "\"Guglielmetti, Robert\"", "subject": "Re: [Radiance-general] Could not install Radiance!!!"}