{"refs": [], "id": "", "subject": "[Radiance-general] Too many questions to fit in the sReferences: <Pine.BSF.4.30.0205091411570.21119-100000@emancholl.pair.com>", "email": "adiance-general@radiance-online.org", "body": "Message-ID: <3CDC2108.10E7A240@kurt-altmann.de>\n\n\nGeorg Mischler wrote:\n\nHi all,\n\nI also spent some time on tests on the export of blocks from AutoCAD to\ninstances in Radiance.\nAt least it's working in a more or less rough manner (even with nested\nblocks).\nBeside the consistency problems Georg already mentioned, problems arose\nconcerning the paths\n(to texture files or IES-data) and the shape of the octree hierarchy.\nEspecially thin long Objects, like railings, or flat Objects, like\nleafs, produce the biggest problems.\nI had to reorganize the blocks to get the expected savings in memory and\nfile sizes (which could be enormous, of course).\nIn other words - I must create the geometry in terms Radiance likes it\nmost - which isn't always the most efficient way to build 3D-Modells.\nAs I understood, the octree is based on cubes. Looking at a leaf\nparallel to the xy-plane inside a cube, there is a lot of 'emptiness'\ninside this cube. The cubes of other nearby leaves are interconnected\nwhich often result in an error by oconv.\nAs a result I have to reorganize the blocks or increase the n-parameter\ndramatically.\nFor these problems it could help a lot, if the 'cage' around objects\ncould be handled in a more relaxed way, i.e. in terms of a real bounding\nbox.\nAre there any thoughts done already in that direction? Could it be a\nfeature for the future?\nOr is it impossible due to the existing octree organization?\nAny comments are welcome.\n\nKurt\n\n________________________________________\n\nKurt Altmann\nSophienstr. 114a\n76135 Karlsruhe\nGermany\nTEL     +49 (0)721 3849730\nFAX     +49 (0)721 3849735\nEMAIL   mail@kurt-altmann.de\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Kurt Altmann", "datetime": "Fri, 10 May 2002 21:35:36 +0200"}