{"body": "\nUrtza,\n\n*Regarding question 1.*\n\nThe CIE Overcast sky is simetric and independent of the date and location.\nThat means that it does not matter if you rotate your model and the sky or\nchange the location and the date, it will always return the same vector\nwhen fed into genskyvec.\n\nGenskyvec approximate the sky as \"finite elements\" of constant Radiance. I\nunderstand this is done using Ray-tracing. That means that each patch\n(element of the sky vector) will have a different value that correspond to\nthis approximation.\n\nFinally, the sky vector does not depend on the model just as the sun's\nposition does not depend on the orientation of your apartment. However, I\nunderstand it is possible to calculate a rotated sky vector. This is faster\nthan performing all calculations again with a rotated model (i.e. if you\nrotate the sky clockwise, it is the same as rotating the model counter\nclock wise).\n\n\n\n\n*Regarding question 2.*\nKlems divition is always the same divition. However, the direction used to\ntrace rays (for sampling and calculating the View matrix) will depend on\nthe orientation of the window. This is the same as saying that the same\ncamera will give you different images if pointing on different directions.\n\n\nI hope I understood your questions and that my answers help\n\nBest,\n\nGerm?n\n\n2015-07-03 6:44 GMT-03:00 <urtza.uriarte at upc.edu>:\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20150703/c4e0eddb/attachment.html>\n\n", "replyTo": "<20150703114408.Horde.Vfppc_0JoTKRKMl7Os3ii_w@correu.upc.edu>", "sender": "=?UTF-8?Q?Germ=C3=A1n_Molina_Larrain?=", "isquestion": false, "tags": [], "id": "<CAF-iH4+moBFgnAhfTs9f1HvurqUzFMGbWrWOnd6MwH2u2qovsA@mail.gmail.com>", "refs": ["<20150703114408.Horde.Vfppc_0JoTKRKMl7Os3ii_w@correu.upc.edu>"], "datetime": "Fri, 3 Jul 2015 14:16:42 -0300", "email": "germolinal at gmail.com", "subject": "[Radiance-general] Three-Phase Method _ Sky Vector - DaylightMatrix"}