{"body": "\nSomeone with better understanding of the math of it might hopefully chime in, but my understanding has been that the phrase \"and approximately represents the error that is associated with it\" - which I think is from the manual page - may cause some undue concern. Similar to recommendations for setting the other parameters, if you want test for stable results, instead of jumping from 0.2 all the way to the extreme 0.01, you might try 0.15, 0.125, 0.1, 0.075 until you don't notice any difference in your results from one to the next. I think you mentioned testing various values for -aa, and what change in results did you see? -aa will sometimes have a stronger impact on rendering time than it does on your results depending on the geometric scale of pixels/points you're trying to discern accurately from your image.\n\nA second note, if you're running -aa 0 you probably want -ps 1 and you want to render an image several times larger than your intended result and filter it down to reduce noise. I'm not sure of the numerical accuracy of this technique but I think this is the usual recommendation. If you were using rtrace for point calculations I suppose the noise introduced in -aa 0 is more visual and should be averaged out in the contributions as measured at the point (if I'm thinking about it clearly), but maybe not if using rtrace without the -I parameter?\n\nHopefully I'm not oversimplifying, and I make my comments hoping someone will correct my misunderstandings and further expand on it.\n\n-Chris\n\nSent: Thursday, August 06, 2015 10:35 AM\nTo: Radiance-general at radiance-online.org\nHello Radiance Community,\n\nThe -aa input argument to rpict controls the ambient accuracy of the rendering and approximately represents the error that is associated with it. I ran some tests varying the -aa parameter while holding all other input parameters constant. To my surprise, the execution of a rendering with -aa 0 took 1.6 hours and the a rendering with -aa 0.01 has taken 15 hours and has only finished 28%.\n\nWhat is considered to be the most accurate rendering? One with no ambient interpolation (-aa 0) or a low error interpolation (-aa 0.01) ?\n\nOverall, what rpict input parameters that will produce the most accurate rendering? Currently, I'm using the following parameter settings, for my \"truth\" renderings that I'm assuming are as accurate as reasonably possible.\n\nGeneral Parameters: -lr 9 -lw 0.0005 -ps 4 -pt 0.05\nSpecular Parameters: -ss 2 -st 0 -as 256\nDirect Parameters: -dr 3 -dp 1024 -ds 0 -dt 0 -dc 1\nAmbient Parameters: -ab 11 -aa 0 -ar 256 -ad 2048\n\nPlease let me know if you think I'm missing some important parameters that affect the rendering accuracy.\n\nThank you for your input,\nAndrei Kolomenski\n\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20150806/3d57e14e/attachment.html>\n\n", "replyTo": "<AE55A995167B224DBBFA16500E3AB9B304802754@NDJSMBX202.ndc.nasa.gov>", "sender": "JSC-SF311", "isquestion": false, "tags": [], "id": "<88079A360FAC7441AE93ECBF61998236274596E6@AMXExMb02.global.arup.com>", "refs": ["<AE55A995167B224DBBFA16500E3AB9B304802754@NDJSMBX202.ndc.nasa.gov>"], "datetime": "Thu, 6 Aug 2015 15:12:46 +0000", "email": "Kolomenski, Andrei", "subject": "[Radiance-general] Effect of -aa parameter on Rpict Rendering Accuracy"}