{"body": "\nHi Jan,\n\nAre you thinking that the \"directional diffuse\" component as described in the reference manual refers to light that transfers from direct sources to the diffuse hemisphere?  I suppose this is confusing terminology, and it is something adopted from the computer graphics community rather than the lighting simulation community, but \"directional diffuse\" refers to reflections and transmission that is neither specular nor Lambertian, but somewhere in between.  As such, it does not refer to how the light arrived at the surface, only what happens to it afterwards.\n\nIf you want to treat the Lambertian and specular portions differently, use the separate functions provided in the BRTDfunc type.  The first three variables specify the amount of light reflected in the mirror direction, and the next three specify the amount of light transmitted in the \"through\" direction.  These are ordinary variables, and may be defined as such in your .cal file, e.g.:\n\n{ Mirror reflection color as a function of ray parameters }\nrefl_red = 0.25*RdotP;\nrefl_grn = 0.3*RdotP;\nrefl_blu = 0.31*RdotP;\n{ Direct transmission color as a function of ray parameters -- I am just making these up as examples }\ntrans_red = 0.1/(1+RdotP);\ntrans_grn = 0.2/(1+RdotP);\ntrans_blu = 0.15/(1+RdotP);\n\nNote that we have no information about the incoming light direction for the specular values.  The assumption is that light behaves the same whether it comes from a source or from somewhere else.\n\nFor the directional diffuse, we do provide the incident direction, which would be the light source by virtue of how this primitive is evaluated.  This is only provided so you can create a full BSDF function if you like, which needs incident & scattered vectors.  You can name these functions as you like, but they should take at least 3 arguments:\n\n{ Example directional-diffuse component, again just making this up }\nsoft_red(ix,iy,iz) = 0.2/PI*abs(ix*Dx+iy*Dy+iz*Dz);\nsoft_grn(ix,iy,iz) = 0.1/PI*abs(ix*Dx+iy*Dy+iz*Dz);\nsoft_blu(ix,iy,iz) = 0.5/PI*abs(ix*Dx+iy*Dy+iz*Dz);\n\nFor these functions, the incident source direction is given as the 3 parameters, which are normalized and directed away from the surface.  The standard variables (Dx,Dy,Dz) tell you the normalized direction vector pointed towards the surface.  You would put the above definitions into a file \"testingBRTDf.cal\" and specify:\n\nvoid BRTDfunc testing\n10\nrefl_red refl_grn refl_blu\ntrans_red trans_grn trans_blu\nsoft_red soft_grn soft_blu\ntestingBRTDf.cal\n0\n9\n0\t0\t0\n0\t0\t0\n0\t0\t0\n\n-----\nI have chosen to have zero diffuse components added, to give you full control over the diffuse portion in your .cal file.\n\nI hope this helps!\n-Greg\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20150805/f13b1525/attachment.html>\n\n", "replyTo": "Subject: [Radiance-general] diffuse transmission of BRTDfunc", "sender": "Greg Ward", "isquestion": false, "tags": [], "id": "<6A1ED068-616F-4416-B7DE-09B35F8395D0@lmi.net>", "refs": ["<55C1D34B.3090502@epfl.ch>", "<5E1BB715-191A-4661-9E12-4F38E7811800@lmi.net>", "<55C24AD6.2060908@epfl.ch>"], "datetime": "Wed, 5 Aug 2015 15:51:02 -0700", "email": "gregoryjward at gmail.com", "subject": "[Radiance-general] diffuse transmission of BRTDfunc"}