{"body": "\nHello Robert,\nHello all,\n\nAs some of you may remember, I am trying to model a set of CFS to compare their effect on indoor horizontal illuminance of a room. So far, I have been advised by you for several stages, which really helped me a lot for better understanding of radiance and how it works.\n\nNow, I have a question about how I use ray-tracing method in radiance? Is it similar to the way explained through the following attachment? As here, calculations are run using Radiance engine but Ecotect or Daysim interface (for geometry modelling and material assignment).\n\nDocument: http://web.mit.edu/sustainabledesignlab/projects/TeachingResources/GettingStartedwithEcotectRadianceDaysim.pdf\n\nI hope if you can kindly advise me on that asap, please?\n\n\nBest regards\nIkrima\n\n\n\n-----Original Message-----\nSent: 12 July 2015 20:37\nTo: radiance-general at radiance-online.org\nSend Radiance-general mailing list submissions to\nradiance-general at radiance-online.org\n\nTo subscribe or unsubscribe via the World Wide Web, visit\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\nor, via email, send a message with subject or body 'help' to\nradiance-general-request at radiance-online.org\n\nYou can reach the person managing the list at\nradiance-general-owner at radiance-online.org\n\nWhen replying, please edit your Subject line so it is more specific than \"Re: Contents of Radiance-general digest...\"\n\n\nToday's Topics:\n\n1. Git for Windows and starting tutorials (Ikrima Amaireh)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nTo: \"radiance-general at radiance-online.org\"\n<radiance-general at radiance-online.org>\nCc: Ikrima Amaireh <ezxia at nottingham.ac.uk>\n<D697763F9F216044A99BC674C00561961358CA9C4C at EXCHANGE1.ad.nottingham.ac.uk>\n\nContent-Type: text/plain; charset=\"us-ascii\"\n\nHi Robert,\n\nMany thanks for your help.\n\nI have installed Git for Windows as you adviced :) Now, Before I start with 3 or 5-phase tutorials, I'm thinking to go through \"radiance tutorial\" (by Axel Jacobs) as a beginner with almost a shallow knowledge/experience of radiance. So, do recommend this (radiance tutorial would be enough to start with 3 or 5-phase methods and understanding of BSDF data approach, etc) or advice another tutorial/source for better understanding of radiance basics (using command prompt)?\n\nMany thanks again :)\n\nRegards\nIkrima\n\n\n\n------------------------------\n\nMessage: 2\nTo: \"radiance-general at radiance-online.org\"\n<radiance-general at radiance-online.org>\nContent-Type: text/plain; charset=\"us-ascii\"\n\nOK so it sounds like you first tried the Windows installer (presumably a NREL-provided one such as this:\nhttps://github.com/NREL/Radiance/releases/download/5.0.a.3/radiance-5.0.a-w\nin64.exe), and this most likely worked fine, you just had some issues actually *doing* anything with it. This is normal. =)\n\nI recommend you install Git for windows (https://msysgit.github.io/), as that will add a little BASH emulator in your Windows system. This way you can run most of the commands exactly as they appear in most of the tutorials out there that are written from a UNIX perspective (as you point out). If you run the \"Git BASH shell\" you will be able to try out all the multi-phase methods, use and generate BSDFs, etc. Once you have Git for Windows installed, head over to Andy McNeil's tutorials for 3- and 5-phase, fire up the Git BASH shell (it'll be in the Git program group in the Windows start menu), and get started!\n\nOne thing to keep in mind is that when running any commands that read/write data (e.g. rcontrib), be sure to use ASCII format rather than float. Windows has issues with float data (among many other things).\n\nGood luck!\n\n- Rob\n\nOn 7/10/15, 8:08 AM, \"Ikrima Amaireh\" <ezxia at nottingham.ac.uk> wrote:\n\n\n\n\n\n------------------------------\n\nMessage: 3\nTo: \"radiance-general at radiance-online.org\"\n<radiance-general at radiance-online.org>\nCc: Ikrima Amaireh <ezxia at nottingham.ac.uk>\n<D697763F9F216044A99BC674C00561961358CA9BAF at EXCHANGE1.ad.nottingham.ac.uk>\n\nContent-Type: text/plain; charset=\"us-ascii\"\n\nHi all,\n\nThanks Robert and Larrain for your detailed replies, that helped me a lot.\n\nI would summarise here what I got form your appreciated replies, as following:\n- Radiance is convenient and best of tools to model daylighting due to its ray-tracing method.\n- 3 or 5-phases methods are used to facilitate the calculations.\n- Generating BSDF data is also used to facilitate these calculations but it is limited to Klems resolution of some CFS.\n\nInitially, I'm not planning to do annual calculations. It's just for specific hours of the day and the target is to produce a illuminance levels for indoor grid under different CFSs. Hence, according to my understanding from Larrain words, I can use either 2-phase or Ray-tracing methods. My question is how can I draw/define the CFS geometry and Space for these calculations? Is it similar to the way use in Ecotect/Radiance calculations?\n\nRegards\nIkrima\n\n\n-----Original Message-----\nSent: 09 July 2015 19:56\nTo: radiance-general at radiance-online.org\nSend Radiance-general mailing list submissions to\nradiance-general at radiance-online.org\n\nTo subscribe or unsubscribe via the World Wide Web, visit\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\nor, via email, send a message with subject or body 'help' to\nradiance-general-request at radiance-online.org\n\nYou can reach the person managing the list at\nradiance-general-owner at radiance-online.org\n\nWhen replying, please edit your Subject line so it is more specific than \"Re: Contents of Radiance-general digest...\"\n\n\nToday's Topics:\n\n1. CFS with Radiance (Ikrima Amaireh)\n2. Could not install Radiance!!! (Ikrima Amaireh)\n3. Re: Could not install Radiance!!! (Guglielmetti, Robert)\n4. Re: CFS with Radiance (Guglielmetti, Robert)\n5. Re: CFS with Radiance (Germ?n Molina Larrain)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nTo: \"radiance-general at radiance-online.org\"\n<radiance-general at radiance-online.org>\nCc: Ikrima Amaireh <ezxia at nottingham.ac.uk>\n<D697763F9F216044A99BC674C00561961358CA9710 at EXCHANGE1.ad.nottingham.ac.uk>\n\nContent-Type: text/plain; charset=\"us-ascii\"\n\nHi G. Larrain,\n\nThanks for your detailed clarification (below).\n\nI wonder if you kindly can help me toward better understanding and answering the following:\n\nWe agreed that for daylight modelling of spaces with CFS, Radiance is a suitable tool as it applies ray-tracing method. And for annual and/or climate-based daylight calculations, as calculation time becomes a critical factor, using BSDF data for CFS is highly recommended to tackle the task with radiance (using phases methods). However:\n\n- if someone needs to perform daylight calculations for given space with different CFS (different cases for comparison purposes) to get illumination levels for horizontal grid points (and not pictures nor scenes), is Radiance still the most convenient option?\n- is it still needed to use any of the phase methods (2, 3 or 5)?\n- most importantly, is it still needed to get BSDF data for CFS or just can model the detailed CFS in Radiance (and, if yes, how?)\n\n\nMany thanks for your kind help :)\n\nRegards\nIkrima\n\n\n\"Ikrima,\n\nI am going to try to build the puzzle of CFS, Phases, BSDF and calculations.... at least the way I understand it.\n\n*CFS* are those systems that, via interreflection or other light transport phenomena, redirect light (or solar radiation). Thus, in order to get a reliable result you will have to consider all the phenomena involved.\nThen, *common\nsimple performance indexes*, such as the miss-used Shading Coefficient and the Aperture Percentage, *always loose a lot of information, trying to reduce all the complex behavior of a CFS to one single number*. We all know that venetian blinds are more \"transparent\" from certain viewing directions than from others, but these performance indexes do not tell you that.\n\nNow... Radiance can certainly perform calculations of spaces with CFS using its \"common\" Ray-tracing. However, this may be slow for some purposes (i.e.\nannual simulations and climate-based daylight modelling), and *this is why 2, 3 and 5 phase methods have been developed*. The *BSDF* representation, I would say, goes in the same direction... It allow summarizing all the bounces, reflections, refractions, etc.  that occure withing the CFS in a single matrix or tensor.* By using BSDFs*, Radiance itself and other tools (i.e. EnergyPlus) can treat CFS as blackboxes, avoiding all the opcits within the system. A BSDF that uses the Klems Full representation has\n21,045 numbers (instead of one, such as the Shading Coefficient).\n\nBeing said all that, I would not trust a calculation method unless it can actually deal with the optics of a CFS that is drawn and/or it can use BSDF (or similar) information.\n\nLets remember that a perforated screen, a venetian blind, a light diffusing device can all have a Shading Coefficient of 50%, but all of them will behave very differently. I made some presentations about this on my previous work (we sold complex Shading Devices), trying to promote the use of BSDF in EnergyPlus calculations... the differences (in solar heat gains) were more than considerable.\n\nI hope that someone else gives us his/her perspective on this topic...\nthere are a lot of concepts that I might be misunderstanding.\n\nBest!\"\n\n\n\n\nThis message and any attachment are intended solely for the addressee and may contain confidential information. If you have received this message in error, please send it back to me, and immediately delete it.\n\nPlease do not use, copy or disclose the information contained in this message or in any attachment.  Any views or opinions expressed by the author of this email do not necessarily reflect the views of the University of Nottingham.\n\nThis message has been checked for viruses but the contents of an attachment may still contain software viruses which could damage your computer system, you are advised to perform your own checks. Email communications with the University of Nottingham may be monitored as permitted by UK legislation.\n\n\n\n\n------------------------------\n\nMessage: 2\nTo: \"radiance-general at radiance-online.org\"\n<radiance-general at radiance-online.org>\nCc: Ikrima Amaireh <ezxia at nottingham.ac.uk>\n<D697763F9F216044A99BC674C00561961358CA9719 at EXCHANGE1.ad.nottingham.ac.uk>\n\nContent-Type: text/plain; charset=\"us-ascii\"\n\nHi all,\n\nAfter one a few weeks of trying, I could not manage to install radiance properly. I am almost disappointed! Please any help?\n\nRegards\nIkrima\n\n\n\n\nThis message and any attachment are intended solely for the addressee and may contain confidential information. If you have received this message in error, please send it back to me, and immediately delete it.\n\nPlease do not use, copy or disclose the information contained in this message or in any attachment.  Any views or opinions expressed by the author of this email do not necessarily reflect the views of the University of Nottingham.\n\nThis message has been checked for viruses but the contents of an attachment may still contain software viruses which could damage your computer system, you are advised to perform your own checks. Email communications with the University of Nottingham may be monitored as permitted by UK legislation.\n\n\n\n\n------------------------------\n\nMessage: 3\nTo: \"radiance-general at radiance-online.org\"\n<radiance-general at radiance-online.org>\nContent-Type: text/plain; charset=\"us-ascii\"\n\nHi Ikrima,\n\nWe'll need a bit more info, here. What OS are you on? How are you attempting to install it (using an installer, compiling from source, or what)? What happens when you try??\n\nOn 7/9/15, 10:38 AM, \"Ikrima Amaireh\" <ezxia at nottingham.ac.uk> wrote:\n\n\n\n\n\n------------------------------\n\nMessage: 4\nTo: \"radiance-general at radiance-online.org\"\n<radiance-general at radiance-online.org>\nContent-Type: text/plain; charset=\"us-ascii\"\n\nSome very quick replies and clarifications within:\n\nOn 7/9/15, 10:26 AM, \"Ikrima Amaireh\" <ezxia at nottingham.ac.uk> wrote:\n\n\n\nBSDF data in an annual simulation context is generally limited to Klems basis BSDF data, which may not be high enough resolution for some CFS. And the 5-phase method, which can circumvent this, is not necessarily \"quick\".\nThis is all still very much a quandary and the newest daylight metrics have added confusion to all of this, IMO.\n\n\n\n\nAbsolutely. The lack of an image-as-output requirement does not change the fact that ray tracing is a good/convenient algorithm option for daylight simulation problems, especially when dealing with diffusing media and CFS in general. BSDFs allow you to do lots of \"what-ifs\", relatively quickly, but are beholden to the limitations of the resolution of the BSDF.\n\n\n\n\nIs what still needed? BSDF data? Ray tracing? I don't know of other lighting simulation tools that can employ the multiphase methods. I would say BSDF data is optional for 2-phase, required for 3-phase, and optional for 5-phase.\n\n\n\nAgain I'm confused as to what \"it\" is. A couple of approaches are available to you in general. If you have a geometric model of the CFS you can use Radiance (genBSDF) to make a BSDF of the CFS and use that in a 3- or 5-phase context. However in an annual/climate-based simulation context, you will be stuck with a Klems basis BSDF and that will not be very good resolution for a lot of CFS; here you may want to use the 5-phase method and stick the actual CFS geometry in the building model.\n\nSome things to consider here are the photon map, now a part of Radiance proper, or using the 2-phase method where appropriate. By 2-phase method I mean generating a daylight matrix for your calculation points (or view), and modeling the window material as-is. If the \"CFS\" is a shade cloth, you can approximate that with a Radiance \"trans\". Same for translucent panels.\nWith this single daylight matrix, you can throw a vector of sky matrices at it and get an annual climate-based result very quickly. Problem is, we want to do stuff to the windows, sometimes at the time step level, so:\n\nBlinds and compact daylight redirection devices (e.g. Lightlouver) are best represented as BSDF, and if most of the redirected flux is headed up and away from the points of interest, a Klems basis BSDF is good enough IMO. In these cases you could use the 3-phase method. Problem is when you have a BSDF for blinds, and you also want to simulate the blinds-up condition (i.e. clear, specularly transmitting glass). Using a Klems basis BSDF for this is sub-optimal. You end up needing to do two annual simulations, one as 2-phase for the clear glass scenario, and again as a 3-phase (with a blinds BSDF for the transmission matrix) for the blinds down condition. If you have a lot of different window groups, your simulation space can get large in a hurry. But it's still do-able and you can get results that tell a story you simply couldn't tell 5 years ago, informing the newest daylight metrics as well.\n\n\n\n\n\n\n------------------------------\n\nMessage: 5\nTo: Radiance general discussion <radiance-general at radiance-online.org>\n<CAF-iH4LSr=y12F1khTrHh6hnf-kS=EmaFuo8uWKvHqMs=FZL-Q at mail.gmail.com>\nContent-Type: text/plain; charset=\"utf-8\"\n\nI must say that I agree with Rob, however, a short answer that might help.\n\nFor evaluating illuminance levels in a space with different CFS you, strictly speaking, DO NOT HAVE TO do anything. You may choose between different methods that have some pros and cons.\n\n\n*ray-tracing*\n\n- Requires ray-tracing for each time-step and each system, which is slow\n(*four systems simulated annualy in an hourly basis --> 4*8760 = 35,040\nsimulations*.)\n- As accurate as it gets, if options are defined correctly.\n\n\n*2 phase method*\n\n- Do not need the BSDF\n- Requires ray-tracing for each CFS (*4 systems --> 4 ray-tracing\nsimulations*)\n- After ray-tracing, annual simulation is fast.\n\n*3-phase method:*\n\n- Requires BSDF data in KLEMS basis, which may be slow to compute,\nunless it can be exported from WINDOW, for example, or such data has\nalready been calculated (the idea is to make a database, I think).\n- Does not really work well for specular systems (Klems patches are too\nbig)\n- Requires 2 ray-tracing runs, always (*4 systems --> 2 ray-tracing\nsimulations*)\n- After ray-tracing and BSDF calculation, annual simulation is fast\n\n*5-phase method:*\n\n- Requires BSDF data in KLEMS  basis AND/OR Tensor tree format, which\nmay be slow to compute, unless it can be exported from WINDOW, for example,\nor such data has already been calculated (the idea is to make a database, I\nthink).\n- Works well for specular systems\n- Requires 4 ray-tracing runs + 1 for each system, always (*4 systems\n--> 4+1 = 5 ray-tracing simulations*)\n- Hard to code...?\n- After ray-tracing and BSDF calculation, annual simulation is fast\n\n\nI would not say there is a recipe. If you have to choose between 1 or 2 CFSs, maybe it is faster to just draw them and use the 2 phase method (or ray-tracing if an annual simulaton is not required). On the contrary, if you are going to test 10 different CFSs, 3 and 5 phases may make sense, since you reduce the expensive ray-tracing calculations... However, this will also depend on weather you have the BSDF data AND/OR if it makes sense to calculate it and store it AND/OR if you intend to simulate a dynamically controlled CFS.\n\nBest!\n\n2015-07-09 14:29 GMT-03:00 Guglielmetti, Robert <\nRobert.Guglielmetti at nrel.gov>:\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20150709/cfbdd4da/attachment.html>\n\n------------------------------\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\nEnd of Radiance-general Digest, Vol 137, Issue 8\n************************************************\n\n\n\n\nThis message and any attachment are intended solely for the addressee and may contain confidential information. If you have received this message in error, please send it back to me, and immediately delete it.\n\nPlease do not use, copy or disclose the information contained in this message or in any attachment.  Any views or opinions expressed by the author of this email do not necessarily reflect the views of the University of Nottingham.\n\nThis message has been checked for viruses but the contents of an attachment may still contain software viruses which could damage your computer system, you are advised to perform your own checks. Email communications with the University of Nottingham may be monitored as permitted by UK legislation.\n\n\n\n\n------------------------------\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\nEnd of Radiance-general Digest, Vol 137, Issue 9\n************************************************\n\n\n\n\nThis message and any attachment are intended solely for the addressee and may contain confidential information. If you have received this message in error, please send it back to me, and immediately delete it.\n\nPlease do not use, copy or disclose the information contained in this message or in any attachment.  Any views or opinions expressed by the author of this email do not necessarily reflect the views of the University of Nottingham.\n\nThis message has been checked for viruses but the contents of an attachment may still contain software viruses which could damage your computer system, you are advised to perform your own checks. Email communications with the University of Nottingham may be monitored as permitted by UK legislation.\n\n\n\n\n------------------------------\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\nEnd of Radiance-general Digest, Vol 137, Issue 12\n*************************************************\n\n\n\n\nThis message and any attachment are intended solely for the addressee\nand may contain confidential information. If you have received this\nmessage in error, please send it back to me, and immediately delete it.\n\nPlease do not use, copy or disclose the information contained in this\nmessage or in any attachment.  Any views or opinions expressed by the\nauthor of this email do not necessarily reflect the views of the\nUniversity of Nottingham.\n\nThis message has been checked for viruses but the contents of an\nattachment may still contain software viruses which could damage your\ncomputer system, you are advised to perform your own checks. Email\ncommunications with the University of Nottingham may be monitored as\npermitted by UK legislation.\n\n\n\n", "replyTo": "", "sender": "germolinal at gmail.com", "isquestion": true, "tags": [], "id": "<D1C40477.1ADCA%Robert.Guglielmetti at nrel.gov>", "refs": [], "datetime": "Thu, 9 Jul 2015 15:56:11 -0300", "email": "Germ?n Molina Larrain", "subject": "Re: [Radiance-general] CFS with RadianceMessage-ID:"}