{"body": "\nThomas has great info on lamp color and using replmarks. ?Further to Randolph?s post, the idea is to wrap the luminaire geometry as tightly as possible using the shapes Randolph mentioned, but this enveloping geometry will have *illum* applied to it, not glow. The glow is used to illuminate the luminaire geometry itself so that it appears realistic in a rendering. You apply glows to the lamp objects in the luminaire generally, or you could apply them to any shades or lenses in the luminaire.?\n\nThe luminous intensity of the illum is derived from the input lumens in the IES file and is modulated by a few cal files, which use the candela values from the IES file. The lamp color utility can give you reasonable values to use for the glows, based on lamp input lumens. Again, the glows illuminate the local luminaire geometry, and the illums actually illuminate the space. The ileum material is invisible when viewed directly, which is why you need the glows to make the luminaries appear correct in a rendering. The flux from the glow also does not make it past the illum geometry and so it does not contribute to the scene illumination or any calculations.?\n\nThere is some info on using illums and glows here:\n\nhttp://www.rumblestrip.org/using-the-illum-material-for-smoother-renderings-in-radiance/\n\nI did a bunch of crap with different illum geometry and cal files (lboxcorr.cal et al.) and got pretty good at picking the best ones for the jobs at hand (wall mounted sconces and stuff like that can be tricky to get looking ?right?), but never got around to posting a summary on that stuff. A good place to start is just running a few different luminaire types though ies2rad and see what you get, and then play with the output files from there.?\n\nAre we having fun yet?\n\n-Rob\n\nFrom:?Randolph M. Fritz <rmfritz3 at gmail.com>\nReply:?Radiance general discussion <radiance-general at radiance-online.org>>\nDate:?August 8, 2015 at 2:32:01 PM\nTo:?Radiance general discussion <radiance-general at radiance-online.org>>\nSubject:? Re: [Radiance-general] Luminaire modelling using Radiance\n\nThe basic technique is to wrap the visible geometry of the luminaire, if any, with a glow in a simple shape that actually radiates the light. The glow is transparent, so that the geometry can be seen, and direct illumination does not pass through the glow, so light can be used internal to the glow to give the luminaire a realistic look.\n\nThe glow geometry and description may be generated by ies2rad. IIRC only four shapes are supported: sphere, rectangular, cuboid (box), and thin disc.\n\nIes2rad does not support eulumdat and again, IIRC, has not been updated to support the latest IES photometry standard, LM-63-02.\n\n--\nRandolph M. Fritz, Lighting Design and Simulation\n+1 206 390 4477 || rmfritz3 at gmail.com\n\nOn Sat, Aug 8, 2015 at 7:46 AM, Thomas Bleicher <tbleicher at gmail.com> wrote:\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20150808/fd36776f/attachment-0001.html>\n\n", "replyTo": "Subject: [Radiance-general] Luminaire modelling using Radiance", "sender": "Rob Guglielmetti", "isquestion": false, "tags": [], "id": "<etPan.55c66da3.3a95f874.8ac@explosivo-2.local>", "refs": ["<CAF-iH4JrynBLgZXzG=yg84_xz_Samwx5Uv_o9=OR_hCZVyqvaA@mail.gmail.com>", "<CAKGV-k3V6hyPJoOEg0i899GhSj6h-UDcz00KcFYFMyeR3WgovQ@mail.gmail.com>", "<CANeAMoL--zOO18MPD4oD-z-eN+Nn6QAfgLq-k+-XhWkBnHk3sA@mail.gmail.com>"], "datetime": "Sat, 8 Aug 2015 14:59:15 -0600", "email": "rob.guglielmetti at gmail.com", "subject": "[Radiance-general] Luminaire modelling using Radiance"}