{"body": "\nHi Natchan,\n\nreflectance from glass is a function of at least wavelength and\ndirection. So short answer is no, most surfaces will show an entirely\ndifferent reflection in NIR than they do in the visible range. Most\nglazing manufacturers work on exactly this target - low NIR\ntransmission, high visible light transmission. And while reflectance for\nvisible light may be dominated by Fresnel laws, NIR reflection will\nprobably be caused by different mechanisms due to the coating applied to\nthe glass.\n\nPlease check some reflectance spectra to get an understanding of what\nthat means. And look into measurement standards:\n\nhttp://windowoptics.lbl.gov/data/standards/solar\n\nRadiance does not really care much about wavelength. As long as it can\nbe considered to behave as light, you can feed any kind of information\non radiation into the three channels that are evaluated in parallel\nwithin Radiance. Most people use the three channels for color\ninformation, red / green / blue. Often, when only photometric results in\nterms of luminance or illuminance are required, you would set all three\nchannels to the same value.\n\nRadiance has several material types for glass, but most of them assume\nan uncoated glass (dielectric, glass) which may not be what you are\nlooking for. In your case, I would recommend to first define the\nwavelength range you want to considere (what is NIR for you?). Then you\nneed to find the reflectance for your glazing for that wavelength range,\nand for several incident directions. You may try to use Optics/Window,\nboth provided by LBL, to try this out. And check Jack de Valpine's nice\npresentation on a very related topic, where he investigated reflection\nfrom (coated) glazings:\n\nhttp://www.radiance-online.org/community/workshops/2009-boston-ma/Presentations/devalpine_visarc_glazing.pdf\n\nPlease note that you will also have to model the emission from sources\nin the _same_ NIR range as determined above.\n\nCheers,\nLars.\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20150817/373e99f0/attachment.html>\n\n", "replyTo": "<CACS+dyqczqnY+5in+eC6pDwFF9NLhTjhBMnUP4a=wJis468XRg@mail.gmail.com>", "sender": "Lars O. Grobe", "isquestion": false, "tags": [], "id": "<55D1C53F.6070309@gmx.net>", "refs": ["<CACS+dyqczqnY+5in+eC6pDwFF9NLhTjhBMnUP4a=wJis468XRg@mail.gmail.com>"], "datetime": "Mon, 17 Aug 2015 13:27:59 +0200", "email": "grobe at gmx.net", "subject": "[Radiance-general] How to define reflectance of near infraredof solar radiation"}