{"body": "\nHi Jasper,\n\nThis is one of the tricky aspects of doing glare analysis with your own\nHDR images. A couple of pointers are below,\n\n* You will need to crop your image to a square aspect about the image\ncenter using the pcompos\n<http://radsite.lbl.gov/radiance/man_html/pcompos.1.html> tool.\nThere was a helpful discussion on maintaining image exposure values\nwhile doing this here\n<http://www.radiance-online.org/pipermail/radiance-general/2011-March/007701.html>.\n* The -vv and -vh parameters are just best guesses according the HDR\ngeneration software. Once you have cropped the image, you will want\nto open the resulting HDR in a text editor and manually change the\nheader 'VIEW' field to include -vta -vv 180 -vh 180. You may also\nspecify them via the command line at this point, as you have done. I\nlike to keep it associated with the image.\n* After that, unless I am forgetting something (others can chime in),\nyou are ready to run evalglare. I would run it with the -d flag,\nwhich will report a lot of details. Most usefully, it reports\nilluminance as derived from the image, which you can compare to your\nmeasured Ev value to check the validity of the HDR. If your HDR is\nwell-calibrated, not inputting the measured illuminance value should\nbe perfectly accurate.\n* I suspect that inputting measured illuminance is somewhat broken in\nthe current version of evalglare as I have the same problem that you\ndo. One option is to use the -1 option to evalglare, which will\nreturn only a single DGP value. It seems to avoid this error.\n\nBy the way, to avoid some of this cropping and exposure value pain, I\nuse an image-processing tool (like PIL for Python) these days that can\nmaintain EXIF data while cropping the source jpeg files. Though perhaps\nthe cure is worse than the disease in this case..\n\nBest,\nAlstan\n\nOn 8/11/2015 11:08 PM, Jasper Overduin wrote:\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20150811/9769e760/attachment-0001.html>\n\n", "replyTo": "Subject: [Radiance-general] help pfilt and low values dgp", "sender": "J. Alstan Jakubiec", "isquestion": false, "tags": [], "id": "<55CA15D2.9060209@jakubiec.net>", "refs": ["<CAHgS54fXM9UeHCXdgT7inVz=n9XFPTBc2kmZKTYKksfOxHngtw@mail.gmail.com>\t<55439897.7050805@epfl.ch>", "<CAHgS54dAEzuMuieRetucx20GN_CM1mRzDhpPG2wW1200_5Fuig@mail.gmail.com>"], "datetime": "Tue, 11 Aug 2015 23:33:38 +0800", "email": "alstan at jakubiec.net", "subject": "[Radiance-general] help pfilt and low values dgp"}