{"body": "\nDear Germ?n,\n\nMany thanks for you. I agree with you totally that all Radiance works need to apply ray-tracing approach as the core principle of it. However, what I meant by using ray-tracing in radiance, was the using of RTRACE directly through stand-alone radiance tool (as you kindly mentioned).\n\nAs you clarified, Daysim uses 2-phase method to do annual simulation (2nd phase) fast, based on pre-calculated Daylight Coefficient Matrix (1st phase). Now, if I need to produce the illuminance levels (produced by specific CFS) at the Workplane under static scene, can I still use Daysim for that? Or, shall I stick to RTRACE tool directly through pure Radiance?\n\nAnd, if I have to stick to using Pure Radiance (RTRACE), is the method detailed in the attached document (hope, you see that: where Geometry and Workplane sensors are built in Ecotect and directly exported to Radiance engine), is it still valid?\n\n\nFinally, in both cases (using pure Radiance and/or Daysim), shall we replace the Radiance tool (works as engine) by the latest released version (i.e. Version 4.2 or recent?) as the one works with Ecotect-Radiance approach (I'm not sure about Daysim, yet) is old version (2.0; in think!)?\n\n\nReally, I am grateful to you for your appreciated help and looking to hear from you again :)\n\nRegards,,,\n\nIkrima\n\n\n\n\n\nSo  far, I have been advised by you for several stages, which really helped me a lot for better understanding of radiance and how it works.\nNow, I have a question about how I use ray-tracing method in radiance? Is it similar to the way explained through the following attachment?\nAs here, calculations are run using Radiance engine but Ecotect or Daysim interface (for geometry modelling and material assignment).\nDocument: http://web.mit.edu/sustainabledesignlab/projects/TeachingResources/GettingStartedwithEcotectRadianceDaysim.pdf\n\nI hope if you can kindly advise me on that asap, please?\n\n\nIkrima,\n\nStrictly speaking, Radiance always use ray-tracing. Whenever you call RPICT, RTRACE or RCONTRIB, there will always be a ray-tracing simulation performed. However, when you want to perform annual simulations, you will want to do as few ray-tracing simulations as possible since they take time.\nRTRACE, for example, is a method used to calculate the illuminance or luminance of a point (sensor) in a static scene. Doing this for a whole year would require 8760 or more RTRACE calls, which means 8760 or more ray-tracing simulations, which is slow.\n\nAccordingly, Daysim (which uses the 2-phase method) runs one ray-tracing simulation that calculates the Daylight Coefficient matrix (this can be done in pure radiance by using RCONTRIB). This matrix relates the sensors\n(workplane?) in the scene with the sky, mich means that you can modify the sky and quickly evaluate illuminance in the same points. This allows performing annual simulations fast (only the sky changes in a static annual simulation). 3 and 5 phase method are extensions to this that allow also modifying the CFSs in the scene.\n\nHope that clarify a little bit.\n\n\n\n\n-----Original Message-----\nSent: 10 August 2015 14:20\nTo: radiance-general at radiance-online.org\nSend Radiance-general mailing list submissions to\nradiance-general at radiance-online.org\n\nTo subscribe or unsubscribe via the World Wide Web, visit\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\nor, via email, send a message with subject or body 'help' to\nradiance-general-request at radiance-online.org\n\nYou can reach the person managing the list at\nradiance-general-owner at radiance-online.org\n\nWhen replying, please edit your Subject line so it is more specific than \"Re: Contents of Radiance-general digest...\"\n\n\nToday's Topics:\n\n1. Re: Ray-tracing with Radiance (Germ?n Molina Larrain)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nTo: Radiance general discussion <radiance-general at radiance-online.org>\n<CAF-iH4LVHB_V+Vmy-mSiv2EtUE25KDxtTAyJfao5Mi6fzFDU1g at mail.gmail.com>\nContent-Type: text/plain; charset=\"utf-8\"\n\nIkrima,\n\nStrictly speaking, Radiance always use ray-tracing. Whenever you call RPICT, RTRACE or RCONTRIB, there will always be a ray-tracing simulation performed. However, when you want to perform annual simulations, you will want to do as few ray-tracing simulations as possible since they take time.\nRTRACE, for example, is a method used to calculate the illuminance or luminance of a point (sensor) in a static scene. Doing this for a whole year would require 8760 or more RTRACE calls, which means 8760 or more ray-tracing simulations, which is slow.\n\nAccordingly, Daysim (which uses the 2-phase method) runs one ray-tracing simulation that calculates the Daylight Coefficient matrix (this can be done in pure radiance by using RCONTRIB). This matrix relates the sensors\n(workplane?) in the scene with the sky, mich means that you can modify the sky and quickly evaluate illuminance in the same points. This allows performing annual simulations fast (only the sky changes in a static annual simulation). 3 and 5 phase method are extensions to this that allow also modifying the CFSs in the scene.\n\nHope that clarify a little bit.\n\nBest,\n\nGerm?n\n\n\n\n2015-08-10 8:51 GMT-03:00 Ikrima Amaireh <ezxia at nottingham.ac.uk>:\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20150810/959f6779/attachment.html>\n\n------------------------------\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\nEnd of Radiance-general Digest, Vol 138, Issue 12\n*************************************************\n\n\n\n\nThis message and any attachment are intended solely for the addressee\nand may contain confidential information. If you have received this\nmessage in error, please send it back to me, and immediately delete it.\n\nPlease do not use, copy or disclose the information contained in this\nmessage or in any attachment.  Any views or opinions expressed by the\nauthor of this email do not necessarily reflect the views of the\nUniversity of Nottingham.\n\nThis message has been checked for viruses but the contents of an\nattachment may still contain software viruses which could damage your\ncomputer system, you are advised to perform your own checks. Email\ncommunications with the University of Nottingham may be monitored as\npermitted by UK legislation.\n\n\n\n", "replyTo": "", "sender": "germolinal at gmail.com", "isquestion": true, "tags": [], "id": "<D697763F9F216044A99BC674C0056196135AD10389@EXCHANGE1.ad.nottingham.ac.uk>", "refs": [], "datetime": "Mon, 10 Aug 2015 10:19:18 -0300", "email": "Germ?n Molina Larrain", "subject": "Re: [Radiance-general] Ray-tracing with RadianceMessage-ID:"}