{"refs": ["<000b01c5fbc9$bebc7ff0$1f7af90a@hwxin>"], "id": "<34F829A2-9E69-423F-B4AF-C9930048E12A@gmail.com>", "subject": "[Radiance-general] Fw: How to increase the rendering speed?", "email": "gregoryjward at gmail.com", "body": "\nHi Huang,\n\nJust in general, I prefer that people not post images in their\nmessages to the mailing list, but you did, so I am, too...\n\nThe attached plot shows the correct Fresnel behavior for smooth\ndielectric surfaces, including plastics, waxed floors, and just about\nanything else with a specular reflection.  Radiance 3.6 uses an\napproximation to Fresnel reflection that is fairly accurate down to\nan index of refraction of 1.35 or so (water), but this was left out\nof the version that became Desktop Radiance due to normalization\nconcerns I have since resolved.\n\nThe problem in your case is that you have specified a material that\ndoesn't make sense, physically -- a perfectly smooth (zero roughness)\nfloor with a specular reflection of 0.004.  I challenge you to find\nsuch a surface in the real world -- this corresponds to an index of\nrefraction of about 1.135, which is greater than any of the gasses\nbut less than any liquid at room temperature.  (Check out the web\npage <http://www.luxpop.com/#index%20of%20refraction%A0> if you want\nto know some physical ranges.)\n\nBe that as it may, Radiance should really disable this approximation\nwhen the specularity is below the values for which it is accurate,\nwhich is around 1.8% (n=1.31).  I will fix this in the next release.\nIn the meantime, you can set a roughness value of 0.01 or so to\neliminate the problem in your model, as Radiance already disables the\nFresnel approximation for rough surfaces, even when the roughness is\nvery small.\n\nAs for the subject of your message, the best way to speed up your\nrendering is to increase the -aa value while setting the AMBFILE=\nvariable in your rad input file.\n\n-Greg\n\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: Fresnel.bmp\nType: application/octet-stream\nSize: 55882 bytes\nDesc: not available\nUrl : http://radiance-online.org/pipermail/radiance-general/attachments/20051208/3cd4a276/Fresnel-0001.obj\n-------------- next part --------------\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Fw: How to increase the rendering speed?", "tags": [], "sender": "Greg Ward", "datetime": "Thu Dec  8 19:00:28 2005"}