{"body": "\nHi Lars,\n\nYou should check that you don't have a limit placed on your data size if\nyou are getting out-of-memory errors.  Run the command in csh or tcsh:\n\n% limit\n\nIt should give you a list of resource limits currently in effect.  If\nthe datasize says anything besides \"unlimited\", you should run the\ncommand \"unlimit datasize\" before running Radiance.  Better still, but\nsuch a command in your .cshrc or .tcshrc file in your home directory.\nIf you are still getting out-of-memory errors after that, there is\neither a problem with your virtual memory size or a problem with\nRadiance.\n\nRaphael wrote to tell me that ximage does a segmentation fault when you\nre-expose the image in his version of Linux.  I found the problem -- a\npointer was being freed twice due to a library call that either changed\nor always freed twice and no one noticed before.  Anyway, I've fixed the\nproblem and will quietly put it into this release rather than creating a\npatch, so you might want to download it again or patch it yourself if\nyou have a slow connection with the following code change:\n\nray/src/px/x11image.c (line 781):\nfree(ourdata);\nchange to:\n/* free(ourdata);       This is done in XDestroyImage()! */\n\nThen simply run \"rmake install\" in that directory, presuming you've run\n\"makeall install\" previously.  Running \"makeall install\" again also\nworks.\n\nRegarding pcond and macbethcal, I don't know what the problem is, but I\ndon't recommend this method anymore, anyway.  Macbathcal works very well\non calibrating input paths, but less well on calibrating output paths.\nUnfortunately, I don't have a really good solution to offer for this at\nthe moment....\n\n-Greg\n\n\n", "replyTo": "Subject: [Radiance-general] memory errors in 3.4", "sender": "Greg Ward", "isquestion": false, "tags": [], "id": "<9C8DC1FE-15A7-11D6-BED1-00306540F848@lmi.net>", "refs": [], "datetime": "Wed, 30 Jan 2002 09:34:28 -0800", "email": "radiance-general@radiance-online.org", "subject": "[Radiance-general] memory errors in 3.4"}