{"refs": ["<B8DD8375FCE2C94B9F170D9277C1FA2B8C5C9B@corvallis>\t<43A7036D.3030105@becausewecan.org>", "<43A70535.2060801@visarc.com>"], "id": "<43A87BDE.6080207@becausewecan.org>", "subject": "[Radiance-general] Radiance plug-in for 3D", "email": "toast at becausewecan.org", "body": "\nThe trouble is that I have no easy and fast way to bring something from\nRevit into Radiance. It's a pain. I'd love to hear a solution.\n\nI'm using Autodesk Revit (heavily). I model my Building. I export out to\nDWG, and then bring that into 3D Studio, which is smart enough to bring\nalong the materials I'm using in Revit into it. I then export out a nice\n3DS file from 3D Studio, and run the 3DS2MGF -> MGF2RAD style of\nconversion, and it gets most of the way through the conversion but then\nhits a 'Unexpected EOF'. If I then render the RAD file things are\nmissing, for it didn't finish the conversion. It happens with this\nscript as well.\n\nThe only other ways I can figure to bring Revit models into Radiance is\nto export them out as a DXF, and do a DXF2RAD, which also crashes and\ndoesn't work. Or I can export them out to a DWG, open them in AutoCAD,\nand then export them out as a RAD using TORAD, but this is now broken\nfor it hasn't been updated for the newer versions of AutoCAD, which are\nall I've got.\n\nThe DXF's out of Revit seem to crash Blender too, sadly. Now, I've been\ntold (by Autodesk) that in Revit 9 there will be a fix to make the DXF's\n'better' but I have no idea if it's going to help my troubles, and\nwithout pulling the Revit models into 3D Studio first you'd have to\nremap all the materials anyways, which will eat up too much time.\n\nSo I'm left with two options: Buy the Radiance plug-in for 3D Studio, or\ntry to write an Radiance exporter using Revit's API directly (or wait\nuntil someone else does). Since Radiance isn't my core business, just a\nrendering engine that I enjoy using and would like to use more of, I\nreally wish I had an easier way of getting from Revit into Radiance, for\ntoday it's a totally pain in the rear.\n\nI had hoped that maybe this script would filter out whatever is causing\nthat EOF, but it doesn't seem too. Oh, I'm running Radiance on Cygwin,\nmaybe I should give this a go on the G4 when I get home and see if I get\nthe same result...\n\nThanks for the script, and sorry for the long story.\n\nJeffrey McGrew\n\n\nJack de Valpine wrote:\n\n\n\n--\n\nJeffrey McGrew\n\nBecause We Can, LLC\n(415) 505-4689\nwww.becausewecan.org\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Radiance plug-in for 3DS", "tags": [], "sender": "Jeffrey McGrew", "datetime": "Tue Dec 20 22:48:41 2005"}