{"refs": [], "id": "<1A03B39D-DD92-4373-8009-123548D56A23@dmu.ac.uk>", "subject": "[Radiance-general] sharing the ambient cach", "email": "jm at dmu.ac.uk", "body": "\n\nActually, I can't really expand much on what is in the book (p387):\n\nHaving created the ambient file with the ?overture? calculation, you\ncan, with\ncaution, relax some of the ambient parameters for the larger\nrenderings. The\nparameter revisions could be one or both of the following:\n? Reduce -ad and -as by about 50%\n? Slightly increase -aa (i.e., by 0.05 or 0.10)\nThe other ambient parameter settings should not be changed. If you do\ndecide\nto change any of the -ad, -as, or -aa settings after the ?overture?\ncalculation, you\nshould be aware that the modifications will not be reflected in the\nheader of the\nambient file. Thus, you need to track both the picture and the\nambient file headers\nto obtain a complete record of the parameter settings for an image.\n\nI seem to recall that Greg reckoned it was not a good idea to reduce\nthe ambient resolution (ar) parameter when reusing the ambient\ncache.  But I can't quite remember the reason why.  I was going to\nend my contribution at this point.  But then I did some tests.  Load up:\n\nhttp://www.iesd.dmu.ac.uk/~jm/pdfs/relax.pdf\n\nWhat we have here is a test scene: a ridged box by a window and\nilluminated by a diffuse (i.e. glow) sky.  The ar parameter limits\nthe extent to which ambient sampling can convincingly shade the\ngrooves.  I populated the ambient file artest.af in creating the\nimage at the top which only sees half the box.  I then reused the\nambient file with lower resolution settings to create wide views of\nthe box -- I thought that seeing the \"boundary\" between the already\npopulated hi-res ambient settings and the low-res might be\ninteresting.  It was.  Note that for each of the three low ambient\nresolution images I reused the *original* artest.af (i.e. I kept a\ncopy).\n\nIn the left and bottom images I relaxed the aa and ad parameters\nrespectively.  The results are what most of us would probably\nexpect.  For the image on the right I relaxed the ar parameter.  Now,\nfor this image, the \"new\" part on the left-hand-side is what would be\nexpected from a fresh run without any pre-existing ambient file -- ar\n64 doesn't allow close-enough sampling and the grooves get some\n\"flat\" ambient shading [1].  The interesting effect is of course on\nthe right -- the pre-existing ambient samples on this side have\nsomehow produced this lovely frog-spawn pattern.  Why? [2]\n\n-John\n\nPS. Dontcha just love this \"I'll never quite master it\" side to\nRadiance?\n\n[1] When av is zero, as it was here, how is the ar-limited shading\nvalue arrived at?\n\n[2] I have this vague feeling that I sort of might know the reason\nwhy.  But it is all too hazy for me to attempt to put it into words.\n\n-----------------------------------------------\nDr. John Mardaljevic\nSenior Research Fellow\nInstitute of Energy and Sustainable Development\nDe Montfort University\nThe Gateway\nLeicester\nLE1 9BH, UK\n+44 (0) 116 257 7972\n+44 (0) 116 257 7981 (fax)\n\njm@dmu.ac.uk\nhttp://www.iesd.dmu.ac.uk/~jm\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20051222/1418bcd7/attachment.htm\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "John Mardaljevic", "datetime": "Thu Dec 22 20:20:06 2005"}