{"body": "\nHi Rob,\n\nThere is no perfect camera for capturing HDR sequences.  The main\nthings you need to be able to control are the white balance, ASA,\naperture and speed, and an autobracketing mode that can cover +/-2\nf-stops or more is ideal.\n\nThe thing you want to avoid is a camera that does weird processing on\nthe images, and this is often difficult to determine until you get it.\nI believe the Olympus C series and the Canon G series are pretty safe\nin the price range you're after.  I've owned an Olympus C-3030, C-3040,\nand C-4040.  I'm sticking with the last one, as the newer in the C line\nadd megapixels and features but nothing I'm interested in.  Generally,\nthe more megapixels you have in a small camera, the more noise you're\ngoing to see.  The current race to 10 MPixels in a consumer-grade\ncamera is lunacy in my opinion.  Who wants to blow up an image to 20x30\ninches?  Even if you do blow up an image to that size once every year\nor so, you're paying for the privilege with image files that are 3-5\ntimes larger than you would need otherwise.  (End rant.)\n\nMy main problem with the C-4040, which you can't even get anymore, is\npurple fringing caused by the lens at the edges of high contrast,\nwide-angle shots.  It also has a very occassional knack of painting\nwhite, blown-out areas blue.  This must have been an ill-considered\nfeature some Olympus engineer came up with it for making washed-out\nskies look more natural, and it sometimes backfires.  I've only had a\nfew images this happened to in the thousands and thousands I've shot,\nbut another fellow with the same camera (but different firmware) has\nseen it more often with his.\n\n-Greg\n\n\n\n", "replyTo": "Subject: [Radiance-general] Digital Camera recommendations?", "sender": "Greg Ward", "isquestion": false, "tags": [], "id": "<5925ba33a184edade655deea6e01b1c0@gmail.com>", "refs": ["<B8DD8375FCE2C94B9F170D9277C1FA2B8C5804@corvallis>"], "datetime": "Wed Mar  9 17:52:05 2005", "email": "gregoryjward at gmail.com", "subject": "[Radiance-general] Digital Camera recommendations?"}