{"body": "\nHello,\nAfter the previous camera questions in early January I did some\nchecking to find out just what my Nikon 990 could do as well as other\ncamera options.\nBy using the manual setting on the 990, and a remote release for\nsteadiness, it is possible to take 14 bracketed photographs in 1 EV\nstep increments from 1/1000 to 8 seconds. The technique is to set the\ncamera to manual exposure and use the ?command dial? to step through\nthe shutter speeds alternating with firing the camera with the remote\nrelease.\nAn alternative is to use the built-in auto bracketing feature and\nexposure compensation to take two series of 5 bracketed photos in 1/3\nEV steps, one where compensation is set to +2 EV and one where\ncompensation is set to -2 EV. This produces a smaller overall range and\nin smaller steps.\nThe 990 is designed for interchangeable lenses, one of which is a\nfisheye with an angular view of 183?. I assume that this would provide\nthe same information as the mirror ball, but I?ve not read up nor tried\nthat technique.\n_____________________\nA company called Harbortronics makes a device, a Digisnap, that can\ncontrol the 990, as well as many other cameras. I exchanged several\nmessages with Mark Roberts to find out if the Digisnap could provide\nauto bracket control beyond +or- one frame and specifically if it could\ndo so while varying the shutter speed only.\n\n?It is 'possible' to add that capability to the firmware, but frankly\nwithout a lot of incentive, it's not going to happen.?\n?\nMark Roberts\nChief Engineer\nHarbortronics LLC\n(253) 858-7769 (Phone)\n(253) 858-9517 (Fax)\nMark@Harbortronics.com\nwww.Harbortronics.com\n\nThis would mean hacking the firmware of the camera, something I?m\nreluctant to experiment with.\nI?ve not tried this device. A friend who has says its clunky, but works.\nHarbortronics makes a wide variety of camera controllers for an array\nof different actions.\n_____________________\nI also checked with a Nikon Technical Representative, Scott Frier, at\nthe recent MacWorld show in San Francisco. The Nikon D2H and D2X can\nauto bracket up to 9 frames at up to 1 EV steps. That?s one in the\nmiddle and 4 over exposed and 4 under exposed. I also asked about how\nthe data is stored, since Greg (thank you) had mentioned that the new\ncameras are incorporating their own, as opposed to Photosphere, image\nprocessing to adjust the over and under exposed areas of a picture. It\nseems that if the image is stored in raw format that there are no\nsoftware exposure adjustments in the file. The file is broken into two\nparts: one folder contains the 0 and 1 data, the other contains a set\nof instructions to be applied to the aforementioned.\n\nThe D2H and D2X are professional cameras in every sense of the word.\nThe good news is, thanks to the D2H now being superseded by the D2X, it\nonly costs $2000.00. I didn?t ask about the D2X. If someone already has\nNikon lenses, this might be a path to HDRI photography.\n\nMaybe there is someone who can rewrite the Digisnap or the camera\nfirmware??\n\nBy the way Greg, Scott was very intrigued with what Photosphere does.\nHe may be getting in contact with you.\n\nPaul LaBerge\n________________________________________________________________________\n_________________\n\nOn Mar 9, 2005, at 8:50 AM, Greg Ward wrote:\n\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: not available\nType: text/enriched\nSize: 5134 bytes\nDesc: not available\nUrl : http://radiance-online.org/pipermail/radiance-general/attachments/20050309/3a6ed285/attachment.bin\n", "replyTo": "Subject: [Radiance-general] Digital Camera recommendations?", "sender": "Paul LaBerge", "isquestion": false, "tags": [], "id": "<0d3e429d50919b17d2f37e8ac046e40e@labergedaylight.com>", "refs": ["<B8DD8375FCE2C94B9F170D9277C1FA2B8C5804@corvallis>", "<5925ba33a184edade655deea6e01b1c0@gmail.com>"], "datetime": "Wed Mar  9 19:42:49 2005", "email": "plaberge at labergedaylight.com", "subject": "[Radiance-general] Digital Camera recommendations?"}