{"body": "\nDear Group\n\nI have come across an issue with the color bleeding of image maps that I use\nwith my Radiance renderings. I have the dual objective of achieving a\nphysically accurate and asthetically pleasing rendering. It is my\nunderstanding that to obtain physically accurate attributes for a material\nassociated with an image map, one should normpat'd the image and then set\nthe appropriate rgb reflection for its associated material. The problem I\nhave come into is that the color bleedng seems excessive. Here are some\nexamples:\n\nFor the wood floor image map in this rendering, the image map was not\nnormpat'd and a rgb reflection for the floor (plastic) was set at .4 .4 .4.\nThe floor image map brightness is a bit darker than what I would expect:\n\nhttp://pg.photos.yahoo.com/ph/marcdevon/detail?.dir=/b3e9&.dnm=d98b.jpg&.src=ph\n\nFor this rendering, the wood floor image image was normpat'd. The red green\nblue option in colorpict was set to red green blue and a rgb reflection for\nthe floor (plastic) was set at .4 .4 .4. Notice the level of color bleeding\nin the rendering. Also, the brightness and saturation of the image map is\nmuch higher than the pre-normpat'd image map:\n\nhttp://pg.photos.yahoo.com/ph/marcdevon/detail?.dir=/b3e9&.dnm=e6b4.jpg&.src=ph\n\nIn this rendering, the wood floor image map was not normpat'd and a rgb\nreflection for the floor (plastic) was set at 1 1 1. I know not how\nphysically accurate the floor material is reacting but the brightness of the\nfloor material is what I think I would expect:\n\nhttp://pg.photos.yahoo.com/ph/marcdevon/detail?.dir=/b3e9&.dnm=adb6.jpg&.src=ph\n\nIn this rendering, the wood floor image map was normpat'd, the red green\nblue option in colorpict was set to clip clip clip and a rgb reflection for\nthe floor (plastic) was set at .4 .4 .4:\n\nhttp://pg.photos.yahoo.com/ph/marcdevon/detail?.dir=/b3e9&.dnm=3242.jpg&.src=ph\n\nIn this rendering, the wood floor image map was normpat'd, the red green\nblue option in colorpict was set to grey grey grey and a rgb reflection for\nthe floor (plastic) was set at .4 .4 .4:\n\nhttp://pg.photos.yahoo.com/ph/marcdevon/detail?.dir=/b3e9&.dnm=36c5.jpg&.src=ph\n\nIn this rendering, the wood floor image map was normpat'd, the red green\nblue option in colorpict was set to noop noop noop (I think this was\nrecommended in RWR) and a rgb reflection for the floor (plastic) was set at\n.4 .4 .4. This rendering and the floor is very saturated.\n\nhttp://pg.photos.yahoo.com/ph/marcdevon/detail?.dir=/b3e9&.dnm=d1fc.jpg&.src=ph\n\nI guess this is the rundown. Any suggestions?\n\nThanks\n\nMarcus\n\n\n\n", "replyTo": "Subject: [Radiance-general] Color Bleeding", "sender": "Marcus Jacobs", "isquestion": false, "tags": [], "id": "<BAY102-F17578E698928F45DBBB4BEA4530@phx.gbl>", "refs": [], "datetime": "Fri Mar 11 20:35:05 2005", "email": "marcdevon at hotmail.com", "subject": "[Radiance-general] Color Bleeding"}