{"refs": ["<BFF3F750.1289%giulio.antonutto@exchange.arup.com>"], "id": "<43CE4F4D.3080301@visarc.com>", "subject": "[Radiance-general] Sunlight through glass", "email": "jedev at visarc.com", "body": "\nHi Giullio and others following this thread,\n\n<RANT MODE>\nIt seems to me that this is a problem with proprietary shrink wrap\nsoftware renderers. Who really knows what is going on under the hood,\nwhose word should be taken for the validity of the physical model, what\nvalidations have occurred?!\n\nUsers see the product marketing materials that talk about Global\nIllumination and \"physical accuracy,\" and they believe the hype! That\nseems to me to be pretty dangerous if you are going to be using the tool\nto somehow \"validate\" design issues!\n\nI know that there are systems that have implemented GI to varying\ndegrees and sophistication. But the problem is you probably have to be\nan uber expert to use them and/or code up custom material/lighting\nshaders. Still though the question is what validation has occurred. I\nthink that most commercial renderers and users of said systems are\nreally not that interested in physical validity, they are most\ninterested in the outcome/appearance of the final image. It does not\nreally matter how it get there.\n\nIt seems to me that the one commercial product that showed some hope in\nits original (pre-acquisition) form was Lightscape. However, Rob\nGuglielmetti has explored and written pretty extensively on this topic\nseemingly with only partial satisfaction (my apologies to Rob G. for\nsuch a cursory summary, he did some really excellent work on this). Note\nI also believe that the original developers of Lightscape were truly\ninterested in enabling people to use a tool with a reasonable and\npractical level of physical validity.\n</RANT MODE>\n\nBest,\n\n-Jack\n\ngiulio antonutto wrote:\n\n\n--\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20060118/80cf72da/attachment.htm\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Sunlight through glass", "tags": [], "sender": "Jack de Valpine", "datetime": "Wed Jan 18 15:24:55 2006"}