{"refs": [], "id": "", "subject": "Re: [Radiance-general] Sunlight through glass", "email": "adiance-general-bounces@radiance-online.org", "body": "Message-ID: <001801c61c9d$bc0a1b60$0164640a@eclipse>\n\nAnd I think we are still interested about it!\n\nBut money talks and we need to satisfy both worlds  (nice images and\nphysically based rendering to some extents).  But I agree with most of what\nJack has been said here..\n\nRegards,\n\nPierre-F?lix Breton\n----------------------------------------------------\n(speaking as a 3ds max product specialist here - having participated in the\nLightscape 3.2 -->viz radiosity work...)\n\n\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of Jack de\nValpine\nSent: Wednesday, January 18, 2006 9:23 AM\nTo: Radiance general discussion\n\nHi Giullio and others following this thread,\n\n<RANT MODE>\nIt seems to me that this is a problem with proprietary shrink wrap software\nrenderers. Who really knows what is going on under the hood, whose word\nshould be taken for the validity of the physical model, what validations\nhave occurred?!\n\nUsers see the product marketing materials that talk about Global\nIllumination and \"physical accuracy,\" and they believe the hype! That seems\nto me to be pretty dangerous if you are going to be using the tool to\nsomehow \"validate\" design issues!\n\nI know that there are systems that have implemented GI to varying degrees\nand sophistication. But the problem is you probably have to be an uber\nexpert to use them and/or code up custom material/lighting shaders. Still\nthough the question is what validation has occurred. I think that most\ncommercial renderers and users of said systems are really not that\ninterested in physical validity, they are most interested in the\noutcome/appearance of the final image. It does not really matter how it get\nthere.\n\nIt seems to me that the one commercial product that showed some hope in its\noriginal (pre-acquisition) form was Lightscape. However, Rob Guglielmetti\nhas explored and written pretty extensively on this topic seemingly with\nonly partial satisfaction (my apologies to Rob G. for such a cursory\nsummary, he did some really excellent work on this). Note I also believe\nthat the original developers of Lightscape were truly interested in enabling\npeople to use a tool with a reasonable and practical level of physical\nvalidity.\n</RANT MODE>\n\nBest,\n\n-Jack\n\ngiulio antonutto wrote:\nAbout MR history and current situation (\nhttp://www.maxwellrender.com/forum/viewtopic.php?t=10185).\nWell the whole thing started a while ago when the promised and sold the\ncertainty to get a finished software for a certain time (last September).\nThis did not happened (they are still speaking of final candidate version\nRC0.5 and so on).\nThe software is not yet finished (it is not version 1.0).\nNot yet implemented on all the platform where was supposed to run (on Mac is\nstill beta although they promised something in the next ?24? hours) and\ndoesn?t support all the plug-ins for 3d application that are indicated on\nthe web page.\nThis doesn?t sound so appealing to me as well and I would understand\nsomebody delusion about the matter.\n\nHaving said that, I also need to add that I requested (as other friends did)\ndetails about the physical accuracy of the renderer.\nI never got an answer.\nIs it itself an answer?\nG.\n\nPS these are my personal opinions.\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n--\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Sunlight through glass", "tags": [], "sender": "adiance-general-bounces@radiance-online.or", "datetime": "Thu Jan 19 03:13:19 2006"}