{"body": "\nAnnouncing:\nLBNL Radiance 3.4 for Unix (including Linux and Mac OS X)\n\nRelease Date:\nJanuary 28, 2002\n\nOfficial Website:\nhttp://radsite.lbl.gov/radiance\nLawrence Berkeley National Laboratory\n\nPrincipal Author:\nGreg Ward\n\nAt long last, I have put together the Radiance release that LBNL hired\nme to do last summer...  The final impetus was my new employer's request\nto write a business plan, which I will avoid until I have absolutely\nnothing else left to do!  Also, it seems that the beta version has been\nout there long enough for people to report problems, and none were\nreported, so I'm dropping the big one.\n\nIt's been 4 years (count 'em) since the last official release I had\nanything to do with, and a lot has happened during that time.  Since I\nleft for SGI in '97, I continued to work on Radiance, in particular the\nnew holodeck program for interactive rendering, but due to liability\narguments between SGI and LBNL, I was never able to release that work.\nA few years and a few CEO's later, I don't think SGI cares anymore, and\nI don't work there, so that seems a non-issue.  Since then, I was at\nShutterfly, where I had nary a minute to answer e-mails, let alone do\nany writing, testing, or debugging of Radiance.  Now that I'm at\nExponent and using Radiance in my daily work, my interest is somewhat\nrenewed, though I continue to focus on other developments.  All excuses\naside, it really has been too long, and there are some nice goodies in\nthis package for those of you who haven't given up completely.  The\nrelease notes at the end of this e-mail spells them out.\n\nThe version number skipped from 3.1 to 3.4 for reasons I don't\ncompletely understand, but it's designed to avoid confusion with\nreleases developed at LBNL and SGI since my departure.  Most of you are\nprobably using Desktop Radiance or some patched version of 3.1, which\ncorresponds most closely to the release of \"Rendering with Radiance.\"\nVersion 3.4 doesn't have many important differences in its basic\noperation from 3.1, but does contain some new programs and features, as\nI mentioned.\n\nTo get to the new release, go to the LBNL Radiance website (above) and\nclick on \"Download\".  There, you'll be directed to the file\n\"Radiance3R4.tar.gz\", which you will need to unpack on your system.\n\nI have compiled the programs already for Mac OS X, and included a link\nto those binaries on the website as well.  You will probably want to\ninstall XFree86 also, and the following link contains a nice how-to\nmanual.  (Look in the right column for \"XFree86 Install Guide):\n\nhttp://www.macosxhints.com/\n\nI plan to get a set of Linux binaries together, but I need access to a\nLinux machine to do that.  Anyone who wants to do this for me is\nwelcome...  I don't know if these need to be linked statically in order\nto work across different versions.  (Help!)\n\nI expect the C compilers on every system to be extremely upset by the\nsource code, which is old-style K&R C and doesn't even have function\nprototypes.  Let me know if you encounter any serious problems or fatal\nerrors, but don't let the warnings scare you.\n\nCheers,\n-Greg\n\n==============================\nVersion 3.4\n\nFixed bug in rpiece that caused it to incorrectly compute -vs and -vl\n(view shift and lift) offsets.  (Included in 3.1.1.)\n\nFixed bug in xform handling mist's with > 5 real arguments.\n(Included in 3.1.1.)\n\nFixed bug in mist handling routines that caused some incorrect\ncalculations\nfor distant sources.  (Included in 3.1.1.)\n\nAdded ability for lam utility to read from commands.\n\nCreated vwrays command to compute ray origins and directions for\nspecified\nviews or pictures.\n\nChanged rtrace behavior to send bogus record when ray direction is zero.\n(Before, it only flushed values with no corresponding record.)  This\nchange was needed to facilitate its use with the new vwrays program.\n\nModified ies2rad so that it no longer produces glow sources for the sides\nof objects, which caused unnatural dark bands near the ceilings of\ndirect/indirect installations.  (Included in 3.1.4.)\n\nFixed bug in rpiece that caused the -pa option to fail.  (Included in\n3.1.2.)\n\nMade ximage emphasize pixels in the selected region for the 'a' and 'h'\ncommands to adjust the exposure using histogram compression.\n(Included in 3.1.4.)\n\nFixed bug in trad which caused it to fail when there were tabs in the\ninput.\n(Included in 3.1.3.)\n\nFixed bug in pcond that caused it to white-out borders of some fisheye\nviews.\n(Included in 3.1.3.)\n\nAdded facility to ra_tiff to read and write new LogLuv high dynamic-range\nimage formats.\n\nChanged ambient value averaging in rendering programs (-aw option) to use\ngeometric mean rather than arithmetic mean, which tended to arrive at\ntoo-high estimates and cause runaway calculations.  (Included in 3.1.4.)\n\nAdded -g, -p, -m and -d options for gamma, paper size, margins and dpi\nto the ra_ps program.  This allows for much better control over output\nto PostScript printers.\n\nFixed compiles for AIX -- select() incompatibility and macro conflicts.\n(Included in 3.1.6.)\n\nIncreased table sizes to allow up to 4 million primitives when -DBIGMEM\nis defined, provided there's enough virtual memory to hold them!\n\nFixed error in viewloc() for computing view locations for cylindrical\nviews.\n\nWrote rholo, rhcopy, rhpict, and rhoptimize programs for holodeck\ncreation, display, and manipulation.  This is a much more powerful way\nto view a model than rview, though it lacks many of the utility commands.\n\nAdded the ability to separate concatanated animation frames using\nra_rgbe.\nThis output facility of rpict was previously useless because nothing\ncould\nget anything past the first frame.\n\nWrote compamb program to compute a good ambient value for a rad input\nfile.\nUsing this script is preferable to setting the -aw option of rpict, which\nseems to result in splotchy artifacts in many situations.\n\nChanged rad so it doesn't use the -aw option, which was causing some\nrather\nannoying artifacts.  (Added as patch to 3.1.8.)\n\nModified ranimate to change directories before running transfer or\narchive\ncommands.\n\nAdded -pm option to rpict to perform jittered motion blurring.\n\nCreated phisto script and added -I option to pcond for computing\nmultiple, identical exposures.\n\nFixed time zone specifications in gensky.  (Added as patch to 3.1.9.)\n\nFixed bug in mixture functions that caused erroneous modifier loops.\n(Added as patch to 3.1.10.)\n\nWrote glrad program for interactive display of Radiance scenes using\nOpenGL.\nModified objview program to use rad and glrad for rendering.\n\nChanged the way ray weights are computed for participating media\n(including\ndielectrics) so they more accurately reflect a ray's contribution,\navoiding\nsome artifacts with unsealed dielectric objects and the ambient\ncalculation.\n\nFixed problem with dielectric materials with textures where rays that\nshould\nhave penetrated or reflected do the opposite.\n\nCreated ra_hexbit program to generate bitmap files for use with\nhexbit4x1.fnt.\n\n****************** COMPATIBILITY CHANGE ***********************\nAltered mixtures to take the most recent modifier definition\nrather than the last one in the entire description.  Made the\nsame change for illum's and mirror's.  Also, fixed a bug in\nthe antimatter type where it didn't always get the correct\nmaterial for shading.\n\nWrote normtiff program to quickly tone-map and convert Radiance pictures\nand SGILOG-encoded TIFF's to flat RGB TIFF output.\n\nAdded -r option to protate for CCW rotations.\n\nAdded ability to load values from read-only ambient file in rpict,\nrtrace and rview.  This may be useful when starting with the same\nvalues on many processors, where NFS lock contention would slow\nthings down if they also wrote values back to the file.\n\nWrote rhinfo program for printing out holodeck section information.\n\nModified rad \"scene\" variable to allow in-line command specifications.\n\nAdded added -s and -b options to ra_ppm for changing output scale and\nforcing greyscale output.\n\nNow allow negative distances for the fore clipping plane in rpict.\nThis may be useful for rendering holographic stereograms.\n\nAdded -f option to xform to read arguments from files.  This can save\na lot of scene loading time by reducing multiple xform invocations.\n\nAdded support for 15-bit TrueColor visuals in ximage.\n\nAdded (undocumented) -P option to macbethcal for picking chart corners\ndirectly using ximage.\n\nAdded -r option to rholo for opening holodeck files read-only.\n\nAdded CAPDATE field to rendering headers to record render date.\n\n\n", "replyTo": "Subject: [Radiance-general] New Radiance release for Unix (at last!)", "sender": "Greg Ward", "isquestion": false, "tags": [], "id": "<5D1312CE-143F-11D6-911A-00306540F848@lmi.net>", "refs": [], "datetime": "Mon, 28 Jan 2002 14:35:42 -0800", "email": "radiance-general@radiance-online.org", "subject": "[Radiance-general] New Radiance release for Unix (at last!)"}