{"refs": ["<E87974E4-C1B9-417E-9BC6-984F60B04007@biomechanicsinc.com>", "<8161F4A2-C045-4603-BCC1-853758F6FCB3@biomechanicsinc.com>"], "id": "<7C9EECA7-D29F-4604-AB4B-F1F041438564@gmail.com>", "subject": "[Radiance-general] BRTDFunc material tutorial?", "email": "gregoryjward at gmail.com", "body": "\nHi Kirk,\n\nProbably the simplest example using the BRTDfunc type is the\nglaze.csh script output and its associated glaze1.cal and glaze2.cal\nauxiliary files.  These may be found in the ray/src/gen directory of\nthe latest Radiance distribution.  If this is not enough for you, you\ncan look at the attached He.cal file for ideas.\n\nIt might be possible to make use of the Curet database, but no one\nhas done it yet with Radiance, as far as I know.  You would probably\nwant to apply the plasdata or transdata primitives, rather than\nBRTDfunc, which is awkward to use with a large dataset directly.\n\nI'm sorry I don't have any better examples of BRDF use, but the\ncommon method is to fit the data to one of the Gaussian distribution\nmodels, which offer more complete and efficient ray interactions.\nSpecifically, the BRDF types do not account for indirect specular\ncomponents, though I believe there is some support for this in the\nphoton map extension.\n\nAt the 2005 Eurographics Symposium on Rendering, Addy Ngan presented\nthe following paper:\n\nExperimental Analysis of BRDF Models\nAddy Ngan, Fr?do Durand, and Wojciech Matusik\n\nwhich is online at:\n\nhttp://people.csail.mit.edu/addy/research/brdf/\n\nThe \"supplemental document\" linked above contains a very nice list of\nBRDF materials and their fits to the \"Ward model,\" which is used in\nRadiance.  If you are applying this to a recent version of Radiance\n(3.6 or later), then you'll actually want to use the coefficients for\nthe \"Ward-Duer model,\" as it includes the correction to the\nnormalization of my original model, pointed out by Arne Duer of the\nUniv. of Innsbruck (and also Don Walters of Boeing Corporation).\nUnfortunately, Ngan et al. only cover isotropic materials in this\ndocument.  They did measure a couple of anisotropic materials, and I\nhave further information on those, but there isn't really enough and\nthe fit wasn't good enough to make them worth using in Radiance.\n\nI hope this helps.\n-Greg\n\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: He.cal\nType: application/octet-stream\nSize: 4910 bytes\nDesc: not available\nUrl : http://radiance-online.org/pipermail/radiance-general/attachments/20060129/e5d157d7/He.obj\n-------------- next part --------------\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] BRTDFunc material tutorial?", "tags": [], "sender": "Greg Ward", "datetime": "Sun Jan 29 17:54:39 2006"}