{"refs": [], "id": "<43E4D9D5.4060301@gmx.de>", "subject": "[Radiance-general] Problems with CAD/ .dxf impor", "email": "christian_fusenig at gmx.de", "body": "\nHello @all,\n\n1. Problem\nI got Auto CAD 2005 files of studio equipment, like video monitors, edit\ndesks etc. from a company. I want to work with them in Radiance.\nThe 'radout' exporter doesn't work with autocad 2005, so i got an old\nlicense for Autocad 2000. There the exporter works. But the 2005 files\ndont work in 2000! An exported version of .dxf files didn't work either\nin 2000.\nI got a hint from an old mailing list article, to export the files from\nautocad 2005 in a .3ds format. Autocad 2000 can read this format and the\n'radout' export worked. But now i have a '.rad' file with hundreds of\npolygons and its impossible to give them the right material, because i\ndon't know where they belong to. If i create one material and apply it\nto all polygons, i can see the model.\nHow is it possible to get different 'layers' in the file like the body\nof a monitor and the screen separately ?\nI have the feeling that even a simple box is subdivided in lots of polygons.\nDo i have to modify may CAD files in a special way ?\n\n2. Problem\nI tried to import a 'Poser 3D' model of a character with 'dxf2rad'. I\nfollowed the instruction of the 'RwR' book on p. 422, but the command :\n$ dxf2rad  -i figur.dxf -orad figur\ndoesn't really work. When i execute:\n$ dxf2rad   figur.dxf   figur.rad\ni end up like in my first problem. I have hundreds of single polygons\nwith no specific name and the same identifier.\nI am a CAD and a Radiance starter but maybe someone can guide me.\nThanks,...\n\nP.S. Thank you Greg for your last answer concerning color an units. I\nincluded my own display primaries now.\n\n--\nChristian Fusenig\nDiplomand, Medientechnik\nUndergraduate, Media Technology\nHamburg University Of Applied Sciences\n\naddress: Beim Schlump 27/07\n20144 Hamburg\n\nemail:    christian_fusenig@gmx.de\n\nmobile:  ++49 179 5975845\n\n\n\n\n\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Christian Fusenig", "datetime": "Sat Feb  4 17:45:47 2006"}