{"body": "<9fad46bd3ee99e2a4a2ae4657b9617a6@labergedaylight.com>\n\nHi Paul,\n\nsorry, with that separate cache I was referring to a still somewhat\nexperimental radzilla feature ('scene') which is not present in classic\nRadiance\n\nsticking to classic Radiance, or in fact general, the key point to keep\nin mind is perhaps that the ambient cache is independent of the\ngeometry. This means except for the surface normal present at creation,\nthere is no other geometry info the ambient cache can use for deciding\nif it's 'allowed' to use a cached value or not. So it is vital to\nuse a correct -ar resolution value, otherwise the cache cannot adapt\nitself adequately (means closer spaced sample points) in regions with\nhigh variation of illumination.\n(Maybe expressed a bit simplified, Greg pelase correct me if I'm wrong :-).\n\nTaken this little amount of info known to the algorithm, the ambient\ncache in fact does quite a good job in sorting out things, and you see\nthe effect of a higer -ar value in your rendering, the  amount of spill\nlight in the left wall is much lesser now.\n\nGenerally, I would not bother too much about this, as in fact the hollow\nwall is an unphysical situation anyway. In reality, there's conrete\ninside. And a real, i.e. thick wall also means a greater distance\nbetween points outside and inside the room, and together with an\nadequate resolution value this makes it much easier then for the ambient\nalgorithim to get things right, i.e. not use values from the outside for\nthe inside.\n\n-cb\n\n\n\n\n\n\n", "replyTo": "", "sender": "Carsten Bauer", "isquestion": true, "tags": [], "id": "<425AAD68.3060608@t-online.de>", "refs": [], "datetime": "Mon Apr 11 17:49:26 2005", "email": "cbauer- at t-online.de", "subject": "[Radiance-general] clipping planes exposing object interiors?References: <a61ef643b01e08e51bd9745ac274e989@labergedaylight.com>\t<29856.193.137.43.137.1112895298.squirrel@193.137.43.137>\t<ba25b7e9506bfca191b045307dde2ad8@labergedaylight.com>\t<10113.213.58.100.17.1112920140.squirrel@213.58.100.17>\t<42564EDE.50605@t-online.de>"}