{"body": "\nGreg,\n\nThanks for the very helpful advice. Unfortunately I cannot access the link\nyou gave me as it says 'object not found', what's the name of the paper?\n\nApologies if my email was confusing, to simplify, I wish to illustrate to an\naudience the dynamics of artificial light in providing a warm and cool\nenvironment relative to mixing light from 2000 to 6000K as is presented by\nPhilips\n(http://www.lighting.philips.com/gl_en/index.php?main=global&parent=global&i\nd=global&lang=en under' a new concept in office lighting ' and then to\ncompare that with actual warm (morning or evening) and cool (midday) light\nfrom a window.\n\nThe lamp colour defaults are 0.907 0.863 0.4762\n\nI wish to model the same lamp but with a colour of 2200 and 6000K resp.\n\nI now understand that the ies2rad program translates the colour from the -t\nand -c options into the .dat file which is used in generating the\ndistributions. The .fmt file must be one just used by DRAD, so not to worry\nbout that.\n\nNow when I consider the human eye things get complicated. There is no\nspectral power distribution of the fluorescent illuminant and the spectral\nreflectances of your objects are also not available. It is a very simple\noffice scene with angled desks, yellow chair, and light coloured partition\ndividers. Can you suggest where I can get generic data of this kind? Or can\nyou suggest the best way to approach what I am trying to simulate?\n\nThanks,\n\nAnthony\n\nP.S. Apologies for attaching the mailing list, hope this one gets through in\nproper format.\n\n\n\n\n--\nThis message has been scanned for content and\nviruses by the DIT Information Services MailScanner\nService, and is believed to be clean.\nhttp://www.dit.ie\n\n\n", "replyTo": "Subject: [Radiance-general] RE: Lamp colour", "sender": "Anthony J. Farrell", "isquestion": false, "tags": [], "id": "<!~!UENERkVCMDkAAQACAAAAAAAAAAAAAAAAABgAAAAAAAAACJWbgafz6UaL6G5F22Jwe8KAAAAQAAAAMrHrnYfG2k6x18HLtsGJpAEAAAAA@dit.ie>", "refs": [], "datetime": "Tue May 24 18:20:16 2005", "email": "anthony.farrell at dit.ie", "subject": "[Radiance-general] RE: Lamp colour"}