{"refs": ["<44275907.1060204@oriel.ox.ac.uk>", "<1F9D2A0E-480A-419C-B8DD-C69445718C6E@gmail.com>", "<4428173E.4050909@oriel.ox.ac.uk>"], "id": "<D10F8691-3A5F-4142-A92D-F3B454AF5CEC@gmail.com>", "subject": "[Radiance-general] specifying sources", "email": "gregoryjward at gmail.com", "body": "\nHi Will,\n\n\nYou can actually run the same command, inserting -f Sharp.cal after -\nf xyz_rgb.cal (putting it before would do nothing).\n\n\nYes, in fact to get the full benefit of the method, you should start\nwith spectral data and premultiply the spectral power and reflectance\nof each surface material if it's available.\n\n\nHere is one of the missing bits in the process.  Radiance doesn't\ncare what color space it renders in, but the default of downstream\npicture tools is to use the standard primaries defined in color.h if\nnone are specified in the picture file.  Therefore, it is best if you\nspecify the correct color primaries following your rendering using a\nscript like so:\n\n#!/bin/csh -f\n# Add Sharp color primaries to Radiance picture header\nforeach f ($*)\ngetinfo < $f > tf$$\ned - tf$$ << '_EOF_'\n/^PRIMARIES=/d\n/^FORMAT=/i\nPRIMARIES= .6898 .3206 .0736 .9003 .1166 .0374 .3333 .3333\n.\nw\nq\n'_EOF_'\ngetinfo - < $f >> tf$$\nmv tf$$ $f\nend\n\nYou can accomplish the same thing manually using the \"vinfo\" script\nthat comes with Radiance, but the above lets you convert a set of\npictures more quickly and conveniently.  I would call it addSharp or\nsomething like that.\n\nOnce your Radiance picture has the right primaries installed in its\nheader, some but not all of the Radiance tools will know what to do\nwith them.  To convert the image back to the standard Radiance color\nspace, you can use:\n\nra_xyze -r sharp.pic standard.pic\n\nObviously, this would also work with an XYZE input picture.  The\nconverters pcond, ra_bmp, and ra_tiff also understand the PRIMARIES=\nheader line, as does Photosphere, which will display the images\ncorrectly without preconversion.\n\n\nRadiance uses an equal-energy white (x,y)=(1/3,1/3) by default, and\nthis is the default for the Sharp color space and XYZ as well, so no\nneed to convert the white point for Radiance.\n\n\nThankfully, ra_xyze and the other tools do a vonKries-style white\npoint conversion for you, so you needn't worry about this bit.\n\n\nYes, indeed.\n\n\nThe CIE (x,y) chromaticity for a 3200K black body is\n(0.4234,0.3990).  You can use the formula in blackbody.cal to convert\ncolor temperature to spectral power, and then the CIE standard\nobservers to get to XYZ.\n\n\nYou can premultiply the illuminant and reflectance values (using\nSharp RGB) and put neutral light sources for your dominant source\n(tungsten 3200K).  This is spelled out towards the end of section 2\nin the EGWR paper.\n\n\nConvert to Sharp RGB and multiply this value if you don't have\nspectral data.  If you have spectral data for the filters, you are\nbetter off using that.  (I see they have a plot on their website, so\nmaybe they'll give you data as well.)\n\n\nLuminance should pass through the conversion with minimal changes,\nbut this is only really guaranteed if you use properly normalized\nspectra rather than RGB multiplication.\n\n\nThe net result would be (nearly) the same, but the glass would be\nmore expensive to compute.\n\n-Greg\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] specifying sources", "tags": [], "sender": "Gregory J. Ward", "datetime": "Mon Mar 27 20:01:42 2006"}