{"refs": [], "id": "<44325DE0.6070707@ise.fraunhofer.de>", "subject": "[Radiance-general] subtended sun angle in gensky and gendayli", "email": "jan.wienold at ise.fraunhofer.de", "body": "\nHi Francesco,\ndear folk,\n\nI have been in some discussions with a user about gendaylit and\nespecially the cygwin- binary of it.\nWe found out, that the subtended angle of the sun differs from the\noriginal gendaylit (0.533) version to the one, which we can download on\nhttp://www.bozzograo.net/radiance(0.5 for cygwin binary).\nFor that reason, I checked in one of the main references in the solar\nworld (Duffie, Beckman: Solar engineering of thermal processes) and\nfound 32' for the subtended solar angle, which corresponds to 0.5333.\n\nSo I assume you changed the value in the source code, or? But as long as\nyou are not adapting the radiance value of the light source (which you\ndon't do), you'll loose more than 10% of the flux of the sun by reducing\nthe value from 0.533 to 0.5 !!\n\nIs there any reason to use 0.5 instead of 0.533?\n\nAnd a question to Greg: gensky is also using 0.5. Is there any reference\nto that? But: As long as the overall flux is correct, the difference in\nthe angle can be neglected.\n\n\nFor the cygwin-version of gendaylit I would suggest to correct that\nvalue in your version to 0.533 of the source code. In addition to this,\nI'll try to put a gendaylit version on our Web-page, which can be\ncompiled also under cygwin without any modification. If ready, I'll\nannounce this here again.\n\nCheers,\n\nJan\n\n\n--\nDipl.-Ing. Jan Wienold\nProject Manager\nFraunhofer-Institut f?r Solare Energiesysteme\nThermal Systems and Buildings, Lighting and Daylighting\nHeidenhofstr. 2, 79110 Freiburg, Germany\nPhone: +49(0)761 4588 5133 Fax:+49(0)761 4588 9133\njan.wienold@ise.fraunhofer.de\nhttp://www.ise.fraunhofer.de\n\nIn office:\nMo,Tue: 9:00-18:00\nWe-Fr:  8:30-14:00\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Jan Wienold", "datetime": "Tue Apr  4 13:52:07 2006"}