{"refs": [], "id": "<B1FFC07B4DFA55428AFE50D6C7F0A745E8438F@NDJSEVS12.ndc.nasa.gov>", "subject": "[Radiance-general] Question on Setting ambient parameters", "email": "ichard.g.boettger at nasa.gov", "body": "\nHi All,\n\nWe have been using Radiance in our lab for many years performing\nlighting analyses mainly for exterior (on orbit) activities involving\nthe shuttle and the space station. We are now beginning to do more\ninterior lighting evaluations such as the space station laboratory\nmodule.\n\nThe interiors we evaluate tend to have a lot of white, non specular\nsurfaces. So diffuse interreflections seem to be important. I've been\nlooking into the parameters that control the ambient calculation in\nRadiance and I am baffled by the \"-ab\" ambient bounces parameter. I\nthought, by keeping all other parameters the same and increasing the\nambient bounces, the results should be more accurate. That is not what I\nsee from our test case.\n\nWe built a box 17\" x 17\" x 36\" with white walls. The wall material\nproperties were measured. A calibrated light source was placed in a hole\nat one end of the box. Illuminance measurements were taken at various\npoints within the closed box. We then modeled the environment in\nRadiance and took illuminance values at the same points. After some\nexperimentation I settled on the following ambient settings:\n\nav: 0.0 0.0 0.0\naa: 0.08\nab: 3\nad: 1024\nas: 512\nar: 64\n\nThe errors between Radiance and measured values were less than 10%.\n\nBut as I increased the ambient bounces beyond 3, the illuminance values\nat the points kept increasing. By 5 bounces the errors were averaging\nover 60%.\n\nIt appears that I am missing something fundamental. I'm hoping the group\ncan help me out.\n\nThanks,\nrick\n\n\nRick Boettger\nSF3/Habitability and Human Factors Branch\nLockheed Martin Space Operations\nGraphics Research and Analysis Facility\nJohnson Space Center\n\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Boettger, Richard G. (JSC-SF", "datetime": "Thu Apr  6 17:55:26 2006"}