{"refs": [], "id": "<5910A0754536EA4AAD411AE8221C39620118A6D7@nrccenexb1.nrc.ca>", "subject": "[Radiance-general] import from Ecotect to Radian", "email": "Christoph.Reinhart at nrc-cnrc.gc.ca", "body": "\nFabienne, I agree with an earlier comment that the MinGW binaries if\nversion 3R7P1 (see email below) would be your best bet and I urge\nFrancesco and Peter to consider John An's request below and put the\nMinGW binaries on the Radiance online site. I have been working with\nFrancesco's binaries in the past few weeks and they work great!\n\nChristoph\n\n\n\n[Radiance-general] RE: wintel binaries\n\nJohn An ja at a10nyc.com\n<mailto:radiance-general%40radiance-online.org?Subject=%5BRadiance-gener\nal%5D%20RE%3A%20wintel%20binaries&In-Reply-To=>\nWed Jan 25 05:12:05 CET 2006\nHello all,\nI've been lurking for some time, trying to keep up on the developments\nin\nboth Radiance and HDRI.\n\nIn any case, to post something that MAY be of interest to others...\nThis is probably old news, but just in case, I have successfully\nreplaced\nthe Radiance binaries that are installed with Desktop Radiance with the\nupdated ones (version 3R7P1, I believe) that Francesco compiled back in\nOctober. I have been using the Radiance Control Panel (part of EcoTect)\nas\nthe GUI front end to Radiance, and so far, everything seems to work\nsmoothly.\n\nThese are the steps I took:\n1. I copied the contents of each folder (bin, lib, obj, doc, and runs)\nfrom\nthe Mingwin binaries that Francesco compiled into the corresponding\nfolder\nin C:\\Radiance. This allowed me to replace any updated binaries, while\nkeeping the older binaries of programs that were not compiled (ie.\nAnything\nthat requires xwindows)\n2. I copied RadianceIV (the image viewer that comes as part of EcoTect)\ninto\nC:\\Radiance, and then renamed it winimage (the name of the image viewer\nthat\nis installed as part of Desktop Radiance)\n\nI have by no means tested this installation to see if all programs work,\nbut\nso far with the basic renderings I have run, I have had no problems\nwhatsoever. Also, because RadianceIV can post-process images, I have\nbeen\nproducing falsecolor images as well as contour line images directly from\nRadianceIV (aka winimage).\n\nSo, for those who, for one reason or another, can only work in the\nWindow$\nenvironment, these binaries completely revamp Desktop Radiance.\n\nFrancesco, Greg, Lars, or John, would it be possible to maintain updated\nWindow$ binaries so that those of use stuck using Window$ can at least\nbenefit from the latest developments and fixed in the Radiance binaries?\n\n\n\nJohn An\n\n\nOn Oct 8 2005, Francesco Anselmo wrote:\nFor those of you who are interested in using Radiance with the Micro$oft\nOS,\nI've put some fresh binaries here...\n\nOn Oct 14 2005, Rob Gugliemetti replied:\nHey Schorsch, could these [wintel] binaries be \"dropped in\" to an\nexisting\nRayfront installation?\n\n\n\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20060420/59146894/attachment.html\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Reinhart, Christoph", "datetime": "Thu Apr 20 18:21:45 2006"}