{"body": "\nHello,\n\nI apologize if this has been asked and answered -- I couldn't find\nanything searching, though I wasn't sure the best keywords to use.\n\nI am trying to create a luminaire octree, which I will then use with\nreplmarks to place about 20 of these in a larger radiance model.  I am\nmodeling a psuedo-indirect exterior fixture that consists of a 19' high\npole with essentially 4 arms, each with a lamp aimed straight up at a\nreflecting panel.  I have an IES file that represents one arm of this\nfixture.  I have successfully modeled the fixture with the 4 arms and am\nnow wanting to make an octree out of it, including the application of\nthe 4 ies distributions ( more technically the output from ies2rad -- I\nhave a brightdata primitive, referring to a dat file describing the\nlight distribution, that gets applied to an illum surface, then applied\nto a box of polygons).  However, when I do this (both frozen and\nunfrozen), I do not see any light sources.  Essentially, it seems the\nbrightdata primitive does not get preserved in the octree.  My resulting\noctree has all the physically geometry I wanted, but the glow surface\n(used to just illuminate fixture geometry) and the IES distribution\napplied to box of illum polygons does not show up.\n\nWhen I try to separate the geometry with the IES distribution I also\nhave trouble.  I have an octree representing luminaire geometry and then\nI separately add the 4 distributions (which do overlap the geometry\nbounding cube) I get some light but definitely not the same distribution\nof light I'm expecting and began with.\n\nAny help is appreciated. I am hoping to find a more elegant solution\nthan just physically modeling (not replmarking) these 20 fixtures and\nadding 80 markers for the distributions.\n\nZack\n\nPS. I can e-mail a rendering if it helps explain the situation (can't\npost to a website right now)\n\n--\nZack Rogers\nEngineer / Daylighting Designer\nArchitectural Energy Corporation\n2540 Frontier Avenue, Suite 201\nBoulder, CO 80301 USA\n\ntel (303)444-4149 ext.235\nfax (303)444-4304\nhttp://www.archenergy.com\n\n\n", "replyTo": "", "sender": "Zack Rogers", "isquestion": true, "tags": [], "id": "<42B9FE05.3070909@archenergy.com>", "refs": [], "datetime": "Thu Jun 23 02:11:39 2005", "email": "zrogers at archenergy.com", "subject": "[Radiance-general] Luminaire octree"}