{"refs": [], "id": "<001a01c66a26$ca9df990$8ef24581@bauphysik7pc>", "subject": "[Radiance-general] Luminous Efficacy", "email": "niloofar.moghbel at lbp.uni-stuttgart.de", "body": "\nDear All\n\n\n\nAs a part of my Ph.D research I am doing a study about the influence of the colors of surfaces on the illuminance at any arbitrary point of the room under daylighting condition. So I need to know about the exact relationship between the color of a surface and its luminance. For that reason I am going to do some simulation with radiance. As  I have just common knowledge of using radiance, sorry if my questions are too basic.\n\n\n\nThe calculation method used in ?Radiance? for computing  the luminance value is:\n\nLuminance = 179 * (0.265*R + 0.670*G + 0.065*B)                                            (1)\n\nWhere the 179 value has been defined so: The value of 179 lm/w is the standard luminous efficacy of equal energy white light that is defined and used by Radiance specifically for this conversion.\n\n\n\n1. Unfortunately I could not find this value at any other document about lighting and colour measurement. Does anybody know how the value of 179 has been derived? I assume it is the average of all the luminous efficacies in visible light spectrum (380 ? 780 nm). Isn't it ?\n\n\n\n2. As I know, the method for calculating the luminance is:\n\nL = 683 ? I (?) * ? (?) * V (?) d?                                                                             (2)\n\n\n\nWhere: 0=<V (?) < =1 and has a maximum of 1 at 555 nm and I (?) is the Spectrum power distribution at any wavelength of arbitrary spectrum. If I have understood correctly,  in the file ?src/common/color.h? the value of (0.265*R + 0.670*G + 0.065*B) will give us the tristimulus value ?Y?, which is the same as: Y= ? I (?) * ? (?) * ?y (?) d?                                                              (3)\n\n\n\nSince ?y (?) = V (?) for computing the luminance value (according to the methods (2), (3)) what we should do is to multiply the Y value at 683 which gives:\n\nLuminance = 683 * (0.265*R + 0.670*G + 0.065*B)\n\n\n\nI suppose if we use the method (1), it means that we have calculated luminance so: L = 179 ? I (?) * ? (?) * V (?) d?\n\nThat means the value of 179 lm/w has been used as maximum luminous efficacy instead of 683 lm/w at 555 nm??\n\n\n\nAnd if 179 has been used as average, I can not understand why we shoud average again , whereas behind the 683 ?  V (?) d?  (380nm- 78nm) there is the meaning of averaging the luminous efficacy over the visible light spectrum.\n\n\n\nI hope I could make my questions understandable.\n\nIf I have gotten the concept wrong, I would be thankful if somebody could tell me where my mistake is, it would be really important and helpful for the result of my research.\n\n\n\n\n\nThank you in advance\n\nNiloofar\n\n\n\n-------------------------------------------------------------------------\nNiloofar Moghbel\nChair for Building Physics\nUniversity of Stuttgart\nPfaffenwaldring 7\n70569 Stuttgart, Germany\nTel.: ++49 (0)711-685-6301\nFax: ++49 (0)711-685-6583\nNiloofar.Moghbel@lbp.uni-stuttgart.de\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20060427/50d1a62f/attachment-0001.htm\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Niloofar Moghbel", "datetime": "Thu Apr 27 20:16:20 2006"}