{"refs": [], "id": "", "subject": "[Radiance-general] Glass & MTL file troubles... (or how to gofrom Revit to Radiance with little pain...)", "email": "T-Bleicher at bdp.co.uk", "body": "Message-ID: <FCCB55B3313F2341AB3C91810FE1166B013E50A9@ln-s3xch1.bdp.holdings.network>\n\n\nJeffrey McGrew wrote:\n\nSame thing here, though I my company _wants_ to use Radiance.\nI just have to sort out the workflow first.\n\n\nI think your looking for high quality renderings of the interior, so\nyou definitely want to use mkillum to restrict your scene to the interior.\nIf it's just a crude rendering I'd create a sky and wouldn't bother\nmuch about the windows as light source.\n\n\nYou could write a script to delete polygons with material glass based\non their area (reduce 6 sides to 2) and vicinity to already checked\npolygons (reduce 2 to one) but that's not going to be easy. You might\nbe able to edit the windows in MAX to get a Radiance friendly geometry.\n\n\nPlease see the man page for obj2rad. The top section describes\nmaterial mapping based on the context (or material) of the face\nin the obj file. If you use the same set of materials in all your\nmodels you could create a material library and a corresponding\nmapping file. Obj2rad then assigns the correct Radiance material\nname (as far as I understand this point, never used it much).\n\n\nYou're welcome! If you can provide Radiance geometry we might\noffer a discount ... ;)\n\n\nThomas\n\n***********************************************************************************\nThis e-mail, (and any attachments) is confidential and may be privileged.  It may be read, copied and used by the intended addressee only.  If you have received this in error please contact BDP immediately.\n\nIf you have any queries, please contact the sender.\n***********************************************************************************\nBuilding Design Partnership\nRegistered in England No 2207415:\nRegistered Office: Building Design Partnership Ltd, Sunlight House, PO Box 85, Quay Street, Manchester, M60 3JA, http://www.bdp.co.uk\n***********************************************************************************\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Bleicher, Thomas", "datetime": "Thu May 11 10:11:30 2006"}