{"body": "\nHi Huang,\n\nPicture normalization is spelled out in the sidebar on page 262 of\n\"Rendering with Radiance\"\n\nhttp://radsite.lbl.gov/radiance/book/\n\nI have reprinted the sidebar below for your convenience:\n\nThere are generally two cases in which pictures are applied as\npatterns. In the first case,\nthe picture corresponds to a piece of artwork or some printed\nmaterial, and only a sin-\ngle copy of it is mapped into the scene. The type of picture that is\nappropriate is\nusually one whose pixel values correspond to reflectances, so the\naverage value will vary\ndepending on average reflectance. The clip() function is often used\nfor value map-\nping to ensure that reflectances do not exceed 1. In the second case,\nthe picture\ncorresponds to a repeating pattern on some larger surface, such as a\ntiled floor. The\ntype of picture appropriate is usually normalized to an average value\nof 1, so that the\nmaterial primitive will carry the average reflectance. The noop()\nfunction is usually\nspecified for value mapping, since the reflectance multipliers may\ntake on arbitrary\nvalues (corresponding to highlights, for instance). Be aware, when\nyou are using these\nfiles, of which type of picture you have. This is most easily\ndetermined by displaying\nthem with ximage or some similar display program. If about half their\nvalues are\ngreater than 1 (washed out so ?e?1 makes them look about right),\nthey are normal-\nized images for tiling. (See the normpat manual page on the CD-ROM\nfor additional\ninformation.)\n\nThe normpat man page may be found here:\n\nhttp://radsite.lbl.gov/radiance/man_html/normpat.1.html\n\nAdditional information about mapping picture coordinates on page 259\nof RwR.\n\n-Greg\n\n\n", "replyTo": "Subject: [Radiance-general] How to map a texture?", "sender": "Greg Ward", "isquestion": false, "tags": [], "id": "<A9C9E9DB-78FC-48C3-8B42-FA4E92E8786E@gmail.com>", "refs": ["<000c01c57218$c5a25960$1f7af90a@kyotovue4o802h>"], "datetime": "Thu Jun 16 19:21:11 2005", "email": "gregoryjward at gmail.com", "subject": "[Radiance-general] How to map a texture?"}