{"refs": [], "id": "", "subject": "Re: [Radiance-general] water simulationTo: Radiance general discussion <radiance-general@radiance-online.org>", "email": "\"Gregory J. Ward\"", "body": "Message-ID: <A1751205CFFEB548B3E78F10333DCF8805F11B@ENGRMAIL1.engr.psu.edu>\n\nI share Christoph's concerns. It would be helpful to ses an algorithm and a validation. This is not a criticism. The database is very useful, but we need to understand how glazing definitions are prepared. Then we could even add our own measurments - I have a few data sets for different interesting glazing types that I measured in a black lab with a calibrated light source - and send them to LBNL, along with a description of how they were measured. I guess manufacturers would like this. Some glazings might not the attention that they deserve, but if we measure them and add them to the radiance digest and other repositories, we will be in good shape for daylight systems modeling. We could even define a measurement standard, starting out with diffuse and specular components, etc.\n\nMartin Moeck, Penn State\n\n________________________________\n\nSent: Mon 5/15/2006 9:57 AM\nTo: Radiance general discussion\nCc: Stephen Selkowitz\n\n\nHi Nick,\n\nI assume that John is referring to a small c-program that comes with Daysim called gen_single_office.exe. It is a very basic but useful program that allows you to write out RADIANCE scene files and sensor grids for single and open plan offices.  I find the script useful for parametric studies as all geometry and material properties are set via the command line. In case I want to get a transmissivity value, I would type something like\n\ngen_single_office -o scene.rad -I sensor.pts -t 80\n\nIn the resulting scene.rad file you get the transmissivity value in the material description for glazing: 0.871538.\n\nI am using the simplified glass model in Radiance because I currently do not trust the Optics/Windows output to Radiance (mainly because (a) I still do not properly understand it and (b) because I am not aware of a proper validation study). Maybe somebody from LBNL could enlighten us? If Windows/Optics output into Radiance was indeed reliable, it would be invaluable for the Radiance community.\n\nChristoph\n\n\n-----Original Message-----\nSent: Saturday, May 13, 2006 11:38 PM\nTo: radiance-general@radiance-online.org\nNick,\nChristoph Reinhart has a little script that allows you to input your desired transmissivity, and you can extract the correct Radiance definition from the output. I think that may be the way to go for your purposes. I would contact Christoph to see if you can get your hands on the script. Your other option is to select a few actual glasses with the transmissivity that you desire, and test to make sure that they all produce similar results.\n\nJohn\n\n\n\nNick Doylend wrote:\n\nThanks very much for your suggestions.\n\nI looked briefly at outputting glazing data from Optics.  It's probably the way to go if I want to model a 'real' glazing type.  I don't really understand how the BRTDfunc is used; it sets the surface reflectance as well as transmittance doesn't it?  At the moment I'm only considering a 'notional' glazing so I'm just calculating the transmissivity and editing the Radiance file output from Ecotect by hand.  For typical glass types, how much difference would using the BRTDfunc definitions make to my internal daylight calculations?\n\nAs far as reliability of results is concerned, It seems Radiance (in the hands of an expert user) is more capable of realistic results than Ecotect.\nI've noticed that Ecotect's speed of calculation is influenced quite significantly by the number of windows.  It doesn't appear to make much difference to Radiance's calculation time.  I guess it's down to the differences in calculation method but it does make me wonder how well Ecotect handles models with many windows.\n\nOn the other hand, I find Radiance doesn't seem to behave quite as expected.\nFor example, for an equal glazed area I would expect fewer, larger rooflights to give the same average %DF across the whole floor as more, smaller rooflights.  In this case, Ecotect seems to behave as I expect, but Radiance suggests fewer, larger rooflights give the better average %DF.  I wonder why this should be.  Maybe my assumption is incorrect.\n\nNick\n\n\n---------\nJohn An\nEnvironmental Designer\nAtelier Ten\n-----Original Message-----\nSent: Friday, May 12, 2006 6:01 AM\nTo: radiance-general@radiance-online.org\nSend Radiance-general mailing list submissions to\nradiance-general@radiance-online.org\n\nTo subscribe or unsubscribe via the World Wide Web, visit\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\nor, via email, send a message with subject or body 'help' to\nradiance-general-request@radiance-online.org\n\nYou can reach the person managing the list at\nradiance-general-owner@radiance-online.org\n\nWhen replying, please edit your Subject line so it is more specific than \"Re: Contents of Radiance-general digest...\"\n\n\nToday's Topics:\n\n1. Re: water simulation (Ignacio Mun?rriz)\n2. Re: Glass & MTL file troubles... (or how to go    from Revit to\nRadiance with little pain...) (Jeffrey McGrew)\n3. Re: Glass & MTL file troubles... (or how to go    from Revit to\nRadiance with little pain...) (Jeffrey McGrew)\n4. Re: Glass & MTL file troubles... (or how to go    from Revit to\nRadiance with little pain...) (Jeffrey McGrew)\n5. Re: Glass & MTL file troubles... (or how to go    from Revit to\nRadiance with little pain...) (Lars Grobe)\n6. Re: water simulation (Gregory J. Ward)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\n<radiance-general@radiance-online.org>\nMessage-ID: <000901c674f4$5ca3aab0$0301a8c0@aisxeon>\nContent-Type: text/plain;       charset=\"iso-8859-1\"\n\nThanks Greg, i think i'm near to get it, but there is something that is not working, i dont know if Rdot is the DOT product or the -DOT product, i tried the two but it is still not working, i?ve been trying to do some tests with calc and it seems to work but something must be wrong because rpict gives the aiming error, what is the best tool in radiance to test this kind of things, i say, testing cal files while sending rays\n\nvoid prism2 water\n9 transm dx dy dz reflect dxx dyy dzz water.cal\n0\n3 1 1 1\n\n####water.cal#####\nnrwater=1.3;\n\ncos1=if(Rdot,Rdot,-Rdot);\nnratio=if(Rdot,1/nrwater,nrwater);\ndnormx=if(Rdot,Nx,-Nx);\ndnormy=if(Rdot,Ny,-Ny);\ndnormz=if(Rdot,Nz,-Nz);\n\nd3=1.0-(nratio*nratio*(1.0 -(cos1*cos1))); cos2=sqrt(d3); d1bis=cos1; d2bis=nratio*cos2; d1t=(d1bis-d2bis)/(d1bis+d2bis); reflpp=d1t*d1t; d1p=1.0/cos1; d2=nratio/cos2; d1=(d1p-d2)/(d1p+d2); reflp=reflpp+(d1*d1); refl=reflp*.5; transp=1.0 -refl; trans=transp*nratio*nratio;\n\n\nreflect=if(d3,refl,1.0);\ntransm=if(d3,trans,0.0);\n\ndm=nratio*cos1 - cos2;\n\ndx=nratio*Dx+dm*dnormx;\ndy=nratio*Dy+dm*dnormy;\ndz=nratio*Dz+dm*dnormz;\n\ndxx=Dx+2.0*cos1*dnormx;\ndyy=Dy+2.0*cos1*dnormy;\ndzz=Dz+2.0*cos1*dnormz;\n\n\n\n\n----- Original Message -----\nTo: \"Radiance general discussion\" <radiance-general@radiance-online.org>\nSent: Wednesday, May 10, 2006 10:02 PM\n\nHi Ignacio,\n\nYour problem stems from the fact that your modified angles do not obey reciprocity, which says that if you reverse the ray (light) direction, then the angles remain the same on either side.  Both prisma and prism2 require this property to function.  Implementing Snell's law correctly, you should get a working material.\n\nThe vector version of Snell's law may be found in ray/src/ dielectric.c, or in an easier-to-read form on Wikipedia:\n\nhttp://en.wikipedia.org/wiki/Snell's_law\n\nNote that the roles of the inside and outside indices of refraction,\nn1 and n2, reverse when you come from one side of the water verses the other.  The n of water is about 1.3, and air is of course 1.0.\n(OK, quibblers, air is really 1.0003)\n\n-Greg\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\n------------------------------\n\nMessage: 2\nTo: Radiance general discussion <radiance-general@radiance-online.org>\nMessage-ID: <44635939.3010408@becausewecan.org>\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\n\nRob Guglielmetti wrote:\nOK, that's what I thought. I'm not using Mkillum yet, just trying to make the windows into a Illum source with Skyfunc and not having much luck.\nI'll look that up. Thanks for the confirmation.\n\nI'm able to flatten the planes in Max via the 'Edit Poly' modifier.\nThankfully, all of those 6-sided polys have their Y-axis pointing the same way it appears, even if tilted/turned, so I can flatten them all with a single tool. However, this doesn't remove the side polys, and leaves you with two flat faces I suspect, so I'll have to research this method more.\nYeah, my unix god friend pointed me towards AWK as a simple solution.\nI'm just lazy, and can't write code quickly (not a programmer) so I was hoping that there might be a solution out there already.\nDidn't know that. Huh. Well, Revit produces very good models (other than this glass thing) so I'm halfway there I guess.\n\nJeffrey\n\n\n\n------------------------------\n\nMessage: 3\nTo: Radiance general discussion <radiance-general@radiance-online.org>\nMessage-ID: <44635A4F.2040901@becausewecan.org>\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\n\nBleicher, Thomas wrote:\nThat's what we've got going, it's a building with lots of glass and skylights and such. So do you think just having the windows be glass would be enough to get somewhat-close numbers? I fear that not making the glass a secondary light source, and just having it be, well, glass and only having the ray of sunlight bouncing around is going to give me bad numbers.\nThat's what I'm doing, I can edit them in Max via the 'Edit Poly'\nmodifier, but I'll need to research this more. I want to stay away from hand-editing much of anything, for I want to be able to go back and edit the Revit model, re-export to Max, and from there re-export to OBJ2RAD for quick revisions. So far, so good on that front, but this glass thing is leaving me stumped.\nI saw that. I was hoping there was a way to use the .MTL file that's already generated by Max. Basically, I'm just being lazy, and hoping there was an existing solution out there.\nNow that doesn't sound like a bad idea! ;-)\n\n--\n\nJeffrey McGrew\n\nBecause We Can, LLC\n(415) 505-4689\nwww.becausewecan.org\n\n\n\n\n------------------------------\n\nMessage: 4\nTo: Radiance general discussion <radiance-general@radiance-online.org>\nMessage-ID: <44635B7E.4040609@becausewecan.org>\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\n\nLars Grobe wrote:\n'Nicer' is good, but I'm worried about the actual numbers. We want renderings as well as falsecolor images. If we just wanted nice renderings, we'd probably go to vRay, which is kind of our unofficial standard for 'sexy' images. If I can get 'ok' renderings but decent falsecolor images without having to edit the glass or use it as a lightsource I could make this whole process very, very easy.\nYeah, when I export to OBJ I'm picking the 'poly' option which seems to produce polygons and rectangles. Revit produces rectangles/polys as well, it doesn't render everything to triangles like some modelers. So I think I'm ok there.\nYeah, just being lazy, and hoping for an easy solution.\n\nWhat would be the best is to use the new Revit API to write an Radiance exporter, and skip Max altogether. However, this is beyond my abilities and available time currently (and sadly).\n\nJeffrey McGrew\n\nBecause We Can, LLC\n(415) 505-4689\nwww.becausewecan.org\n\n\n\n\n------------------------------\n\nMessage: 5\nTo: Radiance general discussion <radiance-general@radiance-online.org>\nMessage-ID: <16096.1147362681@www111.gmx.net>\nContent-Type: text/plain; charset=\"us-ascii\"\n\nHi!\n\n\nI think you are worried too much here. The numbers should not change so much because of mkillum, the image will look nicer in many cases. But the main reason for mkillum is the following.\n\nIf you have a model where most of the indirect light enters the room through small windows, the probability that the (random) indirect rays, which are send from the surface to several (random) directions to find out its indirect contribution hits the (small) light source is getting low. You can increase the number of random rays, but that won't help sometimes and takes a lot of rendering time. So, in these cases, it is better to bring the light source closer. Bt as it sounds to me, your model is not the typical case with shading devices etc, right? So, if you have simple, large windows, at least your numbers should be fine.\n\nLars.\n\n\n\n------------------------------\n\nMessage: 6\nMessage-ID: <7EC041C2-8F0F-4B87-915C-6D83E5A90A7F@gmail.com>\nContent-Type: text/plain; charset=ISO-8859-1; delsp=yes; format=flowed\n\nHi Ignacio,\n\nRegrettably, I don't have time to debug your function file at the moment.  You can try using the debugcal script that comes with Radiance, giving it ray origins and directions on the standard input or using ximage:\n\nximage test.pic | debugcal test.oct -f water.cal -e '$1=dx;$2=dy; $3=dz;$4=dxx;$5=dyy;$6=dzz'\n\nThis script assigns the standard variables from rayinit.cal so you can find out what is happening.\n\nTo answer  your first question, the Rdot variable is the negative dot product, meaning that it is positive when a ray strikes the front of a surface material, and negative when it strikes the back side of the surface.\n\nHope this helps.\n-Greg\n\n\n\n\n------------------------------\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\nEnd of Radiance-general Digest, Vol 27, Issue 9\n***********************************************\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20060515/457f603a/attachment-0001.htm\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "gregoryjward@gmail.com", "datetime": "Thu, 11 May 2006 10:30:01 -0700"}