{"refs": [], "id": "", "subject": "[Radiance-general] Energy and Buildings Vol. 38, Iss. 7, 2006References: <5910A0754536EA4AAD411AE8221C39620118A781@nrccenexb1.nrc.ca>", "email": "MMoeck at engr.psu.edu", "body": "Message-ID: <A1751205CFFEB548B3E78F10333DCF8805F11C@ENGRMAIL1.engr.psu.edu>\n\nThere is a great special issue Energy and Buildings on daylighting. It has some Radiance articles in it. Very useful.\n\nMartin Moeck, Penn State\n________________________________________________\n\nEnergy and Buildings\nVolume 38, Issue 7,  Pages 715-930 (July 2006)\nSpecial Issue on Daylighting Buildings\nEdited by Christoph Reinhart and Stephen Selkowitz\n\n\n1. Editorial Board\nPage CO2\n\n2. Contents\nPages iv-v\n\n3. Daylighting-Light, form, and people\nPages 715-717\nChristoph Reinhart and Stephen Selkowitz\n4. International Energy Agency's Solar Heating and Cooling Task 31, ?EUR~Daylighting Buildings in the 21st Century?EUR(tm)\nPages 718-720\nNancy C. Ruck\nLiterature Reviews\n5. Considerations for lighting in the built environment: Non-visual effects of light\nPages 721-727\nAnn R. Webb\n6. Occupant preferences and satisfaction with the luminous environment and control systems in daylit offices: a literature review\nPages 728-742\nAnca D. Galasiu and Jennifer A. Veitch\nOccupant Behaviour and Preferences\n7. Evaluation methods and development of a new glare prediction model for daylight environments with the use of CCD cameras\nPages 743-757\nJan Wienold and Jens Christoffersen\n8. Subject responses to electrochromic windows\nPages 758-779\nR.D. Clear, V. Inkarojrit and E.S. Lee\n9. The use of shading systems in VDU task offices: A pilot study\nPages 780-789\nYannick Sutter, Dominique Dumortier and Marc Fontoynont\n10. A field investigation of the intermediate light switching by users\nPages 790-801\nDavid Lindel??f and Nicolas Morel\n11. Using field measurements of desktop illuminance in European offices to investigate its dependence on outdoor conditions and its effect on occupant satisfaction, and the use of lights and blinds\nPages 802-813\nFergus Nicol, Mike Wilson and Cecilia Chiancarella\n12. Adding advanced behavioural models in whole building energy simulation: A study on the total energy impact of manual and automated lighting control\nPages 814-823\nDenis Bourgeois, Christoph Reinhart and Iain Macdonald\nSimulation\n13. Findings from a survey on the current use of daylight simulations in building design\nPages 824-835\nChristoph Reinhart and Annegret Fitz\n14. Goniophotometry and assessment of bidirectional photometric properties of complex fenestration systems\nPages 836-848\nMarilyne Andersen and Jan de Boer\n15. Modelling indoor illumination by complex fenestration systems based on bidirectional photometric data\nPages 849-868\nJan de Boer\n16. Application of the CIE test cases to assess the accuracy of lighting computer programs\nPages 869-877\nF. Maamari, M. Fontoynont and N. Adra\n17. Experimental validation of simulation methods for bi-directional transmission properties at the daylighting performance level\nPages 878-889\nFawaz Maamari, Marilyne Andersen, Jan de Boer, William L. Carroll, Dominique Dumortier and Phillip Greenup\n18. Development and validation of a Radiance model for a translucent panel\nPages 890-904\nChristoph F. Reinhart and Marilyne Andersen\n19. Useful daylight illuminances: A replacement for daylight factors\nPages 905-913\nAzza Nabil and John Mardaljevic\nControls\n20. The New York Times Headquarters daylighting mockup: Monitored performance of the daylighting control system\nPages 914-929\nE.S. Lee and S.E. Selkowitz\n\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: not available\nType: application/ms-tnef\nSize: 8943 bytes\nDesc: not available\nUrl : http://radiance-online.org/pipermail/radiance-general/attachments/20060515/029628fe/attachment.bin\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Martin Moeck", "datetime": "Mon May 15 17:43:05 2006"}