{"refs": [], "id": "<5910A0754536EA4AAD411AE8221C39620118A785@nrccenexb1.nrc.ca>", "subject": "[Radiance-general] Radiance, Ecotect and Daysim", "email": "adiance-general-bounces@radiance-online.org", "body": "\nDear all,\n\nWith the new Ecotect 5.5 (which will hopefully be released very soon)\nyou can automatically export from Ecotect to Daysim. The export takes\nthe scene rotation angle into account so that a scene with a North\noffset of X degree in Ecotect has the same Offset in Daysim.\n\nChristoph\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of\nAndrew Bissell\nSent: Monday, May 15, 2006 1:14 PM\nTo: 'Radiance general discussion'\nWith DAYSIM I believe the sky file is fixed (North = +Y) and therefore\nto test different building orientations you need to export from CAD or ?\npackage new models, this is a little bit inconvenient and at times\ndangerous, i.e. if you are changing materials manually once exported as\nyou could change say three models and not the forth.  I am not sure if a\nchange to the DAYSIM code is possible or if possible is too complex to\nallow the sky file to be rotated as it is with Radiance.\n\nAndrew\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of Nick\nDoylend\nSent: 15 May 2006 17:53\nTo: 'Radiance general discussion'\nHi, I'm having a look at the effect of orientation on daylight\navailability.\nI made four identical models in Ecotect, rotated three of them to get N,\nS, E, W facing models.  I exported to Radiance and brought them into\nDaysim for analysis.  I was surprised to see identical results for the\nmodels.  It appears that Ecotect doesn't take account of the orientation\nwhen it exports the radiance geometry.  What it does instead is to\nrotate the (sunny) sky description.  I guess this is fine for Radiance\nbut Daysim does its own 'sky thing' and so I guess disregards the\nexported sky description.\n\nI thought I could rotate the geometry file as required, but I also need\nto rotate the sensor grid file.  I can use xform on the geometry file to\nspin it round the z axis, but it doesn't appear to work on the grid\nfile.  I read a little in the archives about using cnt and rcalc to\ndefine new grids - it might work if I thought about it for long enough.\nI wonder if there's a quicker and easier way to transform the grid file.\nIs there?\n\nThanks,\n\nNick\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\nThis message has been scanned for viruses by MailControl -\nwww.mailcontrol.com\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "adiance-general-bounces@radiance-online.or", "datetime": "Mon May 15 19:26:27 2006"}