{"refs": [], "id": "<2C2E01334A940D4792B3E115F95B722631A561@exchsvr1.npl.ad.local>", "subject": "[Radiance-general] a note of thanks", "email": "chris.foster at npl.co.uk", "body": "\nhello all,\n\nid just like to say a thankyou to john, greg, alexa and thomas for welcoming\nme to the group and giving me some valuable advice with which to start my\nwork. i personally cant afford your book greg (i berely have ?30 for food a\nweek) but i will see if npl will buy it on my behalf because it does appear to\nbe very useful (judging by the tutorial i have done). ive saved your paper too\nalexa and will read it in the very new future, thanks. that site looks very\ninteresting thomas, should help a lot.\n\ni have a question to the group if anyone would be kind enough to answer it.\nmy boss has told me to look at gettin a CAD program to use in partnership with\nradiance, specifically AutoCAD. does anyone know where i can get this, and if\nit is wise to do so? or alternatively can anyone recommend any other CAD\nprograms? im using radiance on a linux system as a point of note.\n\nthanks again\nchris\n\n\n-------------------------------------------------------------------\nThis e-mail and any attachments may contain confidential and/or\nprivileged material; it is for the intended addressee(s) only.\nIf you are not a named addressee, you must not use, retain or\ndisclose such information.\n\nNPL Management Ltd cannot guarantee that the e-mail or any\nattachments are free from viruses.\n\nNPL Management Ltd. Registered in England and Wales. No: 2937881\nRegistered Office: Serco House, 16 Bartley Wood Business Park,\nHook, Hampshire, United Kingdom  RG27 9UY\n-------------------------------------------------------------------\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20060519/2413b024/attachment.htm\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Chris Foster", "datetime": "Fri May 19 11:40:58 2006"}