{"body": "\nHi!\n\nOnce again, maybe I misunderstood, maybe I just wrote a misleading\ndescription what I wanted to achieve by including the material\ndefinitions (at least the colorpict modifier's definition) into each\nobject file.\n\nI have radiance-files describing geometrical objects, like e.g. a plane\nof marble. This \"object\" is placed by replmarks, which brings it to its\nplace moving and rotating it in space. Now, as the object is made of\nmarble in my example, it also has a surface structure which is to be\nrepresented by a picture, used by the colorpict modifier. Both,\ngeometry and image, are placed at (0;0;0) on the x-y-plane originally,\nand translated by replmarks.\n\nSo far, I either used instances with replmarks or included the object\ngeometry with the colorpict modifier's definition. As such, the xform\noperations performed by replmarks were also applied to the colorpict.\n\nNow, having only the alias definition left in the object file, the\nimage map is not translated together with the object itself any more.\nSo the object moves somewhere in space, while the image map, staying at\n(0;0;0) on xy, visually disappears because it no longer touches its\ngeometry.\n\nDoes that mean that I have to stay with the redundant definition of\ncolorpict modifiers? Using only instances gives bad overhead with such\nsimple geometry, objects with only the alias included don't show the\nmapped image when moved or rotated. Using object geometry with included\ncolorpict definition gives my the \"ambient list\" message that I\ninitially described when beginning this thread. For future projects:\nusing u/v with mesh primitives would prevent all that trouble, right?\n\nSo for now, I think I will have to stay with the redundant material\ndefinitions included in object (geometry) files.\n\nThank you for all the help, CU Lars.\n\n\n", "replyTo": "Subject: [Radiance-general] rvu: too many modifiers in ambient list", "sender": "Lars O. Grobe", "isquestion": false, "tags": [], "id": "<2cb014fc6bad376e1f47ca4682c4db21@gmx.net>", "refs": ["<a932f51195d061d856d96814b21d928e@gmx.net>", "<A5662C01-B0B1-4B30-92C2-D098CA4D51F7@gmail.com>", "<4469a270441082ca2a06e1860a55bcb6@gmx.net>", "<BE949BCD-9EBF-4F7C-9D1F-906487F14017@gmail.com>", "<a21064ffac25d2264e0e62cade2f3820@gmx.net>", "<D50BE2C9-DF24-4F96-A535-F413648337A5@gmail.com>", "<7064b329f33eae3d1c756455ec2472b3@gmx.net>"], "datetime": "Mon Jul 11 19:55:07 2005", "email": "grobe at gmx.net", "subject": "[Radiance-general] rvu: too many modifiers in ambient list"}