{"body": "\nThanks, Rob, for the long answer.\n\nOn Sun, Jul 10, 2005 at 11:25:45 -0600, Rob Guglielmetti wrote:\n\n\nAre there any editable bits in a IES data file? I thought these\ninformations describe this type of luminaire and editing them would\nmean to change the luminaire.\n\nAbout the rendering:\nI remember (about 5 years back) a software from a baltic company\nthat could render the \"footprint\" of a luminaire on a piece of\nwall and floor amazingly quick (some sort of photon tracing,\nI guess). Compared to Radiance it was extremly quick. Computers\nbecame more powerfull since and it should be possible to do a\nsimilar thing with rvu now. I'll have to test that.\n\n\nWell, I was hoping for some de facto file format for the informations\nbeyond IES or EULUMDAT (which in my eyes are interchangeable).\n\n\nThat's what I remember as well. But I read that it's didn't become the\nstandard format it wanted to be. All major manufacturers support it,\nthough. I'll search for their specs. IIRC they used a MSDE database\nfor storage.\n\n\nNot only US manufacturers (see Zumtobel Staff and \"Cophos\" for example).\n\n[...]\n\nThanks for pointing this out. I had a look at it and functional\nseems not to have changed much. This is definitly a tool to work\n_on_ the IES data, not only to view and sort it. To distribute\nthe IES data files (and associated information) they create (or\nhave the manufacturers create) simple Windows cabinet file that\ninclude a directory tree with those files. Association is simply\ndone by filename (one could think of a better way).\n\nIt should be possible to extract these files and use the directory\nstructure as is or with a few conversions. I already do use directories\nto sort the data. Would be a nice way to import manufacturer data.\n\n\nI thought that would be a typical approche. Safes me some thinking as\nwell.\n\n\nAgain thanks for your input.\n\nThomas\n\n", "replyTo": "Subject: [Radiance-general] Radiance Project Organization", "sender": "Thomas Bleicher", "isquestion": false, "tags": [], "id": "<20050711195024.GA4685@zwielich.escape.de>", "refs": ["<20050710134200.GA7194@zwielich.escape.de>", "<7a1385c71af5d7f28d4dc287e222d5bc@rumblestrip.org>"], "datetime": "Mon Jul 11 22:15:39 2005", "email": "tbleicher at zwielicht.escape.de", "subject": "[Radiance-general] Radiance Project Organization"}