{"body": "\nHi Greg.\n\nI followed your suggestion and used sed to replace all the modifiers in\nmy cad files. So marble_grey in object plane_1 is renamed to\nplane_1_marble_grey now. However, there is one question left (in fact I\ndidn't really understand the overflow condition I am causing). If I\nreduce the modifiers that will be included in all the object files to a\nlower number (in fact, only the mappings are included into each, as\nthey are used in most cases). I wonder if I will get the \"too many\nmodifiers\" if I have e.g. three modifiers defined in all object files.\nIs the overrun depending on the total number of modifier definitions,\nor is it the limit that ONE modifier can't be defined more than the\nfixed number? The latter means that I have to change a lot, as I would\nhave to examine the cad files also for the most common colorpict\nmodifiers (which I include into each object file so far). From what I\nunderstood, I am afraid that will be necessary, but before spending\nsome hours on this, I would like to understand the nature of this limit\nof modifier ids.\n\nTIA+CU. Lars.\n\n\n(This is the key point - I don't duplicate the entire material library\nwith each object any more now, but still some modifiers of the\nlibrary.)\n\n\n", "replyTo": "Subject: [Radiance-general] rvu: too many modifiers in ambient list", "sender": "Lars O. Grobe", "isquestion": false, "tags": [], "id": "<7b880146285efe068970750035cd388d@gmx.net>", "refs": ["<a932f51195d061d856d96814b21d928e@gmx.net>", "<A5662C01-B0B1-4B30-92C2-D098CA4D51F7@gmail.com>", "<4469a270441082ca2a06e1860a55bcb6@gmx.net>", "<BE949BCD-9EBF-4F7C-9D1F-906487F14017@gmail.com>", "<a21064ffac25d2264e0e62cade2f3820@gmx.net>", "<D50BE2C9-DF24-4F96-A535-F413648337A5@gmail.com>", "<7064b329f33eae3d1c756455ec2472b3@gmx.net>", "<2cb014fc6bad376e1f47ca4682c4db21@gmx.net>", "<36FADA24-5E3C-4E16-945C-13FA1CECCC0A@gmail.com>"], "datetime": "Fri Jul 15 16:13:39 2005", "email": "grobe at gmx.net", "subject": "[Radiance-general] rvu: too many modifiers in ambient list"}