{"body": "\nHi Iebele\n\nAFAIK, for a view ray hit, Radiance checks if the current view ray\ndirection lies in the'highlight cone' of any light source.\nE.g. for a point source and a perfect zero roughness reflector this\n'highlight cone' would just be a delta peak, i.e. the mirror direction,\nif you start to add microscopic roughness to the surface  your\nhighlight  will start to spread, you'll receive reflection also  if you\ndon't look exactly in the mirror direction.\n\nOk, so far you probably know that yourself, I just repeated it to\nemphasis which effects you control with the mentioned parameters: the\nroughness\nparameter determines how much the highlight will spread out, and the -sj\nsetting determines how much of this spread will actually be sampled,\n(-st as threshold finally  decides if it will be considered specular at\nall or just added to the diffuse component.) So  the sense of -sj lies\nmore in setting values < 1 to produce sharper highlights also for rough\nsurfaces to reduce noise in the image, -- whereas you're looking for the\nopposite, a way to make them appear more diffuse.\n\nNow it might be that the problem in your case lies in the method being\nto limited to describe the floor material adequately\nAs mentioned above, you can tweak the amout of spreading for the\nhighlight, but you cannot consider e.g. materials whose specular\nreflection coefficient itself changes with the incident angle, which\nmight be the reason in your case for the highlights being less apparent\nin the direction you're looking.\nAnd even if you provide BRTDF data for the floor material, it would be\nrather tedious as they would have to be inverted during this calculation\nwhich is -again AFAIK -currently not possible in Radiance.\n\n-cb\n\nPS you might still revert to Giulios Photoshop idea, you could also do\nit in Radiance, i.e. make a pic form two base pics with pcomb (I hope I\nname the correct one here, I always mix them up, pcomb, pcompos, pcond,\npwhatever....), then write a script for that purpose to convert all your\nframes automatically..\n\n", "replyTo": "Subject: [Radiance-general] Reflection vs specularity", "sender": "Carsten Bauer", "isquestion": false, "tags": [], "id": "<42DF3EE8.8010106@t-online.de>", "refs": ["<CC0B19F4C6132F4D9FDDEBF194200FB5234C6E@ldcexc02.global.arup.com>", "<42DE83A4.7090608@iebele.nl>"], "datetime": "Thu Jul 21 00:03:55 2005", "email": "cbauer- at t-online.de", "subject": "[Radiance-general] Reflection vs specularity"}