{"refs": ["<CC0B19F4C6132F4D9FDDEBF194200FB50116E19F@ldcexc02.global.arup.com>"], "id": "<4492C0BE.3040102@gmx.net>", "subject": "[Radiance-general] coherent advice on running Radiance on win32", "email": "grobe at gmx.net", "body": "\nAfter all these great contributions, I want to add some thoughts about\nthe criterias. First, I also have a mingw-compile installed on the\nAutocad-Dektop I am sitting right now. Performance is not critical here,\nbut it is nice to be able to check a scene or do a quick preview here.\nBut if people start to wonder about performance, virtual machines to get\nthe latest out of their radiance-windows set up etc, I think it is easy\nto waste time. IMHO, in any serious production environment, it seams to\nbe the best to set up a rendering machine and spend all the time and\nefforts on the integration of this machine instead of any workarounds to\nrun it in parallel with a windows installation.\n\n1) Your rendering machine has completely different needs. No display\nneeded, no graphic cards, no keyboard, no mouse. Instead pure processing\npower (which may lead to high noise and your machine away from your\ndesktop). If you set up some queuing and power management, you can have\nit up and running 24/7 and just send render jobs from all desktops. If\nyou leave your office, either switch off your desktop or put in an\nopenmosix-cd so it can add some computing power to your linux system.\n\n\n2) Radiance on Linux is very easy to remote-control. In fact, I do all\nmy renderings on a machine 2000 km away over a ssh connection (yes, 56K\nmodem speed, but ssh allows compression), all my data is in a cvs.\nControl by ssh (with X-forwarding). Choose between the many ways to\ntransfer data (either by a mounted volume from a file server which is\naccessed by both desktop and render machine, or by any other transport.\nAsk Schorsch about Rayfronts additional capabilities to remote control jobs.\n\n3) One of the most important point for rendering is stability. I would\nnot want to have people start and quit all kinds of apps, log in and\noff, print etc on a windows desktop while I have a rendering runnings\nsince four days on the same machine. A dedicated machine allows you to\nhave only few, well-tested software in a stable environment.\n\nIf you need a REAL integration (without performance drawbacks) use a\nunix-system. I mentioned that Mac OS is a unix-like with most CAD apps\navailable. So that is the cute, slim laptop set-up, with cad, radiance\n(the very latest without any workarounds) natively running and at full\nspeed. Or take a look at the modelers available for unixes, like Maya,\nHoudini, ... It is not impossible to do 3d on unix.\n\nReally, I see the Radiance/Windows as a nice alternative for people who\nwant to do \"preflight-checks\" on their modeling desktops or do some\nsmall / fast simulations. In fact, most light studies do not require too\nmuch calculation and even few of the brand-new features of the latest\nradiance cvs. For those, vmware and other virtualization solutions are\nok, and the mingw-binaries with the new preview for windows will be\ngreat. But if processing speed is needed, as in a production workflow, I\nreally think that setting up a unix-machine is worth it!\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] coherent advice on running Radiance on win32", "tags": [], "sender": "Lars O. Grobe", "datetime": "Fri Jun 16 16:31:40 2006"}