{"body": "\nI will be out of the office and unavailable from July 21st through July 26th.\n\nMark de la Fuente\nWilliam Tao & Associates\nElectrical Project Engineer\n349 Marshall Avenue\nSuite 200\nWebster Groves, MO 63119\nv. 314.961.5252 x 250\nf.  314.961.5258\n\n\nSend Radiance-general mailing list submissions to\nradiance-general@radiance-online.org\n\nTo subscribe or unsubscribe via the World Wide Web, visit\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\nor, via email, send a message with subject or body 'help' to\nradiance-general-request@radiance-online.org\n\nYou can reach the person managing the list at\nradiance-general-owner@radiance-online.org\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of Radiance-general digest...\"\n\n\nToday's Topics:\n\n1. estimating -av values, color (Lars O. Grobe)\n2. Re: estimating -av values, color (Jack de Valpine)\n3. Re: estimating -av values, color (Carsten Bauer)\n4. Re: estimating -av values, color (Lars O. Grobe)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nContent-Type: text/plain; charset=\"us-ascii\"\n\nHi list,\n\nI have a question regarding the so-often given advice to use a neutral\n-av setting. Why? Is it assumed that in general, the light conditions\nin a building are like that? I have used a -av of .5 .5 .5 here,\ntogether with -ae excluded objects (I wrote enough questions on that\ntopic ;-). This results in a strange image, as the calculated ambient\nis redish, and the ambient-excluded objects appear very strange (like\nblueish) because they are the only objects illuminated by this neutral\ncolor. I can understand that if using -ab 0, setting a colored -av\nwould not make sense as ALL indirect illumination would be neutral\nthan.\n\nSo, am I right that in the case here (I use the -av settings only for\nthe -ae excluded objects in a scene that is rendered with -ab 2), using\na neutral value would be simply wrong and I have to use the \"measured\"\n(from rview) radiance?\n\nTIA+CU Lars.\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: smime.p7s\nType: application/pkcs7-signature\nSize: 2134 bytes\nDesc: not available\nUrl : http://radiance-online.org/pipermail/radiance-general/attachments/20050721/ee571035/smime-0001.bin\n\n------------------------------\n\nMessage: 2\nContent-Type: text/plain; charset=\"us-ascii\"\n\nHi Lars,\n\nEstimating ambient values is part science and part art as far as I have\nlearned over the years. I don't think that I know of a situation where\nwe have ever used a non neutral ambient value. I suppose if one were\ntrying to more accurately account for certain kind of atmospheric shifts\nthis might be a case to do this....?\n\nWithout knowing what your scene looks like (pictures help) it is\ndifficult to help diagnose what is going on. My suscpicion though is\nthat an ambient value of .5 .5 .5  may be too high for the given scene,\nthus the odd looking (\"glowing\") results. A very good option would be to\nuse the \"compamb\" script that Greg wrote. This runs a pass on a small\nimage using fairly high parameters and then does some calculations to\ncome up with a good ambient value for the scene. This is pretty easy to\nuse and does not take that long to return the results.\n\nNote the av value affects the whole simulation not just the excluded\nobjects.\n\n-Jack\n\nLars O. Grobe wrote:\n\n\n--\n#\tJohn E. de Valpine\n#\tpresident\n#\n#\tvisarc incorporated\n#\thttp://www.visarc.com\n#\n#\tchanneling technology for superior design and construction\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20050721/9c31c84e/attachment.html\n\n------------------------------\n\nMessage: 3\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\n\nHi Lars,\n\nyou can think of the av value being a substitution for the rest amount\nof light hovering in the room which gets ommitted in your calculations\nwhen you follow\nambient rays only a certain number of bounces deep, instead of following\nthem infinitely deep.  And if you have a neutral source, but red walls,\nthe  diffuse indirect light will be red, and so should also be the av\nsetting, to be a correct compensation...\n\nSo generally your're right in considering the color bias of the scene\nalso for the constant ambient approximation. But definitely also keep in\nmind  Jacks remark on -av affecting all objects...\n\n-cb\n\n\n\n\n\n------------------------------\n\nMessage: 4\nContent-Type: text/plain; charset=\"us-ascii\"\n\n\nHi,\n\nthanks to Jack and Carsten for the responses, this list is always of\ngreat help. I didn't really use -av in previous projects, but need it\nnow because the complexity of the scene forces me to exclude modifiers\nfrom the ambient calculation.\n\nAs far as I understood, the influence of the -av setting (on objects\nnot excluded from the ambient calculation) can be dimmed by the -aw\nsetting, and as I start my renderings with an \"ouverture calculation\"\nthe computed ambient distribution should be stable enough. Am I wrong\nhere?\n\nCU Lars.\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: smime.p7s\nType: application/pkcs7-signature\nSize: 2134 bytes\nDesc: not available\nUrl : http://radiance-online.org/pipermail/radiance-general/attachments/20050722/1b3f3e7f/smime-0001.bin\n\n------------------------------\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\nEnd of Radiance-general Digest, Vol 17, Issue 20\n************************************************\n\n", "replyTo": "", "sender": "grobe@gmx.net", "isquestion": true, "tags": [], "id": "<227fab3d7079cb70f772c7218959fc95@gmx.net>", "refs": [], "datetime": "Fri, 22 Jul 2005 11:47:07 +0200", "email": "Lars O. Grobe", "subject": "Re: [Radiance-general] estimating -av values, colorTo: Radiance general discussion <radiance-general@radiance-online.org>"}