{"body": "\nHi all,\n\n\n\nCurrently I'm working on a booklet showing my Radiance work.\n\nAlso some of the technicalities of Radiance are discussed.\n\nI have to agree with what 'Rendering with Radiance' states on this topic;\nits hard to explain precisely what makes Radiance fundamentally different\nfrom other rendering solutions. Call me a pretentious prick, but I find it\neffective in communicating Radiance' value to consider an image a virtual\nprototype rather than just a rendering. To get this point across, its\nimportant to show a potential client the different levels of significance a\nRadiance rendering has. It all comes down to filtering in the end.\n\nI think its important to explain how a pcond -h image differs from a\nnon-filtered image (well, pfilt)\n\n\n\nI'm trying to sum up the different levels of information one can extract\nfrom a single Radiance image using:\n\n\n\nPcond,\n\nGlare,\n\nFalsecolor (nits, Dayfact, lux)\n\n\n\nWhich is basically what one can expect from someone who has reasonable\ncontrol over Radiance.\n\nOf course, there's lots of more ways of extracting different levels of\ninformation from Radiance / a Radiance image.\n\nSpeaking for myself, I have been messing around piping rtrace intersections\nto a .dxf file, showing a beautiful diagram of the way Radiance is computing\nits light interactions. But I'm not that funky with image filtering.\n\n\n\nAny suggestions of interesting / original ways of extracting information of\na Radiance image?\n\n\n\n\n\nCheers,\n\n\n\nJelle.\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20050719/a8c44b8a/attachment.html\n", "replyTo": "", "sender": "Jelle Feringa / EZCT Architecture & Design Research", "isquestion": true, "tags": [], "id": "<mailman.10.1121782916.370.radiance-general@radiance-online.org>", "refs": [], "datetime": "Tue Jul 19 16:21:56 2005", "email": "jelle.feringa at ezct.net", "subject": "[Radiance-general] image filtering"}