{"refs": [], "id": "", "subject": "[Radiance-general] Re: Radiance for Mac OS X", "email": "adiance-general@radiance-online.org", "body": "Message-ID: <40436984-BE88-11D6-B7C1-00306540F848@lmi.net>\n\nHi Galen,\n\nI just uploaded a new copy of the Radiance binaries for Mac OS X v10.2\n(Jaguar), since the old 10.1 binaries don't seem to work on the new\nversion of the operating system.  There are no \"Dummy\" pages for\nRadiance, and no dummies as far as I know who can do anything with the\nsoftware...  We really should have some quick introduction somewhere, I\nsuppose.  Right now, the README file that comes with the main\ndistribution is about all we have, and that's probably out of date.\n\nAnyway, to install Radiance on your system, just grab the main\ndistribution from the website Download link\n(http://radsite.lbl.gov/radiance of course), then download the MacOS X\nbinaries from the same place.  Copy the binaries to /usr/local/bin or\nsomeplace like that, and the libraries (ray/lib in the main\ndistribution) to /usr/local/lib/ray.  This is explained on the download\npage as well.\n\nUnfortunately, there is a small snag in this procedure, which is that\nit fails to install certain critical library files, such as\n\"rayinit.cal\", which are normally copied as part of the makeall build\nprocess.  Therefore, it's often best to run \"makeall install\" anyway on\nyour system, to make sure you get everything, in which case the\nbinaries aren't really needed, unless of course you don't have the\ndeveloper tools that come free with Mac OS X installed on your system.\n\nTo manually copy all the library files, just execute the following\ncommands after you've unpacked the ray directory:\n\n% cd ray\n% cp -rp lib /usr/local/lib/ray\n% cp -p src/*.cal /usr/local/lib/ray\n\nThat should do it!\n-Greg\n\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Re: Radiance for Mac OS X", "tags": [], "sender": "Greg Ward", "datetime": "Mon, 2 Sep 2002 08:25:45 -0700"}