{"refs": [], "id": "<FCCB55B3313F2341AB3C91810FE1166B013E5123@ln-s3xch1.bdp.holdings.network>", "subject": "[Radiance-general] ies data.", "email": "adiance-general-bounces@radiance-online.org", "body": "\nHello Chris.\n\nYou don't need exactly the IES files mentioned in the book.\nYou can get them from any manufacturer from their website.\n\nYou just have to figure out how the navigation of the catalogues\nand download of the IES files work ...\n\nThe results you will get will differ from the results of the book,\nso you can't check your procedures against the book.\n\nThomas\n\n\n\n\n_____\n\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of Chris\nFoster\nSent: 18 July 2006 10:58\nTo: Radiance general discussion\n\n\nHello everybody,\n\nIm after more help im afraid, but hopefully only a quick question.\n\nIm following RwithR book and am attempting to do scene 2. On pages 161\nand 163 of the book (I am trying to make some spotlights for the art\ngallery) it mentions that the IES photometric files i need are on the\nwebsite. I cant find them! Can someone tell me where there are please.\n\nI thought i had all the support files downloaded alreayd when i got\nradiance but as i did a file search and i didnt come up with anything,\nobviously not.\n\nThanks\n\nChris\n\n\n\n-------------------------------------------------------------------\nThis e-mail and any attachments may contain confidential and/or\nprivileged material; it is for the intended addressee(s) only.\nIf you are not a named addressee, you must not use, retain or\ndisclose such information.\n\nNPL Management Ltd cannot guarantee that the e-mail or any\nattachments are free from viruses.\n\nNPL Management Ltd. Registered in England and Wales. No: 2937881\nRegistered Office: Serco House, 16 Bartley Wood Business Park,\nHook, Hampshire, United Kingdom RG27 9UY\n-------------------------------------------------------------------\n\n\n\n***********************************************************************************\nThis e-mail, (and any attachments) is confidential and may be privileged.  It may be read, copied and used by the intended addressee only.  If you have received this in error please contact BDP immediately.\n\nIf you have any queries, please contact the sender.\n***********************************************************************************\nBuilding Design Partnership\nRegistered in England No 2207415:\nRegistered Office: Building Design Partnership Ltd, Sunlight House, PO Box 85, Quay Street, Manchester, M60 3JA, http://www.bdp.co.uk\n***********************************************************************************\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20060718/a033db1c/attachment.html\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "adiance-general-bounces@radiance-online.or", "datetime": "Tue Jul 18 22:29:55 2006"}