{"refs": [], "id": "", "subject": "[Radiance-general] gensky questionReferences: <44C4A66C.7030006@bankerinter.net>", "email": "chris.foster at npl.co.uk", "body": "Message-ID: <2C2E01334A940D4792B3E115F95B722631AF2B@exchsvr1.npl.ad.local>\n\nHi Everybody,\n\nI have an aim to find out the luminance of the sun after it hits a perfect diffuser. I'm sure i have done this the very long way round, but at least this step by step way i understand what is going on.\n\nI have used gensky to create a sun, and have created a sky and a ground (see bottom).\n\nAside question- the default for meridian using gensky is -120, and as im in london i have put my meridian to 0. this seems to give me a negative azimuth angle for my early morning sun and a positive for my afternoon sun. this means that the sun is rising in the west and setting in the east....im sure its the other way round?????????? the first four lines of the 10am automatically generated gensky file can be seen below\n# gensky 07 24 10 -a 52 -o 2 -m 0 +s\n# Local solar time: 9.76\n# Solar altitude and azimuth: 48.8 -52.0\n# Ground ambient level: 18.3\n\nI have created different files for the sun throughout one day, started and finishing at 7, so that i have 13 different sun's.\nI have then oconv each file to my material file, found a nice view directly at the sun for each time in rview and then rendering the image in rpict and finally pcond each image with a -h- option to get a good exposure level. So i have 13 images all looking directly at the sun. When i then click on a point and press l it gives me a value for (i think????) luminance.\n\nI now want to place a perfect diffuser with a normal pointed directly at the sun in each of these 13 positions and measure the illuminance reflecting off of the diffuser. My big question is, how do i orientate the diffuser so that it is normal to the sun each time, and any recommendations as to what material/values i should make the diffuser from??\n\nMy sky.mat file just for completion\n\nskyfunc glow sky_glow\n0\n0\n4 1 1 1 0\n\nsky_glow source sky\n0\n0\n4 0 0 1 180\n\nskyfunc glow ground_glow\n0\n0\n4 1 1 1 0\n\nground_glow source ground\n0\n0\n4 0 0 -1 180\n\n# ground plane\n\nvoid plastic ground_mat\n0\n0\n5 .28 .18 .12 0 0\n\nground_mat ring groundplane\n0\n0\n8 0 0 -.01\n0 0 1\n0 30\n\nThanks\n\nChris\n\n\n-------------------------------------------------------------------\nThis e-mail and any attachments may contain confidential and/or\nprivileged material; it is for the intended addressee(s) only.\nIf you are not a named addressee, you must not use, retain or\ndisclose such information.\n\nNPL Management Ltd cannot guarantee that the e-mail or any\nattachments are free from viruses.\n\nNPL Management Ltd. Registered in England and Wales. No: 2937881\nRegistered Office: Serco House, 16 Bartley Wood Business Park,\nHook, Hampshire, United Kingdom  RG27 9UY\n-------------------------------------------------------------------\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20060724/2eb17213/attachment.htm\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Chris Foster", "datetime": "Mon Jul 24 14:39:20 2006"}