{"refs": [], "id": "<FCCB55B3313F2341AB3C91810FE1166B013E5130@ln-s3xch1.bdp.holdings.network>", "subject": "[Radiance-general] rad and/or mgf to 3ds/dxf", "email": "adiance-general-bounces@radiance-online.org", "body": "\nHi Christiano.\n\nIf you have only the geometry you want in one or more\nfiles then you don't need to read them into a modeller to\nuse them in Radiance. Just create a triangular marker in\nyour modeller and use !replmarks to replace it with\nthe contents of the file.\n\nIf you know where this file will be in your new project\nyou could use \"!xform\" as well. But this requires that\nyou have to work out position and rotation before.\n\nIf it's not urgent for you you can also wait until I am motivated\nto include my old scene file parses in my Blender interface.\nBlender has a 3ds exporter but I don't know much about the\nquality of the files it creates. And your geometry should only\nbe triangles or my scripts would ignore it.\n\nFor now I'd look into xform or replmarks.\n\nThomas\n\n\n_____\n\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of Dr.\nCristiano Guarnaschelli\nSent: 24 July 2006 17:39\nTo: radiance-general@radiance-online.org\n\nHello to everyone\nI never wrote in here before cause all my questiond found an answer in\nthe archives\nbut not this time.\n\nI lost a source 3d file of an old project, I have only in radiance\nformat (and then mgf format)\nnow I need it to inset it in a bigger project of the same place, but I\nneed to have it at first\nin 3ds/dxf/vrml or whatever known format to place it correctly in the\nnew project.\n\nI tryed to convert it in mgf format with rad2mgf and it seems correct\n(I've checked it with a mgf viewer)\nbut if I tryed to convert it into vrml vith mgf2inv (with the -vrml\noption) evey vrml viewer tell me the vrml file is wrong.\n\nAnyone has an idea? Any help is welcome\n\nThanks all\n\nCristiano\n\n\n\n\n\n\n\n\n***********************************************************************************\nThis e-mail, (and any attachments) is confidential and may be privileged.  It may be read, copied and used by the intended addressee only.  If you have received this in error please contact BDP immediately.\n\nIf you have any queries, please contact the sender.\n***********************************************************************************\nBuilding Design Partnership\nRegistered in England No 2207415:\nRegistered Office: Building Design Partnership Ltd, Sunlight House, PO Box 85, Quay Street, Manchester, M60 3JA, http://www.bdp.co.uk\n***********************************************************************************\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20060724/98602b3f/attachment.html\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "adiance-general-bounces@radiance-online.or", "datetime": "Mon Jul 24 20:59:45 2006"}