{"body": "\n\nHi Thomas,\n\nOn Jul 10, 2005, at 7:42 AM, Thomas Bleicher wrote:\n\n\nThis looks very cool, Thomas.\n\n\nI love the way you create 3D objects in the scene that represent the\nphotometry...\n\n\nI think the main thing is to be able to see the critical bits of the\nfile, such as multiplier, photometric type, lamp lumens and quantity,\nnotes, and either a text- or image-based view of the distribution. From\nthere one could be able to edit these bits and save variations on the\nfixture.  A basic-quality rendering of the luminaire would be great\ntoo, placed in a box maybe so one could see the distribution in a space\n(like my ltview utility does).  The 3d object representing the\ndistribution is very cool, but having a rendering of the luminaire in a\nspace would also be useful for troubleshooting purposes, especially\nwhen using illum spheres and all.\n\n\nYou're talking about a couple of things here.  In terms of raw\ninformation exchange, the formats you mention are the standards.  I'm\nmostly familiar with the .IES format since I'm in the USA, but many\nEuropean manufacturers I deal with also make their data available in\nIES format.\n\nThen you mention a \"presentation utility\", and a database.  These are\ndefinitely things that exist, and not in any standard format.  I have\nused Dialux in the past and I know what you are referring to there;\nthey have an internal database that stores information about luminaires\nincluding the photometric distribution, picture(s) of the image, and\nkeywords.  Basically building on the IES file with more organizational\ninformation & fields. I believe the makers of Dialux also publish the\nformat for these databases and that is how the manufacturers have been\nable to provide downloadable plugins to Dialux.  Often, US\nmanufacturers will release calculation software that has an excellent\ndatabase of *their* luminaires, but allow you to define lums based on\nany IES file, for obvious marketing reasons.\n\nThere is also a product called Photometric Toolbox, made by Lighting\nAnalysts (the people who produce  the very popular AGI lighting\ncalculation product).  I only used an old version of the program, so\nthis may not be a totally accurate description, but as I recall it was\nessentially a very detailed photometric file viewer/converter.  With\nthis tool, you could look at the raw data in an IES file but have it\npresented in an easy-to-read manner, with edit boxes for all the\nparameters, and polar curves of all the planes.  It could also convert\nbetween type B and type C formats.  This is a very useful tool; it's\nnot a database, but an excellent viewer.  The functionality of this\ntool is essentially what I was describing in my answer to your question\nabove.  Having this functionality, along with the ability to add\nextended information to search on like manufacturer, lamp type,\nmounting, notes, etc, and the ability to then copy any luminaire into a\nproject database, would be great!\n\n\nI generally collect all the ies files (and converted .rad/.dat files\nfrom ies2rad) for a given project and keep them within the job file\nhierarchy.  In general for any given project there will be a manageable\namount of files, and it also makes sense because I often modify things\nlike lumen output on a per-fixture basis so libraries don't necessarily\nwork.  HOWEVER, that's not to say that having a library of *standard*\nluminaires from which to select *project* luminaires, as described\nabove, isn't a great, great thing.\n\n\nI'm a materials wimp; at my previous company I used grey materials,\ndealing with straight reflectance only.  I had my reasons.  But I have\nstarted at a new company very recently and they use a little more color\nand use patterns and mixtures a lot more.  From what we all see from\nthe Radiance images that get shared in this community, I think the\nlatter case is more the rule than the exception. And the Jedi Masters\nof cal files on this list have done some pretty amazing things with\nmixtures & .cal files, so from where I'm standing, I'd say there's no\nend to the complexity.\n\n\nI make my models so that each layer gets a certain material assignment\nwhen I export (I use Georg's radout utility for this).\n\n\nall of the above. Again, since I used to do a lot of grey-only\nrenderings, it was pretty straightforward to use intuition and\nexperience to assign a basic reflectance to a material.  There are lots\nof good glass definitions in that Optics5 program, too.  But special\ncases demand special practices, and I have in the past done fancy\nmeasurements of one-off glass/diffuser combinations.  I think I had\nsome pictures of that setup in my presentation from the 2003 Radiance\nWorkshop.\n\n\nSometimes.  =8-)\n\nI hope some of you can share their experiences and information\n\nI hope this was useful to you, and I hope more people share here as\nwell.  Radiance is such an open ended collection of tools, there are as\nmany ways to approach modeling and rendering with it as there are\nusers.\n\n\nSounds good, and hello to you Francesco, I'm glad to hear you are OK in\nlight of last week's event (Greg told me you and yours were OK).\n\n=================\nRob Guglielmetti\nwww.rumblestrip.org\n\n\n", "replyTo": "Subject: [Radiance-general] Radiance Project Organization", "sender": "Rob Guglielmetti", "isquestion": false, "tags": [], "id": "<7a1385c71af5d7f28d4dc287e222d5bc@rumblestrip.org>", "refs": ["<20050710134200.GA7194@zwielich.escape.de>"], "datetime": "Sun Jul 10 19:26:37 2005", "email": "rpg at rumblestrip.org", "subject": "[Radiance-general] Radiance Project Organization"}