{"refs": [], "id": "<FCCB55B3313F2341AB3C91810FE1166B013E5133@ln-s3xch1.bdp.holdings.network>", "subject": "RE: [Radiance-general] gensky question", "email": "adiance-general-bounces@radiance-online.org", "body": "\nChris.\n\nGlad you solved your problem, sort of.\n\nI just want to add one comment:\n\nIf you add the \"-i\" switch to rpict/rtrace the surface properties\nfor the last bounce will be replaced with a Lambertian surface\nwhich is what you are looking for (completely diffuse reflection).\n\nFor you it might be the simplest solution to do an irridience\ncalculation with only one bounce. The real properties of the\ndiffuser (your plastic definition) don't make any difference then.\n\nFor an illustration of this see the color prints of the reception\ndesk in RwR (plate 15).\n\nThomas\n\n\n\n_____\n\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of Chris\nFoster\nSent: 25 July 2006 09:30\nTo: Radiance general discussion; Radiance general discussion\n\n\nHi Tom,\n\nThanks for your help. The angles thing has sorted itself out now. I\nthought i read somewhere that east of south was positive, but obviously\nnot! From my results it makes sense if it were your way.\n\nI near enough did what you recommended already, but i dont think i\nclarified what i wanted judging by your response.\n\ntransmittance.\n\nI am after a material with 100% diffuse reflectance\n\nMy material,reflector.rad\n\nvoid plastic reflector_mat\n0\n0\n5 1 1 1 0 0\n\nreflector_mat ring reflector\n0\n0\n8 0 0 0\n0 -1 0\n5 0\n\nAn example of one of my xforms,\n\n!xform -n reflector -t 0 0 10 -rz 38 -rx -48.8 reflector.rad\n\nThese angles are following the azimuth and altitude of the sun, i used\nrz and rx because of the way my ring was made. I have made my plastic\nmaterial with a 0,0 spec and roughness value to get a perflectly\nreflecting diffuse surface (r,g,b are 1,1,1). Im now aim to look\ndirectly at my surface and measure the luminance from it.\n\nThere isnt really a question in this email, just thought id reply to\nyours, thanks for your help!\n\nChris\n\n\n\n-------------------------------------------------------------------\nThis e-mail and any attachments may contain confidential and/or\nprivileged material; it is for the intended addressee(s) only.\nIf you are not a named addressee, you must not use, retain or\ndisclose such information.\n\nNPL Management Ltd cannot guarantee that the e-mail or any\nattachments are free from viruses.\n\nNPL Management Ltd. Registered in England and Wales. No: 2937881\nRegistered Office: Serco House, 16 Bartley Wood Business Park,\nHook, Hampshire, United Kingdom RG27 9UY\n-------------------------------------------------------------------\n\n\n\n***********************************************************************************\nThis e-mail, (and any attachments) is confidential and may be privileged.  It may be read, copied and used by the intended addressee only.  If you have received this in error please contact BDP immediately.\n\nIf you have any queries, please contact the sender.\n***********************************************************************************\nBuilding Design Partnership\nRegistered in England No 2207415:\nRegistered Office: Building Design Partnership Ltd, Sunlight House, PO Box 85, Quay Street, Manchester, M60 3JA, http://www.bdp.co.uk\n***********************************************************************************\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20060725/722eeb72/attachment.htm\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "adiance-general-bounces@radiance-online.or", "datetime": "Tue Jul 25 11:02:58 2006"}