{"refs": [], "id": "", "subject": "[Radiance-general] glare on monitor screen", "email": "erika_yuniarti at yahoo.com", "body": "Message-ID: <20060726010908.99706.qmail@web51909.mail.yahoo.com>\n\nHi Greg,\n\nThank you for your quick reply.\nI see, so I could not use \"findglare\".\n\nis L_fore the luminance of the monitor screen? is L_back the luminance of the surroundings? So you suggest to compare brightness of the monitor screen against brightness of the surrounding?it that so,what contrast level is acceptable?\n\nHowever, usually, veiling glare on monitor screen causes very bright portions on the screen that the display on the monitor cannot be seen anymore. Isn't it a brightness comparison between areas on the monitor screen it self (instead of brightness comparison between the screen and the surrounding). Or is it not a matter of brightness comparison, instead it is a matter of too much luminance on the screen that we cannot see clear image anymore? If that so, how to get the luminance values occured on the screen (besides the iso contour and false color, because they dont really show value)?\n\nMany thanks, Greg.\n\nBest regards,\n\nYuni\n\n\n\"Gregory J. Ward\" <gregoryjward@gmail.com> wrote:\nHi Yuni,\n\nDiscomfort glare and reflected glare off a VDT screen are very\ndifferent, which is why using findglare doesn't tell you anything.\nThe contrast lost on a VDT due to reflected glare is a little tricky\nto measure, and there are no corresponding standards. You can think\nof the contrast as the difference between the foreground and the\nbackground divided by the adaptation luminance (usually the same the\nbackground):\n\nContrast = (L_fore - L_back)/L_back\n\nSince reflected glare increases foreground and background equally,\nthe new contrast becomes:\n\nContrast_veil = (L_fore - L_back)/(L_back + L_veil)\n\nThe larger the veiling luminance, the lower the contrast. Does this\nmake sense?\n\n-Greg\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n---------------------------------\nHow low will we go? Check out Yahoo! Messenger?s low  PC-to-Phone call rates.\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20060725/6bbd2453/attachment.htm\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] glare on monitor scr", "tags": [], "sender": "erika yuniarti", "datetime": "Wed Jul 26 03:09:16 2006"}