{"refs": [], "id": "<FCCB55B3313F2341AB3C91810FE1166B013E514B@ln-s3xch1.bdp.holdings.network>", "subject": "Re: [Radiance-general] calculation weirdness", "email": "adiance-general-bounces@radiance-online.org", "body": "\nHi Mark.\n\nI don't know how your going to evaluate your model but if you're\ncalculating\nillumination over an area or even falsecolor image I wouldn't worry much\nabout\nthe accurate contribution of one individual luminiare. You'll have\nseveral luminiares\ncontributing at any given spot which should even out the computational\ndifferences\nof each luminaire.\n\nBased on your description the -ds option will probably have no effect\nanyway\nbecause all your light sources are small in relation to their distance.\nIf you want\nto compare results between different applications you'd have to setup\nthe same\nmodel in each and run a standard (for each application) calculation.\nThis will\naccount for the different types of calculation methods (tracing vs.\nradiosity)\nand details (as the -ds effects).\n\nPlease note that I have seen a noticeable slowdown in my recent\ncalculations\nof scenes with large numbers of light sources. If anyone has an idea how\nto\noptimise that it be great.\n\n\nThomas\n\n\n_____\n\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of Mark\nde la Fuente\nSent: 03 August 2006 00:26\nTo: Radiance\n\nGreg,\n\nI really appreciate you looking into this.  I was going to drop the -ds\nparameter all together, confident with my AGI/Radiance check!\n\nThe light fixture in question is a sportslighting fixture for a hockey\nrink.  There will be 200+ fixtures all aimed at slightly different\nspots.  The fixtures as you mentioned have a very strong but also very\nnarrow distribution in one axis.  It sounds like I need to run a -ds\nconvergence checker at 100' to see what the largest value possible\nshould be to get accurate results.  (I typically do this for the ab\nparameter only and just settle on some of the others based on rad's\noutput)\n\nDoes the size of the scene affect the -ds parameter?  My final scene\nwill be a large stadium.\n\nGiven this distribution, how will having an illum at each fixture\nhelp/hurt renderings or point-by-point calculations?\n\nThank you for your guidance.\n\nMark\n\n\n***********************************************************************************\nThis e-mail, (and any attachments) is confidential and may be privileged.  It may be read, copied and used by the intended addressee only.  If you have received this in error please contact BDP immediately.\n\nIf you have any queries, please contact the sender.\n***********************************************************************************\nBuilding Design Partnership\nRegistered in England No 2207415:\nRegistered Office: Building Design Partnership Ltd, Sunlight House, PO Box 85, Quay Street, Manchester, M60 3JA, http://www.bdp.co.uk\n***********************************************************************************\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20060803/e10b5d1c/attachment.html\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "adiance-general-bounces@radiance-online.or", "datetime": "Thu Aug  3 10:25:39 2006"}