{"refs": [], "id": "<2C2E01334A940D4792B3E115F95B722631A57C@exchsvr1.npl.ad.local>", "subject": "[Radiance-general] making my own ies fil", "email": "chris.foster at npl.co.uk", "body": "\nHello again,\n\nIm making my own ies file for a spotlight i am using in a lab from data i found at the manufacturers website. i have a graph of angle against brightness and i know the format of such a file from readin RwR. however i can seem to find a description for some of the values needed, either in the book or in the online manuels\n\nthe file i have made so far looks as so, but the text in square brackets are the values im not sure of (ignore the oridnary parenthesis, i simply havent measured my spotlight yet.). i havent got access to the iesna standard and so was wondering if anyone on the list has knowledge of this area.\n\nTILT=NONE\n\n1 [lumens per lamp] [candela multiplier] 11 [photometric type] [units type] (w) (l) (h)\n[ballast factor] 1 4000\n0 0.5 1.5 3 4 5 6 7.5 9 11 17\n0\n1880000 1800000 1600000 1000000 600000 400000 250000 120000 100000 60000 0\n\ni think that all the square bracket values have to be 1, but the one im most unsure of is the lumens per lamp value. this is most definately not 1, does anyone know what this is and how i calculate this for my spotlight??\n\nthanks in advance, any help much appreciated as usual (wish i could give something back!).\n\nChris\n\np.s. still havent solved my last email either if anyone has any suggestions...\n\n\n\n\n\n-------------------------------------------------------------------\nThis e-mail and any attachments may contain confidential and/or\nprivileged material; it is for the intended addressee(s) only.\nIf you are not a named addressee, you must not use, retain or\ndisclose such information.\n\nNPL Management Ltd cannot guarantee that the e-mail or any\nattachments are free from viruses.\n\nNPL Management Ltd. Registered in England and Wales. No: 2937881\nRegistered Office: Serco House, 16 Bartley Wood Business Park,\nHook, Hampshire, United Kingdom  RG27 9UY\n-------------------------------------------------------------------\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20060803/f7c41ea7/attachment.htm\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Chris Foster", "datetime": "Thu Aug  3 10:32:45 2006"}