{"body": "\nOn Tue, Aug 16, 2005 at 10:08:31 -0700, Fitzsimmons, Rob wrote:\n\nOut of interest I did a small search in Apples support section and\nfound how to do it on a OS X server:\n\n==================================================================\nThis article describes how to change the default application for\nopening a particular a file.\n\n\nThe default application is the one which opens when you open a file.\n\nMac OS X Server matches applications with files they can open\nautomatically. You can't influence the available default applications\nfor files in any way other than by installing or removing applications.\n\nTo change a file's default application, follow these steps:\n\n1. In the Workspace Manager, select the file by clicking on it.\n2. Open the Tools menu and choose Inspector.\n3. Choose Tools from the Inspector pop-up menu.\n4. Select an application's icon from the center of the window.\n5. Click Set Default.\n==================================================================\n\nDon't know if this is any help on a workstation.\n\n\n\n^ looks like this is in your HOME directory\n\nIf you only deleted your private copy Preview will use system defaults.\nYou need to change those but as far as I can tell Apple does not want\nanybody to mess with the *.plist file(s). They look like some kind of\nmime-type definition to me and would be the right place to do it.\n\n\n\"Opens hdr and exr\" ... successfully? If so, *.plist definitions have\nbeen replaced (I saw in an article that this would happen during the\nupdate) and OS X simply does not know any more that there is another\napplication for these file types.\n\nIf it doesn't work, I think the *.hdr extension gets missinterpreted\nas HDRI TIFF files and the default for TIFFs (Preview) is started.\nI don't know *.exr; some species of JPEG?\n\n\nOT: I was going to buy an iMac in the near future. But this short\ntrip into Apple user information did put me off a bit. Everthing\nthat looked halfway technical wasn't even mentioned on any of\nthe pages. But that's exactly the kind of information I'm looking\nfor when I have to consult manuals.\n\nI know there are a few MaxOS X user out there. How are your\nexperiences with Radiance etc. on OS X? Do the Unix apps work\nin a one-mouse-button environment?\n\n\nAny feedback is welcome,\n\nThomas\n\n\n\n\n", "replyTo": "Subject: [Radiance-general] Mac Tiger quirks", "sender": "Thomas Bleicher", "isquestion": false, "tags": [], "id": "<20050817094236.GA7324@zwielich.escape.de>", "refs": ["<B8DD8375FCE2C94B9F170D9277C1FA2B8C5A60@corvallis>"], "datetime": "Wed Aug 17 20:20:36 2005", "email": "tbleicher at zwielicht.escape.de", "subject": "[Radiance-general] Mac Tiger quirks"}