{"refs": ["<2C2E01334A940D4792B3E115F95B722631A57C@exchsvr1.npl.ad.local>\t<44D1F584.7070600@psu.edu>", "<2C2E01334A940D4792B3E115F95B722631AF37@exchsvr1.npl.ad.local>"], "id": "<44D22050.5010300@rumblestrip.org>", "subject": "[Radiance-general] making my own ies fil", "email": "pg at rumblestrip.org", "body": "\nChris Foster wrote:\n\n\nHi Chris, et al.:\n\nChris, the fresnel lens has nothing to do with the lamp.  Just want to\nbe clear on that.  The lens is part of the luminaire itself and its\nbehavior should be accounted for in the candela values you got from the\nwebsite. Arri makes luminaires, not lamps.  (And that 4K fresnel is a\nkick-butt luminaire!!  I used their 2K spots in my theatre days; those\n4K's must _really_ throw some light. The lamp socket for the 2K was\nnuts, with its own mechanical clamp that held it in place.  I still\nremember the lamp code: CYX.  Don't ask me why that tidbit remains in my\nbrain sixteen years after the fact, when I can't even remember what I\nhad for dinner last night.  Anyway...)\n\nThe lumens/lamp field really should contain the initial lumens of the\nlamp used in the luminaire when it was photometered, per the\nspecification.  That's just good practice in case someone else ever uses\nthat file and they have a different lamp; that way one can tailor the\noutput to reflect a different lamp output using the multiplier (see\nbelow).  The fact of the matter is that in Radiance (and I'm pretty sure\nthis is true of AGI as well), it really doesn't matter what you put in\nthe lumens/lamp field in the ies file, as the candelas are what they\nare, regardless.  Like I said, it's just good practice to follow the\nspec.  That said, in Lightscape, if you changed the lumens in that\nfield, you changed the output of the luminaire, but this is not really\nthe way things are supposed to work.  That's what the multiplier is\nfor.  The multiplier field allows you to adjust the luminaire output to\nreflect a different lamp output, as well as the effect of all the other\nelements that go into the Light Loss Factor (LLF).\n\nThis brings me to mean vs. initial.  Lamp catalogs usually have both\nvalues, the mean value quantifying the lamp's lumen depreciation over\ntime.  It's nice to have both because then you can compute more accurate\nLLD multipliers (mean lumens/initial lumens=LLD), as they vary from lamp\ntype to lamp type, and manufacturer to manufacturer. Of course LLD is\nonly one element of the total LLF.\n\nNote also that ies2rad has its own multiplier (-m), so you could leave\nthe multiplier in the ies file at 1 and use the -m to apply your\nmultiplier (this is what I do).\n\n- Rob Guglielmetti\nwww.rumblestrip.org\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] making my own ies fi", "tags": [], "sender": "Rob Guglielmetti", "datetime": "Fri Aug  4 19:12:14 2006"}