{"body": "\nHi Rob,\n\nDid you try doing a \"Get Info\" from the Finder on a .pic file and\ntelling it to set the default application for all files of this type\nto Photosphere?  That's what I would try.  It's better to use\nthe .hdr suffix, because Macintosh PICT files sometimes use .pic\nrather than .pict as their suffix, and this confuses OS X no end.  In\nparticular, Tiger is always running it's mdimport application on .pic\nfiles, which takes forever to figure out that it's not actually a\nPICT file at all but a Radiance picture.  The details of why this is\nare hard to explain and I'm not sure I understand them myself, so\nit's just better to use .hdr for Radiance pictures on the Mac.  I\nshould probably change rad to use this suffix by default, but it's\nhard to change a convention like that without breaking a lot of\nthings other people have built on it.\n\n-Greg\n\nP.S.  Regarding Thomas' comments *.exr is the OpenEXR format, and\n*.hdr is usually interpreted as Radiance format under OS X.  The\nlatest mouse from Apple is 3-button, and there is generally good\nsupport for third-party three-button mice.  The one-button mouse\nworks using the control- and option- keys, but it's a pain that way.\nThere is a good set of OS X books available from O'Reilly, which may\neven be found as free PDFs online.  My favorite is \"Mac OS X for Unix\nGeeks,\" which I found on the web somewhere.  I have the hardcopy as\nwell, but I can't seem to locate the link at the moment -- maybe it\nwas a fluke.\n\nOn Tue, Aug 16, 2005 at 10:08:31 -0700, Fitzsimmons, Rob wrote:\n\n\n\n", "replyTo": "Subject: [Radiance-general] Mac Tiger quirks", "sender": "Gregory J. Ward", "isquestion": false, "tags": [], "id": "<0F777486-2C39-409B-80FE-1BCA17A9DF5B@gmail.com>", "refs": ["<B8DD8375FCE2C94B9F170D9277C1FA2B8C5A60@corvallis>", "<20050817094236.GA7324@zwielich.escape.de>"], "datetime": "Thu Aug 18 05:20:55 2005", "email": "gregoryjward at gmail.com", "subject": "[Radiance-general] Mac Tiger quirks"}