{"body": "\nradiance-general-request@radiance-online.org wrote:\n\nHi Federico,\n\nmy two cents thoughts on validations in general: Rather simple ideas\nreally. Sorry if they are a boring repetition of standard engineering\nprocedures to many of you. Having watched and read some Phds on this\nsubject, it seems worth mentioning so. Many other works on the subject\ndon't need any of my humble comments. Nothing personal: \"you\" is just\nto-whome-it-may-concern.\n\n* Your results will most likely /not/ match you simulation. Be\nprepared to figure out why. Don't just say \"oh, they are 15% off\nat point A und only 5% at point B, so we're better than 15%.\nHomework done, can I go play outside ?\" . Check what's happening\nbetween point A und B.\nCompare whole curves rather than individual points to see whether\nthere's an offset or a complete different shape. Both cases ask\nfor an explanation.\nIf they match perfectly, vary some parameter and check that the\nmatch results from you doing the right thing and not from sheer luck.\nIf simulation and measurement differ by Monte Carlo and/or\nmeasurement noise, you're knighted and may retire to a splendid\nlocation on the planet.\nThe aim of a validation is not so much an impressively small\ndeviation between simulation and measurement, but a proven\nunderstanding of the mechanisms that lead to the deviations.\n* nature lies to you cold blooded at any moment you're not alert.\nStart with the simplest imaginable case and check that. Build\ntrust in your results by adding complexity stepwise and in a\ncontrolled manner.\n* Keep track of your setup, materials and procedures. If you find\nout at a late stage that rho_dh of molton differs mysteriously\nfrom the value measured at the beginning (maybe because the large\npiece of molton that was cut down to smaller patches wasn't\nhomogenous), you want to know which measurements might have been\naffected by this. Be prepared to recheck. That of course works\nmore easily with automated measurements than with long runs of\npure hand measurements.\nUnless you're taking data on Nessie or Mt. St. Helen, plan to\nrepeat a measurement. Just for the fun of it and to see whether\nnature is still on your side.\n* get as much data points as you can. Timewise (some people are\nsuprised to find that artifical lamps have a 50/60Hz modulation\nand that shows if values are not averaged over a longer period or\nif no special power source is used. output decrease with age, too)\nand spatial. IMHO the latter is higher valuable:\nMeasurements at 3 points in a box are, at least to me, not enough\nto understand what's happening inside.\n* really diffuse reflecting materials are hard to find and it gets\nharder with higher incident angle (away from the surface normal)\n* \"The systematic experiment\", edited by J.C. Gibbings, Cambridge\nUniv. Press 1986 has some introduction to this art. Likely there\nare a piles of similar nice texts available.\n* Don't trust your superiors telling you that this bit of extra\neffort is not worth it.\n* To the superiors: Allocate enough money to do it right.\nValidations are like antibiotics: Do it fully or don't do it at all.\n\nanyway, - enough nagging comments,\ncheers\nPeter\n\n--\npab-opto, Freiburg, Germany, http://www.pab-opto.de\n[see web page to check digital email signature]\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20050911/467c62ea/attachment.htm\n", "replyTo": "Subject: [Radiance-general] Re: Materials for scale model room", "sender": "Peter Apian-Bennewitz", "isquestion": false, "tags": [], "id": "<432359E7.9060303@pab-opto.de>", "refs": ["<200509090957.j899vSUB008807@light-simulation.com>"], "datetime": "Sun Sep 11 00:13:21 2005", "email": "apian at pab-opto.de", "subject": "[Radiance-general] Re: Materials for scale model room"}