{"refs": ["<CC0B19F4C6132F4D9FDDEBF194200FB5018C43A9@ldcexc02.global.arup.com>"], "id": "<450035FD.7020506@visarc.com>", "subject": "[Radiance-general] Acad2004 Exporters?", "email": "jedev at visarc.com", "body": "\nHi Giulio and Mark,\n\nI think that this is an excellent question! Although we do have\nAcad2000, I have been using 2004 and this has required changes in\nworkflow, not all of them ideal. I am not sure what the development path\nis for Rayfront and thus radout as these seem to still be at Acad 2000,\nperhaps Georg can provide some input. As an alternative, I purchased\nPolytrans from Okino (www.okino.com). The nice thing about this is that\nwe can read in a dwg and write out an obj file. The dwg import seems to\nbe fine for surface type primitives. I have had some issues though with\nacis solid models. One of the nice things about radout was the ability\nto leverage the other primitive types available such as cylinders and\npolygons with vertices > 3!\n\nI am not sure how many Autocad users there are in the Radiance community\n(perhaps we could get some number on this through a survey?) But it\nwould be nice to come up with a geometry translation mechanism that\nwould be easier to grow along with successive releases of Autocad. My\nconcern with 3dsout is the limitation on geometry/objects and control of\ngeometry tessalations. I have been meaning to sit down and look at this\na bit more.\n\nIt seems to me that the best solutions would be to have a smooth method\nfor going from .dwg to .obj directly from Autocad.... and that can work\nin successive releases of the Autocad. There is a application called OBJ\nExport from www.fpsols.com for $200US, this might be worth looking into.\n\n-Jack\n\nGiulio Antonutto wrote:\n\n--\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20060907/33701935/attachment-0001.html\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Acad2004 Exporters?", "tags": [], "sender": "Jack de Valpine", "datetime": "Thu Sep  7 17:09:19 2006"}