{"refs": [], "id": "", "subject": "[Radiance-general] Re: Radiance workshop, etc.", "email": "adiance-general@radiance-online.org", "body": "Message-ID: <156D4FC8-DA09-11D6-9720-00306540F848@lmi.net>\n\nHi Everyone,\n\nI just read through Rob's very well-written and flattering article on\nthe workshop, which didn't include a single reference to baseball (must\nhave been some oversight).  I hope the other attendees enjoyed it half\nas much as he did -- for my part, the workshop gave me loads to think\nabout as I go into Exponent for the last time today to clean out my\ndesk and contemplate what I'll do next....\n\nI'm sorry that my presentation on Radiance OpenSource raised more\nquestions than it answered.  I didn't want to conceal the fact that I\nhave no clear notion what it means, myself.  I am hoping it will be a\ngood thing.  Certainly, having LBNL continue to own and \"manage\" the\nUNIX source code is not desirable, and the fact that they're willing to\nlet it go is something I take as a very good sign for the rest of us.\nStill, it is nice to have a single, authoritative version on which to\nbase derivative works, so we may have to think up a way to do this\n(possibly with LBNL's cooperation).\n\nLike I said, the workshop gave me lots to think about, and I made a\nlist of the improvements I would like to see in  the source code,\nordered here from most to least compelling from my standpoint.  I would\nwelcome feedback on this list with additions or things you think ought\nto be made a priority.  The ones with an asterisk are features that\nothers have already done most (or all) of the work on, and the ones\nwith double-asterisks are enhancements I really need someone else's\nhelp in doing.\n\nPossible Radiance Enhancements\n-----------------------------------------------\n1. ANSI-fication and CVS, library conversion\n2**. Integration of Windows version or addition of Windows portability\nand functionality\n3*. Photon map\n4. Direct calculation improvements\n5. Cylindrical arcs\n6. Rendering with light probes\n7*. Complex fenestration\n8**. Rendering artifact assistance pages\n9**. Material library/assistance pages\n\nI would also encourage people to try out Roland Schregle's photon map\nextension to Radiance 3.4.  I think this could be a very good thing for\nRadiance, but it probably needs some critical stress-testing before\nbeing rolled into the main distribution.  At least, it would if I had\nwritten it!\n\n-Greg\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Re: Radiance workshop, etc.", "tags": [], "sender": "Greg Ward", "datetime": "Mon, 7 Oct 2002 08:26:00 -0700"}