{"refs": [], "id": "", "subject": "[Radiance-general] Re: Radiance workshop, etc.References: <156D4FC8-DA09-11D6-9720-00306540F848@lmi.net>", "email": "adiance-general@radiance-online.org", "body": "Message-ID: <3DA2B54D.E014E8D2@t-online.de>\n\nHi all,\n\na first feedback from my point of view...\n\nHaving one central code base is certainly something desireable, although\nit may take more effort than thought at the first glance, including some\nof the 'good old' hierachy and scheduling. People taking over\nresponsibilities for certain parts and deliver results more or less\nwithin some schedule, test persons willing to bother about sending back\ndetailed feedback and so on ...\n\nPersonally, I would like to have some more time for checking out the new\nstuff, thinking about further ideas of modifications and ways how to\ncombine everything. But, in order to keep things and persons from\ndrifting apart some sort of deadline might be helpful, by which those\nwho are interested to continue further development deliver short lists\nor possible short reports of interesting topics similar to Gregs\n'wishlist', plus additional information about the amount of work they\nare able to spend on it. People form the user's end of the line should\nbe integrated in the same manner right at the beginning, too, giving\ninfo about what improvement is needed in the everyday applications.\nA very vague assumption of mine is, that when the process finally\nstarts, it will not just end in pouring all add-ons into one bigger\nbucket (stirr well !), but that a rather comprehensive renewal will take\nplace in the end.\n\n(OK, this sounds very much of a typical politians speech, talking big\nabout organizing without actually doing something. For a personal\nexcuse, there have been elections in Germany recently, so still everyone\nhere is in some way infiltrated by that spirit ...)\n\nso long\n\n- Carsten\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Carsten Bauer", "datetime": "Tue, 08 Oct 2002 12:37:01 +0200"}