{"refs": ["<00c101c6e323$95ac37d0$c000a8c0@JELLE>\t<451C0DC2.7060400@rumblestrip.org>", "<451C1583.1080504@visarc.com>"], "id": "<451C1BC4.7040505@rumblestrip.org>", "subject": "[Radiance-general] ambient setting for very large scenes", "email": "pg at rumblestrip.org", "body": "\nJack de Valpine wrote:\n\nHiya Jack,\n\nThis was discussed at length on this list a couple years ago, I started\nthe thread and I think my feeble understanding of lightprobes caused the\ndiscussion to get a bit scattered.  Bottom line: there are issues with\nthis approach, especially if you are going for numeric accuracy, but I\nalso think that Greg's mksource addition may have solved some of that\n(as I understand it, mksource is sorta like a \"mkillum for lightprobes\").\n\nI still do not have a fisheye lens so my lightprobe experiments... have\nnot begun.  Jack, I was really impressed with your presentation at the\nWorkshop (actually, I was impressed with all of the ones I've read so\nfar!), it renewed my interest in playing around with that stuff.\nSliding off the topic a bit, has everyone seen the new Canon PowerShot\nG7 that's coming out next month?  It looks really nice, with film\nemulation up to ASA1600, and the all-important autobracket for us HDR\nheads, in a compact size (and a separate film speed dial!).  With a 10mp\nsensor, I'm really curious to see how well the ASA1600 pics come out,\nbut even a low-noise 800 would make me really happy.  Guess I'll wait\n'till the folks at www.dpreview.com put it through its paces...\n\nAnyhoo, the thread I mentioned way back in the first paragraph of this\nreply begins here:\nhttp://www.radiance-online.org/pipermail/radiance-general/2003-May/000818.html\n\nThe discussion spills over into June, so look for those too.  For some\nreason the posts don't appear continuously even when sorted by thread.\n\n- Rob\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] ambient setting for very large scenes", "tags": [], "sender": "Rob Guglielmetti", "datetime": "Thu Sep 28 21:00:25 2006"}