{"body": "\nRob Guglielmetti wrote:\n\n\nHi Rob,\n\nI recommend SuSe as an Linux distribution that is relatively easy\nto install and configure. Other people seem to get good results\nwith Mandrake. Don't even think about RedHat if you're not very\nfamiliar with Linux already.\n\n\n\nThis may not be exactly what you wanted, but if you use the -bv-\nboolean switch, then all faces will become invisible from the\nback...\n\nMy personal philosophy about this point is (so far anyway), that\nthis is the task of the modeller you're using. Once you're\nrunning rview (or any similar program), it's really a bit late\nto do anything about flipped orientations. The fact that the\norientation doesn't matter at all for most material types in\nRadiance has helped me to stick to this position.\n\nOf course, there is the rshow program by Peter, which works on\nmost unix systems with OpenGL. I don't know if anyone has tried\nto port it to OS X though, nor if it can do anything about\nsurface normals.\n\n\n\nRadiance normally does fine with thin boxes. There *may* be light\nleaks in low quality simulations when the ambient density is too\nloose. But with tougher settings, you will rarely see this.\n\n\n\nThe latter is the case, as it's a simple colorpict pattern.\nYou will lose the accountability of the CIE sky model when you\nmap a picture onto the sky sphere.\n\nBtw: Rayfront has a simple drop-down box in the sky configuration\ndialog to select sky maps... ;)\n\n\n\nIn theory, this sounds easy. In practise, it would open a\npandora's box of consistency problems, not to mention the\nquestions about how to assign materials to subentities within\nsuch blocks that are placed on different layers. I have been\npondering those issues for years, and haven't come up with a\npractical solution yet.\n\nI think there was some talking about doing this for Desktop\nRadiance, but I have no idea if they actually got around to\nimplement anything of the kind. Since DR never looks back at the\nRadiance data it has written, but simply overwrites it when you\nchange anything within Autocad, it can avoid many (but not all)\nof the consistency questions.\n\nIf you're feeling adventurous and know some Autolisp, then you\ncould try to hack my old torad.lsp translator. If you manage to\ncome up with a fool proof solution, then I'll immediately\nintegrate it into Radout.\n\n\n\nBoth DR and Rayfront can do this for you.\n\n\n\nIf anyone wants to share their creations, I'd be more than\nwilling to establish and maintain an online repository.\nOf course, if you use materials that others have created and\nexpect them to be physically meaningful (beyond just looking\nnice), then you'll have to run some sanity checks on them\nyourself, especially if you're thinking about procedural\ndefinitions.\n\n\n\nIf you buy DesignWorkshop, then I think you also get a tree\ngenerator program, which produces data that can be exported to\nthe Radiance scene file format.\n\n\n\nThere's something wrong either with your machine, or with the\nOS X port of Radiance. There is no direct relation of processing\npower and clock speed between different CPU types.  In general,\nPowerPC CPUs require about half the cycles for the same results\n(ie. your 550 MHz G4 is roughly aequivalent to a 1 GHz P4). If\nyou get only the same performance per cycle on your G4, then\nyou're probably running into a system bottleneck of some kind\n(disk access, RAM size etc.).\n\nDoes your HD go to sleep when it isn't accessed for a few\nminutes, or do you have any other power saving features turned\non? Were the Radiance binaries compiled with comparable\noptimization flags? It may also be that a laptop simply has a\nrelatively slow HD installed to preserve energy. If you're low on\nRAM, then this could stall a Radiance simulation to some degree.\n\n\n\nNo, this must have something to do with your specific system.\nThe G4s *are* faster than most Pentiums out there.\n\n\n\nLinux isn't optimized for multi-CPU systems yet, although it's\ngetting better. It is even more difficult to directly equate\nclock speed with processing power on multi-CPU system than it\nalready is with normal boxes. The overall architecture of the\nsystem (both in hardware and software) can influence the result\nup to a factor of 50% or more. If the amount and type of your RAM\nor the configuration of your HD isn't carefully balanced against\nthe CPU specifications, then you'll get quite surprising results.\n\n\n-schorsch\n\n--\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch.com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n\n\n", "replyTo": "Subject: [Radiance-general] Too many questions to fit in the subject", "sender": "Georg Mischler", "isquestion": false, "tags": [], "id": "<Pine.BSF.4.30.0205091411570.21119-100000@emancholl.pair.com>", "refs": [], "datetime": "Thu, 9 May 2002 14:16:30 -0400 (EDT)", "email": "radiance-general@radiance-online.org", "subject": "[Radiance-general] Too many questions to fit in the subject"}