{"refs": [], "id": "", "subject": "[Radiance-general] Radiance documentation organization", "email": "vangelis at unb.br", "body": "Message-ID: <20061104155615.1742B267521@mail.unb.br>\n\nGreg,\n\n\n\nWe can try MOODLE, it's a PHP aplication, with very nice features like wiki,\nf?rum, chat, etc.\n\n\n\nI have used this for two years in my classes in Universidade de Brasilia\n(Brazil)\n\n\n\nIt's possible to control the login and administration is very easy.\n\n\n\n\n\n\"Moodle is a course management system (CMS) - a free, Open Source software\npackage designed using sound pedagogical principles, to help educators\ncreate effective online learning communities. You can download and use it on\nany computer you have handy (including webhosts), yet it can scale from a\nsingle-teacher site to a 50,000-student University. This site itself is\ncreated using Moodle, so check out the Moodle Demonstration Courses or read\nthe latest Moodle Buzz.\"\n\n\n\nPlease, look at\n\n\n\nhttp://moodle.org/\n\n\n\nNice to hear from you\n\n\n\nvangelis\n\n\n\n\n\nWe tried a Wiki for Radiance already and it didn't go anywhere, and\n\nwas inundated by adware.  I don't really blame Wiki for this -- the\n\nproblem was more lack of groundswell and necessary controls, which\n\nI'm sure we could remedy if we were a little more organized.\n\n\n\nI am not versed on the merits of or differences between Plone and\n\nWiki, and I know very little about either.  Both Peter Apian-\n\nBennewitz and Daniel Fuller (the sysadmin for LBL's website) say\n\nPlone is better, but you would have to ask them for details.  I'm\n\nwilling to trust others' judgement on the matter, as I have no\n\nexpertise in the area of web management.  I can make some simple\n\nHTML, and that's about it.\n\n\n\nThe important thing is that we agree to contribute material, and the\n\nsite administrator should be happy and/or paid for their efforts,\n\nwhich I suspect would be substantial using either system.  In other\n\nwords, setting up a Wiki site may be easy, but protecting it from\n\nadware while developing useful content may in fact be easier with\n\nPlone.  I leave the debate to others.\n\n\n\n-Greg\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20061104/01ded843/attachment.htm\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Radiance documentation organizati", "tags": [], "sender": "Evangelos", "datetime": "Sat Nov  4 16:56:41 2006"}