{"refs": [], "id": "<D8A5C637-CDD9-4F66-9CE0-069697434E85@dmu.ac.uk>", "subject": "[Radiance-general] 3.8 Falsecolor Scal", "email": "jm at dmu.ac.uk", "body": "\nRob,\n\n\nI beg to differ.  When I first decided on a false-colour scale (quite\nsome years ago) I had about 15 to choose from in IDL (data analysis/\nvisualisation package similar to MATLAB).   The one they called\n\"gamma\" (black-blue-red-orange-yellow-white) seemed a natural since\nit corresponded to my expectations (i.e. cold through to hot).  I've\nbeen using it ever since.  I clip the scale to go from the brightest\nblue through to yellow.  I clip at the low end because part of the\nblack to blue transition looks a little too close to the blue-red\ntransition.  White at the top is removed so that high values in\nfigures wouldn't bleed into background white paper on hard copies.\nExample:\n\nhttp://www.iesd.dmu.ac.uk/~jm/pickup/pipe_figure.pdf\n\nI certainly prefers Greg's new scale to the previous version.\nHowever I will continue to use my gamma scale even though it offers\nless discrimination than Greg's new scale.  I guess I just prefer a\nsimple thermal scale.  The only other scale I use in IDL is a red-\ngreen-blue scale whenever I need to show values either side of zero\n(e.g. the difference between two images).\n\nI suspect the red=high expectation originates with the common\nred=danger/warning usage.  Plus the fact that the red light in a\ntraffic signal is always at the top (any exceptions?).  These are of\ncourse uses of colour in a discrete rather than continuous sense.\nIndeed, whilst red=danger etc. does lead to an expectation that red\nshould be the colour for the most intense values (i.e. at the top), I\ndon't believe that there is any intuitive expectation for what should\nbe below [1].  Or, how the transitions should look.  The rainbow\nscale provides a \"natural\" solution of sorts.  However, despite a\ntraining in physics and a familiarity with the progression of colours\nin a rainbow, I still find the thermal scale more of an intuitive\nprogression than the rainbow scale.  Whilst I don't see too many\nexamples I'm not entirely alone in having this preference: the false-\ncolour scheme used in ECOTECT seems similar.\n\n-John\n\n[1] Those familiar with Doppler broadening of spectral lines (where\nthe line is both red and blue shifted) excepted.\n\n-----------------------------------------------\nDr. John Mardaljevic\nSenior Research Fellow\nInstitute of Energy and Sustainable Development\nDe Montfort University\nThe Gateway\nLeicester\nLE1 9BH, UK\n+44 (0) 116 257 7972\n+44 (0) 116 257 7981 (fax)\n\njm@dmu.ac.uk\nhttp://www.iesd.dmu.ac.uk/~jm\n\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "John Mardaljevic", "datetime": "Sat Nov 11 13:25:48 2006"}