{"refs": [], "id": "<4555BEC1.B450.0049.0@wmtao.com>", "subject": "[Radiance-general] 3.8 Falsecolor Scal", "email": "MdelaFuente at wmtao.com", "body": "\nI find people understand the blue - red scale as well.  Since falsecolor\nimages are usually presented to clients, having \"bloody\" pictures is\noften a very effective communication tool.  Probably some psychological\nthing that dates back to hunting mammoths saber tooth tigers!\n\nThe one drawback I always saw to the old scale was that if one sets the\nscale at 3500 lux, the fist number shown is something like 3281.25.\n(Under that lighting condition, my light meter measures at +/- 10 lux!)\nIt would be great to start at 3500 lux and have the ability to drop or\nset the decimal places.  It always confuses people when I tell them red\nis 3500 lux but they can't find the number as they scan the scale.\n\nI've not had a chance to try out the new scale but offer the\nfollowing:\n\nIn AGI, one is able to set the maximum light level in the image as the\ntop of the falsecolor scale like so.\n\nhttp://members.fortunecity.com/dela2/agi1.jpg\n\nOr You can set the scale and make it so whatever you set is displayed\nat the top.\n\nhttp://members.fortunecity.com/dela2/agi1.jpg\n\nI suppose in Radiance one could to a pextrem command on a picture to\nget the maximum value and then use that to set the scale, but having it\nspit out something like the following can be a little intimidating.  :)\n\n499 499 0.000000e+00 0.000000e+00 0.000000e+00\n322 218 2.706250e+01 2.693750e+01 2.706250e+01\n\nI've tried to use this before, but have come up with numbers I don't\nfeel comfortable using.\n\nSeems like a \"-s max\" setting would be useful.  Where setting the scale\nto \"max\" would automatically check the image and set the scale to the\nmax pixel value automatically.\n\nHope some of that is useful.\n\nMark\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20061111/e307a697/attachment.html\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Mark de la Fuente", "datetime": "Sat Nov 11 19:15:34 2006"}