{"refs": [], "id": "<B8DD8375FCE2C94B9F170D9277C1FA2B8C6484@corvallis>", "subject": "[Radiance-general] The sub-4K second benchmark barrier...", "email": "Rob Guglielmetti", "body": "\nI ran Mark's Benchmark test on my iMac 10.4.7 Core2Dou 2.14 GHz 1 GB RAM\nwith Radiance 3.8 Universal binary and I got times around 9000 seconds.\nSeems too long.\nI was hoping it would be in the 4K region. Of course I closed the shell\nbefore copying the times, so I don't have the exact number.\nFor a Core2Duo, does Radiance use both processors, or would I have to use\nrad with -N 2?\nI know you have to do that with a render farm or any multiple processor\nmachine, but since the Core2Duo is 2 on one chip, I'm not sure.\nFor the benchmark itself, I saw Mark only wants single processor results.\nRob F\n\n-----Original Message-----\nSent: Wednesday, November 01, 2006 9:40 AM\nTo: Radiance general discussion\nCc: Ferdinand Schmid\n...has been broken!\n\nThat's right, people.  One of the beloved render farm machines at my office\njust turned in a sub-4K second timing on the Mark Stock Radiance benchmark\nscene.  SSSssssssss!\n\nWhat's interesting to note is that there are subtle differences in cpu\nspeed, even among the same cpu model.  I assume this is due to different\nvoltage settings on the motherboards, but I'm not positive.  I also wonder\nhow much of the speedup is attributable to the use of the new official\nrelease of Radiance 3.8.  Another interesting thing is that three of four\nbenchmarks had the same exact number of rays traced.  I find this a little\nodd.\n\nI was hoping Greg and maybe Ferdinand (builder and maintainer of my office's\nrender farm systems) could weigh in on this.  I have a couple other\nbenchmark timings and stats to add to the site\n(http://mark.technolope.org/pages/rad_bench.html) as well, I was hoping\nothers have installed the official 3.8 and were doing similar testing.\n\nHappy benchmarking.\n\n- Rob\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "rpg@rumblestrip.org", "datetime": "Wed Nov 15 20:20:58 2006"}