{"refs": [], "id": "<20061122095537.27CB853485@outmail.freedom2surf.net>", "subject": "[Radiance-general] FW: Gensky Question", "email": "nickd at f2s.com", "body": "\n\nHi All,\n\nI have a GENSKY question that I cant find the answer to in the archives. I\nsuspect that the answer is straightforward, but I am now challenging all my\nold assumptions as I have just switched from old school desktop radiance to\n3R7P2 with photon mapping running under Ubuntu on VMware Workstation.\nDaunting, but I like it!\n\nPerhaps first I should state that I am aware from the listings that perhaps\nI should be using Gendaylit rather than Gensky, but I have not managed to\ncompile it yet. Compiling makes me anxious. I used Francesco's Linux\nbinaries in the end as I couldn't get photon map to compile properly after\n3R7P2. My /bin and /lib files are not in the standard location, but I have\naltered PATH & RAYPATH accordingly.\n\nSo, to the questions:\n\nFirstly, I have some data for sky brightness from BRE Availability of\nDaylight, for diffuse and direct illuminance. If for example, I have\nilluminance values of 34 klux diffuse and 26 klux direct can I explicitly\nset these in Gensky (assuming 179lux per watt) with\n\nGensky (location details, azimuth etc) +s -B 189 -R 145.25 > skyfile.rad\n\nMy concern is whether -B or -R overrides the other, or will I ultimately\nresult in approximately total 60klux horizontal illuminance?\n\nSecondly, do I have to manually add the following to the bottom of\nskyfile.rad. I presume that I don't need to alter any of the parameters here\nfor a basic sky and ground plane and that it references the skyfunc output\nfrom the gensky command.\n\nskyfunc glow skyglow\n0\n0\n4\n.85 1.04 1.2  0\n\nskyglow source sky\n0\n0\n4\n0 0 1  180\n\nskyfunc glow groundglow\n0\n0\n4\n.8 1.1 .8  0\n\ngroundglow source ground\n0\n0\n4\n0 0 -1  180\n\nFinally, if I explicitly set -B & -R for an intermediate sky with +i does\nthe +i setting result in an adjustment to the -B & -R values?\n\nMany thanks in advance\n\nNick Devlin.\n\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Nick Devlin", "datetime": "Wed Nov 22 10:55:41 2006"}