{"refs": [], "id": "", "subject": "Re: [Radiance-general] Understanding illum correctly?", "email": "adiance-general-bounces@radiance-online.org", "body": "Message-ID: <EB65303B6C7EBA4996382AA5E0806BF47DBDF9@soleil.EEL.local>\n\nGreg, Carsten - thanks for your help. I really appreciate it. I just\nwanted to make sure I was understanding things correctly, so forgive\nthese two questions:\n\nAs I understand it now, there are three ways to wind up with illum\nsources in your .oct file:\n1. Use the illum material type. Run 'oconv' as normal.\n2. Use rad and place all of the 'illums' (using whatever secondary\nmaterial) into a separate file. This runs mkillum automatically.\n3. Use mkillum manually. (This is the same as 2 above?)\nAs I type this out it makes perfect sense. Perhaps I have a tendency to\noverthink things.\n\nOne thing I noticed is that the window_dist type is replaced with a\nsimple glass type. Is this because the reflectance/appearance of the\nskylight doesn't matter due to it being mostly hidden? Is it correct to\nassume that if I had a sidelight window in my final scene, I would\ninclude the \"skyfunc brightfunc window_dist 2 winxmit winxmit.cal 0 0\"\nbit to make the window appear as a real window?\n\nCheers,\n\nMark Shewfelt\nEnermodal Engineering Ltd.\nKitchener Ontario Canada\n\n\n\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of\nGregory J. Ward\nSent: December 7, 2006 6:08 PM\nTo: Radiance general discussion\nHi Mark,\n\nI realize this is confusing, but basically you want to put a \"void\"\npolygon in front of your opening.  Carsten is correct that the polygon\nneeds to point into the room, but some other slight modifications are\nnecessary as well to work with rad, as identified below.  It is probably\nbetter just to use a pane of glass instead of an illum initially.\n\n\n\nReplace the above with simple, clear glass type:\n\nvoid glass skylight_glass\n0\n0\n3 0.96 0.96 0.96\n\n\nYou can take the illum out, as we won't need it (and the zeroes\nshouldn't be there, as Carsten mentioned).\n\n\nTake the above and put it into room3.rad, as you won't be making it into\nan illum with mkillum.  The \"illum=\" line in your rad input file is for\nsurfaces to be made into illum's, only.  Orientation doesn't matter in\nthis case.\n\n\nAs Carsten points out, you need to reverse your vertex order:\n\n# light is emitted from this \"surface\" into the room void polygon\nface.65 0 0\n12\n5.491076\t 5.213552\t 3.00000\n4.201076\t 5.213552\t 3.00000\n4.201076\t 6.503552\t 3.00000\n5.491076\t 6.503552\t 3.00000\n\n---------------\nNotice that I replaced the modifier with \"void.\"  Mkillum will take this\nfile and compute an appropriate output distribution based on the light\nentering the space and up to 2 indirect bounces.  (This may be modified\nby setting the \"mkillum=\" variable in rad.)\n\n-Greg\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n", "isquestion": false, "replyTo": "<7D485242-F44A-421D-A34B-06304E5B1DE9@gmail.com>", "tags": [], "sender": "adiance-general-bounces@radiance-online.or", "datetime": "Fri Dec  8 17:25:07 2006"}