{"body": "\nKurt Altmann wrote:\n\n\nIt is terribly inefficient to create instances with only a few\nprimitives in them.\nAn octree should have a few hundred geometric primitives to make it\nworthwhile in terms of rendering time.  Given such a constraint, it is\nusually\npossible to partition geometry so it is roughly cubical in terms of\nvolume,\nthough I agree this is an inconvenience.  The only reason it was done\nthis\nway is to stick with a strict octree as opposed to a binary partition\ntree,\nwhich is more complicated to code and takes up more space in memory.\nOne could have an octree with a non-cubical bounding box, but the\nefficiency of tracing rays through long, thin subcubes would be awful.\n\nI don't recommend putting individual leaves into instances -- when I have\nused instances for trees, I put groups of leaves or needles together into\nan instance.  It may be better to put in the entire tree in many cases.\nRailings and walls should never go into instances.\n\nAs I suggested to Rob, the replmarks program offers the ability to\ngenerate\nxform calls to place raw geometry into the scene, and this is far\npreferable\nfor long or thin geometry such as you describe.  Instancing should be\nreserved for cases where duplicating geometry causes memory problems\nduring rendering, such as when you are modeling a forest of trees or\na great number of similarly complicated geometric objects.  For simple,\nreplicated geometry, you will get faster renderings and less hassle if\nyou just duplicate it throughout your scene, even if it means having\nhundreds of identical objects floating around.\n\nHere's a good rule of thumb for when instances might be appropriate:\n\nN_p > 200, and\nN_o * N_p > N_t / 5\n\nwhere:\nN_p = number of geometric primitives in instanced object\nN_o = number of instances\nN_t = total scene size (excluding other instances)\n\nOtherwise, it is better to use xform and just duplicate geometry.\n\n-Greg\n\n\n", "replyTo": "Subject: [Radiance-general] Octree blocks", "sender": "Greg Ward", "isquestion": false, "tags": [], "id": "<2F03A82F-64EA-11D6-81A5-00306540F848@lmi.net>", "refs": [], "datetime": "Sat, 11 May 2002 07:20:02 -0700", "email": "radiance-general@radiance-online.org", "subject": "[Radiance-general] Octree blocks"}