{"refs": ["<45939571.B450.0049.0@wmtao.com>"], "id": "<Pine.LNX.4.64.0612281508550.1157@joust.gpcc.itd.umich.edu>", "subject": "[Radiance-general] ambient accuracy parameter", "email": "stock at umich.edu", "body": "\nOn Thu, 28 Dec 2006, Mark de la Fuente wrote:\n\nMark,\n\nOne disadvantage is hard drive space: how many 3 GB images can I\nkeep around? Another problem that occurs more with some pieces\nthen others is speckles caused by particularly bright pixels.\nSince pfilt works on the full dynamic range, a single\nsuper-bright pixel in the full-res image can cause a\nsignificant bright spot in the final reduced-res image. Note the\nspeckles in this image:\n\nhttp://mark.technolope.org/image/p54.html\nhttp://mark.technolope.org/image/img54_detail_900.png\n\nThat second image is at print resolution, and was filtered down\nfrom a 4x or 6x resolution original. That scene is very\ncontrasty. Some of my more recent work mitigates the speckling by\nrendering in a closed room: allowing enough bounces to provide a\nmore even background.\n\nI find that \"-aa 0\" is appropriate when the octree for a scene\nwith little overlapping geometry takes more than a few hundred MB\nto create. Or for scenes in which I want detailed interreflection\namong a great number of very tiny surfaces (probably the same\nthing). It seems to me to be an easy way to get rid of the\nsplotches that plagued some of my earlier renderings.\n\n\nI have not studied this at all. I could posit that the low -ad\nwith high oversampling rate allows me to bias the interreflection\ntoward the first (and most important) bounce. Shooting 36 rays\ninto a final image pixel (what 6x oversampling does) but letting\neach of those only spawn 8 child rays (-ad 8) at the second and\ndeeper levels effectively means that I'm doing a more accurate\n1st bounce.\n\n\nMy impetus was to slash the computation times and fit the problem\nin memory. Of course, back then I had 2 GB of RAM *at most* and\nno access to anything better than a dual-proc machine. Now I am\nblessed with access to a 32 GB monster 8-core intel box and a\nnumber of medium-sized clusters.\n\nOne other advantage of \"-aa 0\" is that one pixel trace does not\ndepend on another, so parallelization is trivial. I use rpiece\nalmost exclusively for my big jobs now. OpenMP or pthreads\nanyone?\n\nMark\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] ambient accuracy parameter", "tags": [], "sender": "Mark Stock", "datetime": "Thu Dec 28 21:25:47 2006"}