{"refs": [], "id": "<9A8ADB1F-FE62-414E-9D77-1F935FA5AB6A@gmail.com>", "subject": "[Radiance-general] Radiance-related job posting", "email": "gregoryjward at gmail.com", "body": "\nA post-doc position has opened up at LBNL, and Eleanor Lee has asked\nme to post the following to the mailing list.  Please respond to her\ndirectly.\n\nCheers,\n-Greg\n\nJob Posting: Physicist or Related Building Science Discipline ? Post\nDoc Fellow\n\nEnvironmental Energy Technologies Division\nBuilding Technologies Department\nLawrence Berkeley National Laboratory\nBerkeley, California USA  http://www.lbl.gov/\n\nJoin a team of building scientists, architects, and engineers\ndeveloping new daylighting tools and technology solutions that will\nprovide highly efficient, glare-free solutions for the next\ngeneration of zero energy buildings.  The Lawrence Berkeley National\nLaboratory in Berkeley, California is searching for highly motivated\nindividuals to conduct state-of-the-art research on innovative fa?ade\nsolutions.  To explore recent projects, see:\nhttp://windows.lbl.gov/comm_perf/newyorktimes.htm\nhttp://windows.lbl.gov/comm_perf/Electrochromic/electroSys-cec.htm\n\nSummary\n\nThe purpose of this position is to evaluate innovative daylighting\nand dynamic facade technologies using Radiance and other simulation\ntools and measurement procedures.\n\nDuties\n\nEssential -- Identify, engineer and evaluate innovative facade\nsystems that employ static or dynamic technologies such as shades,\nblinds, light-redirecting glazings, switchable glazings, overhangs,\nfins, etc. using the Radiance lighting simulation program. Develop\nRadiance descriptors for facade systems using measured bidirectional\nproperties of component materials used in complex systems, ray\ntracing models, and other analytical methods. Develop and/or modify\nscripts to model control algorithms for operable facade systems.\nConduct parametric studies and sensitivity analysis to quantify\nenergy and non-energy impacts in commercial buildings.\n\nMarginal -- Plan and coordinate work with diverse project team and\nensure technical progress to meet deliverables within schedule.\nDisseminate knowledge via journal articles, conference papers,\npresentations, etc.\n\nQualifications\n\nEssential -- Demonstrated proficiency with the Radiance simulation\nprogram as related to facades and daylighting. Must be an expert in\ntechnical programming using UNIX C shell scripts, Python or\nequivalent scripts, C++, and a high-level scientific system such as\nMathematica. Familiarity with the application of facade systems to\nenergy-efficient building design and daylighting. Ph.D. in physics or\nrelated building science discipline.\n\nMarginal -- Familiarity with optics, high dynamic range imaging, and\nfield testing of innovative facade systems.\n\nNotes\n\nThis is a one year visiting postdoctoral fellow appointment with the\npossibility of renewal depending on the availability of funds and\nperformance.\n\nPlease send resumes to: Eleanor Lee at eslee@lbl.gov.\n\n\n\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20070307/7939475f/attachment.html\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Gregory J. Ward", "datetime": "Wed Mar  7 21:22:13 2007"}