{"body": "\nHi,\nI have few questions about accurate modeling of different glazing. I've read\nall previous discussions on this list, and now I'll try to summarize my\nthoughts about this subject.\nSuppose we want to simulate the behavior of some single or multiple layer\nglazing in Radiance, and the data of available glazings can be found in\nOptics5 database (actually IGDB).\nThese are few possible procedures how to define and use this material:\n\nPROCEDURE1\n1. convert glazing (all layers) data from Optics5 to Radiance.\n2. use output glass material for glazing definition.\n\nProblem:\n*Glass reflectance is calculated implicitly, and values from Optic5 database\ndon't have any effect.\nThis can be solved by using trans.cal functional file, and changing index of\nrefraction to obtain appropriate reflectance.\n*Dependence between light incident angle and transmittance/reflectance is\nimplicit and it is calculated using the algorithm for common glass material.\n\nPROCEDURE 2:\n1. convert glazing (all layers) data from Optics5 to Radiance.\n2. adjust BRTDfunc data, like Jack de Valpine suggested:\nvoid BRTDfunc GlzSys_front_and_back\n10\nif(Rdot, <r_front_refl>, <r_back_ref>l) if(Rdot, <g_front_refl>,\n<g_back_refl>) if(Rdot, <b_front_refl>, <b_back_refl>)\n<r_trans> <g_trans> <b_trans>\n0   0   0\n.\n0\n9 0 0 0 0 0 0 0 0 0\n3.Use this BRTD definition for glazing.\n\nProblem:\n*No transmittance/reflectance dependence of incident angle is taken into\naccount!\n\nPROCEDURE 3:\n1.convert glazing (all layers) data from Optics5 to Radiance.\n2.Use BRTD definition and glazing.cal file to define angular dependence of\ntransmittance/reflectance values.  Definition would look like:\nmod BRTDfunc my_glazing\n10     rrho grho brho\nrtau gtau btau\n0 0 0\nglazing.cal\n0\n18     0 0 0\n0 0 0\n0 0 0\nFRRHO FGRHO FBRHO\nBRRHO BGRHO BBRHO\nRTAU GTAU BTAU\nwhere:\nFRRHO FGRHO FBRHO is front normal spectral reflectance\nBRRHO BGRHO BBRHO is back normal spectral reflectance\nRTAU GTAU BTAU is normal spectral transmittance\n\n3.Use this definition for glazing material.\n\nProblem:\n*glazing.cal calculate these functions ONLY for coated and clear glass with\nthe cut- off point transmittance=0.654. Below that value it is supposed that\nglass is coated, and above that it is clear.\n\nPROCEDURE 4:\n1.convert each layer of glazing  from Optics5 to Radiance.\n2.Create input file for glaze.csh script (see question below)\n3.Call glaze.csh script and define 1 or 2 panel glazing, and all its\nsurfaces.\n4.Use BRDTfunc created as output of the script, as glazing material.\n\nProblem/question:\n*Is it important what kind of glazing user defines? I know the main goal of\nthis script is to define fritted glass, but is the calculation OK for user\ndefined types of surface.\n\n\nQUESTIONS:\n1.Which of this procedures should be used in which real case? I suppose for\nsingle pane clear glass we could use only glass primitive. Can glazing.cal\nbe used for all coated glazings, and glaze.csh for fritted ones?\n2.What is the format of input file for glaze.csh script?\n3.What if glazing have more than 2 layers?\n\nThanks,\nMarija.\n\n\n", "replyTo": "", "sender": "Marija Cvetkovic", "isquestion": true, "tags": [], "id": "<004f01c5dfa3$144f93f0$0100a8c0@mallah>", "refs": [], "datetime": "Wed Nov  2 12:47:59 2005", "email": "cveleglg at bankerinter.net", "subject": "[Radiance-general] glazing modelling"}