{"refs": ["<AC87FF54.298@wmtao.com> <45FF9611.B450.0049.0@wmtao.com>", "<A5AC95D0-3BB0-4AB5-A357-AE776F333B10@gmail.com>"], "id": "<f0a01ca8cbd75f923c7e3c6d1ed0dc42@architecture.uwaterloo.ca>", "subject": "[Radiance-general] monitor model upload in Desktop Radian", "email": "tseebohm at architecture.uwaterloo.ca", "body": "\nThe general procedure that I would use is to run Desktop Radiance first\nwithout the monitor in the scene and then to modify the files that\nDesktop Radiance has produced to include the .rad file for the monitor.\nIf the .rad file for the monitor represents a monitor already\npositioned at the right location in the scene (and of the right\ndimensions) then one simply has to add the following line in the .rif\nfile:\nscene = monitor.rad  and  to add the monitor.rad file to the list of\nrad files that Desktop Radiance has already produced\nAssuming the file is called monitor.rad\n\nIf the monitor is not scaled correctly and/or not positioned correctly,\nthen one must convert the monitor.rad file to an octree first by typing\nthe line,  oconv monitor.rad  > monitor.oct, at the  command prompt.\nNext you need to create a new .rad file with this octree to position\nand scale the monitor  correctly. This new text file would have the\nfollowing lines:\nvoid instance monitor1\n13 monitor.oct -s 1.0000 -rz 0.00000 -rx 0.0000 -ry 0.0000 - t 0.0000\n0.0000 0.0000\n0\n0\n\nwhere the number after the -s represents the scale factor\nthe numbers after the -rz, -rx, -ry represent the rotations (probably\nin degrees)\nand the three numbers after the -t represent the x,y,z translation of\nthe monitor to the right location in the scene\nThis new rad file should then be included with the list of rad files\nthat Desktop Radiance has already included and, as above, the following\nline should be added to the rif file:\nscene = monitornew.rad\nwhere monitornew.rad is the new rad file.\nIn order to do this you will, of course, need to find out where Desktop\nRadiance stored the files it created.\nLastly, after you have made all these changes, you need to run Radiance\nfrom the command line rather than from the Desktop Radiance menu.\nIn know this sounds a bit complicated but only if you are doing it for\nthe first time. You do this by clicking on the last .bat file that\nDesktop Radiance created.\n\nThomas\nOn Mar 20, 2007, at 9:44 AM, Gregory J. Ward wrote:\n\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] monitor model upload in Desktop Radianc", "tags": [], "sender": "Thomas Seebohm", "datetime": "Tue Mar 20 17:03:41 2007"}