{"body": "\nHi Peter,\n\nYour reply includes some critical remarks on the subject.\nI will try to answer them from my point of view, within the context of\nanimation (please remember that  my project would have taken about 2250\nhours (14 weeks) on 4 1000Mhz cpus when rendered as animation, and still\nhaving significant artifacts).\n\n\nTransparent surfaces (like glass) seem yet another problem for me....\n\nWhat I will try is using a radiance picture without radiosity and then\nchange the value of each pixel a little depending on the normal orientation\nof that pixel. When the normal points upward, I make the pixel just a liitle\nbrighter, facing downwards, the pixel becomes a liitle darker, etc.\nThis is needed for my application, since a non-radiosity interior image\nlooks very flat (a cube in such a case is hardly recognisable as a cube).\n\nMy approach is a little like \"vloeken in de kerk\" (dutch: using bad language\nin the church):  I am aware of that.  Believe me: I hardly dared to bring\nthe topic into this discussion (...).\nWe want to use animation in combination with \"real\" radiance images in the\nediting of a project (so we don't use bad words all the time :).\nThe animation is meant to provide a way of having some insight in the\nspatial behaviour of a building.\nWhen we use another renderers besides radiance however, these images don't\nlook very good (they are _different_ ). To mention: luminaires, sky\ndefention, the appearance of 'white' surfaces etc, the overall feeling of\nlight (even if ab=0 I feel light in the scene -  I never felt light in\nLightscape, but ok, that was about 8 years ago).\n\n\nWhen I program this 2d processing: certainly not!\nThat will be far beyond my skills.\nI give it a try, when it does what I imagine I am satisfied.\nIf anybody can do it better: please!!!\n\n\nI don't want to use different rendering tools within one project. As I said:\nwe will use radiance anyway.\nOther renderers require other ways of getting the data right. This means:\nmuch extra work within the same deadlines.\nThere is something else. I worked with a lot of renderers (except renderman)\nand what I like about radiance is that we are able to write scripts for\ncomplex situations. For example we did a project in which there were 4\nvariations on 4 building types on 2 different location-types.\nWe rendered two views from every possible combination and put these images\nin a simple user-interface. The scripting took 2 hours, the renderings\novernight. Is there any renderer that allows me to do this? I really rely on\nRadaince in such cases.\n\n\nTo me also. Maybe I am wrong and the whole idea will not work.\nI will be happy to show you some images after I finished  my homework :)\nI am very curious what the result are. My opinion is very humble in this....\n\nYet there is another application where I am thinking about: when I know\nwhich object/modifier is represented by a pixel, I easily can put each\nobject-pixel in a different layer ( as in photoshop) and enhance them\nseperately.\nThis is very usefull in video, for example to dim oversaturated colors a\nbit.\n\n\nWhy not Radiance in this case?\n\n\nLast but not least: Is there a way to do this ? I read some discussions\nabout this topic, and it seems to me that it does not really work (?). Or am\nI wrong here?\n\nJust to mention within this context. Something simular to the above: we work\non 360o panoramic views (2048x2048pixels, rendering times about 10 hours for\none oversampled image, but that doesn't hurt for a single image), which we\nmap on a slowly rotating cylinder in OpenGL, and then we render these frames\nto file. These result are quite good (and fast and reliable/trustable). The\nonly bad thing is that I am not an educated programmer, and the application\ncrashes as soon as I write an image to a file... So I've seen the results\nonly in the application, not on video yet.\nTime will fix this sooner or later.\n\n\n\nI can't translate this sentence, mileage is not in my dictionary (?)\n\n\nRegards (nice discussion),\n\nIebele\n\n\n", "replyTo": "", "sender": "atelier iebele abel", "isquestion": true, "tags": [], "id": "<3CD94E10.EA496208@iebele.nl>", "refs": [], "datetime": "Wed, 08 May 2002 18:10:56 +0200", "email": "radiance-general@radiance-online.org", "subject": "[Radiance-general] animationReferences: <3CD284B0.72EB180C@iebele.nl> <3CDACAE9.3E60F54B@pab-opto.de> <3CD7A43B.F83F2FE9@iebele.nl> <3CE0C46F.1718C236@pab-opto.de>"}