{"body": "<CE13197E-1ADF-4A19-8A75-E18AC22DD179@gmail.com>\n\nHello,\n\nMy graduate student and I tested Photosphere for a Nikon 5400. The results are published in the October 2005 LEUKOS Journal of the Illuminating Engineering Society of North America at\n\nhttp://www.iesna.org/leukos/Volume2/number2.cfm\n\nSee a similar text version at\nhttp://www.personal.psu.edu/mum13/photosphere.pdf\n\nAbstract:\nHigh dynamic range imaging is a set of techniques that allows for a far greater dynamic range of exposure than normal digital imaging techniques. The intention is to accurately represent the dynamic range of lighting levels found in real scenes, ranging from direct sunlight to deep shadows. Various software packages have emerged that translate these HDR images into high resolution luminance maps. This paper tests the accuracy of one such package, taking into consideration different Munsell hues, values, and chroma. It investigates the impact of different light spectra, spatial frequency, vignetting, and thermal noise on the accuracy of luminance measurements and determines the potential errors.\n\nSome conclusions:\nVignetting is a minor problem and leads to a falloff in luminance at the image edges of 80% at 28mm focal length. There is virtualy no vignetting for maximum focal length.\n\nWarm hues have the least error, while cool hues have the largest errors.\n\nThe error also increases with saturation. The error in reflectance increases as the Munsell value decreases.\n\nThe error in reflectance for all Munsell colors, irrespective of hue, chroma and saturation, is almost independent of the illuminance level on the target.\n\nColors with low chroma (chroma=2) have less error than colors with the maximum chroma at the same Munsell value.\n\nPhotosphere with the Nikon 5400 tends to overestimate the luminance for colors with a low value, or darker colors of the same hue and chroma.\n\nThe error in reflectance is independent of the spectral power distribution of \"normal\" (incandescent, all fluorescents from CRI 60-90, and all major HID lamps) lamps, provided that the Nikon's auto white balance is used. (!)\n\nThe minimum detail that can be measured reliably has an angular resolution of 0.0574 degrees. Example: Two distinct objects (black and white lines) are closer than 3.2mm, zoom= 116mm, distance to object: 3.35 m. This will lead to a contrast reduction of around 30%.\n\nPhotosphere be used in scenes with materials having low chroma, saturation and warmer hues with minimal error. However, in scenes with cooler hues like blue and green and with hues having high chroma, the combined errors can go as high as 80%, for example in foliage.\n\nInteriors of buildings and built environments however usually have low chroma and saturation. The errors in such a case would peak at around 20%. This error could be acceptable since a luminance meter also can have an error of around 2-10%.\n\nNikon tends to overestimate, whereas Olympus and Canon tend to underestimate (more contrast).\n\nLow Munsell values (dark greys) cannot be measured reliably. I recommend to stay away from saturated blues and greens.\n\nLow illuminance levels are not a problem. The Nikon has a thermal noise correction mechanism which is very useful.\n\nFor specific errors for specific Munsell hue, values and chroma, see the paper.\n\nGreg, you have done a super job with Photosphere!\n\nMartin Moeck, Penn State\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: not available\nType: application/ms-tnef\nSize: 4467 bytes\nDesc: not available\nUrl : http://radiance-online.org/pipermail/radiance-general/attachments/20051126/52b68724/attachment.bin\n", "replyTo": "", "sender": "Martin Moeck", "isquestion": true, "tags": [], "id": "<84F05BA9118BBD4A8FC6409808CE266C23486E@ENGRMAIL2.engr.psu.edu>", "refs": [], "datetime": "Sat Nov 26 18:52:24 2005", "email": "MMoeck at engr.psu.edu", "subject": "[Radiance-general] RE: Photosphere Evaluation Study PublishedReferences: <43872F52.6010807@bradford.ac.uk>"}