{"refs": [], "id": "<CC0B19F4C6132F4D9FDDEBF194200FB502CDEDC9@ldcexc02.global.arup.com>", "subject": "[Radiance-general] Radiance tool and Atrium daylighsimulation", "email": "Jiangtao Du", "body": "\nPlease also consider the Mac option.\n\nRadiance runs at full steam.\n\nyou can use vtk or opendx for cutting edge visuals or any other x11\nbased system (and these come either free of pre compiled for about 10\nPounds and do work well).\n\nall maya, cinema4d, archicad, sketchup, formz, argon, vectorworks, modo,\nsolidthinking are native applications.... and many others for good 3d\nmodelling\n\nPython is there so blender and Francesco and Thomas good stuff is ready\nout of the box.\n\nIf you need to use Windows you can just have it side by side with\nparallel and this works great (for instance you can drag and drop files\nfrom one to the other or use copy and paste seamlessly... ask for a demo\nand see it)\n\nTried keynote for presentations instead of PPT?\n\nfinally you have a native, well working, Unix system but simple to use\nand administer, with a nice coherent interface and a full set of system\noptions:\nyou do not have two system panels from two different distributions that\ntry to do the same and one is v1.1b and the other v0.1.1, there is just\none, graphically coherent version throughout...\n\nBut I guess if I push more it will be clear that I have quite some\nshares\n:-)\n\nGood luck!\n\nG.\n\n\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of Nick\nDevlin\nSent: 27 March 2007 11:23\nTo: radiance-general@radiance-online.org\nJiangto,\n\nWelcome to the wonderful confusing world of radiance.\n\nFirstly, I am a big fan of Ecotect, as it is a great tool for modeling.\nI\ncertainly prefer it to Autocad, 3d studio etc. It's development was\nalways\nintended for use during early design stages by providing quick iterative\nresults.\n\nHowever, I would also suggest that using it with Desktop Radiance will\nnot\nonly seriously limit the analysis process by limiting access to the\nnewer\nRadiance functions, but also potentially compromise the validity of your\nresults and cloud your understanding of the various Radiance analysis\nfunctions and parameters.\n\nSo, if you have access to Linux and the latest Radiance versions, I\nwould go\nwith that, but use Ecotect to build your models and export the relevant\n.rad\nfiles. You can also export the analysis girds locations etc for use with\nRtrace directly within Linux version. Finally, you can then re-import\nthe\nvalues to Ecotect for certainly visualization tasks.\n\nI run Ubuntu Linux on my windows machine through VMware workstation,\nwhere\nyou can set up shared folders to move data between linux and windows.\n\nI would however strongly recommend that you have a look at Axel's\nRadiance\ntutorials from London Metropolitan University as these are on the money\nas\nthey say. They can be found at:\nhttp://www.learn.londonmet.ac.uk/student/resources/notes.shtml.\n\nGood luck..\n\nNick\nNick Devlin Associates\n\n\n\n------------------------------\n\nMessage: 2\nTo: radiance-general@radiance-online.org\nMessage-ID: <20070326213211.80900.qmail@web28114.mail.ukl.yahoo.com>\nContent-Type: text/plain; charset=\"iso-8859-1\"\n\nHi, friends,\n\nI am a post-graduate student in Sheffield University. My project is\natrium\ndaylighting and I want to simulate atrium daylight using Radiance. As a\nbeginner of this tool, I have many questions:\n\n1. Do you think Ecotech 5.5 with Desktop Radiance control panel (the\nnewest version ) is the right tool to do my atrium research? I like\nusing it\nfor its clear GUI, but if it could finish similar work and achieve the\nsame\nresults as its UNIX/LINUX brother?\n\n2.  I think a lot of complex atrium roofs have to be researched and\nconstructed in my project, if UNIX/LINUX Radiance is the most suitable\ntool?\nIf Linux version is good, could I use the Radiance on Cygwin\nEnvironment?\n\n3. Someone has told me that Radiance in Adeline is a cut-version, but\nI\nfound some atrium daylight papers which have used this tool (Anca D.\nGalasiu, Morad R. Atif from Canada, B. Calcagni, M. Paroncini from\nItaly).\nHow about your opinion?\n\n4. Mac Radinace is a new choice , I found some researchers recommended\nthe\nSketchup + Radiance is a good way. Could you compare this with Sketchup\n(or\nAutocad) + Ecotech +Radiance?\n\nMany thanks to your help.\n\nJiangtao Du\nMphi/phd student in School of Arch in Sheffield Univ\n\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "jiangtao.du@yahoo.co.uk", "datetime": "Mon, 26 Mar 2007 22:32:11 +0100 (BST)"}