{"body": "\nDear Radiance colleagues,\n\nThe following announcement might be of interest to those of you located\nin the greater Boston area.\n\nChristoph\n\n+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n\nMassachusetts Institute of Technology, Department of Architecture\nBuilding Technology Program\n\nIf you wonder how to better integrate lighting issues in your design\nprojects, this 3-days IAP workshop is a great opportunity to learn more\nabout the tools and performance metrics available today to help you out\nin this task:\n\nNatural Light in Design: Using Simulation Tools to Explore Realistic\nDaylight-Responsive Solutions\n\n\nJanuary 24, 25 and 31, 2006 - 09:30am-05:30pm\n\nComputer-based analysis techniques used as a basis for design decisions\nare introduced in this course, with a focus on lighting and energy.\nParticipants will be exposed to traditional performance metrics, such as\ndaylight factor and avoidance of direct sunlight, and will also gain\nknowledge and practice in emerging metrics based on dynamic annual\ndaylight simulations. Two days of formal instruction and hands-on\nexercises will be followed by a day during which participants will be\nable to apply the concepts learned to a design project of their\nchoosing.\nThis workshop is open to students and practitioners.\n\nProf. Marilyne Andersen, Dr. Christoph Reinhart (NRC Canada)\n\nRegistration deadline: December 12, 2005\n\nCourse tuition fee: $180\n\n\nFor more information: http://architecture.mit.edu/subjects/sp06/4493.pdf\n<http://architecture.mit.edu/subjects/sp06/4493.pdf>\nFor questions and workshop registration: contact Kathleen Ross at 617-\n253 1876 or kross@mit.edu <mailto:kross@mit.edu>\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20051205/32b44508/attachment.html\n", "replyTo": "", "sender": "Reinhart, Christoph", "isquestion": true, "tags": [], "id": "<5910A0754536EA4AAD411AE8221C3962F47A1A@nrccenexb1.nrc.ca>", "refs": [], "datetime": "Mon Dec  5 17:34:33 2005", "email": "Christoph.Reinhart at nrc-cnrc.gc.ca", "subject": "[Radiance-general] Workshop on Daylighting Simulation Tools offeredat MIT to students and practitioners"}