{"refs": [], "id": "<490502E140871249B0D7D36CE0B358AAF71D42@dkhexc004.PM.local>", "subject": "[Radiance-general] trouble 'Rendering with Radiance'!", "email": "sean.mooney at pmg.ie", "body": "\nHi\n\n\n\nI've had the book 'Rendering with radiance' on order from Amazon for a\nnumber of weeks. Received a message last night that they were unable to\nsource the book. Any tips on alternative supplier [currently trying\nABEbooks.com] welcome.\n\n\n\nRegards\nSean Mooney\nProject Management\nKillakee House,\nBelgard Square,\nTallaght,\nDublin 24,\nIreland\nw: www.pmg.ie <http://www.pmg.ie/> .\ne: sean.mooney@pmg.ie <mailto:sean.mooney@pmg.ie>\nt: +353 (1) 4040700\nf: +353 (1) 4599785\n\n\n\n\n______________________________________________________________________\nThe information contained in this electronic message (e-mail), and any files transmitted with it, is intended for the named recipient(s) only. It may contain privileged and/or confidential information and if you are not the intended recipient, you must not copy, distribute or take any action in reliance on it. If you have received this electronic message (e-mail), and any files transmitted with it, in error, please delete it immediately.\n\nInternet communications are not secure and therefore the PM Group does not accept legal responsibility for the contents of this message. Except where sent in the ordinary course of business, any views or opinions presented are solely those of the author and do not necessarily represent those of the PM Group.\n\nThe PM Group operates anti-virus programs; nevertheless all attachments with this message should be checked for viruses before it is opened. The PM Group cannot be held responsible for failure by the recipient to test for viruses before opening any attachments and does not accept responsibility for any damage whatsoever that is caused by viruses being passed.\n\nShould you communicate with anyone at the PM Group by e-mail you consent to us monitoring and reading any such correspondence. Email is monitored by the PM Group solely for operational, security and business reasons.\n______________________________________________________________________\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20070522/dd44f7f8/attachment.html\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Mooney, Sean", "datetime": "Tue May 22 12:43:50 2007"}