{"refs": [], "id": "<3E26E825.4080607@rumblestrip.org>", "subject": "[Radiance-general] multiprocessor systems, Radiance, and yo", "email": "adiance-general@radiance-online.org", "body": "\nHowdy folks-\n\nAfter spending the last couple of months getting up to speed with\nRadiance (the workshop in Freibourg was really, really, good at showing\nme how much I had to learn, how behind the curve I was [am]), and\nperforming hunderds of rtrace jobs, and compiling a cohesive analytical\nreport on the data, our client has responded:\n\nThey want more.\n\nYou all know how it is, once you show someone what is possible with\nRadiance, they start thinking \"what would it look like if we did this,\nor this, or this, or this, etc, etc....\".  So we intend to show them\nsome of these options.\n\nWhile I'm thrilled to be doing more with Radiance, I'm now Desperately\nSeeking Cycles, CPU horsepower that is.  After Jack's fifteen minute\nrendering claim at the workshop -- Yes Jack, that's what you said, we\nall heard you ;-) -- for a single dual Athlon box, I'm thinking this is\nwhat I want to do.  I don't need NFS lock headaches right now, I have\nenough problems.  So I'm looking to build one very fast box, and I'm\nhoping to make it a dualie, and skip the LAN based render farm for now.\n\n(several paragraphs later he gets to the questions...)  My questions are\nfor those of you on the list with MP linux experience.  I guess I'm hazy\non the way the two processors are utilized.  Do you tend to run one job\non one CPU and a second one on the other, or do you use rpiece to work\none job across both, as if the the CPUs are two different hosts?  Or is\nthere some OS and/or Radiance compile tweak that you do to simply make\nboth CPUs act as one, obviating the need for rpiece? Seems like you\nstill need rpiece so the ambient cache is managed properly. As far as\nCPU, do I *have* to use the Athlon MP, or can I run two XPs?  Anyone\nhave hardware recommendations?  I like Abit motherboards, but they don't\nseem to offer a dual socket variant.  What about OS?  I had great\nsuccess with RHL 8.0 on an old Dell -- it installed and compiled\nRadiance without a single hiccup.  Anyone using it on a dual box?  Any\ncompile changes to either the OS or Radiance?\n\nAny info, urls or advice would be greatly appreciated.\n\n----\n\nRob Guglielmetti\n\ne. rpg@rumblestrip.org\nw. www.rumblestrip.org\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Rob Guglielmetti", "datetime": "Thu, 16 Jan 2003 12:13:09 -0500"}