{"refs": [], "id": "", "subject": "[Radiance-general] Job opening: Opportunity to joininterdisciplinary research team", "email": "a.i.ruppertsberg at Bradford.ac.uk", "body": "exploring realistic rendering and high dynamic range imaging\nMessage-ID: <469F27F9.30902@bradford.ac.uk>\n\nHello list,\n\nwe've got a position open for someone with Radiance-skills:\nFor details see below.\n\ncheers,\nalexa\n\n\n\nRESEARCH ASSISTANT Post REF: ROP2306\n\n24,402 - 26,666 per annum, (english pounds) depending on skills and\nexperience. In first instance fixed term for 1 year (maternity cover).\n\nThis post is funded via the EPSRC award \"High Dynamic Range for High\nFidelity Image Synthesis of Real Scenes\". The aim of this project is to\ncompute and display the highest fidelity computer-generated images of\nreal scenes.\nYou should have proven programming skills in C++ or Matlab and\nenthusiasm for problem solving and research. Under the guidance of Dr\nBloj you will develop a BRDF (Bi-directional Reflectance Distribution\nFunction) capture system based on digital photography, implement the\ncorresponding model in a rendering package (preferably RADIANCE) and\nsupport the psychophysical evaluation of the resulting images using\nstandard displays and a Brightside DR37-P High Dynamic Range Display.\nThis represents an exciting opportunity for a promising researcher to\njoin a vibrant interdisciplinary team with partners at the Warwick\nDigital Lab and Brightside (now part of DOLBY) working on the\ndevelopment and validation of High Dynamic Range capture and display\nsystems.\nThe successful applicant will be based in Dr Bloj's lab in the\nUniversity of Bradford, UK.\n\nInformal enquires can be made to Dr Marina Bloj. Tel +44 (0)1274 236258;\ne-mail: M.Bloj@bradford.ac.uk or Dr Alexa Ruppertsberg +44 (01274\n235378; e-mail A.I.Ruppertsberg@bradford.ac.uk .\n\nCLOSING DATE: 13th August 2007. We expect to interview during the week\nof 20th August. Job reference ROP2306.\n\nApplication forms and more information available at:\nhttp://www.brad.ac.uk/admin/personnel/jobvacancies/fps/ROP2306.pdf\n\n---\nMarina Bloj PhD FHEA MInstP, Senior Lecturer\nDivision of Optometry, School of Life Sciences\nUniversity of Bradford\nBD7 1DP, UK\nTel: +44-(0)1274 23 6258 Fax: +44-(0)1274 235570\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Alexa I. Ruppertsberg", "datetime": "Thu Jul 19 03:05:10 2007"}