{"body": "\nJack de Valpine wrote:\n\n\nRevit tends to make models with lots and lots of surfaces and\ninformation. So this could very well be the limitation I'm hitting.\n\n\nHuh, that's not good to hear. The only reason Max is even in the mix for\nme is as a overblown file converter, really. I'd much rather prefer\ngoing to Blender, but Blender's DXF import functions seem not-so-good\nand aren't being done via it's Python API, but instead has been written\ninto it's code,\n\n\nI wish this was viable option. See, Revit has materials in it already,\nand it's very handy to assign materials therein because then they relate\nparametrically to what materials show up in your Deliverables (for\nexample, drywall looks like drywall in section and elevation), and they\ncan participate in Structural Analysis. It's only that the rendering\nabilities of Revit are grossly limited via Accurender (it's built-in\nrendering engine) that I'm looking to use other tools with it. Now,\nRevit's exporting to DWG/DXF is really intended for sending 2D and 3D\nmodels out to consultants. Revit places things into layers based upon\nwhat they are, not by what material they are, but it does include the\nmaterial information as X-data. 3D Studio knows how to read this data,\nso that when you bring in a model from Revit the materials are intact.\nMost other programs don't read this data, and so you wind up with a nice\nmodel, but one without materials already mapped, meaning you have to\nduplicate work and waste a lot of time. Theoretically you could write\nyour own DXF2RAD converter that understood the x-data as well, that\ncould produce a RAD file, materials intact. But no one has yet, and I\ndon't have the time right now to learn how to take something like the\nPython DWG/DXF routines that are available and edit them for this sort\nof use.\n\n\nI will give them a try, but again, I'd like a model with materials if I\ncan get it.\n\n\nIt's a fantastic tool for Production, if the majority of what you do is\ntypical Document sets, like Schematics, CD's, that sort of thing. If the\nend result is a PDF or printed paper, Revit is really, really keen.\nHowever, it only exports to DWG, DXF, and SAT. And only the DWG/DXF\noption retains materials (it's a long story) and so you're dead on in\nassuming that it's not the best tool for creating 3D models in whatever\nformat you might want. The pain here is that it does create very nice\nand detailed models very quickly. It's just a pain to get them out into\nsome other format. Now with 3D Studio's new ability to talk to Revit\n(somewhat indirectly, but still) there are a lot more options available,\nand I'm hoping that it might lead to an easy and fast Revit -> Radiance\nbridge of some kind.\n\nI got into Radiance a while ago, but because of this difficulty of using\nRevit models with it I haven't gotten the chance to do too much 'real\nwork' with it. I'm just a designer looking for a better rendering\nengine, really, not a lighting or analysis person.\n\n\nI use Revit a lot, however I'm currently just one guy doing his own\nprojects and helping others out with Revit stuff. I might take a job\nwith a huge firm tho, to help them with their transition to Revit, and\nas such might have a lot more resources available to me. The Revit API\nis all .NET based, so any .NET language would work (sadly :P). I've had\nenough time to find out the the API allows for something like a Radiance\nexporter to be made (I think) but not enough time to actually learn how\nto make one (again, just a designer, not a programmer, sadly).\n\nThanks for all the great info, I've got some research to do! If I figure\nout a quick way to go from Revit to Radiance I'll definitely post it here.\n\nJeffrey McGrew\n\nBecause We Can, LLC\n(415) 505-4689\nwww.becausewecan.org\n\n\n", "replyTo": "Subject: [Radiance-general] Radiance plug-in for 3DS", "sender": "Jeffrey McGrew", "isquestion": false, "tags": [], "id": "<43A99997.3010601@becausewecan.org>", "refs": ["<33B40178-C019-45BF-8FDE-DFCF7A3006E5@dmu.ac.uk>\t<43A92484.4090608@esru.strath.ac.uk>", "<43A9882A.3040706@visarc.com>"], "datetime": "Wed Dec 21 19:07:42 2005", "email": "toast at becausewecan.org", "subject": "[Radiance-general] Radiance plug-in for 3DS"}