{"refs": ["<AB5BF04B-B69B-478E-8486-7B5FCB99FDEE@cox.net>"], "id": "<C79B8BB4-5B40-473A-8059-D193BDEE0509@arcor.de>", "subject": "[Radiance-general] Newbie Install Question", "email": "tbleicher at arcor.de", "body": "\n\nOn 5 Aug 2007, at 21:17, Sean Smallman wrote:\n\n\nYes. Just go on and create '/usr/local/' and all the directories that\nmight be\nrequired below that (although I think they will be created\nautomatically by the\ninstaller if necessary). These are '/usr/local/lib', '/usr/local/bin'\nand\n'/usr/local/man'.\n\n'/usr/local' was traditionally the place were software was installed\nby the\nadministrator. OS X doesn't need it and Apple doesn't expect their\ntype of\ncustomer to fiddle with the file system; so they don't provide it out\nof the\nbox. But it won't hurt your system.\n\n\nSimple indeed but not particularly admin-friendly. You will end up\nwith a\nsystem that mixes the system binaries with the Radiance specific files.\n\nAnd as I just realised the current download from http://\nradsite.lbl.gov/radiance\ndoes not include all the files, only the binaries. Following the\nabove instructions\nwould result in an error message after the first 'cd ...' command.\n\nIf you are familiar with Linux or another Unix system and think you can\ncompile the whole think yourself I would recommend you to do that. Read\nthe README file in the source distribution, run the 'makeall' command\nand everything will be installed for you. You have to install the\ndeveloper\ntools for OS X first, though (2nd CD iirc or download the updated\nversion\nfrom the web).\n\nIf you want to go with the binaries you still have to download the\nsource\nto get the various other files the installation instructions mention.\nI would copy the binaries to /usr/local/bin and set the $PATH variable\nto include that in your search path. I have modified the instructions\nfrom\nthe web page for that:\n\nSTEP 2:\n\nsudo mkdir /usr/local\nsudo mkdir /usr/local/bin\ncd rad3R8_macosx\nsudo cp * /usr/local/bin\n\nWhenever you use the sudo command (superuser do) you will NOT be\nasked for the password\nyou just set for root. You will be asked for YOUR password (once for\na certain period of\ntime - a few minutes, usually) and you will be allowed to continue\nwith proper rights\nonly if you have set up yourself as an administrative user\n(\"System Panel -> Accounts -> Allow user to administer this\ncomputer\"). If you are\nroot there is no point in using 'sudo'.\nUse the sudo command with care. There is no limit to the damage you\ncan cause with this omnipotent command.\n\nYou will get an error about dev being a directory, so it wasn't\ncopied. This is fine.\n\nStep 3 Install standard libraries\n---------------------------------\n\nNow do the following:\n\n-> Download and unpack source distribution from the above website. I\nwill assume the directory created is called 'ray' and it's in your\nhome directory\n\ncd ~/ray\n\nmkdir /usr/local/lib\nsudo mv lib /usr/local/lib/ray\n\ncd ~/ray/src/rt\nsudo cp rayinit.cal /usr/local/lib/ray\n\ncd ~/ray/src/gen\nsudo cp *cal /usr/local/lib/ray\n\nAt this point you have a functional standard Radiance installation.\n\nThe last to steps\n\nsudo mkdir /usr/tmp\nsudo chmod 777 /usr/tmp\n\nare not necessary any more. You can install the manual pages, too:\n\nsudo mkdir /usr/local/man\n\ncd ~/ray/doc/man\n\nsudo cp * /usr/local/man\n\nI'm not sure /usr/local/man is included in the search path of the man\ncommand, though.\n\nAfter installing into '/usr/local/' you have to change the '$PATH'\nsetting\nof your shell to include that directory structure into the search\npath - in\nparticular the '/usr/local/bin' directory. You should find a line\nthat starts\nwith $PATH in the '/etc/profile' file. Make a copy of that file\nbefore you\nchange it so you can go back to the original version. Change the line to\n\nPATH=\"/usr/local/bin:/bin:/sbin:/usr/bin:/usr/sbin\"\nexport PATH\n\nFinally you can set the RAYPATH environment variable (in the same file):\n\nRAYPATH=\".:/usr/local/lib/ray\"\nexport RAYPATH\n\n(I can't find this set on my system and yet all that I do with Radiance\nworks fine.)\n\nThis sets the environment for commands typed in the terminal\napplication.\nIt's only active after you start a new terminal session or type\n'bash -login' in your current terminal. This is a good way to find out\nif everything is right.\n\nNow you really should have a functional Radiance installation.\n\n\nCheers,\nThomas\n\n\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Newbie Install Questi", "tags": [], "sender": "Thomas Bleicher", "datetime": "Sun Aug  5 16:54:47 2007"}