{"body": "\nHi Marcus,\n\nThere's rather a lot to respond to here, but I'll give it a go...\n\n\nYour analysis makes sense.  As noted in discussions earlier this\nweek, it is probably a bad idea to change the -ar setting between\nruns.  This is most likely the source of your problems.\n\n\nIt's difficult to say for certain, but it probably has to do with the\nsolid angles visible from the problem areas.  Also, if the wall\nsurface on the coves of your skylight are smooth and specular, this\ncould greatly amplify their indirect contribution.  I believe\nspecularities are at play in some of the artifacts you mention below.\n\n\nI am a little confused by the term \"lite,\" which my dictionary\ndefines as \"beer with relatively few calories.\"  I assume you mean\nthe mullions.  Bear in mind that mkillum does not attempt to model\nlight sources already in the scene, such as the sun, and this light\npasses without intervention.  Mkillum only takes over for ambient\ncontributions and glow's, such as the sky.\n\n\nWhat are the specularities and roughness values of your floor\nsurfaces?  And which version of Radiance are you running?  This looks\nlike it could be a bug, or it could just be mirror-like specular\nreflections off your floor.  I suspect you have a low roughness value\n-- do you?\n\n\nThis looks like mirror reflections off your counter top, which could\nbe real but are poorly rendered by the indirect calculation.  (You\ncould use the \"mirror\" type to correct this, though I'm not sure it's\nworth it.)\n\n\nThese artifacts are more worrisome.  I'm not sure what's causing\nthem, unless it's more of the low-angle specular reflections off your\nskylight cove.  Are these surfaces purely diffuse, or do they have a\nsmall specular component that might get blown out of proportion at\nlow angles?  (This is a problem that was discussed earlier this month\nunder the heading \"How to increase the rendering speed?\" and fixed in\nthe latest HEAD release.)\n\n\nA worthy goal.  I think we can all benefit from what we learn in this\nexploration, and I appreciate your sharing your results.\n\nHappy Holidays!\n-Greg\n\n", "replyTo": "Subject: [Radiance-general] What's causing these artifacts???", "sender": "Greg Ward", "isquestion": false, "tags": [], "id": "<DC1C3DBA-017C-4A9A-A1B2-FCA65BDE7E22@gmail.com>", "refs": ["<BAY102-F262A8A795DB30D6E5CFE18A4330@phx.gbl>"], "datetime": "Sat Dec 24 18:23:52 2005", "email": "gregoryjward at gmail.com", "subject": "[Radiance-general] What's causing these artifacts???"}