{"refs": [], "id": "", "subject": "Re: [Radiance-general] IES2Rad questions", "email": "Thomas Bleicher", "body": "Message-ID: <H000009600f06823.1190824860.babel.archenergy.com@MHS>\n\nThanks for your response Thomas.  I still think IES2rad is reading files differently than the standard (clockwise and with 0 as +y).\n\nI did figure out the Type B photometry issue, seems this is only a problem within Rayfront.  Using IES2rad outside of Rayfront does not have a problem, my apologies.  Everything else shown was also done outside of Rayfront as I was wanting to eliminate this from the equation.\n\nRegards,\nZack\n\nZack Rogers, P.E., IESNA, LEED AP\nDaylighting Analysis Group Leader\nArchitectural Energy Corporation\n2540 Frontier Avenue, Suite 201\nBoulder, CO 80301 USA\n\ntel (303)444-4149 ext. 435\nfax (303)444-4304\nhttp://www.archenergy.com\n\n\n-----Original Message-----\nSent: Tuesday, September 25, 2007 2:56 PM\nTo: Radiance general discussion\nHi Zack.\n\nI haven't looked at IES files in a while so my memory is a bit mushy\nand I can't go into the details of the standard as I don't have a copy.\n\nBut:\n\nOn 22 Sep 2007, at 04:39, Zack Rogers wrote:\n\n\nI think it's ies2rad that creates the confusion here. In the man page\nit says:\n\n\"The light source geometry will  always  be centered  at  the  origin\naimed\nin the negative z direction, with the 0 degree plane along the x axis.\"\n\nThis is fine for luminaires as they usually have their highest output in\nnegative z direction ('down') but define this in the IES file as 0\ndegree\nvertical angle (the vertical angles start pointing down and then go up).\nIn your case ies2rad might simply have turned the z-axis around so\nthat your\n+z is now pointing down.\n\nIf you use replmarks to place your windows you have to define the longer\naxis as x and the sorter will be y. This is just how replmarks works and\nis independent of source.cal.\n\nI used to check the Radiance renderings of luminaire files against a\nrendering\nof another application like Dialux or Relux just to check if I did\nthe placement\nand rotation of the IES file right.\n\nRegards,\nThomas\n\n\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] IES2Rad questions", "tags": [], "sender": "tbleicher@arcor.de", "datetime": "Wed Sep 26 09:41:08 2007"}