{"refs": [], "id": "<3E2855BF.2090106@archenergy.com>", "subject": "[Radiance-general] Re: multiprocessor systems, Radiance, and yo", "email": "adiance-general@radiance-online.org", "body": "\nHello,\n\nI've been using several dual processor systems for the past year or\nso...I thought I'd add my 2 cents.\n\nOur IT guy built my machine using a Tyan motherboard and 2 - 1.8 GHz\nAthlon AMD MP.  I'm told by our IT tech guy that the AMD processors are\nfaster doing these floating point calculations than the Pentium III or\nIV counter part.  He says the Pentium's fairly new MMX instruction set\nis great for new multimedia programs coming out, but the program has to\nbe able to take advantage of this MMX instruction set.  I guess 90% of\nthe programs out there are not designed to use the MMX and require the\nolder 387 instruction set.  So, the new Pentium's can revert back to the\n387 instruction set but are slower than the AMD counter part when doing\nso.  So until a version of Radiance is compiled that takes advantage of\nMMX, I believe AMD processors will perform better.  I am not an expert\non all this, I hope I have not misstated anything as I am just passing\nalong what was told to me, but if you have any other questions on the\nspecifics of our dual processor machines please feel free to ask.  We\nhave built several for both Radiance and CFD modeling and so have some\nexperience with this.\n\nMy machine has been working great for me.  I run Windows NT on it but I\nalso use several other Dual Processor machines running Suse8.0.  On both\nOS's, the Radiance simulations run on only a single processor.  I will\ntypically have numerous parametric designs, and so this works for me.  I\nwill usually just load up each processor and run them in parallel.  I'm\nsure there is a way to get them to run in series, but I too have much to\nlearn about Radiance and have no idea how.  I would recommend the Suse\nOS, it has worked great for us, although I have no experience with any\nother Linux OS so I have nothing to compare it to.  Radiance did compile\neasily on it and it runs great.  Radiance does run as a friendly process\non it, sharing the processor with other programs, which is nice.  Our\nCFD programs our processor hogs.\n\nHope this is of some help!\n~Zack\n\n--\nCelebrating 20 Years of Improving Building Energy Performance\n\nZack Rogers\nStaff Engineer\nArchitectural Energy Corporation\n2540 Frontier Avenue, Suite 201\nBoulder, CO 80301 USA\n\ntel (303)444-4149 ext.235\nfax (303)444-4304\nhttp://www.archenergy.com\n\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Zack Rogers", "datetime": "Fri, 17 Jan 2003 12:13:03 -0700"}