{"refs": ["<100441490710140725v22bd4ab7u2b550ba31c50bb84@mail.gmail.com>"], "id": "<471233EB.700@bzed.de>", "subject": "[Radiance-general] Radiance in Debian!", "email": "bernd at bzed.de", "body": "\nHi Axel,\n\n\nany comments are welcome!\n\n\nI've called it -materials now, I doubt that makes a big difference. I\ndon't know any policy about packages having to use -data. I think most\nof the stuff are material definitions in the package, so I think it's fine.\nI don't want to split them again, Debian's ftp masters like to start to\ngrumble if a package builds too many small packages.\n\nIf you're facing such questions - the Debian policy is what you want to\nread: http://www.debian.org/doc/debian-policy/ch-binary.html#s3.1\n\n\n\nradiance is NOT in non-free. It is in Debian/main.\nActually the license is a bit weird, it's similar to the php license\nwith some name changes, but it's fine for main.\nYou're probably thinking abut the .dfsg. in the version number - it just\nmeans I had to remove two pdf files which are shipped without source.\nSeems the source of one of them is lost, and Greg will ship the other\nfiles's source with 3R9, or they're removed both by him. THen the .dfsg.\nis gone, too. Nothing that stops a package from going into main, though.\n\n\n\nIf I remember right Lars build those packages. I know they exist, but\nusually it is faster for me to repackage things from ground of then\ntrying to understand what other people did and doing things based on that.\n\n\nI gave it a thought, too, but discarded that for now as the dependency\nto x11 only brings a few hundred k of extra libraries. I doubt that's\nworth the work. You don;t need to install X completely on Debian...\n\n\n\n\nI doubt it is worth to read trough the whole thread. But if it's ok for\nGreg I'll create a summary of the interesting parts of it.\n\nAbout libtiff: if I remember it right (without reading trough the 30\nmails again), the reason why there's one shipped in radiance is that the\nlibtiff in BSD was broken, or so. Anyway I have no other chance then\nusing Debian's libtiff, I'd get slapped by the ftp masters if I'd try to\nadd the source of an old version of libtiff to Debian - it's a waste of\nspace and another thing you need to patch if there's a security hole in\nlibtiff.\n\n\nCheers,\n\nBernd\n\n--\nBernd Zeimetz\n<bernd@bzed.de>                         <http://bzed.de/>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Radiance in Debian!", "tags": [], "sender": "Bernd Zeimetz", "datetime": "Sun Oct 14 08:21:34 2007"}