{"refs": ["<EXFE2R5chK6m7swxvR30000ca51@email.curtin.edu.au>"], "id": "<000301c80ecd$4f776b50$0d01a8c0@nest1>", "subject": "[Radiance-general] Re: Radiance in Debian!To: radiance-general@radiance-online.org", "email": "\"Axel Jacobs\"", "body": "\nHello All,\n\nI have been using trad with my undergraduate students for a number of years.\nLast used with the KNOPPIX_V5.1.1CD-2007-01-04-EN.iso (debian) and built\nwith the makeall script. Worked fine no issues.\n\nWould be sad not to see it in there as it is very valuable in weening the\nfancy gui/mouse generation into serious software.\n\nRegards\n\nTerry Mc Minn\nFaculty of Built Environment, Art and Design\nCurtin University of Technology\nGPO Box U 1987 Perth 6845\nWestern Australia\nEmail: T.Mcminn@curtin.edu.au\nCRICOS Provider Code: 00301J\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of\nradiance-general-request@radiance-online.org\nSent: Monday, 15 October 2007 7:52 AM\nTo: radiance-general@radiance-online.org\nSend Radiance-general mailing list submissions to\nradiance-general@radiance-online.org\n\nTo subscribe or unsubscribe via the World Wide Web, visit\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\nor, via email, send a message with subject or body 'help' to\nradiance-general-request@radiance-online.org\n\nYou can reach the person managing the list at\nradiance-general-owner@radiance-online.org\n\nWhen replying, please edit your Subject line so it is more specific than\n\"Re: Contents of Radiance-general digest...\"\n\n\nToday's Topics:\n\n1. Re: Radiance in Debian! (Axel Jacobs)\n2. Re: Re: Radiance in Debian! (Bernd Zeimetz)\n3. Re: Re: Radiance in Debian! (Greg Ward)\n4. Re: Re: Radiance in Debian! (Bernd Zeimetz)\n5. Re: Re: Radiance in Debian! (Bernd Zeimetz)\n6. Re: Radiance in Debian! (Axel Jacobs)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nMessage-ID:\n<100441490710141230l4408ef68k9a76f83b78206d82@mail.gmail.com>\nContent-Type: text/plain; charset=ISO-8859-1\n\nf) If you compile with SPECIAL=\"ogl\", you'll get OpenGL drivers for the\nholodeck stuff. This makes it much faster and nicer. There will be\nadditional device files. Here are mine:\n\nglx1.hdi   ogl.hdi   oglo.hdi   ogls.hdi   oglso.hdi   x11.hdi\nglx1h.hdi  oglh.hdi  ogloh.hdi  oglsh.hdi  oglsoh.hdi  x11h.hdi\n\nDownside would be the additional dependency on the Mesa libs.\n\nb) (again). I did not mean to suggest that Radiance is not Free. What I\nsimply do not know is whether it's Free Enough to be included in Debian\nproper. It certainly is free enough for me.\n\nI already pointed out the potential click-wrap problem, which you simply\npatched away.\n\nIf the click-wrap is there for no reason at all, then a better solution\nwould be to get it removed up-stream. Since I don't know what Greg has to\nsay about this, I shall make no further assumptions.\nGenerally speaking, however, you only need to agree if somebody takes\nsomething away from you (e.g. your right to distribute the software, like it\nwas in those old days), not if somebody gives you something for absolutely\nand unconditionally free.\n\nAnother interesting phrase is para 5 of the Radiance Software License:\n\n\"5. Products derived from this software may not be called \"Radiance\", nor\nmay \"Radiance\" appear in their name, without prior written permission of\nLawrence Berkeley National Laboratory.\"\n\nNo problem with me. However, what it would stop me from doing is to create\nsomething like radiance-ng (as in next-generation), or radiance-nt (as in\nnew technology) or nu-radiance (as in new).\n\nYou will be aware that there is syslog and syslog-ng, both GPLd, I believe,\nso this kind of naming is not unheard of.\n\nThe question is whether this teeny weeny restriction of my freedom to name a\nderived package anything-radiance or radiance-anything is enough for the\nvery strict rules of the DSC to render it non-free.\nProbably not, but I thought I'd throw in my 2 Escudos, anyhow.\n\nI trust that you as a seasoned Debian developer with >30 packages under your\nbelt know all the ins and outs of all sorts licenses and Social Contracts,\nso having your assurance that Radiance is Free-as-in-Debian will make me\nsleep comfortably at night.\n\nThanks for your time\n\nAxel\n\n\n\n------------------------------\n\nMessage: 2\nMessage-ID: <471272A8.3050004@bzed.de>\nContent-Type: text/plain; charset=ISO-8859-1\n\nAxel Jacobs wrote:\n\nbroken on linux, at least with the current xorg. It builds, but the output\nis distorted. Probably this depends on the graphic hardware, though.\nSomething to look a bit deeper into.\n\n\n\nYou can be sure the license is free enough to be included in Debian,\notherwise\n- it would have been rejected by the ftp masters. They take such things\n_serious_.\n- there wouldn't be php in Debian.\n\n\n\nThe license does not require any kinds of click-wrap, it is the build system\nwhich asks me to accept the license. As the build system is shipped under\nthat license I'm free to change it (I'm not using it at all btw, much more\neasy to do build without the build-system).\n\n\n\nStill don;t see the problem here, as the click-wrap is not in the license\nbut in the build system - but it would probably make people's life more easy\nif they wouldn't have to accept the license while using that build system.\n\n\nugly, but ok.\nhttp://www.debian.org/social_contract#guidelines (4)\n\n\n... still working on becoming an official Developer :)\n\n\neven if you couldn't trust me, you can trust the ftp master who checks the\npackages. He reads _every_ file and would simply reject a package if\n- debian/copyright (== /usr/share/doc/radiance/copyright) is not complete or\nif there're any problems with a license of a single file. Or because\nthere're two pdfs without source included, which happened to me\n- I just missed to look for their source.\n\n\nCheers,\n\nBernd\n--\nBernd Zeimetz\n<bernd@bzed.de>                         <http://bzed.de/>\n\n\n\n------------------------------\n\nMessage: 3\nMessage-ID: <9F41AF95-5593-4891-B442-8266896D10BE@lmi.net>\nContent-Type: text/plain; charset=US-ASCII; delsp=yes; format=flowed\n\nHi Bernd,\n\nYou are welcome to share whatever portion you like from our e-mail\nexchange.\n\nThanks again for all your efforts!\n-Greg\n\n\n\n------------------------------\n\nMessage: 4\nMessage-ID: <471279CF.5090100@bzed.de>\nContent-Type: text/plain; charset=ISO-8859-1\n\nHi,\n\n\nok, I think I'll compile a FAQ-like document, that's probably the best\nthing to do.\n\n\nyou're welcome!\n\n\nBernd\n\n--\nBernd Zeimetz\n<bernd@bzed.de>                         <http://bzed.de/>\n\n\n\n------------------------------\n\nMessage: 5\nMessage-ID: <47128B44.4080606@bzed.de>\nContent-Type: text/plain; charset=ISO-8859-1\n\nHi,\n\nhere come the interesting parts of the mails between Greg and me (my stuff\nquoted, a few additional links added):\n\n----------------------------------------------------------------------------\n--\n\nthe\n\nIt probably works with the new version.  My problem was getting the newer\nversion to compile on Macs and FreeBSD was proving problematic, and I didn't\nneed any of its features so I was lazy and just fell back to one that\nworked.\n\n----------------------------------------------------------------------------\n--\n\nthe\n\nGeorg Mischler <schorsch@schorsch.com> is responsible for the SCONS build\nsystem, which is there to make compiling under Windows less painful.  I\ndon't\nknow what its status is, and Schorsch has been pretty difficult to raise\nthese\ndays.\n\n----------------------------------------------------------------------------\n--\n\nprograms\n\nDefinitely the renderers, \"rpict,\" \"rtrace,\" and \"rvu\" built in src/rt.\nAfter\nthat, maybe some of the libraries in src/common, especially the cal*.c\nroutines.\nI'd have to think about it after that....\n\n----------------------------------------------------------------------------\n--\n\n\nif\nmanpages\n\nI never wrote man pages for these, as they are specialty programs used by\nexperts, for the most part.  Some aren't used at all, and probably shouldn't\nbe\ncompiled (like pcwarp and plot4).  No one else has written man pages for\nanything, as far as I know.  You are welcome to give it a go if you have\ntime,\nbut I don't even have time at the moment to go through them, really.\n\nhttps://ssl.recluse.de/svn/debian/trunk/packages/radiance/debian/radiance-ex\nperttools.sgml\n\n----------------------------------------------------------------------------\n--\n\n\nbut\nwhile\n\nI don't think the trad code works anymore, and I haven't had time to update\nit.\nI imagine it would take some effort -- a day or two or three.\n\n(trad is not included in Debian therefore)\n\n\n----------------------------------------------------------------------------\n--\n\n\n\nActually, we did a build clean-up a while ago and pulled out all the\ncompletely\nuseless programs.  The plot4 program actually serves a purpose, which I only\nremembered after I sent the e-mail.  The pcwarp program is more\nexperimental,\nand should probably be pulled.\n\n\n----------------------------------------------------------------------------\n--\n\n\n\nAs I recall, Paul Haeberli had a really simple polygonal font format,\nsimilar to\nmy own, and it was a snap to convert.  If you have something that already\nparses\nthe foreign format, and it's not difficult to add a new output format, the\none I\nuse is quite simple.  It's described in:\nhttp://radsite.lbl.gov/radiance/refer/filefmts.pdf\n\n\n----------------------------------------------------------------------------\n--\n\n\nhttps://ssl.recluse.de/svn/debian/trunk/packages/radiance/debian/patches/rho\nlo-missing-devpath-fix.dpatch\neven\nhappens\n\nIf the DEVDIR is not set, and it usually isn't, rholo searches for its\ndevice\ndrivers in subdirectories named dev/ in each of the executable PATH\nlocations.\nIn other words, installing the drivers in dev/ under the Radiance executable\ndirectory should always work.  I put DEVDIR in there as a precaution for\nstrange\nsystems that might cause a collision.  It's never happened.\n\nto\npackage\ncould\n\nThe files you're putting in /usr/lib are executables if that makes any\ndifference -- did you mean /usr/local/lib?  It seems odd to install things\nin\nthe main system directory.  I wouldn't want them there if I were a user\ninstalling a third-party package.\n\nRholo calls rtrace to do most of the CPU-intensive work, but you can compile\nit\nhowever you think best.\n\nTo test, go to the ray/obj/cabin directory and trun \"make nholo.\"  You might\nalso alter the nholo target to set -n 2 to make sure multi-processing is\nworking\nright, and \"-o x11\" rather than \"-o ogl\" to try out the quadtree driver.\n\n\n\n\nI'm sorry but not surprised to hear the OGL driver doesn't work under Linux.\nThey seem to have a pretty loose idea of this standard.  It works under Mac\nOS\nX, but then, that's where I'm able to test and debug it.\n\nAs for -ffast-math, there shouldn't be a problem for Radiance.  It doesn't\nrely\non exact trig calculations or the like.\n\n----------------------------------------------------------------------------\n--\n\n\n\nThe rview program was renamed to rvu just to avoid the conflict with vim.  I\nput\na soft link in for backwards-compatibility, but you can safely remove it if\nit\ncauses problems.\nhttps://ssl.recluse.de/svn/debian/trunk/packages/radiance/debian/patches/no-\nrview-please.dpatch\n\n----------------------------------------------------------------------------\n--\n\nAnd last but not least:\n\nbzed@hal:~$ wget -q -O - http://www.radiance-online.org/main.html |\ngrep hemp\n<a href=\"hemp://radsite.lbl.gov\" target=\"_top\">LBNL</a>, <a\nhref=\"hemp://www.epfl.ch\" target=\"_top\">EPFL</a>, then\n\n\n--\nBernd Zeimetz\n<bernd@bzed.de>                         <http://bzed.de/>\n\n\n\n------------------------------\n\nMessage: 6\nMessage-ID:\n<100441490710141648p12e76558ifab8eb7677d8bd98@mail.gmail.com>\nContent-Type: text/plain; charset=ISO-8859-1\n\nbut\nwhile\n\nupdate it.\n\n\nI use trad all the time. Still works flawlessly without hacking in:\n- F7\n- the latest LEARNIX, which is based on KNOPPIX 5.0.1, which is based\non Debian unstable from about one year ago.\n\nWould be a shame not to include it. Why don't you just give it a try...\n\nAxel\n\n\n\n------------------------------\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\nEnd of Radiance-general Digest, Vol 44, Issue 7\n***********************************************\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Re: Radiance in Debia", "tags": [], "sender": "jacobs.axel@gmail.com", "datetime": "Mon, 15 Oct 2007 00:48:13 +0100"}