{"refs": [], "id": "<CC0B19F4C6132F4D9FDDEBF194200FB5042D8288@ldcexc02.global.arup.com>", "subject": "[Radiance-general] Questionaire on fluorescent lamp", "email": "adiance-general-bounces@radiance-online.org", "body": "\ntry to have a look for the -ds setting...\n\n\n\nif this still a problem for your application I'd investigate the use of\n'glow' (0 0 4 r g b 0) in conjunction with an indirect calculation (-ab\nn, n>0)\n\n\n\nto avoid ambient cache problems you may switch to -aa 0 -u  but this\nwill require over sampling of your grid to remove Montecarlo noise.\n\n\n\nhope this makes sense,\n\n\n\nciao\n\n\n\nG.\n\n\n\n\n\n\n\n________________________________\n\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of Minki\nSung\nSent: 15 October 2007 12:16\nTo: radiance-general@radiance-online.org\n\n\nHello Everybody,\n\n\n\nIt's my first time to mail to the radiance mailing list.\n\nI'm using Radiance to calculate near field illuminance (in fact\nradiation) from bare fluorescent lamps.\n\nBefore doing with real mode data, I tested one with a bare fluorescent\nlamp and a plan 20 centimeter away from the long and cylindrical lamp.\nBut the result right under the lamp was strange, that is, the other\nvalues were as I expected but only in the area directly under the lamp\nthe illuminance was highest at the center and decreased gradiently as\nwent to the end of the lamp. For example, the illuminance was 5000 lux\nat the center right under the lamp, but it decreased to 15 lux at a\nquarter point of the lamp, though the two would be almost same.\n\nMaybe I am not understanding properly the lamp description. Can you\nanyone explain this to me? Or Radiance is not adequate for near field\ncalculation with long cylindrical lamp?\n\n\n\nBest Regards\n\n\n\nMinki Sung\n\n\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20071015/d25ac151/attachment.html\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "adiance-general-bounces@radiance-online.or", "datetime": "Mon Oct 15 04:26:34 2007"}