{"refs": [], "id": "", "subject": "[Radiance-general] multiprocessor systems, Radiance, and yoReferences: <3E26E825.4080607@rumblestrip.org>", "email": "adiance-general@radiance-online.org", "body": "Message-ID: <3E302233.7040703@visarc.com>\n\n--------------010303060008050602080707\nContent-Type: text/plain; charset=us-ascii; format=flowed\nContent-Transfer-Encoding: 7bit\n\nHi All:\n\nI know that I am about a week behind on this topic. I have been out of\nthe office and disconnected for this time taking care of my son while my\nwife was attending a trade show in LA (at least it was warm there\ncompared to the temperatures we currently have in Boston). Anyway as\nCarsten pointed out on the topic, everyone will want to way in on the\ntopic, so here is my two cents worth. Based on Rob's original post it\nseems that there are a couple of issues:\n\n* hardware\n* process management\n\nFor running parallel rpiece type jobs without complications of network\nrelated issues (i.e. NFS and others) smp boxes are a must have depending\non the rendering task complexity. For exterior daylight only scenes it\ndefinitely possible to get very, very fast rendering times (15 minutes\nis a good example at 1200 to 1600 pixel final images size with 2 to 3\ntimes oversampling with careful management of rendering parameters) with\nthe only qualifier being image size. For complex lighting or large image\nsizes, well two is better than one cpu. We have rendered images to 6000\nto 9000 pixel final image sizes again with 2 to 3 times oversampling,\ni.e. 18,000 pixel images (we may have done them larger but I cannot say\nfor sure offhand). Currently I think that the AMD MP systems give the\nbest price to performance. However, if you go for an AMD MP system for\nproduction use, then you should only get the MP cpus not the XPs. The\nonly other major consideration is how complex your scenes are and\ntherefore how much RAM will be required. Just as a side note we have\nbeen using Radiance on dual processor boxes since 1996, starting out on\ndual processor Pentium Pros and now currently running dual processor\nAthlon MP based systems. And with the latest Linux distributions (RedHat\nis the only one I am currently have hands on experience with)\ninstallation should be very, very easy for a typical system.\n\nNow, since Rob is running lots of rtrace jobs, the problem that he is\nfacing is more likely management and batch processing of multiple\n\"rendering\" jobs. While it is not clear exactly what the task is, my\nguess would be that there are lots of rtrace jobs representing some kind\nof timeslice analysis that need to be started and then on completion the\nresulting data must be integrated or aggregated for evaluation and\npresentation. This really is a scripting task at its heart, where the\nrepetitive tasks need to be understood and scripted accordingly. It\nshould not really matter what scripting/programming tool (bash, perl,\npython, C), whatever you are most comfortable with. Rob, if you can,\nmaybe you can give us a better understanding of the \"rendering\"\nproduction task you are facing, people maybe able to give you feedback\non other scripting ideas than what you have already put together.\n\n-Jack\n\nRob Guglielmetti wrote:\n\n\n--\n#\tJohn E. de Valpine\n#\tpresident\n#\n#\tvisarc incorporated\n#\thttp://www.visarc.com\n#\n#\tchanneling technology for superior design and construction\n\n\n\n--------------010303060008050602080707\nContent-Type: text/html; charset=us-ascii\nContent-Transfer-Encoding: 7bit\n\n<html>\n<head>\n</head>\n<body>\nHi All:<br>\n<br>\nI know that I am about a week behind on this topic. I have been out of the\noffice and disconnected for this time taking care of my son while my wife\nwas attending a trade show in LA (at least it was warm there compared to\nthe temperatures we currently have in Boston). Anyway as Carsten pointed\nout on the topic, everyone will want to way in on the topic, so here is my\ntwo cents worth. Based on Rob's original post it seems that there are a couple\nof issues:<br>\n<ul>\n<li>hardware</li>\n<li>process management</li>\n</ul>\nFor running parallel rpiece type jobs without complications of network related\nissues (i.e. NFS and others) smp boxes are a must have depending on the rendering\ntask complexity. For exterior daylight only scenes it definitely possible\nto get very, very fast rendering times (15 minutes is a good example at 1200\nto 1600 pixel final images size with 2 to 3 times oversampling with careful\nmanagement of rendering parameters) with the only qualifier being image size.\nFor complex lighting or large image sizes, well two is better than one cpu.\nWe have rendered images to 6000 to 9000 pixel final image sizes again with\n2 to 3 times oversampling, i.e. 18,000 pixel images (we may have done them\nlarger but I cannot say for sure offhand). Currently I think that the AMD\nMP systems give the best price to performance. However, if you go for an\nAMD MP system for production use, then you should only get the MP cpus not\nthe XPs. The only other major consideration is how complex your scenes are\nand therefore how much RAM will be required. Just as a side note we have\nbeen using Radiance on dual processor boxes since 1996, starting out on dual\nprocessor Pentium Pros and now currently running dual processor Athlon MP\nbased systems. And with the latest Linux distributions (RedHat is the only\none I am currently have hands on experience with) installation should be\nvery, very easy for a typical system.<br>\n<br>\nNow, since Rob is running lots of rtrace jobs, the problem that he is facing\nis more likely management and batch processing of multiple \"rendering\" jobs.\nWhile it is not clear exactly what the task is, my guess would be that there\nare lots of rtrace jobs representing some kind of timeslice analysis that\nneed to be started and then on completion the resulting data must be integrated\nor aggregated for evaluation and presentation. This really is a scripting\ntask at its heart, where the repetitive tasks need to be understood and scripted\naccordingly. It should not really matter what scripting/programming tool\n(bash, perl, python, C), whatever you are most comfortable with. Rob, if\nyou can, maybe you can give us a better understanding of the \"rendering\"\nproduction task you are facing, people maybe able to give you feedback on\nother scripting ideas than what you have already put together.<br>\n<br>\n-Jack<br>\n<br>\nRob Guglielmetti wrote:<br>\n<blockquote type=\"cite\" cite=\"mid:3E26E825.4080607@rumblestrip.org\">Howdy\nfolks- <br>\n<br>\nAfter spending the last couple of months getting up to speed with  Radiance\n(the workshop in Freibourg was really, really, good at showing  me how much\nI had to learn, how behind the curve I was [am]), and  performing hunderds\nof rtrace jobs, and compiling a cohesive analytical  report on the data,\nour client has responded: <br>\n<br>\nThey want more. <br>\n<br>\nYou all know how it is, once you show someone what is possible with  Radiance,\nthey start thinking \"what would it look like if we did this,  or this, or\nthis, or this, etc, etc....\".&nbsp; So we intend to show them  some of these options.\n<br>\n<br>\nWhile I'm thrilled to be doing more with Radiance, I'm now Desperately  Seeking\nCycles, CPU horsepower that is.&nbsp; After Jack's fifteen minute  rendering claim\nat the workshop -- Yes Jack, that's what you said, we  all heard you ;-)\n-- for a single dual Athlon box, I'm thinking this is  what I want to do.&nbsp;\nI don't need NFS lock headaches right now, I have  enough problems.&nbsp; So I'm\nlooking to build one very fast box, and I'm  hoping to make it a dualie,\nand skip the LAN based render farm for now. <br>\n<br>\n(several paragraphs later he gets to the questions...)&nbsp; My questions are\nfor those of you on the list with MP linux experience.&nbsp; I guess I'm hazy\non the way the two processors are utilized.&nbsp; Do you tend to run one job\non one CPU and a second one on the other, or do you use rpiece to work  one\njob across both, as if the the CPUs are two different hosts?&nbsp; Or is  there\nsome OS and/or Radiance compile tweak that you do to simply make  both CPUs\nact as one, obviating the need for rpiece? Seems like you  still need rpiece\nso the ambient cache is managed properly. As far as  CPU, do I *have* to\nuse the Athlon MP, or can I run two XPs? du Anyone  have hardware recommendations?&nbsp;\nI like Abit motherboards, but they don't  seem to offer a dual socket variant.&nbsp;\nWhat about OS?&nbsp; I had great  success with RHL 8.0 on an old Dell -- it installed\nand compiled  Radiance without a single hiccup.&nbsp; Anyone using it on a dual\nbox?&nbsp; Any  compile changes to either the OS or Radiance? <br>\n<br>\nAny info, urls or advice would be greatly appreciated. <br>\n<br>\n---- <br>\n<br>\n&nbsp;&nbsp;&nbsp;&nbsp; Rob Guglielmetti <br>\n<br>\ne. <a class=\"moz-txt-link-abbreviated\" href=\"mailto:rpg@rumblestrip.org\">rpg@rumblestrip.org</a> <br>\nw. <a class=\"moz-txt-link-abbreviated\" href=\"http://www.rumblestrip.org\">www.rumblestrip.org</a> <br>\n<br>\n_______________________________________________ <br>\nRadiance-general mailing list <br>\n<a class=\"moz-txt-link-abbreviated\" href=\"mailto:Radiance-general@radiance-online.org\">Radiance-general@radiance-online.org</a> <br>\n<a class=\"moz-txt-link-freetext\" href=\"http://www.radiance-online.org/mailman/listinfo/radiance-general\">http://www.radiance-online.org/mailman/listinfo/radiance-general</a> <br>\n<br>\n<br>\n</blockquote>\n<br>\n<pre class=\"moz-signature\" cols=\"$mailwrapcol\">--\n#\tJohn E. de Valpine\n#\tpresident\n#\n#\tvisarc incorporated\n#\t<a class=\"moz-txt-link-freetext\" href=\"http://www.visarc.com\">http://www.visarc.com</a>\n#\n#\tchanneling technology for superior design and construction</pre>\n<br>\n</body>\n</html>\n\n--------------010303060008050602080707--\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Jack de Valpine", "datetime": "Thu, 23 Jan 2003 12:11:15 -0500"}