{"body": "\nHi Greg,\n\nThanks for the follow-up on this. I think that I have gotten the white\nbalance part correct. I always set it by hand (for example to the sun\nicon) so the auto white balance feature is effectively off. And I have\nused aperture priority on the camera however I have used auto\nbracketing, so maybe I am not getting enough samples? It sound like\nperhaps the best thing to do is set the aperture manually and vary the\nexposure time manually as well in order to generate your suggested ~10\nsamples. Although doing everything manually involves a lot of\nunnecessary touch of the camera.\n\nSo as to scene, clear sunny sky conditions would be ideal I suppose with\na range from shadowed features to direcly illuminated features... Sorry\nfor this next... So how do you use the luminance measure from the\nreference card to further calibrate the response curve?\n\nOnce a response curve has been generated is there some way to check or\nvalidate it (if that makes any sense)?\n\nIn the book (the new one;-) you also indicate that the darkest exposure\nshould have no RGB values greater than ~200 and the lightest no values\nless than ~20. I could certainly figure out a filter routine with pcomb,\nhowever there must be a simple way to do this with ImageMagick. The\npoint being to run a quick preprocess check on the the bounding images.\nAny takers or suggestions for how to do this easily?\n\n-Jack\n\nGregory J. Ward wrote:\n\n\n--\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n\n\n\n", "replyTo": "Subject: [Radiance-general] HDRI - Camera Response Curve", "sender": "Jack de Valpine", "isquestion": false, "tags": [], "id": "<43C2CA2E.7060007@visarc.com>", "refs": ["<2C0020B9EB71CE4281B292F0E16A6DDE7FC742@ldcexc02.global.arup.com>\t<61FE56DB-9427-4AB0-B590-95D4FF32EC3D@gmail.com>\t<43C29B3A.9090603@visarc.com>", "<4020F2F5-CD73-47A9-833F-7C143383D546@gmail.com>"], "datetime": "Mon Jan  9 21:43:39 2006", "email": "jedev at visarc.com", "subject": "[Radiance-general] HDRI - Camera Response Curve"}