{"refs": ["<a504443a0710310724n9971202g6a0ae2794b69b0a8@mail.gmail.com>"], "id": "<108AB72E-6F19-4B5B-AD9D-97C4E74F8184@arcor.de>", "subject": "[Radiance-general] Sketchup to Radiance for win users?", "email": "tbleicher at arcor.de", "body": "\n\nOn 31 Oct 2007, at 14:24, Val?re Paupelin-Huchard wrote:\n\n\nIf this is about Radiance in general buy the book\n\n'Rendering with Radiance' by Ward/Shakespeare\n\nor see here:\n\nhttp://luminance.londonmet.ac.uk/learnix/docs/radtutorial_basic.pdf\n\n\nIf this is about my script to export from Sketchup, here's the idea:\n\nThe script creates a common file structure of Radiance scene files\nwhere you have at the top level\n\n- a materials.rad file with all material definitions\n- a <scenename>.rad file with references to the geometry files\n- a <scenename>.rif file as input for 'rad'\n- the 'objects/' directory with the actual geometry\n- the 'skies/' directory with the sky definition\n- the 'views/' directory with one file per exported perspective\n- a bunch of other directories\n\nBecause the script is incomplete the first thing you have to do\nis to replace all the material definitions in the 'materials.rad'\nfile with actual physical materials. You can find a number of\nmaterials in the Radiance distribution or on the internet. It's\nworth to reduce the number of materials in the model before exporting.\n\nThe next thing you may want to do is to add some keywords to the\n<scenename>.rif file. There are some standard options which I forgot\nto add. You can use the free Radiance Control Panel to view and\nchange the settings in a GUI:\n\nhttp://squ1.com/download?radiancecp\n\nIf you want to do actual daylight analysis check also the parameters\nof the sky description. In particular the meridian and skytype are\nmore or less guesswork.\n\nIf you have checked all the above, go to the directory of the '.rif'\nand '.rad' file. All references in the '.rad' file assume that your\nworking directory is this directory when you start Radiance apps.\n\nTo start an interactive preview with rvu (not available on Windows)\ntype\n\nrad -o x11 <scenename>.rif\n\nTo render one perspective (as listed in the '.rif' file) type\n\nrad -v <viewname> <scenename>.rif\n\nTo render all pictures type\n\nrad <scenename>.rif\n\nAll these commands will work on Linux/OS X. I have not used Radiance\non Windows yet (as cygwin or mingw) but I think the commands should\nbehave similarly to the Unix versions.\n\nOnce you have rendered the images you can download the Radiance image\nviewer from Square1 to view and analyse your images:\n\nhttp://squ1.com/download?radianceiv\n\nThe viewer that comes as part of Radzilla should also work on Windows.\nEveryone else uses ximage.\n\n\nOne feature I have not mentioned yet is the feature to export points\non a working plane for calculation with rtrace. You have to create\na layer called 'numeric' in your SketchUp scene. All the polygons on\nthis layer will be exported as a grid of points with 0.25m distance.\nThe files will be exported to the 'numeric/' folder with a filename\nbased on the group or scene name.\n\nExample:\n\nYou have created a room with windows etc. Copy the 'floor' of the room,\nmove it 0.75m up (Z-axis) and create an offset of 0.4m from the edge.\nYou have now a plane floating in space. Move this plane to the layer\n'numeric' and create a group out of the plane only or the plane and\nthe room geometry (recommended because you can move or copy the whole\nensemble at once). Give the group a name (say 'room1' and when you\nexport the scene make sure the 'numeric/' level is visible.\n\nThis will create the file 'numeric/room1.fld' with one line for each\npoint in the form 'x y z 0 0 1'. This format can easily be piped to\nrtrace for calculation:\n\nrtrace -ab 3 -ov <scenename>.oct < numeric/room1.fld > numeric/\nroom1.irr\n\n(provided that there is already a <scenename>.oct). Don't forget to\ncheck/edit the material for your window. It's very likely that your\nglass material is not at all transparent.\n\nIf you modify this a bit and use '-oodv' as the output format you can\nuse the 'Plugins/Radiance/numeric input' menu entry to create a 3D\nsurface\nfrom the calculated values.\n... perhaps. This is highly experimental. Use at your own risk.\n\n\nHave fun and report errors,\nThomas\n\n--\nWhen I'm old I want to be a wiki page at\nhttp://www.bozzograo.net/radiancewiki/doku.php.\n-- anonymous email\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Sketchup to Radiance for win users?", "tags": [], "sender": "Thomas Bleicher", "datetime": "Wed Oct 31 12:52:11 2007"}