{"refs": [], "id": "", "subject": "[Radiance-general] 3ds import to Daysim", "email": "adiance-general-bounces@radiance-online.org", "body": "Message-ID: <5910A0754536EA4AAD411AE8221C3962029D8E46@nrccenexb1.nrc.ca>\n\nDear Annica:\n\nWe have a little Daysim discussion forum going under\nhttp://groups.google.com/group/daysim which might be better than\nRadiance-online for Daysim-specific requests. In the archives of the\nforum you will find that the problem that you are encountering is due to\nthat fact that SketchUP somehow changed their 3ds output files in\nversion 5 and up, REDUCING the number of characters allowed for each\nmaterial layer in 3ds. This has lead to the problem that most material\nnames are shortened and that the Daysim library does not recognize them\nany more. As a workaround you have to manually change the material\ndescriptions for your Daysim/Radiance scene as described in the\ntutorial.\n\nGood luck and let me know in case your problems persist.\n\nChristoph\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of\nAnnica Nilsson\nSent: Thursday, November 08, 2007 7:15 AM\nTo: radiance-general@radiance-online.org\nHello All,\n\nMy name is Annica Nilsson and I am new to this mailing list. I have just\nstarted my PhD studies at Uppsala University, Sweden, where my project\nwill be related to optical characterization, daylighting simulations,\nand energy aspects. I am currently not a Mac user and I've therefore\nchosen to work with Daysim. I understand that this is a radiance mailing\nlist, but I believe that Daysim is well-known to at least some of you,\nand I'm hoping that you will be able to help me.\n\nMy problem is that when I import my SketchUp files to Daysim the\nresulting material file references the ImportFrom3ds.geo.ra file rather\nthan the C:/DAYSIM/materials/ catalogue, which from my understanding is\nthe preferred reference.\n\nThis occurs for all materials in the SketchUp file that I have created\nand for the glazing materials in the example file (PrivateOffices.3ds)\nincluded with the Daysim program.\n\nI'm using the DaysimMaterialsForSketchUp in my sketch and I have the\nstyle set to \"Monochrom\" before I export the 3ds file. What else do I\nneed to think of when creating/exporting/importing my drawings?\n\nI am new to the daylighting simulation world, but I'm hoping to learn,\nand I appreciate any hints, ideas, comments and help I can get.\n\nBest regards,\nAnnica\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] 3ds import to Daysim", "tags": [], "sender": "adiance-general-bounces@radiance-online.or", "datetime": "Thu Nov  8 07:18:56 2007"}