{"refs": [], "id": "", "subject": "Re: [Radiance-general] Radmap: to produce irradiation map", "email": "Rob Guglielmetti", "body": "Message-ID: <A3B29F823861B34BB3868348164689490B7C61@server2.escny.local>\n\nThanks Rob for your quick response.\n\nYes, I realized that the -m 57 option I was using was not correct, and\nre-rendered with \"-m 75\". The results I am getting after correcting -m\nis little better but not as I expected. The shadows seems to be rotated\nabout 75-90 degrees towards East - Any Idea why this is happening?\n\nI am using radmap version v. 0.1b / 2003-11-24. I am not familiar with\npython, and I am using Linux for the first time for Radiance, so I am\nvery much limited to using the compiled versions.\n\nThanks,\n\nPrasanta\n\n-----Original Message-----\nSent: Thursday, November 29, 2007 6:01 PM\nTo: Radiance general discussion\nPrasanta Bhattarai wrote:\nI might be completely wrong on what I am saying. If so, please correct\nme and give suggestions.\n\nHi Prasanta,\n\nWelcome to the world of Radiance! The radmap tool is actually a separate\n\ntool from the main Radiance distribution, but the creator, Francesco\nAnselmo, is a member of this mailing list so you may get some responses\nbesides mine here. But you should definitely also check out\nhttp://www.bozzograo.net/radiance/ for other possible leads.\n\nrender existing and proposed irradiation maps with \"radmap\" command:\n--no-albedo --viewfile viewfile --radfile test.rad  -x 2048 -y 2048\n--keep-temporary-maps --sky-resolution 1024 --max-kWh 500 --max-MJ 150 *\n\nYour longitude is 73.9, but your standard meridian is a slightly\nnon-standard 57 degrees. I'd assume \"-m 75\" with \"-o 73.9\" will give a\nbetter result. Looks like you just accidentally transposed the numbers\nthere...\n\n\nWhat version of radmap are you using? I have not used option files with\nit before, but I looked at the python code for my copy of radmap (v0.1c)\n\nand it doesn't seem like there's any confusion between view files and\noptions files. In other words, it should be reading in your option file\ncorrectly despite what's being printed to the command line. You might\nwant to try changing options directly in the python code; you'll see the\n\noptions towards the top of the file and Francesco has commented\neverything fairly well. Only a few of the options are in there, but it\nserved me well enough. Good luck!\n\n- Rob Guglielmetti\n\n\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Radmap: to produce irradiation ma", "tags": [], "sender": "rpg@rumblestrip.org", "datetime": "Mon Dec  3 07:11:34 2007"}