{"refs": ["<200801031611.m03GBFO8031053@omr5.networksolutionsemail.com>"], "id": "<51E9A75A-BADE-4D62-90DF-219889A51990@lmi.net>", "subject": "[Radiance-general] extracting brightness values from pictur", "email": "gward at lmi.net", "body": "\nHello Prasanta,\n\nAs Rob points out, Photosphere may be used to compute the average\nvalue for a portion of an image.  The ximage viewer may be used in\nthe same way.  If you need this computed in \"batch mode\" or want all\nthe pixel values for a rectangular section, you can pass the picture\nthrough pcompos before sending it to pvalue.  (However, be aware that\nthe -o option of pvalue will not work for pictures passed through\npcompos.)\n\nThere is no convenient facility to get the pixels from a non-\nrectangular region of a picture, but using the following syntax:\n\npvalue -o -h -H result.pic | rcalc -e 'cond=func($1,$2)' -e '$1=179*\n(.265*$3+.670*$4+.065*$5)'\n\nyou can produce the luminance values for every pixel where func(x,y)\nis greater than zero.  Naturally, you must define this function also\non the rcalc command line, and creating one for a polygon is not that\neasy.  An example function that would get luminance values along a\ndiagonal extending from the lower-left of the image to the upper-\nright would be:\n\n-e 'func(x,y)=equal(x,y);equal(a,b):if(a-b+.5,b-a+.5,-1)'\n\nI hope this makes some kind of sense.\n\nIf you have a way to create the mask you want on the image (in\nPhotoshop or whatever), you can use the following nonsense to average\nover only these values.  (I assume the input mask is in PPM format,\nbut it could be TIFF or whatever.)\n\nra_ppm -r mask.ppm \\\n| pvalue -h -H -pG -df \\\n| rlam -if - \"\\!pvalue -h -H -o -b -df result.pic\" \\\n| rcalc -if2 -of -e 'cond=$1-.5;$1=$2' \\\n| total -if -m\n\nThe backslash before the exclamation mark is only necessary for the C-\nshell, so you might have to remove that.\n\nBest,\n-Greg\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] extracting brightness values from pictur", "tags": [], "sender": "Greg Ward", "datetime": "Thu Jan  3 11:11:04 2008"}