{"refs": [], "id": "<JUOX95$D16CAE178829D833BA82381657FC20EF@libero.it>", "subject": "[Radiance-general] Re: Thesys targ", "email": "loscotec at libero.it", "body": "\nThank you very much for your reply Axel..\n\nI did thought as well some cases were based on real measurement but I did read too it quite fastly.\n\nAccording to Antonutto someone else already did that validation..  So, there's no need to repeat it (even if actually I'm not able to find this research on the web).\n\nAnyway.. in an hour I will talk with my teacher to plan something..\n\nAs about Relux I didn't look for report, 'couse I don't think it could be interesting to me.. if you see it differently, please, tell me why !\n\nThank you again !!\n\nLucio\n\n\n.Dear Lucio,\n.> So ... it exists a tachnical report from  CIE which is titled \"Test cases to asses the\n.> accuracy of lighting computer programs\". Briefly, it contains some sets of\n.> scenes well described to be reproduced and computed in any software..\n.\n.> If nobody did those tests using radiance, it could be a nice goal for my thesys\n.> to complete them or some of them at least.. If somebody already did them,\n.> I'd like to look at them, if possible.\n.\n.Funnily enough, I was actually going to give this very task to one of\n.my students this year. I think it's well worth doing as an exercise.\n.\n.There is a validation of Relux (and I think one other software\n.package) based on the CIE technical report. If I remember correctly,\n.Relux worked all right, but they discovered that the CIE overcast sky\n.definition was implemented incorrectly in Relux, which it's now fixed.\n.If you cant' find  the report on the Net, get back to me, and I'll try\n.to dig it out.\n.\n.There are two things that you should be aware of with such a validation:\n.\n.a) The test cases are all VERY basic. This is because the reference\n.results are derived analytically (pen on paper). This is to make them\n.100% correct, but the downside is that the scenarios can't be very\n.complex. Radiance, however, excels exactly in such cases difficult\n.cases which can only be validated though elaborate measurements in\n.real spaces (See J. Mardaljevic, C. Reinhard)\n.\n.b) Much of Radiance's accuracy is based on the operator's experience\n.and him setting the ambient parameters correctly. I feel this would\n.have to be quite a large part of this assessment: How to get them\n.right, and the penalty of not getting them spot-on.\n.\n.Those are my thoughts on the subject. I am looking forward to reading\n.your report, and wish you best of luck with it.\n.\n.Axel\n.\n._______________________________________________\n.Radiance-general mailing list\n.Radiance-general@radiance-online.org\n.http://www.radiance-online.org/mailman/listinfo/radiance-general\n.\n\n.. Caminante no hay camino, solo se hace camino al andar ..\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "loscotec@libero.it", "datetime": "Tue Jan 15 06:51:25 2008"}