{"refs": [], "id": "<JVQ6D2$148B6C2D7564DA3F4F30121DC8064FAC@libero.it>", "subject": "[Radiance-general] Re: falsecolor's isolux on observer's luminance.", "email": "loscotec at libero.it", "body": "\nWonderfull!!!\n\nSo powerfull is Radiance!! :o)\n\nThat's really what I wanted ! Thank you very much !!!\n\nNow let's see if I'm able to really do it ! :-P\n\nJust a curiosity. Pinterp just interpolates datas, right? So as much going far from the observer, as loosing detail, isn't it? This is probably the reason why I need high resolution image.\n\nIt is not possible to just calculate the points needed for the last image orthogonal one) from the observer point of view , and save results in an image format? It would probably need just a quite simple script (which calls rtrace many times) and could save much render time (definition is only were needed). Am I right? Or there is something I didn't contemplate?\n\nLucio\n\n\n\n\n.Hi Lucio,\n.\n.It is possible to do what you want, but you need to first generate a\n.view using rpict at a high resolution with the -z option to specify a\n.depth buffer for output.  Then, give the picture and depth buffer to\n.pinterp with the desired orthogonal view and resolution for your\n.falsecolor isoluminance image.  Pass the output to falsecolor and\n.generate your contours.  The actual values will correspond to the\n.original rpict view, but the image will be reprojected into your\n.orthogonal view.\n.\n.Hope this helps!\n.-Greg\n.\n.> From: \"loscotec\\@libero\\.it\" <loscotec@libero.it>\n.> Date: February 4, 2008 7:10:05 AM PST\n.>\n.> Good day to everybody!\n.>\n.> I need yuor help!\n.>\n.> I would like to know if it is possible to do what I'm going to\n.> explain and how could I obtain such result.\n.>\n.> So.. what I need is to have in the end an orthogonal view from\n.> above a street which shows isolux lines of luminance from a\n.> determined poin of view.\n.>\n.> I guess I should tell Radiance for every and each point of the\n.> street as seen from above to collect radiance values as if that\n.> point was seen from the observer point of view instead than from\n.> above, and then to store those data in an .pic image. Then I would\n.> have to pass this to falsecolor to compute isolines..\n.>\n.> but I don't know how I could do it.. even if I'm quite sure it is\n.> possible.. !!\n.>\n.> Can someone help me?\n.>\n.> Lucio\n.\n._______________________________________________\n.Radiance-general mailing list\n.Radiance-general@radiance-online.org\n.http://www.radiance-online.org/mailman/listinfo/radiance-general\n.\n\n.. Caminante no hay camino, solo se hace camino al andar ..\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "loscotec@libero.it", "datetime": "Mon Feb  4 09:39:09 2008"}