{"body": "\nSo I've been following this raging debate over at the Maxwell Render\nforums regarding the physical accuracy of renderers and the specific\nproblem of visualizing the following scenario, to the best of my\nunderstanding:\n\nArchitectural rendering folks want a renderer that can accurately\ndepict sunlight, through glass into the interior of a space.  They\nwant this interior lighting to be visualizable from the exterior of\nthe space as if you were standing outside with your camera, looking\nthrough the window, into the interior of the space.\n\nhere are some quotes:\n\n1.\n- - - - - - -\nNo one has presented a proper sollution to this problem.\nI?m referring to rendering an interior space seen from an outside\nview in sunlight, trough glass without cheating.\n\nThis is a milestome in 3d art!!\nIf the MR team feel confident to deliver this in due time ok!!\n- - - - - -\n\n2.\n--  - - -\nI assume you mean it would be a milestone for Maxwell? Every other\nrenderer I've ever seen can handle this very easily.\n- - - - -\n\n3.\n- - - - -\nhe key is that he said \"without cheating\".\n\nNo other renderers can do it in the physically correct way. They all\nmake it up.\n- - - - -\netc.\n\n\nIs this a difficult rendering scenario for RADIANCE or any other\nrenderer or are these people missing something?  There are some\nseriously pissed off people in the Maxwell Render forums, especially\na lot of architect types who seem to think that the beta releases of\nM-R should solve all of their problems. I was more curious about the\nability of Radiance to handle this type of scenario versus M-R which\nclaims to be a physically-based renderer.\n\nThoughts?\n\nLet me also be very clear that, after reading the vituperous\n\nkirk\n------------------------------\n\nKirk L. Thibault, Ph.D.\nkthibault@biomechanicsinc.com\n\np.  215.271.7720\nf.   215.271.7740\nc.  267.918.6908\n\nskype. kirkthibault\n\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20060117/39fd552b/attachment.htm\n", "replyTo": "", "sender": "Kirk Thibault", "isquestion": true, "tags": [], "id": "<CB10DCB7-D3F2-4112-A0D2-684A47F917EE@biomechanicsinc.com>", "refs": [], "datetime": "Tue Jan 17 18:43:19 2006", "email": "kthibault at biomechanicsinc.com", "subject": "[Radiance-general] Sunlight through glass"}