{"refs": [], "id": "<JVYWUJ$5D3EB62515A8A15C8564212F90A24A5F@libero.it>", "subject": "[Radiance-general] Illuminance and coloured lights", "email": "loscotec at libero.it", "body": "\nHey Rob !!!\n\nI still haven't given thanks to you for your very detailed informations about lumen depreciation and so on.. !!\n\nTHANK YOU !!!!\n\nIt is really a gift to have people like you willing to help and doing it so much and so exhaustively ! My thesys (and my radiance learning curve) would require much more time (but really much more) if I wouldn't have your help !!\n\nGuess I should find some similar kind of community to improve my english as well !! :-P\n\n\nLucio\n\n\n\n.loscotec@libero.it wrote:\n.> Mmm.. I see.. Thank you very much.. but...\n.>\n.> what actually is depreciation?\n.>\n.\n.We're talking about lamp lumen depreciation (LLD) here, i.e. the gradual\n.decrease in lamp output over the life of the lamp--which can be\n.significant in certain lamps.  This is the reason why you will see two\n.columns for lumen output in any respectable lamp manufacturer's catalog,\n.for sources where this is an issue. Often called \"initial\" and \"design\"\n.lumens, the design lumens are adjusted for a particular lamp's lumen\n.depreciation over its rated life.  Design lumens will always be lower\n.than initial, unless if you're looking at a first edition Philips lamp\n.catalog from 2005 (or 2004, can't remember) which, very embarrassingly,\n.inverted the labels on the two values!  (I still have my copy somewhere,\n.but I doubt it will become a collector's item (except among a bunch of\n.lighting geeks.))\n.\n.Anyway, back to LLDs... The LLD is but one of the elements that comprise\n.the overall light loss factor (LLF) that is commonly used in lighting\n.calculations to account for these and other losses inherent to a\n.lighting design (room surface dirt, ballast factors, etc).  In Radiance,\n.this is accounted for with the multiplier (-m) in ies2rad (though you\n.can also use it to simulate higher or lower wattage lamps, or dimming, etc).\n.\n.***Which brings up a good point: if you are using colored lights in\n.Radiance by referencing lamp.tab it's not a bad idea to check what\n.lamp.tab thinks the LLD is and make sure it jives with your actual lamp,\n.AND make sure that factor is REMOVED from the LLF that you are\n.(hopefully) using in your multiplier.***\n.\n.> Should I run the command \"ies2rad -m 1.1764706 -t fluorescent lamp.ies\" to have right illumination ? If this is right, is there a reason why ies2rad does not do it automatically?\n.>\n.Hopefully the above paragraphs shed light on the answers to these\n.questions, which are \"no\", and \"yes\", respectively.  =8-)\n.\n.> If it isn't right, are Calculux and Dialux using badly lights ? 15 % illuminance less is really something.. !!\n.>\n.\n.See above...\n.\n.> And, there is some documentation about all this stuff ? It would be an interesting chapter for my thesys I guess..\n.>\n.>\n.The ies2rad man page does explain the lamp color and the lamp.tab\n.lookups.  There is more info in lamp.tab itself.  General info about\n.light loss factors can be found in any decent lighting design\n.calculation text.\n.\n.Hope this helps!\n.\n.Rob Guglielmetti\n.www.rumblestrip.org\n.\n._______________________________________________\n.Radiance-general mailing list\n.Radiance-general@radiance-online.org\n.http://www.radiance-online.org/mailman/listinfo/radiance-general\n.\n\n.. Caminante no hay\ncamino, solo se hace\ncamino al andar ..\n\n\n---   o\nmeglio   ---\n\n.. Caminante el\ndestino no es al\nfinal de el viaje,\npero en todo el\nandar ..\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "loscotec@libero.it", "datetime": "Sat Feb  9 02:52:08 2008"}