{"refs": ["<780003.51767.qm@web26613.mail.ukl.yahoo.com>"], "id": "<3436E2D5-9FEF-4551-8ED6-E8A12AB5F975@lmi.net>", "subject": "[Radiance-general] External 'clear' shading", "email": "gward at lmi.net", "body": "\nHi Per,\n\nIf you knew a few more details, such as the type of frit and percent\ncoverage, you could use the Radiance glaze script to arrive at a more\naccurate model.  Based on the information you have and a reasonable\nassumption of Rs=0.08, you can use a trans material (also see\nattached excerpt from RwR):\n\nvoid trans fritted_glass\n0\n0\n7 0.422 0.422 0.422 0.08 0 0.434 0.5\n\nI got this using:\n\nA6 = (Td + Ts) / (Rd + Td + Ts) = 0.23 / (0.23 + 0.30) = 0.434\nA5 = Sr = 0\nA4 = Rs = 0.08\nA3 = A2 = A1 = (Rd - Rs) / ((1-Rs)*(1-A6)) = (0.30 - 0.08)/((1-0.08)*\n(1-0.434)) = 0.422\n\nThe only thing that's really a guess is A7, the fraction of specular\ntransmission.  This would require an additional measurement or the\npercentage frit coverage.  I guessed 50% coverage.\n\nI hope this helps!\n-Greg\n\nExcerpted pages 325-326 from \"Rendering with Radiance\" <http://\ntinyurl.com/2wn78b>:\n\n5.2.6 Modeling Transmitting Media\nSome luminaires use semitransparent surfaces to cover the bright\nlight sources hidden\ninside. This can include downlights and other lensed luminaires. In\naddition,\nsome daylight control products, such as curtains and fritted glass,\nare most appropriately\nmodeled as a semispecularly transmitting medium. In these cases, it is\nimportant to know how to properly specify the trans material type to\naccurately\nmodel the appearance of the luminaire or other light-transmitting\narchitectural\nelement.\nSpecifying a trans material can be intimidating. It is one of the\nmost confusing\nmaterial entities in the Radiance repertoire. However, it is the\nsimplest material that\nwill trace direct source rays through a semispecular surface in order\nto determine\nthe diffuse and specular transmitted components.\nYou will have to measure the following surface properties in\npreparation for the\ncreation of a trans material type:\n? Diffuse reflectance (RGB): The color will affect both diffusely\nreflected light (if\nthere is any surface roughness) and transmitted light. Call the red,\ngreen, and\nblue components Cr, Cg, and Cb. Calculate the photopic average of the\nRGB\nand call this Rd.\n? Reflected specularity: As with glass, this is the fraction of light\nthat is reflected\noff the first surface in a mirror-like way. This we?ll call Rs; it is\nequal to floatingpoint\nargument 4, A4.\n? Surface roughness (RMS): Facet slope as in plastic. Call this Sr.\n? Diffuse transmissivity: Fraction of light that passes all the way\nthrough the surface\ndiffusely. Call this Td.\n? Transmitted specularity: Fraction of light transmitted as a beam?\nthat is, the\nfraction of light not diffusely scattered. Call this Ts.\nThe following formulas can be used to calculate the A7 through A1\nparameters\nfor the trans material:\nA7=Ts / ( Td+Ts )\nA6=( Td+Ts ) / ( Rd+Td+Ts )\nA5=Sr\nA4=Rs\nA3=Cb / ( (1-Rs)*(1-A6) )\nA2=Cg / ( (1-Rs)*(1-A6) )\nA1=Cr / ( (1-Rs)*(1-A6) )\nThe behavior of trans is regulated by the -st specular threshold\nrendering parameter.\nThe following formula can be used to determine the appropriate -st\nsetting for\nrview, rpict, or rtrace to ensure that the transmitted (and\nreflected) semispecular\ncomponent will be rendered. The variables A1 through A7 are the first\nthrough seventh\nfloating-point arguments to the trans primitive as calculated above.\nSt = A6 * A7 * (1 - grey(A1, A2, A3) * A4)\nUnlike most other Radiance material primitives, the trans material is\nneither\nintuitive nor straightforward to apply. It is a good idea to keep\nample notes for later\nreference when you are creating a trans material. Backing out your\nassumptions\nfrom an unannotated trans primitive is difficult.\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20080212/89834706/attachment-0001.htm\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] External 'clear' shading", "tags": [], "sender": "Greg Ward", "datetime": "Tue Feb 12 10:50:48 2008"}