{"body": "\nHi Kirk,\n\nYou've jammed a lot of questions in here, so let me try to take them\none or two at a time....\n\n\nEssentially correct.  So long as you stick to the same settings for\nyour exposure sequences, and the camera is not automatically\nadjusting the tone curve, you should get reproducible results out of\nPhotosphere/hdrgen.  Typically, the aperature-preferred or manual\nmode you will use for exposure bracketing precludes automatic tone-\ncurves.\n\n\nConsistency is the main thing.  After that, you are better off\nwithout aggressive color and tone enhancement, and sharpening.\nBoosting color saturation (as many cameras like to do) intermingles\nthe color channels in nasty, non-invertible ways.  Boosted contrast\nlimits the dynamic range of each exposure.  Sharpening makes image\nalignment errors more noticeable.\n\n\nAs I said above, the aperture-preferred and manual modes of most\ncameras disables per-image tone dickering.\n\n\nI spent the better part of a day last week taking shots of a Macbeth\nColorChecker chart in the many modes of the Canon EOS 5D I have on\nloan from LBNL, and concluded that there were small differences to be\nseen, particularly in terms of color accuracy, but for most\napplications this is not going to be a make or break consideration.\nStick with the most neutral, faithful, unaltered mode your camera\noffers, and JPEG should work fine.\n\n-Greg\n\n", "replyTo": "Subject: [Radiance-general] HDRI - Camera Response Curve", "sender": "Greg Ward", "isquestion": false, "tags": [], "id": "<C39BB15C-FA0A-4D15-88FA-EF6062A525B8@gmail.com>", "refs": ["<2C0020B9EB71CE4281B292F0E16A6DDE7FC742@ldcexc02.global.arup.com>", "<61FE56DB-9427-4AB0-B590-95D4FF32EC3D@gmail.com>", "<43C29B3A.9090603@visarc.com>", "<2F1A3A88-369E-4787-8138-4C32155689F7@biomechanicsinc.com>", "<B87EACF3-F5F3-44B9-8DEB-3B43CC426894@gmail.com>", "<183B764D-6878-455C-9495-DFBC717B1E10@biomechanicsinc.com>"], "datetime": "Tue Jan 10 18:57:35 2006", "email": "gregoryjward at gmail.com", "subject": "[Radiance-general] HDRI - Camera Response Curve"}