{"refs": [], "id": "<JWBQNI$49F37DDA725F8740D6F76803C731D612@libero.it>", "subject": "[Radiance-general] Problems with rpiece - Solved", "email": "loscotec at libero.it", "body": "\nThank you Greg!\n\nI imagined it was a wait-period problem, so I tried giving manually some \" rpiece @args \" invocation after minutes, and it didn't work as well. In addiction, setting -X and -Y directly in args and not in the sync file does work correctly (I've used it many times) withouth any wait-period.\n\nLucio\n\n\n. .Hi Lucio,\n.\n.It's difficult to say why this didn't work as you originally had it,\n.but it's generally a good idea to insert a pause of a couple of\n.seconds between each invocation of rpiece, to give it time to lock\n.its files.  This isn't reliable on all systems, otherwise.\n.\n.-Greg\n.\n.> From: \"loscotec\\@libero\\.it\" <loscotec@libero.it>\n.> Date: February 15, 2008 11:41:07 AM PST\n.>\n.> Thank you Rob!\n.>\n.> Actually I didn't want to continue an unfinished sequence, but to\n.> start a new one. Erasing the 3 files I was creating for the\n.> process, didn't work either (in fact the script already was\n.> overwriting them, so it was just to not leave anything untried that\n.> I tried it).\n.>\n.> I managed just a few minuts ago to solve the problem. Instead of\n.> writing the numbers of divisioni to the sync.file as written\n.> before, I wrote them in the normal way : -X 8 -Y 8 .\n.>\n.> This solved my problem but leaves opened the question on why it\n.> didn't work in the other way (as it was copied right from the manual).\n.>\n.> Lucio\n.\n._______________________________________________\n.Radiance-general mailing list\n.Radiance-general@radiance-online.org\n.http://www.radiance-online.org/mailman/listinfo/radiance-general\n.\n\n.. Caminante no hay\ncamino, solo se hace\ncamino al andar ..\n\n\n---   o\nmeglio   ---\n\n.. Caminante el\ndestino no es al\nfinal de el viaje,\npero en todo el\nandar ..\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "loscotec@libero.it", "datetime": "Sat Feb 16 01:07:06 2008"}