{"refs": [], "id": "", "subject": "[Radiance-general] Problem installing radiance onto MaOSX-Leopard: running trad", "email": "t.mcminn at curtin.edu.au", "body": "Message-ID: <000601c88274$e308a170$0d01a8c0@nest1>\n\nHello All,\n\nProblem installing radiance onto Mac OSX-Leopard: running trad (I am a Linux\nuser)\n\nWe use Radiance in our undergrad classes in the 3rd year of both the\nArchitecture and Interior Architecture courses here at Curtin University in\nPerth, Western Australia.\n\nFor teaching, I have authored a version Knoppix 5.1.1 with the radiance\nsoftware (radiance-HEAD-2007-02-15) pre installed for the students use. In\nthe PC labs, the students use vmplayer with the ISO image. At home, they are\nfree to burn the ISO image or download vmplayer from www.vmware.com and take\nhome the ISO file and appliance. For modelling software - SketchUP 6 (Pro or\nFree) with T. Bleicher's su2rad plug-in and model_location1.0.rb plug-in for\nthose that use the SketchUP 6 (Free) version at home.\n\nHowever, this year, a number of students have asked to install radiance on\ntheir MAC notebooks - easy says I ...\n1)\tDownload the MAC binaries from radiance-online.org\n(rad3R8_macosx.tar.gz)\n2)\tExtract my additional resources\n3)\tJump into terminal on the MAC (please bear with me - I don't have a\nMAC to play with but am comfortable with Linux OS)\n4)\tUn-tar the binaries, extensions and my additional resources into the\nusers directory.\n5)\tCreate a .profile with the additional PATH and RAYPATH directives.\n\nSo far no trouble in the 10 minutes between classes however I came unstuck\nwith the TRAD program - appears to run but bombs out with glob errors -\nsorry don't have the student's machine here to give more information. What I\ndo know, is that unknown to the student, X11 was pre-installed as was some\nversion of wish. The OS version was Mac OSX Leopard.\n\nOn the Knoppix 5.1.1 trad runs happily with wish8.4 straight up on a clean\ninstall.\n\nDo any of the Mac users have suggestions as to running trad - a vital front\nend in our teaching program? At this beginner's level, my students find the\ntrad GUI much more comfortable than the command line allowing them to\nconcentrate on learning and using radiance for lighting investigations in a\n10 hour sub unit in the science unit. As we all know when using trad,\nstudents will still need to use the command line at various points.\n\nRegards\n\nTerry Mc Minn\nFaculty of Built Environment, Art and Design\nCurtin University of Technology\nGPO Box U 1987 Perth 6845\nWestern Australia\nEmail: T.Mcminn@curtin.edu.au\nCRICOS Provider Code: 00301J\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Terrance Mc Minn", "datetime": "Sun Mar  9 23:05:19 2008"}