{"refs": ["<15AEE4FA-1FAC-4B15-8F7A-CF28AB013F73@arcor.de>", "<47E2D28C.7080908@rumblestrip.org>"], "id": "<D2982D2B-4E86-47C7-9D47-A6B8D256CED5@arcor.de>", "subject": "[Radiance-general] su2rad.rb - update of the Sketchup to Radianconverter", "email": "tbleicher at arcor.de", "body": "\n\nOn 20 Mar 2008, at 21:09, Rob Guglielmetti wrote:\n\n\nI couldn't reproduce Rob's problem here but there is a situation\nwhere something similar happens (semi-)intentionally:\n\nIn 'by layer' export the script uses the layer of the polygons\nto define the material. I assume that most imports from CAD will\nkeep the layer assignment as it was and so you could use this\nto create layers like 'concrete', 'wall internal', 'wall external'\nwhich after the export would be assigned to materials of the same\nname (or the Radiance save version with spaces replaces by '_').\n\nAt the moment the only thing the exporter can do is to create a\ndummy material file with all of these layer/material names aliased\nto the default material. Hence the unmodified export will be grey.\nYou now should use the references in the 'material.rad' file to\ncreate your own material file. The simplest way is to replace it\nwith a standard file that contains default material descriptions.\nAs long as your layer names match the material names this should\nwork out of the box.\n\nI was planning to add a function to read existing material files\nand use the definitions in this file. However, for that I have to\nwrite a parser for Radiance syntax in Ruby and that's not at the\ntop of my TODO list right now.\n\n\nI do not remember a previous v00d but I referred to everything since\nv00c as 'v00d'; it just never had a release date next to it.\n\nYou can go to the google code site and check the existing revisions\nhere:\n\nhttp://code.google.com/p/su2rad/source/list\n\nThen you can use any SVN client to get the revision you want or\nuse your web browser to get them individually.\n\n\nThe only thing you could do right now is place a Radiance material\nfile next to the material's '*.skm' file in your Sketchup installation.\nThe content of this file would be use instead of the replacement\nso the names have to match! It's not my preferred way to handle\nmaterials but it was possible without 'understanding' the contents\nof the file and therefore quick and easy to do.\n\nNOTE: I have found another problem with the material assignment\nthat causes the rendering of the scene to fail due to missing\nmaterial definitions. This happens with the 'by color' mode\nand is fixed in the current SVN.\nI also noticed that the 'by color' mode does not behave as\nit's supposed to do. This might be related to components and\ntherefore not such a problem but I see that I have to work on\nthis for a while before a 0.1 release.\n\n\nAnyhow, I hope it still helps some of you out there.\nThomas\n\n\n\n", "isquestion": false, "replyTo": "<47E2D28C.7080908@rumblestrip.org>", "tags": [], "sender": "Thomas Bleicher", "datetime": "Fri Mar 21 05:54:23 2008"}