{"refs": [], "id": "<94D15743AD28084CB9A3C763698895CB0177C8@server.Giladi.local>", "subject": "[Radiance-general] Bash error messag", "email": "angela at giladi-associates.com", "body": "\nHello,\n\n\n\nAfter weeks of trying to understand this parallel universe which is\nCygwin and Radiance, I finally reached the stage where I could attempt\nto follow the instructions in the introduction to 'Rendering with\nRadiance', 2003.\n\n\n\nAnd my first attempt produced the following error message:\n\n\n\n$ rvu -vp 2.25 .375 1 -vd -.25 .125 -.125 -av .5 .5 .5 test.oct\n\nbash: rvu: command not found\n\n\n\nI am googled-out.\n\n\n\nI have tried tirelessly to understand the workings of this new language\nand, in Newbie-speak, perhaps this is a PATH issue?\n\n\n\nI compiled Radiance (several times - still got errors) from the latest\nradiance tar files, and I am using CygwinX.\n\n\n\nA bit of background - Before this first attempt I was familiarizing\nmyself with CygwinX/Radiance. The first issue for me was that many of\nthe exe files were not in the bin directory, but nicely organized under\nsrc (source?) and several sub-directories eg util. I compared the\ndirectories to the ones that were compiled with Francesco Anselmo's\nbinaries for Cygwin (yes, I did that too) and the directories are very\ndifferent. I am now confused as how to set up the PATH.\n\n\n\nSecond issue was that the rvu.exe file was not installed at all. I did\ncopy the rvu.exe (into bin) file from Anselmo's Cygwin installation, as\nwell as the bash_profile file where he sets up the different PATHS (into\nCygwin directory). I did of course change the file to my setup.\n\n\n\nMany thanks for any help offered - (please)\n\n\n\nAngela\n\n\n\n\n\n\n\n\n\n\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20080403/9b62c0ed/attachment.html\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Angela Giladi", "datetime": "Thu Apr  3 11:03:41 2008"}