{"body": "\nHi Lars,\n\nIn brief again. I did some preliminary experimentation with OpenSSI a\ncouple of years ago. I think that it shows a lot of promise and a very\nsupportive user group. I believe a couple of the developers are from HP\nand thus really interested in developing a robust and stable platform.\nThey have integrated some of HPs clustering technology as well as tools\nfrom other systems. I believe that they have utilized some elements of\nthe OpenMosix load balancing algorithm.\n\nAs you know I did experiment with OpenMosix as well prior to learning\nabout OpenSSI. At the time my experiments lead me to recognize a problem\nwith OpenMosix when jobs requiring large allocations of memory start up,\n(eg multiple jobs get started on a given node, the jobs need to load to\nmemory prior to getting migrated, however the memory requirement exceeds\nthat of the local node thus swapping occurs). Thus my instinct if I were\nto use openmosix, would be to forgo the automated migration mechanism\nand develop a simple scheduler that would send jobs out to specified nodes.\n\nIf I decide to move forward with a clustering solution, my instinct\nwould be to go with OpenSSI at this time. This would be from standpoint\nof stability, robustness, shared filesystems and development team. But\nthis is just my bias without anything well documented at this time to\nsupport it. There was an excellent paper written on Single System Images\ncomparing (openmosix, openssi and Kerrighed)\n\nhttp://www.irisa.fr/paris/Biblio/Papers/Lottiaux/LotBoiGalValMor05CCGrid.pdf\n\n\nThe latter is a clustering solution out of a French research group,\nthough I am not sure if it available in any kind of stable release, (I\nhave not checked).\n\nI am happy to see that you and Francesco at least have made some real\nefforts to use OpenMosix in a production setting. It would be great to\nhear about some of your experiences thus far. I think that the real\nopportunity of these clustering systems is as follows:\n\n1. single process space across nodes\n2. shared filesystems that do locking/caching correctly (ie more\nstable than NFS)\n\nThere are many others, but these are the main features that come to mind.\n\nBest,\n\n-Jack de Valpine\n\nLars O. Grobe wrote:\n\n--\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20060219/21b16eec/attachment.html\n", "replyTo": "Subject: [Radiance-general] ranimate, recovering from broken rpicts?", "sender": "Jack de Valpine", "isquestion": false, "tags": [], "id": "<43F8B204.6030409@visarc.com>", "refs": ["<20b7f559db0e093ad73930afa5babe40@gmx.net>\t<43F7B4F9.2030104@visarc.com>\t<20857D59-57E3-4170-A2B2-B4824D1C7318@gmail.com>\t<200602190917.44566.pisuke@blueyonder.co.uk>", "<f474d9a6575e5b63d84bae47a102d6ce@gmx.net>"], "datetime": "Sun Feb 19 19:01:28 2006", "email": "jedev at visarc.com", "subject": "[Radiance-general] ranimate, recovering from broken rpicts?"}