{"body": "\nHello group, hello Greg ;)\n\nMy recent experiments with obj2mesh and uv coordinates have\ninspired a proposal to add uv coordinate conversion to\nobj2mesh.\n\nThe problem:\n\nRadiance works in a texture coordinate system of (Lu,Lv)\nwhere the _smaller_ dimension is 1.0 and the larger is >1.0.\nOther file formats (especially *.obj) work in a texture\nspaces that's normalized to 1 (both dimension are in the\nrange (0,1) regardless of width and height of the image).\n\nWhen uv coordinates are present in an *.obj file that's\nconverted via obj2mesh the coordinates are taken as they\nare found which is only correct for square images. In other\ncases only the lower left square of the texture image is\nused for the mapping.\n\nCurrent solution:\n\nThe uv coordinates of the *.obj file have to be converted\nto the range expected by Radiance before the mesh is created\nwith obj2mesh. This is not difficult but it would change the\ncontent of the original file in a way that's probably against\nthe specs of the *.obj file format.\n\nAlternative:\n\nMy proposal is to add a new option to obj2mesh to set the\naspect ratio of the texture image when the mesh is created.\nobj2mesh can do the necessary conversion of the normalized\nuv coordinates and write the converted values to the mesh.\n\nThe informations necessary are the relation of the image\ndimensions and which side is the larger one (w or h). Both\ncan be given in a single float when we assume a w/h aspect\nof the images (though I'm not sure this convention exists\nanywhere in Radiance). The default should be a 1.0 aspect\nso the current behavior is preserved even without the new\noption given.\n\nSince '-a' and '-r' are already used in obj2mesh the new\noption could be '-t' (for texture aspect). Example:\n\n$ obj2mesh -t 0.5 input.obj output.rtm\n\nto map the uv coords of the *.obj to a landscape texture\nimage (eg. w=200 h=400 px).\n\n\nPlease correct me if anything is wrong with this idea or\nif it's incompatible with the current use of obj2mesh.\n\n\nThomas\n\nPS: I may have difficulties replying to emails in the next\ndays or weeks. Please don't think I'm avoiding the wrath\nif a reply takes a some days.\n\n\n\n\n", "replyTo": "<A22E9EEA-7920-44A8-836D-0DFCE7225045@arcor.de>", "sender": "Thomas Bleicher", "isquestion": false, "tags": [], "id": "<D211B7CE-6C1A-41EE-8B4B-BE90DAD476B3@arcor.de>", "refs": ["<2C0020B9EB71CE4281B292F0E16A6DDE7FC869@ldcexc02.global.arup.com>", "<A22E9EEA-7920-44A8-836D-0DFCE7225045@arcor.de>"], "datetime": "Mon Feb 20 17:53:11 2006", "email": "tbleicher at arcor.de", "subject": "[Radiance-general] obj2mesh proposal [was: obj2mesh,UV coordinates and image aspect]"}