{"refs": ["<706596.88943.qm@web26610.mail.ukl.yahoo.com>"], "id": "<EB124710ADB8554C930FADF760BB2BE7025DCE35@n-yexc01.global.arup.com>", "subject": "[Radiance-general] Illuminance falsecolor pictures", "email": "Christopher.Rush at arup.com", "body": "\nThere are a few things you can do to improve the falsecolor output. The\naccurate output from rpict is another topic, but it seems that you're\nmainly interested in displaying your data.\n\n\nYour command was missing at least one important item, a maximum for the\nscale. If your maximum illuminance in the scene that you're interested\nin is say 2000 lux you should add that to your falsecolor command.\n\nAlso if you are using the numerical data from the irrad.pic, the label\nshould be for illuminance, lux, unless you are converting to something\nelse.\n\nfalsecolor -i irrad.pic -p rad.pic -cl -n 10 -l lux -s 2000 > illum.pic\n\nA few more items that you can add to make it more legible... Try a\ngreater number of steps to your scale, maybe up to 20, although this\nmight be too many for a 512 pixel image. If your image was larger you\ncould make your scale larger with the -lh and -lw options. Also if you\nhave a high range and want to see detail at the low end of the scale\nwhile still registering values at the high end you could try a\nlogarithmic scale, I think a base around the natural log 2.718 usually\nshows the range well.\n\nfalsecolor -i irrad.pic -p rad.pic -cl -n 20 -l lux -s 2000 -log 2.718 >\nillum.pic\n\nTry a few variations of the scale, log base, and number of divisions\nuntil you get something legible.\n\n-Chris\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20080423/46b577b4/attachment.html\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Illuminance falsecolor pictures", "tags": [], "sender": "Christopher Rush", "datetime": "Wed Apr 23 07:25:06 2008"}