{"refs": [], "id": "", "subject": "[Radiance-general] aiming illums, orthographic projection, and hiding surfaces", "email": "adiance-general@radiance-online.org", "body": "Message-ID: <491B7E5A-7B77-11D7-843E-000393824274@rumblestrip.org>\n\nOn Wednesday, April 30, 2003, at 09:02 PM, John An wrote:\n\nWell, I guess we'll find out tomorrow then. =8-)  I don't recall any\nannouncements from Greg about this situation getting resolved, but if\nit's true that's GREAT!  Do let us all know how you make out.  I'd\nstill like to get another copy for the office.\n\nCongrats on taking the plunge with Radiance.  It's a great program\n(that I am only beginning to understand), and the massive effort you\nput into learning it *will* be rewarded.  And this list is frequented\nby many of the gurus, and they are quite open and generous with their\nadvice.  It's a great bunch of people on here.\n\n\nIt's not the number of polys that's causing that aiming failure, it's\nthe shape.  And it's only with illum sources.  So no, you don't need to\nde-triangulate all your surfaces for accurate calcs.  Just fix those\nillum polygons and that error will go away.  That said, long thin\npolygons are not a \"good thing\", and others on here could give you a\nbetter explanation of why, but it's not the end of world if you have\nsome in there (I don't think).\n\nI played with Sketchup a little bit, among other modelers, but I always\ncrawl back to AutoCAD, for better or worse.  I guess once you get comfy\nwith something, it's hard to leave it.  If Skecthup works for you, use\nit.  But I find AutoCAD to be a very precise tool, and Gerog Mischler's\nradout utility is a great .DWG > Radiance exporter.  It's a good combo!\n\n\nHa, it's my pleasure to be able to *answer* a question here, opposed to\nalways being the \"asker\".  (Hopefully I did not steer you wrong, but if\nI did I will surely be corrected here...)  Good luck in your pursuits\nwith Radiance!\n\nRob Guglielmetti\nrpg@rumblestrip.org\nwww.rumblestrip.org\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] aiming illums, orthographic projection, and hiding surfaces", "tags": [], "sender": "Rob Guglielmetti", "datetime": "Wed, 30 Apr 2003 21:50:28 -0400"}