{"body": "\nWell, I got my MacBook Pro today, and have been playing with it this\nevening a bit. Update:\n\nIt does not want to play nice with my wireless router, so I had to\nsteal bandwidth from a neighbor who has a slow connection and no\nawareness of wireless security. Spent 3 hours downloading X-code so I\ncould compile Radiance, then discovered that it was on the CDs that\ncame with the computer.  Duh.\n\nAnyway, once I got x-code installed, I was able to compile Radiance\nstraight away. I guessed at the compile options, sort-of combining\nthe linux and OSX gcc options from the makefile.  Here's the case I\ncreated:\n\ncase 8:                 # MacOS X on Intel\nset mach=\"-DBSD -DNOSTEREO -Dfreebsd -I/usr/X11R6/include -L/\nusr/X11R6/lib\"\nset opt=\"-O3\"\nset arch=IBMPC\nset extras=\"CC=cc\"\nset special=\"ogl\"\nbreaksw\n\nI got some errors, but at this point everything seemed to compile.\nI'd be happy to share the errors if someone wants to tell me how the\nheck to save the make output to a file (the errors scrolled off the\nscreen before I could read them).  Then I installed X11 from the\nincluded CDs, and created a .bash_profile file that looks like this:\n\nPATH=/usr/local/bin:$PATH\nRAYPATH=.:/usr/local/lib/ray\nexport PATH RAYPATH\n\n# if we're not SSH'd in\nif [ ! ${SSH_TTY} ]; then\n# make sure X is running\nif [ \"`ps -x | awk '{print $5}' | grep X11`\" = \"\" ]; then\nopen /Applications/Utilities/X11.app &\n# then refocus Terminal.app\nosascript -e 'tell appliction \"Terminal\" to activate'\nfi\n# if DISPLAY isn't set\nif [ x${DISPLAY} = x ]; then\nexport DISPLAY=:0\nfi\nfi\n\n\nThen I was able to run some test scenes from the obj directory (I\nhaven't even begun to move all my files from my old computer), and\nthey ran fine (and fast).\n\nGreg, the Universal binary of Photosphere loaded (instantly), but I\nhave no catalogs or images on here yet, so all I can say is it loads.\n\nMore later for sure.  I plan to run Mark Stock's benchmark test and\nplay with the holodeck on here, but right now I need to put some\nmusic on this thing and my cat is screaming for her catnip.\n\n- Rob Guglielmetti\n\n", "replyTo": "", "sender": "Rob Guglielmetti", "isquestion": true, "tags": [], "id": "<DE5FF2CE-B75B-4DC4-AEB2-CDCC45AE296A@rumblestrip.org>", "refs": [], "datetime": "Tue Feb 28 07:18:52 2006", "email": "rpg at rumblestrip.org", "subject": "[Radiance-general] MacBook Pro Report"}