{"body": "\nHi,\n\njust tried out, replaces my meshes by obj2rad-oconv-generated\ninstances. May be faster, but now my rpict-process takes 1.4 GB instead\nof 700 MB ;-) So I guess I will have to stay with those \"slow\"\nmeshes...\n\nCU Lars.\n\nP.S.: Concerning optimizations: I think trying to introduce assembler\ninto radiance code is a bad idea, as it breaks portability, a great\nstrength of the current code. Still, I think one should think about if\nthe code could not be written to be more vector-friendly. Than\ncompilers could do the rest (auto-vectorization is even in gcc since\n4.0), and those who want to try (like me ;-) could simple replace some\nfunctions. Some ideas would be like passing not only one ray, but ray\nclusters to the subfunctions, so that these could be implemented to do\ncalculations in parallel. Another help would be to replace the\nunflexible datatypes by unions. I ran into trouble when I just wanted\nto Altivec some routines. As mat4, fvec etc are simply arrays, I have\nto get the data in a altivec-suitable format, which causes overhead. If\nthey had been e.g. unions (containing nothing but an array), I would\nhave simply changed this to be an union of array and vector. All\nunchanged functions would work as now, and still I could directly apply\naltivec code on data. Those who think altivec is out because Apple\nbuild x86: this year we might see the first cell-processor machines.\nAnd vector units are built into almost all platforms today.\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: smime.p7s\nType: application/pkcs7-signature\nSize: 2134 bytes\nDesc: not available\nUrl : http://radiance-online.org/pipermail/radiance-general/attachments/20060226/b4126464/smime.bin\n", "replyTo": "Subject: [Radiance-general] Mesh Rendering Performance", "sender": "Lars O. Grobe", "isquestion": false, "tags": [], "id": "<814553ecc7ac40056a3377b2d97adbd2@gmx.net>", "refs": ["<BAY102-F198EF7F777CF434858D064A4F30@phx.gbl>", "<7B695E27-07BC-4D86-AFF8-DA33C6076CEB@gmail.com>"], "datetime": "Sun Feb 26 10:40:21 2006", "email": "grobe at gmx.net", "subject": "[Radiance-general] Mesh Rendering Performance"}