{"refs": ["<D9EDCE72-1A3B-41C1-A23A-279140BA2052@lmi.net>"], "id": "<EEF2DD64-9C9D-45AC-94B3-DF284BF218D2@lmi.net>", "subject": "[Radiance-general] Re: Official Radiance 3.9 Releas", "email": "gregoryjward at gmail.com", "body": "\nI neglected to mention in my announcement the significant changes\nsince the last 3.8 release (Oct. 2004):\n\nAdded -spec option to falsecolor to restore original spectral color\nscale.\nAlso added \"-s auto\" option to automatically set the maximum value.\n\nRe-fixed bug in octree code that caused it to allocate 8 times as\nmuch memory as it actually used(!) -- this was pointed out way back\nin 1999 by Erik Reinhard and Erik Jansen, but the fix they gave me\ngot lost in the slightly broken release process at the time.  This\nshould make a big difference in memory usage, especially for the\nnew mesh primitive.  (I measured 30% less memory usage.)\n\nFixed bug in shadow cache where it was adding surfaces with antimatter\nholes cut in them to the obstructor list.  Thanks to John Mardaljevic\nfor discovering and reporting the problem.\n\nAdding ability in mkillum to incorporate BSDF data in calculation.\nInternal interface (raypcalls) now used in place of rtrace process(es).\n\nAdded -c option to rtcontrib to facilitate cumulative calculations.\n\n****** COMPATIBILITY CHANGE ********\nFixed long-standing bug in source.cal, which caused it to produce\nreversed anisotropic photometric distributions due to the\nmisorientation of the y-axis.  Thanks to Zack Rogers for discovering\nand helping debug this problem.\n\nAdded rsensor program to compute sensor signal for daylighting controls.\nFunding for this component was provided by the Architectural Energy\nCorporation in Boulder, CO, and directed by Zack Rogers.\n\nAdded \"planisphere\" (stereographic) fisheye view type for traditional\ndaylighting analysis.  Feature requested & explained by Axel Jacobs.\n\n--------------------\n\nOf these, the addition of the rsensor program for SPOT and the new\nBSDF input for mkillum are probably the most important.  Thanks is\ndue to AEC and LBL for sponsoring these developments.\n\nThe complete list of changes for all releases is available at:\n\nhttp://radsite.lbl.gov/radiance/refer/Notes/ReleaseNotes.html\n\nCheers,\n-Greg\n\nP.S.  With help from Peter A-B, I've finished updating radiance-\nonline so the HEAD patches are relative to the new 3.9 release.\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Re: Official Radiance 3.9 Releas", "tags": [], "sender": "Greg Ward", "datetime": "Thu May  1 14:53:36 2008"}