{"refs": [], "id": "", "subject": "[Radiance-general] aiming illums, orthographic projection, and hiding surfaces", "email": "adiance-general@radiance-online.org", "body": "Message-ID: <EC9FC0B6-7B81-11D7-B071-0030658EA95E@panix.com>\n\nOn Wednesday, April 30, 2003, at 03:08  PM, Rob Guglielmetti wrote:\n\nA bit more clarification.\n\nIf one has a model which is 100 feet in the x (width) direction and 50\nin the y direction, and one's floor is at z=0, and one is using feet\n(which I prefer for AS units), then the options:\n-vl -vd 0 0 -1 -vu 0 1 0 -vp 50 25 5 -vo 1\nwill give a plan cut at the conventional four feet off the floor.\nAlso, this:\n-vl -vd 0 0 -1 -vu 0 1 0 -vp 50 25 7 -vo -1\nI believe will give the reflected ceiling plan so popular with lighting\ndesigners, cut at eight feet off the floor, which I expect will include\nmost overhead luminaires.\n\nExplanatory notes:\n\n\"-vl\" sets a \"parallel\" (orthographic or axonometric) projection.\n\n\"-vd\" (view Direction) sets view direction; the option takes x y and z\nvalues but these are used to define a vector and (so far as I can tell)\nonly the direction of the vector is used.  \"-vd 0 0 -1\" is a plan,\nsince it is a vector pointing straight down.\n\n\"-vo\" (fOre) sets a clipping plane near the viewpoint and \"-va\" (Aft)\nsets one behind the space.  \"-vo 1\" sets a cutting plane 1 unit from\nthe viewpoint.  \"-vo -1\" will--I think--show a reflected image one unit\nbehind the viewpoint\n\n\"-vp\" (viewPoint) sets the viewpoint in model space (this will be the\ncenter of an orthographic projection.)  \"-vp 50 25 5\" is a viewpoint\nfive feet up in the center of my example model.\n\n\"-vu\" (up) gives a vector in model space which indicates the \"top\"\n(maximum y coordinate) of the 2-D projection.  \"-vu 0 1 0\" (I believe\nthis is default) will make the y direction in model space the y\ndirection in the projection.\n\nI believe that's a summary of the basics of Radiance parallel\nprojections.  Hope it helps!\n\nRandolph\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] aiming illums, orthographic projection, and hiding surfaces", "tags": [], "sender": "Randolph Fritz", "datetime": "Wed, 30 Apr 2003 20:06:38 -0700"}