{"body": "\nJack,\n\nSee Thomas's comments below.  ;-)\n\nI too see Blender as being a powerful complement to Radiance because\nof the Python API, giving the Radiance end-user of Blender the\nability to extend Blender to suit the needs of Radiance.  It appears\nthat Thomas has some pretty impressive goals for integrating Blender\nand Radiance even more tightly than I was imagining, but his ideas\nfit exactly my personal opinion of what I picture Radiance to be - a\ncollection of tools that one can link together in endless\ncombinations to achieve the specific task at hand.  The open and\nPython-scriptable nature of Blender makes this a natural extension of\nthe Radiance model.\n\nBlender's modeling metaphor and control layout takes a little getting\nused to but it is customizable, so if you are used to using the left\nor right or middle mouse button to do certain things, etc. all that\nis configurable.  I am not a CAD user, so I cannot compare the two to\nyour level of detail, however, it is fairly robust as a modeler,\nsupporting NURBS and Subd's, etc.  I suppose it depends on what you\nare looking for it to do.  It may be that Blender is a middle step in\nworkflow that demands the precision of CAD and the flexibility to\ncondition that CAD output into something more Radiance friendly and\ncustomizable.  As Thomas mentioned, it would make the perfect \"set\nup\" tool - complex modeling in CAD, scene set-up, lighting and\nmaterial selection, etc. in Blender and tweaking, crunching and\nanalysis with Radiance's computing and analysis tools.  You can;t\nbeat the price.\n\nI use Lightwave and Blender, mostly because I like trying the same\nthing in different ways to see how each app handles my solutions.\n\nGood luck!\n\nkirk\n\n\nOn Feb 20, 2006, at 5:02 PM, Thomas Bleicher wrote:\n\n\n\n", "replyTo": "Subject: [Radiance-general] Blender", "sender": "Kirk Thibault", "isquestion": false, "tags": [], "id": "<A4688346-675D-4D34-90D9-5C6FFE063319@biomechanicsinc.com>", "refs": ["<2C0020B9EB71CE4281B292F0E16A6DDE7FC869@ldcexc02.global.arup.com>\t<A22E9EEA-7920-44A8-836D-0DFCE7225045@arcor.de>\t<A9230BDD-27E2-4F7F-BA62-0BD03FB7B582@gmail.com>\t<CE3109FB-02D4-4E61-8ABA-3A7C9EA2F4D7@arcor.de>", "<9C959B0D-ED49-4FDB-9D4E-1CC6668AB4AF@biomechanicsinc.com>", "<43FA23D2.3090803@visarc.com>", "<F1CCD0B3-C717-4A77-9986-A0B8EEAE726E@arcor.de>"], "datetime": "Tue Feb 21 03:30:08 2006", "email": "kthibault at biomechanicsinc.com", "subject": "[Radiance-general] Blender"}