{"refs": ["<467886.95117.qm@web26605.mail.ukl.yahoo.com>"], "id": "<E87FDE1B-60EC-4250-9128-EC2B0219D528@arcor.de>", "subject": "V: Re: [Radiance-general] Lux-values for points in a plan", "email": "tbleicher at arcor.de", "body": "\n\nOn 14 May 2008, at 08:54, Per Haugaard wrote:\nI would suggest to split your verification of glazing material and\nshading system\ninto two separate steps to identify possible problems more easily.\nFor the material\npart I would create a simple scene like this:\n\n#### simple test scene ####\n\n## overcast sky with 10000 lux horizontal diffuse\n!gensky 3 21 12:00GMT -c -o 0 -a 51 -m 0 -B 55.866\n\nskyfunc glow skyglow 0 0 4 1 1 1 0\nskyglow source sky 0 0 4 0 0 1 180\n\n## material for glass sphere\nvoid glass window_glass\n0\n0\n3 .78 .78 .78\n\n## glass sphere around origin\nwindow_glass sphere glass_sphere\n0\n0\n4 0 0 0 1\n\n#### end of test scene ####\n\nThen use two points (0,0,0) and (0,0,2) to calculate the lux values\ninside and outside of the sphere. The direction has to be (0,0,1)\nbecause the scene does not include a ground glow.\n\nIf you get around 10000 lux outside of fhe sphere and with the\nabove material around 7200 lux inside the scene setup is correct\nand you can now start modifying the values for the glass material.\nThe ratio of ouside/inside will give you the transmittance of the\nglazing (which is not equal to the values of the glass material!).\n\nWhen you have verified your glass material do the next step and\nuse it in a scene. You can now be sure that the material is correct\nand any unexpected values are the result of the scene geometry.\n\n\nYour reference point might be in the centre of the window but\nrtrace samples the whole hemisphere around this point. So if you\nhave (black) reveals this will influence the calculations even if\nyou move your calculation point only by 0.05 units.\n\nWithout knowing more about your scene it's hard to tell what\nexactly causes your values. As a quick help calculate the scene\nwithout glazing and with different glazing values but always\nfrom the same point inside of the room. If these values are correct\nit's your geometry that's creating the problems.\n\n\nThomas\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20080514/98c57b86/attachment.html\n", "isquestion": false, "replyTo": "Subject: SV: Re: [Radiance-general] Lux-values for points in a pla", "tags": [], "sender": "Thomas Bleicher", "datetime": "Wed May 14 12:26:13 2008"}