{"refs": ["<100441490805021446hf63b5f9i9c3a0153dd258665@mail.gmail.com>", "<07CC9FF7-3E04-4DE8-9FC2-122D43ABFEA5@mac.com>", "<BAY143-W428DA13550C2E6002DD371E0C00@phx.gbl>"], "id": "<E1DF2A00-1D54-4C26-AD46-7F43B21D9603@lmi.net>", "subject": "[Radiance-general] applied material to all faces of a genbox", "email": "gregoryjward at gmail.com", "body": "\nHi Steve,\n\nFor a sky view, folks usually apply the fisheye.cal mapping using a\nfisheye capture as input.  Mapping appropriate sky distribution\nvalues is a challenge, although not one you have to worry about if\nyou've managed to actually capture a good HDR sky.  (This is a tricky\nproposition -- see <http://gl.ict.usc.edu/skyprobes/> for examples.)\n\nI remember discussing with the Visarc folks ways to use the output of\ngensky or gendaylit to \"correct\" a sky image that was inserted for\npurely artistic reasons.  Simply using the color from an image and\nthe luminance from gensky doesn't work that well, since it would make\neliminate important luminance changes at cloud boundaries and the\nlike, I would think.  However, you should be able to combine the\nhighest luminance frequencies from your sky photo along with the\ncolor to get a reasonable impression.\n\nI took the following image:\n\nhttp://www.camerantics.org.uk/wallpapers/clouds.jpg\n\nand ran the following:\n\ndjpeg clouds.jpg | ra_ppm -r > clouds.pic\npgblur -r 40 clouds.pic | pcomb -e 'hfs=1/li(1);ro=hfs*ri\n(2);go=hfs*gi(2);bo=hfs*bi(2)' - clouds.pic > hfclouds.pic\n\nThis should give you a picture that contains all the color and the\nhigh frequency luminance changes of the original, normalized to an\naverage of 1.0.  Multiplying this against a sky distribution will\ngive you the appearance of clouds while maintaining the overall\nluminance distribution.  Of course, there are caveats, as the high\nfrequencies (and even the color) may affect your rendering due to\ntheir local influence on the output of gensky or gendaylit.\n\n(Note: the djpeg program is not included with Radiance -- you may\nneed to use Photosphere or Photoshop to convert a JPEG image to HDR\nformat.)\n\nI hope this helps.\n-Greg\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] applied material to all faces of a genbox", "tags": [], "sender": "Greg Ward", "datetime": "Sat May 24 09:11:17 2008"}