{"refs": ["<100441490805021446hf63b5f9i9c3a0153dd258665@mail.gmail.com>", "<07CC9FF7-3E04-4DE8-9FC2-122D43ABFEA5@mac.com>", "<BAY143-W428DA13550C2E6002DD371E0C00@phx.gbl>", "<D3926527-204A-4E8F-A802-19E963C28421@arcor.de>"], "id": "<BAY143-W7E5B48BE92060F0499A9FE0C20@phx.gbl>", "subject": "[Radiance-general] applied material to all faces of a genbox", "email": "smichel_designer at hotmail.com", "body": "\n\nI was thinking of horizon views instead of variable skies. After all a perfect blue or evenly gray sky is entirely plausible but a flat landscape without vegetation and neighboring buildings is rare for most architectural projects . Actual window views of landscape and setting is an instrinstic part of architecture. I've used simple tree models for near field modulation of window shading. But the horizon beyond is seldom a simple line (of course basic adjacent building blocks are required for accuracy) But instead could one method be photographing the 'view' and map it perhaps directly to the window with a  mkillum type function and transparency??   Ideally the sky model distribution would be filtered through by a visible bitmap of the 'view'. HDR luminance might serve since logically near and midfield horizon objects could 'mask' or alter the sky distribution with more accuracy with added bonus of an actual view.\nsky dist--->windowmap filter (near field obstructions)--->windowglass--->room\n\nMaybe Im re-inventing the wheel- So my question: what function could i use to do what I described (and is my reasoning sensible?)\n\n\nsteve\n\n----------------------------------------\n\n_________________________________________________________________\nIf you like crossword puzzles, then you'll love Flexicon, a game which combines four overlapping crossword puzzles into one!\nhttp://g.msn.ca/ca55/208\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] applied material to all faces of a genbox", "tags": [], "sender": "steve michel", "datetime": "Sun May 25 18:43:35 2008"}