{"body": "\nHi there\n\nI've been trawling the internet for a while now looking for ies data\nfiles (or any other standard fot that matter) for theatrical lighting\ninstruments, with out any luck at all.\n\nI've found lots of data architecturial lanterns, and lots for the actual\nbulbs (from ge, osram etc)but these aren't very useful when you're\ntrying to light a theatre, with the lanterns that are available there.\n\nThe only best photometric data i've found is from ETC:\n\nhttp://www.etcconnect.com/docs_downloads/datashts/S4_19_Deg_vD.pdf\n\nwhere they give you a \"Candlepower Distribution Curve\" as well as field\nand beam angles, but most places dont even give that.\n\nI also have the problem that most of the lanterns i'm interested in are\nfocusable, and many are zoomable as well, so i need data at a couple of\nfocus/zoom settings (i can then interpolate between these).\n\nDoes anyone have any ies (or other useful format, or even radiance\nformat) files about any theatrical lanterns? ideally i'm after selecon\nlanterns, but i would be happy with some generic data for the standard\nlantern types:\n-profiles (of various angles)\n-fresnels\n-pc's (less important)\nprerferably data at a couple of focus settings, and data for 1kW and\n500W lanterns.\n\nI dont have access to the facilities to make my own measurements, and i\ncan't figure out how to use the data provided\n(http://www.seleconlight.com/english/support/english/acclaim%20fresnel.pdf\nfor the selcon fresnel i'm particulary interested in) to estimate the\nfigures.\n\nSo if anyone can come up with any advice, or has any suggestions of\nwhere I can get hold of this data it would be very much appreciated.\n[I will be using the data in part of an undergraduate engineerig degree\nproject, and wont use anythign for any commercial purposes if it makes\nany difference to anyone].\n\nThanks for your help everyone\nwill\n\n", "replyTo": "Subject: [Radiance-general] lighting fixtures data", "sender": "william reynolds", "isquestion": false, "tags": [], "id": "<44082EB9.4080609@oriel.ox.ac.uk>", "refs": ["<Pine.GSO.4.62L.0602281420240.2678@scrubbing-bubbles.mit.edu>"], "datetime": "Fri Mar  3 12:57:23 2006", "email": "william.reynolds at oriel.ox.ac.uk", "subject": "[Radiance-general] lighting fixtures data"}