{"body": "\nHi WIll,\n\nFunny you should mention this, because here I find myself attending\nRob Shakespeare's \"Virtual Scenography in Live Performance\" symposium\nat Indiana University <http://www.indiana.edu/~vslp/>, where a bunch\nof theater types and researchers are gathered talking about lighting,\nsimulation, and the like.\n\nI will definitely ask Rob if he has any data, and maybe he'll respond\nwith some pointers as well.  Are you planning to input this directly\ninto Radiance, or do you have other tools in mind as well?  (I.e., do\nyou need IES format data, or can you get by with something not easily\nconverted to IES?)\n\nThe reason I ask is that I've been toying with HDR imaging as a quick\nand convenient method to get at certain types of photometry, where\nthe projection angle is small but the pattern potentially complex --\ni.e., theater lighting instruments.  The method is simple, but there\nare a few details to work out.  Basically, you set your instrument\nand point it at a blank wall or ceiling or some diffuse, white\nsurface large enough to encompass the beam.  Then, you take an HDR\nphotograph of the beam pattern.  The part I haven't worked out\ncompletely is using this as input to Radiance, but if you have some\nbasic distance and beam size measurements, this should be\nstraightforward.\n\nYou would of course need a reasonable digital camera -- SLRs are\ngenerally better due to the better flare characteristics of their\nlenses, and access to the light instrument of interest and a dark\nroom to do the measurements.  If this is of interest, I would be\nhappy to help you assemble an example photometric distribution as a\nproof of concept.\n\n-Greg\n\n\n", "replyTo": "Subject: [Radiance-general] lighting fixtures data", "sender": "Gregory J. Ward", "isquestion": false, "tags": [], "id": "<A922809C-2114-4DC9-8A25-941ABDAE4B4B@gmail.com>", "refs": ["<Pine.GSO.4.62L.0602281420240.2678@scrubbing-bubbles.mit.edu>", "<44082EB9.4080609@oriel.ox.ac.uk>"], "datetime": "Fri Mar  3 13:32:16 2006", "email": "gregoryjward at gmail.com", "subject": "[Radiance-general] lighting fixtures data"}