{"refs": ["<393151.66932.qm@web35105.mail.mud.yahoo.com>"], "id": "<AA91B67C-0982-449B-B3D0-16451E2386F1@rumblestrip.org>", "subject": "[Radiance-general] lighting simulation of blinds in Energy Plusvs. Radiance", "email": "pg at rumblestrip.org", "body": "\n\nOn Jun 5, 2008, at 11:34 AM, Svetlana Olbina wrote:\n\n\n\nDepends on what you're trying to accomplish, but 10% error is\nperfectly acceptable for most architectural/lighting design\nsimulation problems.  But to simply say that the program is within\n10% without stating assumptions regarding the various simulation\nparameters (which affect accuracy) is a gross misrepresentation (and,\nsadly, a common one with software manufacturer claims).\n\n\n\n\nWhat time of day?  What sky condition?  Hoe close is \"close to the\nwindow\"?  Lots of questions...\n\n\n\nUsing a light-backwards ray tracing algorithm to solve light\ntransport through blinds is a tough problem.  Radiance includes a\ntool called mkillum that can do an initial raytrace at the blind\ninterface and convert that result into a direct distribution for the\nwindow/blind system.  This in turn is then used as a virtual light\nsource to calculate the illuminance in the space.  It leads to faster\nand more accurate results in Radiance.  I cannot speak to Energy\nPlus' lighting calculation capabilities, but my experience with DOE-2\nis that building energy simulation programs are severely limited in\ntheir ability to accurately estimate annual daylight and electric\nlight performance.  It is possible to precalculate the daylighting\nperformance in Radiance and convert that to some sort of lighting\nschedule that can be plugged into the E+ model to at least get a\nsingle picture from E+ for the building's performance.\n\n- Rob Guglielmetti\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20080605/fed484c2/attachment.htm\n", "isquestion": false, "replyTo": "<393151.66932.qm@web35105.mail.mud.yahoo.com>", "tags": [], "sender": "Rob Guglielmetti", "datetime": "Thu Jun  5 10:54:28 2008"}