{"body": "\nHi!\n\nI am running in trouble (and into the limits of my cpu ressources) with\na scene that contains simply too many light sources. It is a huge room\nlid by groups of small light (oil lights), all in all there are\nthousands... Rendering is getting really slow now, and I wonder how to\nget the most of the scene without loosing to much visual accuracy.\n\nSo far, I use a radiance sphere with a light modifier and xform these\nspheres to all the positions in my room. I guess, as the sphere is a\nbasic and native radiance primitive, it should not make a big difference\nif I use a sphere, a polygon or any other primitive here? I remember\nthat this question had been on this list some years ago, but I was not\nable to find any post in my archives. I also believe to remember that\nthere has been someone doing renderings of whole star fields with\nthousands or millions of sources, am I dreaming or are there some\nprojects out there like that?\n\nWhen I know how to load the light sources, the next is which settings to\nuse rendering them. They are all extremely small compared to the room. I\nwas also thinking if it might be worth to wrap them into an illum \"box\",\nso that for at least the ambient calculation, the groups of \"point\" (in\nfact sphere) sources would appear as uniform area light sources.\n\nThank you for sharing ideas and experiences, at the moment I am not able\nto get any result in a reasonable time.\n\nCU Lars.\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: smime.p7s\nType: application/x-pkcs7-signature\nSize: 3485 bytes\nDesc: S/MIME Cryptographic Signature\nUrl : http://radiance-online.org/pipermail/radiance-general/attachments/20060312/c8ca82d4/smime.bin\n", "replyTo": "", "sender": "Lars O. Grobe", "isquestion": true, "tags": [], "id": "<44140FF1.2000405@gmx.net>", "refs": [], "datetime": "Sun Mar 12 13:11:48 2006", "email": "grobe at gmx.net", "subject": "[Radiance-general] organizing scenes with many light sources"}