{"refs": [], "id": "", "subject": "[Radiance-general] Radiance - Mac Performan", "email": "adiance-general@radiance-online.org", "body": "Message-ID: <Pine.BSF.4.44.0306020716530.62083-100000@emancholl.pair.com>\n\nRob Guglielmetti wrote:\n\n\nYou always have to say what you're comparing to. What Apple\ncompares in their PR is the CPU frequencies. Since the PowerPC\nis a true RISC CPU, it will process about twice as much data per\ncycle. This means that eg. an 800 Mhz Mac will roughly equal\na 1600 Mhz PC running Linux (your mileage may vary with Windows).\n\nIt does *not* mean that this power will come at an equal price.\nThere's simply no way for Apple to compete with the mass produced\nparts in a PC here, even if they have switched to use some of\nthose as well.\n\n\n\nGiven the similar frequency range, it is indeed very likely that\nsomething is wrong here.  Note that laptops (on both sides) use\ndifferent types of CPUs and probably other components, which will\nslow down a lot of stuff, even when the system doesn't switch to\nsleep mode in between...  Just think of the hard disks for\nexample, which rotate relatively slow to reduce noise and power\nconsumption.\n\n\n\nMass production and competition between various manufacturers\ndo have a noticeable effect.\n\n\n\nCPU specific optimizations may add another dimension to the\nequation. Compilers will try to do something into that direction,\nbut to get the most bang for the buck, some small key routines\nwould have to be rewritten in assembler. Imagine a vector-matrix\nmultiplication finishing in less than ten cycles on an Altivec\nCPU, instead of the several dozen it currently takes, and the\nMac comparison would look very different to what it does now.\n\n\n\n\n\nProbably not much. The main advantage of a 64 bit system is the\nlarger address range. There may be compiler options that allow you\nto load several values into the same registers together, but I\nwouldn't expect any wonders from that if the software isn't written\nwith it in mind. And other (or maybe the same) compiler options will\ncause harm, if they change eg. the size of an int.\n\n\n-schorsch\n\n--\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Radiance - Mac Performanc", "tags": [], "sender": "Georg Mischler", "datetime": "Mon, 2 Jun 2003 07:38:07 -0400 (EDT)"}