{"body": "\ngreg\ni think i'm starting to follow you now!\njust a couple more things...\n\n-converting radiance RGB to sharp RGB (all my material reflectances are\nin RGB, eg from the materials file in lib/) and i'm not sure how to\nconvert them to sharp rgb. i thought i could use xyz_rgb.cal, by\nconverting RGB to XYZ, then the XYZ values to sharp RGB. but i thought\ni'd check my idea by converting RGB to XYZ, and then converting it back\nagain, thinking it should be the same, and its not.\n\n-you say that a white popint adjustment is effectively made during the\nrendering. is this just the shift needed to account for the different\nviewing conditions (ie being in the room, and looking at the monitor)?\n\n-premultiplying surface reflectances. the RGB values i am geting for the\nXYZ data i have for the filters are much bigger than 1, so\npremultiplying will give reflectances much bigger than 1.\nfor example:\n\nthe RGB values for a certain red filter = 55, -3.6, -0.7 (from\nX,Y,Z=21.3, 9.1, 0) [i thought the range for these values was (o:inf)?]\n\nthe RGB reflectance for a white painted wall = 0.9, 0.8, 0.8\n\nso the compensated RGB reflectances would be 49.5, -10.08, -0.56 (ie.\n55*0.9 etc) But these should all be between 0 and 1 shouldn't they?\n\nshould i simply normalise the filter's RGB values to sum to 1, or am i\nmissing something more important here?\n\nthanks again\nwill\n\n\n\n\n\nGregory J. Ward wrote:\n\n", "replyTo": "Subject: [Radiance-general] specifying sources", "sender": "william reynolds", "isquestion": false, "tags": [], "id": "<44288065.5030108@oriel.ox.ac.uk>", "refs": ["<44275907.1060204@oriel.ox.ac.uk>\t<1F9D2A0E-480A-419C-B8DD-C69445718C6E@gmail.com>\t<4428173E.4050909@oriel.ox.ac.uk>\t<D10F8691-3A5F-4142-A92D-F3B454AF5CEC@gmail.com>\t<44283E82.1020102@oriel.ox.ac.uk>", "<BB7EBF9F-50CA-417D-9286-8C90CF482682@gmail.com>"], "datetime": "Tue Mar 28 02:23:41 2006", "email": "william.reynolds at oriel.ox.ac.uk", "subject": "[Radiance-general] specifying sources"}