{"refs": [], "id": "", "subject": "Re: [Radiance-general] light leakage problem", "email": "Thomas Bleiche", "body": "<628A0BB0-BCD0-47F5-9E3F-7C45DF64F20B@arcor.de>\nMessage-ID: <002301c8ee34$5fd2f4f0$3b00a8c0@Jiten>\n\nHi everyone,\n\nThanks for your feedback\n\nyup as Kai said ,,I have kinda huge model... so that can be one of the things which i need to check.\nand one more thing is as Thomas said,I have modelled it without the actual material thickness.So i even have to check it with that.\nNow I am just explaining what problem i have eaxactly.\nI have a geometry of a building block wiith two wings ,modular. The wing from which I am getting light leakage is on east side.\nSo i tried copying the same geometry from west to east.\nbut the same geometry is perfect on west and if you place it on east it leaks light.\n\nI know this is kinda long mail,,, but thanks for reading\n\nIn search of solution\nHarshada\n\n\n\n\n----- Original Message -----\nTo: Radiance general discussion\nSent: Friday, July 25, 2008 12:04 AM\n\n\n\nOn 24 Jul 2008, at 14:25, EncaseIndia wrote:\n\n\nHi Thomas,\n\nThanks for the feedback.\nI was actually checking my model in radiance without any windows,wherein it showed me light leakage.Its just one corner of the building at which i can see some light ,which is around 250 lux, quite huge amount.\nI deleted all my windows in ecotect and then exported the model in radiance, after so much analysis i could just find the corner from where the light is leaking.\n\n\nRadiance can show some unwanted light spots at the edges of polygons.\nThis is due to inaccuracies of the geometry generation and the interpolation\nbetween two calculated points.\n\n\nI have seen this in models where I only created a single polygon for a wall\ninstead of two polygons for inside and outside or where the floor or ceiling\nwas larger than the room space itself and extended into the exterior. If your\nmodel is of this type try to build floor, walls and ceiling with real thickness.\nThis will create an exterior envelope around your room that should stop most\nof the light. I have no idea how you can do this in Ecotect, though.\n\n\n\n\nI have attached the pictures here.\n\n\nSorry, you can't post files to the mailing list. You have to find a public\nwebsite (myspace would do) and post the link here.\n\n\nand I hope you find my english proper. :)\n\n\nYes. Keep going!\n\n\nRegards,\nThomas\n\n\n\n\n\n\n------------------------------------------------------------------------------\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20080725/9b2a3154/attachment.html\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Thomas Bleich", "datetime": "Fri Jul 25 01:50:08 2008"}