{"refs": ["<ABEIIOCILNBBDDEPEPICEEGLCAAA.tiago@tkh.att.ne.jp>"], "id": "<200306032247.52512.cbauer-@t-online.de>", "subject": "[Radiance-general] Re: physically-based landscapes", "email": "adiance-general@radiance-online.org", "body": "\nHi all,\n\nsome more thoughts from my side ... I have the assumption that this is one of\nthose problems where one can easily miss something in the argumentation.\n\n1) where to put the HDR image:\n\nAt the moment I'm a bit puzzled, too. If one maps an HDR image representing a\nview of an outside landsacpe onto a window pane, - isn't this only exact for\nthis special point of view? Other rays from somewhere else in the room\nhitting the illum made out of the image , won't they get assigned a wrong\nvalue? (Just read Peter's mail, which in fact gives an answer to this...)\n\nAt least this is the thinking behind the idea of mapping the landscape view to\n- example -  a 100 m radius sphere like a dome over a 10x10x10m scene, thus\nmaking parallax errors reasonably small, by keeping the blowing up of the\nscene reasonable, too.. (Perhaps not as small as I think, I have to look at\nPeter's examples..) The drawback of this method is, that such a large source\ncannot be treated with the direct calc. anymore (illum/light) but must be\nused as glow with 4. param zero and thus considered wtihin the ambient\ncalculation, affording in turn sufficiently high ambient parameters for a\ntrustworthy rendering. If you use the source type for the dome like Santiago\npointed out, you can add a separate sun like it is done with the usual gensky\nprocedure.\n(Never did this so far, I have to admit ...)\n\n2) -ae / -ar\n\nAs far as I know, -ae and -ar are independent parameters. Ambient cache\nresolution specification with -ar always is relative to the whole scene\nbounding cube, no matter what sort of objects are actually present. But there\nmight be another way out: imagine a small indoor scene with an adequare -ar\nsetting resulting in values spaced, say, half a meter apart. If you add a\nseveral km wide outdoor bounding cube to it, you have to raise -ar\nrespectively. Normally this would result in an exploding memory requirement\nfor the ambient cache, but if everything in the outdoor part of the scene is\nexcluded with -ae, only values in the indoor part will be calculated. By this\nyou can have the same high absolute resolution within the indoor part like\nbefore, and the high -ar setting shouldn't effect calculation time/memory\nrequremant at all.\n(Never tried this, either, but it sounds as if it could work...)\n\n-Carsten\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Re: physically-based landscapes", "tags": [], "sender": "Carsten Bauer", "datetime": "Tue, 3 Jun 2003 22:47:52 +0000"}