{"body": "\nHi Peter,\n\n\nE995:\n- USB interface shows up as hard drive, so is no good for remote control\n- RS232 cable (available for E990) allows for remote control, BUT not\nsetting of shutter/aperture, so you are limited to the +/- 2 EV AEB which\ncan be combined with +/- 2 EV MEC to give in theory +/- 4EV.\n\nE990:\n- Starting with this model, Nikon have systematically removed remote\ncontrol funtionality (hence 995 problems)\n- Both, USB and serial may be used to change settings (USB will not show\nup as HD)\n- my particular model hangs when remotely pushing the trigger via USB, but\nserial works. This seems to be a general problem with 990s.\n- AEB only +/- 0.7 EV\n- no built-in noise reduction!\n- full remote control over aperture and shutter speed\n\nE4500:\nSame problem as 995 -- Nikon deliberately crippled this functionality,\nprobably to force people to go D-range ($$$!)\n\n\nWhat appears to be a USB connector is on fact a combination of USB and\nRS232. There are enough pins to break out both. I'd be terribly surprised\nif the MC-EU1 serial remote control would not work with the E4500.\nHowever, unless you get one given to you, I wouldn't recommend buying one\n(at least not for the full RRP). It only gives you zoom, trigger and a\nsorta time lapse that can't go below 2 mins, and doesn't even display the\ntime remaining until the next shot.\n\n\nTechnoTeam in Ilmenau, DE have teamed up with Rollei to produce a camera\nthat has a special firmware for HDR (-9T, -3T, T, +3T, +9T). This gizmo\nalso comes with a complete set of calibration files and some Windoze\nsoftware. Don't know about the pricing, though.\n\nI've recently got myself a 5 Pound (price, not weight!) Palm pilot on\ne-bay.  They have a serial interface and can control CoolPixes. There is\nsone stuff on the web:\na) http://vyskocil.free.fr/cool (closed source)\nb) http://timeguy.com/cradek/palmshotcom/ (GPL)\n\nBased on b), I intend to hack together 'PalmHDR', once I've got some time.\nI'll keep you updated.\n\nCheers\n\nAxel\n\n\n\n\n", "replyTo": "", "sender": "Axel Jacobs", "isquestion": true, "tags": [], "id": "<10101.213.58.97.212.1146065390.squirrel@webmail1.londonmet.ac.uk>", "refs": [], "datetime": "Wed Apr 26 17:32:37 2006", "email": "a.jacobs at londonmet.ac.uk", "subject": "[Radiance-general] USB?linux remote shutter control of Nikons ?"}