{"body": "\nI second John's evaluation of SketchUP. It is an amazing tool that\nallows you to do pretty advanced 3D drawings in no time. Another caveat\nfor Radiance users: SketchUP geometries can have two different materials\nattached to the two sides of a surface. When you export into Radiance\n(via 3ds) the material attached to the front of the surface is exported.\nThis can lead to surprises so bear this 'feature' in mind when you set\nup your SketchUP model. Also, do not make your material names in\nSketchUP too long as the names will get cut to eight (?) characters in\nthe 3DS model.\n\nChristoph\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of John\nMardaljevic\nSent: Friday, April 28, 2006 9:19 AM\nTo: radiance-general@radiance-online.org\n\nGoogle bought SketchUp a few months ago.  Today they have released a\nfree, but limited, version of SketchUp (Mac OS X & Windows):\n\nhttp://sketchup.google.com/\n\nPro version is as before with, I think, one or two minor additions.\n\nSketchUp is so easy to use that I managed to create a 3D model for a\nproject whilst learning how to use SketchUp and got it done well before\nthe 8hr evaluation period ran out (Pro version).  Search this site for\n\"3ds2rad\" for how to convert from 3DS to Radiance format.\n\nHere's the catch: only the Pro version exports SU models to formats such\nas 3DS etc.  So I'm afraid that the offer of a free version of SU is not\nterribly useful for Radiance users.  Where it may count is to have it\nsitting there as a freebie which you can toy with every\nnow and then and perhaps learn how to use as a 'background' task.\nThen when you really do need to use SU to make a Radiance model, you\ncould either buy the Pro version or see how much you could get done\nduring the 8hr demo period.  I don't know if you could run the Free and\nPro versions alongside each other; that would be a sneaky way of getting\na lot out of the 8hr trial period.  I never said that.\n\nWell worth a look -- but not quite the gift (for Radiance users) that it\nmight have been.\n\n-John\n\n-----------------------------------------------\nDr. John Mardaljevic\nSenior Research Fellow\nInstitute of Energy and Sustainable Development De Montfort University\nThe Gateway Leicester\nLE1 9BH, UK\n+44 (0) 116 257 7972\n+44 (0) 116 257 7981 (fax)\n\njm@dmu.ac.uk\nhttp://www.iesd.dmu.ac.uk/~jm\n\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n", "replyTo": "", "sender": "radiance-general-bounces@radiance-online.or", "isquestion": true, "tags": [], "id": "<5910A0754536EA4AAD411AE8221C39620118A717@nrccenexb1.nrc.ca>", "refs": [], "datetime": "Fri Apr 28 15:45:08 2006", "email": "radiance-general-bounces@radiance-online.org", "subject": "[Radiance-general] Free version of SketchUp released by Google(butthere's a catch)"}