{"body": "\nHi Christian,\n\nIt sounds like we're back on track, here.  I'm relieved.\n\n\nI typically use the SCE to get the diffuse and the difference between\nthe SCI and SCE (specular included and excluded) measurements to get\nthe specular reflectance component, but it only works for fairly\nsmooth surfaces.  If a surface is too rough, the components get mixed\nin the glossy reflection, which ends up being larger than the\nspecular trap in the CM-2002.\n\nFor non-metals, the SCE value is better for determining the surface\ncolor.  For metallic surfaces, I would use SCI.\n\n\nDid you erase the info. from the CM-2002?  Maybe the spectral data is\nstill there.  It would be better to use it if you have it.  Even if\nyou used a tungsten illuminant to determine the XYZ value, shifting\nto a different illuminant without the spectral data is a shaky business.\n\n\nThis is correct.\n\n\nRight.\n\n\nUmm...  It doesn't matter what you give to ximage at that point,\nsince you're having rtrace do the calculation.  This is  just as\nwell, since ximage ignores the color primary and white point\ninformation in the picture header, and would report (slightly) wrong\nluminance with the 'l' command starting from anything besides\nRadiance RGB color space.\n\n\nYes.  It performs a proper von Kries transformation, using the Sharp\ncolor adaptation matrix.\n\n\nYes.  If a Radiance converter takes a -p option with 6 arguments,\nthen it's doing color and white point conversion.\n\n\nI think so.  I won't make you any warranties, though.  Without\nspectral data, the accuracy is going to be highly dependent on your\nparticular materials.\n\n-Greg\n\n", "replyTo": "<4450B140.5090701@gmx.de>", "sender": "Gregory J. Ward", "isquestion": false, "tags": [], "id": "<25D68F41-8608-4F18-AE08-2F8D3A05B0B9@gmail.com>", "refs": ["<20060425165232.5401gmx1@mx013.gmx.net> <4450B140.5090701@gmx.de>"], "datetime": "Thu Apr 27 16:03:58 2006", "email": "gregoryjward at gmail.com", "subject": "[Radiance-general] Re: Again transmissivity for color filter,/ glass"}