{"refs": [], "id": "", "subject": "[Radiance-general] irradiance vs. radiance / luminance vs.illuminance", "email": "adiance at ndoylend.fastmail.fm", "body": "Message-ID: <1220630461.4902.1272373303@webmail.messagingengine.com>\n\nHi again,\n\nI've been puzzling over an extremely bright ground plane in one of my\nimages.  I think I've tracked it down the the use of rpict's -i switch\nfor calculating irradiance rather than radiance.  Can anyone help\nclarify whether I'm on the right track?\n\nIf I want a luminance image, i.e. with levels corresponding to what one\nmight actually see (and can compare cd/m2 values at different points) I\nomit the -i switch (and calculate radiance).  If I include the -i switch\n(and calculate irradiance), then I obtain illuminance (lm/m2 levels).\nIn both cases the radiometric units and turned into photometric units\n(using Radiance's 179lm/W conversion factor) by the image viewer\nsoftware (I'm using the Ecotect RadianceIV viewer).\n\nRadiance is W/m2.sr while irradiance is W/m2.  Luminance is lm/m2.sr\n(cd/m2) while illuminance is lm/m2 (lux).  I think this means radiance\nand luminance are properties of a (solid angle) source while irradiance\nand luminance are properties of a (flat) surface?\n\nSo my extremely bright ground plane is actually showing its lux level\n(the amount of light falling on it, rather than the amount of light it's\nreflecting).  If I want to illustrate the relative brightness of\ndifferent surfaces I guess I need to go back and calculate luminance\nrather than illuminance.\n\nI did notice that if I clicked on the bit of 'ground' beyond the ground\nplane I get a much smaller value (in fact the same as the value in the\nluminance image - because I'm clicking on the ground as defined in the\nsky file - a glow source).  Why is this?  Does the concept of\nilluminance on a direct light source not make sense?\n\nSorry for the long winded email equivalent of thinking out loud, and I\nappreciate that my understanding of photometry is pretty sketchy.\n\nNick\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Nick Doylend", "datetime": "Fri Sep  5 09:01:13 2008"}