{"refs": ["<EXCHSVR01GNsokLQ8aZ000015d5@exchsvr01.atelierten.com>"], "id": "<5F14FD0DF6BA66459300C536DEFCFBB2F8C1D5@exchsvr01.atelierten.com>", "subject": "[Radiance-general] rhino - ecotect - radiance issuesTo: <radiance-general@radiance-online.org>", "email": "\"Cramer Silkworth\"", "body": "\nCramer,\n\nI've come across the same thing in the past and thought that it was due to the model being a set of NURBS surfaces that rhino is segmenting to turn into a DXF. I think there is a way to try and get rhino to clean some of this up but haven't found a fast process to do so.\n\nDo you need to clean up the model? I would try a test render to find out what kind of processing time it takes to render and use this to evaluate if you need to clean up. In ecotect the edges are highlighted to help you indentify different objects. I've found in the past that these often don't show up in a radiance render and this can often be less time consuming than trying to process the surfaces.\n\nRegards,\n\nMeredith Davey\nAssociate Director\natelier ten???\nbuilding service engineers + environmental designers\n\n----------------------------------------------------------------------\n\nMessage: 1\nMessage-ID:\n<FE872D9C4591BF44AAFD986BF73368FF03193A2B@webmail.transsolar.com>\nContent-Type: text/plain; charset=\"us-ascii\"\n\nHi All,\n\nI've got a model from an architect, built in Rhino, that I need to get\ninto Radiance. Typically we do this via Ecotect, exporting 3ds files\nfrom Rhino, importing into Ecotect, and using Ecotect to generate my rad\nfiles. However, this model is just a mess once it's imported into\nEcotect - even the flat facades are a mess of triangles, and the reduce\ncoincident triangles/polygons command is all but worthless. The Rhino\nmodel is actually fairly complex, it's a masterplan with 20 or so\ntowers, but even doing just one building is going to take me a day to\nclean up. Does anyone have any suggestions?\n\nThanks,\nCramer\n\n\nJ. Cramer Silkworth\n\nTranssolar Climate Engineering\n\nTechnical consulting for energy efficiency and environmental quality in\nbuildings.\n\n145 Hudson Street\n\nSuite 402\n\nNew York, NY 10013\n\nOffice: 212-219-2255\n\nMobile: 347-283-2547\n\nsilkworth@transsolar.com\n\n\n________________________________________________________________________\nThis e-mail has been scanned for all viruses by Star. The\nservice is powered by MessageLabs. For more information on a proactive\nanti-virus service working around the clock, around the globe, visit:\nhttp://www.star.net.uk\n________________________________________________________________________\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] RE: rhino - ecotect - radiance issues", "tags": [], "sender": "silkworth@transsolar.com", "datetime": "Fri, 10 Oct 2008 18:48:07 +0200"}