{"body": "\nLars Grobe wrote:\n\nas it seams to me, the Radiance wiki is dead. That is a pity, but at\nleast we should\n- get the latest content of th wiki somehow to a few static webpages\n- remove the links on radiance-online\nThe first is a question to the (former) maintainer, the second goes to\nPeter...\n\nHi Lars, Hi folks,\n\nsince your question touches the idea of some sort of collaborative docs, maybe I should mention an off-list thread about this in November 2005. It was sparked of by my suggestion to use Plone (www.plone.org) as framework for structured, collaborative docs. There had been different views, Greg suggested to initiate an automated (or at least semi-automatic) \"knowledge-compiler\" that extracts information from the mailing list archives to generate some FAQ. My own view was more relying on a small number of people each being /responsible/ for one (or two) subjects and keeping that sub-tree of the docs up-to-date. Content management would be done on a distributed basis, different owners/moderators managing their field, including a review process. Plone was my choice since I had used it elsewhere.\n\nIt never materialized on radiance-online because of costs involved in the /initial/ set-up of the system (which would be done by someone I worked with successfully on similar projects, so it would be a) fastest to pay him to do it and b) my additional time for support would remain foreseeable) and, well, apparent lack of support from one big guru (name withheld).\n\nAnyway- likely this post triggers comments- that's fine - just don't expect me to reply to well meant suggestions about other systems which are better/spiffier/easier/environmentalfriendlier, I have sank enough time into this thread. Simply, to make it happen, around 1.4kEUR plus a new (faster, due to much heavier CPU use) motherboard for the server are needed. (ah - do not bother sending me your old motherboard).\n\nhappy rendering to all\n-Peter\n\n--\npab-opto, Freiburg, Germany, http://www.pab-opto.de\n[see web page to check digital email signature]\n\n\n", "replyTo": "", "sender": "Peter Apian-Bennewitz", "isquestion": true, "tags": [], "id": "<445B3D74.6050604@pab-opto.de>", "refs": [], "datetime": "Fri May  5 13:57:29 2006", "email": "apian at pab-opto.de", "subject": "[Radiance-general] knowledge platform"}