{"body": "\nNick,\nEcotect uses the split-flux method for daylight factor calculation. Radiance\ncalculates the daylight factor using backward raytracing. Thus, if the\nsurface reflectance values is accurate, the Radiance method should be more\naccurate. There is the argument that if the surface reflectance value is\nslightly off, then the raytracing method magnifies the error with each\nbounce of light, where with the split-flux method, the error is not\nmagnified.\n\nWith regard to glass definition, Ecotect has been known not to transfer\nglazing properties correctly into Radiance definition. If the discussion\nforum was still online, then you would be able to follow a forum discussion\nregarding the difficulties in translating Ecotect glass to Radiance\ndefinition. The way I get around this problem is by using Optics (not\nWindow, as I had previously mentioned) from LBNL to create a Radiance\ndefinition of a commercially available glass, and use the Optics definition\nto replace the Ecotect glass. If you want a step-by-step method, email me\noff the forum.\n\nSo, to answer your ultimate question, I generally trust Radiance results\nover Ecotect results. But then again, this is just my opinion. The\ndifference between Ecotect and Radiance results are simply because of the\nalgorithm used. This does not necessarily mean that one is wrong and the\nother is right.\n\nHope this helps\n\nJohn\n\n\nOn 5/9/06 6:00 AM, \"radiance-general-request@radiance-online.org\"\n<radiance-general-request@radiance-online.org> wrote:\nCan anyone help here?\n\nI'm trying to model daylight factors on the vertical surface of a 10m high\nwarehouse rack.  The reflectances are fairly low, 0.3 for the rack and 0.6\nfor the other surfaces.  I've compared daylight factor results from Ecotect\nand Radiance and found big differences in the magnitude and range of values\nacross the surface.  In one case, Ecotect is giving values varying between\nabout 7.5% and 1%, the corresponding values from Radiance are between about\n2.5% and 0.25%.\n\nEcotect's export to Radiance facility appears to incorrectly set the\ntransmissivity of the glazing material in the .rad output.  Setting the\nglazing transparency (I guess this is the same as tranmsmittance) in Ecotect\nto 0.88 and using the 'clean' glass preset I would expect to see\ntransmissivity values of 0.96 in the .rad file output.  I'm actually getting\nvalues of 0.66.  Even after correcting the .rad file I still find the output\nvalues to be considerably smaller than those from Ecotect.\n\nI'm using the high quality preset for Ecotect's calculation (further\nincreasing the quality appears to give slightly larger daylight values), and\nan 'indirect reflections' value of 5 for Radiance, all other parameters are\nthe defaults for Ecotect's Radiance interface.\n\nI suppose my real question here is which values should I trust?  Perhaps\nneither.\n\nNick\n\n\n", "replyTo": "Subject: [Radiance-general] Re: Radiance and Ecotect", "sender": "John An", "isquestion": false, "tags": [], "id": "<C086DB99.186D%ja@a10nyc.com>", "refs": [], "datetime": "Wed May 10 05:52:07 2006", "email": "ja at a10nyc.com", "subject": "[Radiance-general] Re: Radiance and Ecotect"}