{"body": "\nHi Oskar,\n\nThe formatting of your post is rather messed up, but I'll try to\nreply in-line:\n\n\nRadiance compiles with the rmake -k option, which means that\ncompilation continues even when errors are encountered.  You can take\nthis off in the makeall script if you like.\n\n...\n\nI've seen this problem before, but I don't know where it comes from.\nI suspect that the latest TIFF library is using some non-standard\nfeatures of make that aren't supported on your system.  Not much I\ncan do to fix it because I don't understand the build on libtiff at all.\n\n\nThis should be no cause for concern.\n\n\nThe compilation continued because of the -k option, as mentioned\nabove.  This is a bug introduced some years ago no doubt in one of\nGeorg Mischler's code clean-ups.  Almost no one uses -DSTEREO, which\nis why it wasn't noticed before.  Just add a \"double d;\" declaration\nat the top of the routine and it should be OK.  Let me know if you\nrun across anything else -- I've checked in a fix for the next release.\n\n\nActually, you have Georg to thank for that.  I used to just ignore\nwarnings, which accumulated over the years as C compilers got more\nand more finicky.   Schorsch went in and fixed most  of them.\n\n\nLike I said, I don't understand libtiff compilation, and I just\nstruggle to get it to do anything reasonable at all.\n\n\nThis is part of Georg's test suite, which is another thing I don't\nunderstand.  I think he has the spaces in there for a reason, but I\ndon't recall what it was.\n\n\nLibtiff again.  Dunno.   Dunno.   Dunno.\n\n\nYeah, that's the right thing to do -- didn't read this far before my\nresponse.\n\n\nI wish I could follow what you just said.  What do you get if you cd\nto ray/src/px and just run \"rmake ximage\" there?\n\n-Greg\n\n", "replyTo": "Subject: [Radiance-general] [Help] Problem with ximage in 7.3.2", "sender": "Gregory J. Ward", "isquestion": false, "tags": [], "id": "<9322905F-5313-4758-B01B-444C7EAAE218@gmail.com>", "refs": ["<2AE27CD8C00C3540AF5DCEBE6C3D020B017206B6@opecexch1.opec.org>"], "datetime": "Tue May 23 15:20:11 2006", "email": "gregoryjward at gmail.com", "subject": "[Radiance-general] [Help] Problem with ximage in 7.3.2"}