{"body": "\nHi Nick,\n\nTechnically, the correct thing to do is to model the water's surface\nas a dielectric with an index of refraction corresponding to water --\naround 1.3.  The problem, as you noticed, is that you cannot see\nbeneath such a surface, and this is due to the inability of the\nsource calculation in Radiance to find the light source after\nrefraction.\n\nOne cheap \"solution,\" so to speak, is to use a BRTDfunc type to get\nthe surface reflection and transmission right, without actually\ncomputing refractions.  The objects under the water will not be\nproperly distorted, but at least they won't be black(!)  The\nfollowing should work:\n\nvoid BRTDfunc water_mat\n10\trefl\trefl\trefl\ntran\ttran\ttran\n0\t0\t0\nfresnel.cal\n0\n10\n0\t0\t0\n0\t0\t0\n0\t0\t0\n1.3\n\nAnd the file \"fresnel.cal\" contains:\n\n{\tFresnel equation for reflection and transmission\t}\n\ninside = -Rdot;\t{ > 0 means ray coming from inside }\nnratio = if(inside, arg(10), 1/arg(10));\n\ncos1 = if(inside, -Rdot, Rdot);\ncos2 = Sqrt(1 - sq(nratio)*(1 - sq(cos1)));\nrefl = if(FTINY-cos2, 1, (sq((cos1 - nratio*cos2)/(cos1 +\nnratio*cos2)) +\nsq((1/cos1 - nratio/cos2)/(1/cos1 + nratio/cos2)))/2);\ntrans = 1 - refl;\n\n----------\nThe problem with John's suggestion is that you will end up with twice\nas much reflection as you ought, because glass simulates reflection\noff both the front and back surfaces, whereas you have just one\nsurface.  You could lower the index of refraction given to match the\nreflection of the water's surface at normal incidence, but the\ncomputed reflection would still be somewhat off as a function of\nangle.  The above formula gives you the correct reflection amount\n(even from underwater).  It just doesn't do refraction.\n\nYou probably want to add a time-dependent wave texture to your\nwater's surface as well, since most of what makes a person difficult\nto see while underwater is the reflections off the surface, which are\nconstantly in motion.  I recommend doing an animation for that reason.\n\n-Greg\n\n\n", "replyTo": "Subject: [Radiance-general] another water question", "sender": "Gregory J. Ward", "isquestion": false, "tags": [], "id": "<C1706414-8780-4652-8F8A-A10DC267E0D2@gmail.com>", "refs": ["<20060525071350.6631.qmail@web54614.mail.yahoo.com>"], "datetime": "Thu May 25 17:18:37 2006", "email": "gregoryjward at gmail.com", "subject": "[Radiance-general] another water question"}