{"body": "\nFellow Radiance renderers, scientists, practitioners and enthusiasts\n(is that everybody?)\n\nHere are some details and titles of presentations that will be given\nat the Radiance 2006 Scientific Workshop\n13-14 (Wed-Thu) September, Queens Building, De Montfort University,\nLeicester, UK\nhttp://www.iesd.dmu.ac.uk/~jm/radiance2006work.html\n\n------------------------------------------------------------------------\n--------------------------------------------\n\nRtcontrib Tutorial\nGreg Ward, Anyhere Software\n\nThe rtcontrib program introduced in Radiance 3.7 offers a general\nfacility for tracking ray contributions and partial sums, by calling\none or more rtrace processes with the -oTW or -oTV option.  The\nintended application for rtcontrib is daylight coefficient\ncalculations, but it may also be applied to BRDF simulation and\noptical systems analysis.  After going over the basic idea behind\nrtcontrib design and operation, we will give a few related examples\nof daylight coefficient usage.  We will then demonstrate how one can\ncompute the light distribution from a badly designed light pipe over\nthe course of a year using a pair of coupled rtcontrib runs, using\nrcalc and pcomb to render an image for each time-step.  By reversing\nthe usual ray flow direction, starting from the sky and working\ntowards the skylight opening, we can relate the output distribution\nof the skylight to the sun and sky coefficients, effectively doing\nmany photon map calculations at once.  This is just to get the\naudience thinking about the possibilities.  Plenty of time will be\nallowed for questions, suggestions, and discussion of user\nexperiences and problems with the new program.\n\nDaylight coefficients: theory and implementation\nJohn Mardaljevic, IESD\nThis presentation serves as an introduction to Greg's rtcontrib\ntutorial.\n\n------------------------------------------------------------------------\n--------------------------------------------\n\nNight Lighting Simulation: Design Evaluation Using Radiance's\nRtcontrib and Mksource Programs\nJack de Valpine,  Visarc Incorporated\n\nThis talk presents a lighting simulation study for the exterior\nlighting of a 60 story office tower set in an urban context. The\npurpose of the study was to assist the design team in evaluating and\npresenting the proposed lighting design to the owner. Due to the\ncomplexity of the design and variable design options, Radiance's\nrtcontrib was used to provide the greatest flexibility and control\nover simulation results. In order to better approximate lighting from\nthe local surrounding urban environment and sky condition, HDRI\nphotography was employed to capture the local environment and then\nused to produce an image based lighting environment with Radiance's\nmksource. In addition to examples from the project, overall workflow\nand resource requirements will be discussed in contrast to more\ntypical workflow for Radiance simulations.\n\n------------------------------------------------------------------------\n--------------------------------------------\n\nThe following are titles only -- details to follow:\n\n\"WebHDR\", Axel Jacobs, London Met.\n\n?Calculation of circadian illuminance distribution with Radiance\",\nKrzysztof Wandachowicz, Poznan University of Technology\n\n\"MOAR: The Mother of All Renderers or Radiance in Real-Time\", Alan\nChalmers and Kurt Debattista, Bristol University\n\n\"Comparing Real and Virtual Scenes\", Timo Kunkel, Bristol University\n\n\"Radiance on Mobile Devices\", Matt Aranha, Bristol University\n\n\"Accelerating Radiance using Novel Hardware\", David Coulthurst,\nBristol University\n\n\"New Photosphere features, e.g.  panoramic HDR stitcher\", Greg Ward,\nAnyhere Software\n\n\"Novel Applications of HDR Imaging\", John Mardaljevic, IESD\n\nMore have been promised -- please send as soon as you can.\n\nPricing will be finalised soon.  We will endeavour to keep costs as\nlow as possible.  They will be in the *region* of:\n\n?180 Attending only\n?150 Presenting\n?120 Registered students\n?low A special discretionary rate depending on individual\ncircumstances, e.g. un-waged (by arrangement)\n\nRegards,\n\n-John Mardaljevic\n\n-----------------------------------------------\nDr. John Mardaljevic\nSenior Research Fellow\nInstitute of Energy and Sustainable Development\nDe Montfort University\nThe Gateway\nLeicester\nLE1 9BH, UK\n+44 (0) 116 257 7972\n+44 (0) 116 257 7981 (fax)\n\njm@dmu.ac.uk\nhttp://www.iesd.dmu.ac.uk/~jm\n\n\n\n", "replyTo": "", "sender": "John Mardaljevic", "isquestion": true, "tags": [], "id": "<D9D16493-AE4D-4383-957E-3BA50E7E6973@dmu.ac.uk>", "refs": [], "datetime": "Fri May 26 11:01:28 2006", "email": "jm at dmu.ac.uk", "subject": "[Radiance-general] Radiance 2006 Workshop - 26 May Update"}