{"refs": [], "id": "<252592.35663.qm@web90505.mail.mud.yahoo.com>", "subject": "[Radiance-general] Setting ambient accuracy (-aa) to 0", "email": "citykam at yahoo.com", "body": "\nDear all,\n?\nI intend to model the amount of solar radiation falling onto different parts of a building facade.? To do this, RTRACE is used.? An array of measurement points at 1-unit interval is assigned on the facade.\n?\nTo model it properly, I am currently deciding on the ambient settings.? My understanding is that, by setting -aa to 0, there will be no interpolation of irradiance values, and so all the backward ray-tracing will be conducted exactly at the measurement points.? But I also read an advice aganist turning -aa to 0 for the purpose of evaluating irradiance value in a space (see the thread?below).\n?\nCould anyone advise whether it is appropriate to set -aa to 0 in this situation?? Corrections on any misconception of mine are also appreciated.? Thanks!\n?\nCheers,\nKam\n?\n?\nGregory J. Ward gregoryjward at gmail.com\nThu Dec 28 22:04:38 CET 2006\n\n\nPrevious message: [Radiance-general] ambient accuracy parameter\nNext message: [Radiance-general] Modeling reflective glazing and glazing with ceramic frit\nMessages sorted by: [ date ] [ thread ] [ subject ] [ author ]\n\nJust wanted to chime in on this thread.  The -aa 0 setting is\nappropriate when you have a lot of small geometry that isn't safe to\nleave out of the ambient calculation (using the -ae or -aE options),\nor for special applications such as mkillum or rtcontrib.  Turning\noff the ambient cache is NOT a good idea when what you care about is\nindividual ray accuracy, such as when you are using rtrace to\nevaluate radiance or irradiance values in a space.  It can be done\nwith -aa 0, but you have to pay close attention to your other\nparameter settings (such as -ad, -as, -lw, and -lr) and alter them\nappropriately.  The -ar setting has no effect with -aa 0.  Ditto for -\naw.\n\n-Greg\n\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20081203/c5017ef3/attachment.html\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Kam Shing Leung", "datetime": "Wed Dec  3 02:38:38 2008"}