{"refs": ["<49378E3A.8050803@gmx.net> <4938DB56.7070208@ise.fraunhofer.de>"], "id": "<4938DF21.5000804@gmx.net>", "subject": "[Radiance-general] experiences with the photon map", "email": "grobe at gmx.net", "body": "\nHi Jan!\n\nWell the pipe is closed by the 45 degree mirror, but I guess that I must\nnot have geometry extend from the end (so that a part of it is inside\nthe system and a part is outside). This is really important for\nmodelling and was not clear to me so far! So the viewer in the sketch\nbelow will see the surfaces A and B lid even though light is not able to\nreach those, because the photons hitting the surface are counted even\nthough not visible from the viewer position, right?\n\nSurface A\n___________________________\n|\nlight source      |    viewer\n________________|___________\n\nSurface B\n\nThis is good news for all Radiance users! Will it be possible to use\nBRTDfunc modifiers with the photon map than? At the moment we have a\nstrange situation - most Radiance users most probably use the software\nfor advanced daylighting simulation. But they cannot model the advanced\nsystems with the core distribution (pmap is not integrated), and even if\nthey patch Radiance to support photon mapping, they cannot use the\ngalzing definitions as given e.g. by the glaze script because of a lack\nof support for BRTDfunc in the pmap extension. I wonder how one can\nmodel a daylight set-up with light redirection systems in Radiance at\nall at the moment.\n\nHow are experiences with the pmap for Radiance 3.8? I could use that one\nfor now (I cannot really wait for half a year, so I must use what is\navailable) if it is found to have been relieable. Or should I stay with 3.7?\n\nAgain thanks to you and the other Fraunhofer folks making this important\nextension available to us - is there any hope that pmap could become\npart of the Radiance distribution itself one day?\n\nCU, Lars.\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] experiences with the photon ma", "tags": [], "sender": "Lars O. Grobe", "datetime": "Thu Dec  4 23:58:32 2008"}