{"refs": ["<49378E3A.8050803@gmx.net>\t<4938DB56.7070208@ise.fraunhofer.de>\t<4938DF21.5000804@gmx.net>\t<4938F959.6040208@ise.fraunhofer.de>", "<493FAB44.2050805@gmx.net>"], "id": "<49403579.7040704@ise.fraunhofer.de>", "subject": "[Radiance-general] BRTF for glazing", "email": "jan.wienold at ise.fraunhofer.de", "body": "\nHi Lars and Marija,\n\n\nthe mentioned restriction occur also for glazings, which are defined as\nBRTDfunc!\n\nThat means, the angular information of the BRTD is lost for the glow\nmaterial (= sky distribution). This means for example, the the\ncircumsolar range of a sun with high altitude will contribute in the\nsame way as other parts of the sky with lower angles of incidence. And\nall the contributions from glow will be distributed lambertian from the\ninner pane. So whenever you use a sky distribution (e.g. with gendaylit\nor within DAYSIM), the  occurred  difference may be significant.\nThis modeling may be sufficient for many applications, but you must be\naware of loosing the angular information as soon as the ambient\ncalculation hits BRTDfunc.\nMy way is to use other standard material which do not show those\nrestriction and to mix them together according to the\ntransmission/reflection properties (which I get either from the\nmanufacturer or I generate them with window  or WIS. The \"mix-func-fix\ntakes me 10 min and then I'll get a model which works for (hopefully ;-)\n) all situations.\n\nThe other comments are below:\n\nLars O. Grobe wrote:\nA colleague of mine -Francesco Frontini - is currently just doing this\n(=geometric modeling), even extending your ideas having printings at\nvery specific positions and having three layers (directed laminated\nusing interface, printings modeled with plastic or trans).  In principle\nit is possible to model it like that, but it is a rather hard job to get\na reliable model. My colleague is working on that issue for months and\nis trying to get close to the laboratory measurements. As far as we are\nnow, we cannot get a potential contribution of multi-internal\nreflections within the glass for the sun as light source (the plastic\nstripes reflect the light and there should be a certain light transport\nto the inner side). The ambient calculation will not find the sun - even\nif the parameters for ad is increased radically. But this is as I\nexpected before. But the direct light transport and the sun blocking for\ncertain angles (that's the purpose of the system) works more or less\nlike in theory.\n\nCheers,\n\nJan\n\n\n\n--\nDipl.-Ing. Jan Wienold\nProject Manager\nFraunhofer-Institut f?r Solare Energiesysteme\nThermal Systems and Buildings, Lighting and Daylighting\nHeidenhofstr. 2, 79110 Freiburg, Germany\nPhone: +49(0)761 4588 5133 Fax:+49(0)761 4588 9133\njan.wienold@ise.fraunhofer.de\nhttp://www.ise.fraunhofer.de\n\nIn office:\nMo,Tue: 8:30-18:00\nWe,Thu: 8:30-16:00\nFr:  8:30-15:30\n\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] BRTF for glazing", "tags": [], "sender": "Jan Wienold", "datetime": "Thu Dec 11 06:53:57 2008"}