{"body": "\nWith DAYSIM I believe the sky file is fixed (North = +Y) and therefore to\ntest different building orientations you need to export from CAD or ?\npackage new models, this is a little bit inconvenient and at times\ndangerous, i.e. if you are changing materials manually once exported as you\ncould change say three models and not the forth.  I am not sure if a change\nto the DAYSIM code is possible or if possible is too complex to allow the\nsky file to be rotated as it is with Radiance.\n\nAndrew\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of Nick\nDoylend\nSent: 15 May 2006 17:53\nTo: 'Radiance general discussion'\nHi, I'm having a look at the effect of orientation on daylight availability.\nI made four identical models in Ecotect, rotated three of them to get N, S,\nE, W facing models.  I exported to Radiance and brought them into Daysim for\nanalysis.  I was surprised to see identical results for the models.  It\nappears that Ecotect doesn't take account of the orientation when it exports\nthe radiance geometry.  What it does instead is to rotate the (sunny) sky\ndescription.  I guess this is fine for Radiance but Daysim does its own 'sky\nthing' and so I guess disregards the exported sky description.\n\nI thought I could rotate the geometry file as required, but I also need to\nrotate the sensor grid file.  I can use xform on the geometry file to spin\nit round the z axis, but it doesn't appear to work on the grid file.  I read\na little in the archives about using cnt and rcalc to define new grids - it\nmight work if I thought about it for long enough.  I wonder if there's a\nquicker and easier way to transform the grid file.  Is there?\n\nThanks,\n\nNick\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\nThis message has been scanned for viruses by MailControl - www.mailcontrol.com\n\n", "replyTo": "", "sender": "radiance-general-bounces@radiance-online.or", "isquestion": true, "tags": [], "id": "<7300B8B9B92D1441910052FEC7D9F754019F5FAC@aries.burohappold.com>", "refs": [], "datetime": "Mon May 15 19:14:26 2006", "email": "radiance-general-bounces@radiance-online.org", "subject": "[Radiance-general] Radiance, Ecotect and Daysim"}