{"body": "\nHello all,\n\nVery long time ago I'd compiled Radiance 3.1.11 on my SGI Indigo2 [IRIX\n6.5.22, MipsPro 7.3.2] and it did run fine - but then I forgot about it.\n\nJust recently, however, I recompiled 3.1.11 on my new SGI Fuel [IRIX\n6.5.28,\nMipsPro 7.4.4, V12] and everything worked as before.\n\nSo, I decided to upgrade to Radiance 3.7.2 on my Fuel [same OS & same\ncompiler\nas above]. It compiled ok, but <ximage> seems now somehow to be broken -\nall\nmy pictures (ok under 3.1.11 on my Fuel) are completly wrong color-wise\nand\nlook almost like as if produced via fractint :-).\n\nI feel something with the colortable routines is amiss, but I've no\nidea what it could be [I tried different values for DSPEED - but no\nsuccess;\nalso changing the value of <set special> in <makeall> from \"ogl\" to\n\"tiff\" to\n\"sgi\" didn't help any].\n\nBTW, if I convert the pics with ra_tiff and view them [on my Fuel with\nvstiff],\nthey are ok.\n\nYour hints are certainly appreciated.\n\nThanks in advance.\n/oskar\n\n\n\n\nDISCLAIMER\n\nThis e-mail and any files transmitted with it are intended solely for the use of the individual or entity to which they are addressed and may be legally privileged and/or confidential. Any unauthorized use, disclosure or copying of this e-mail or any of its attachment(s) by unintended recipient may be unlawful and is strictly prohibited. If you have received this e-mail in error, please immediately notify the sender by e-mail and permanently delete the original e-mail and attachment(s) from your computer system.\n\nAny opinions contained in this message are those of the author and are not given or endorsed by OPEC, unless otherwise clearly indicated in the message, and the authority of the author to so bind OPEC is duly verified. OPEC does not warrant or assume any legal liability or responsibility for the accuracy, completeness, or usefulness of any information contained in the e-mail content transmitted over the Internet.\n\nThank you for your cooperation.\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20060515/64326cb6/attachment.htm\n", "replyTo": "", "sender": "Itzinger, Oskar", "isquestion": true, "tags": [], "id": "<2AE27CD8C00C3540AF5DCEBE6C3D020B0169F8A1@opecexch1.opec.org>", "refs": [], "datetime": "Mon May 15 09:30:08 2006", "email": "oitzinger at opec.org", "subject": "[Radiance-general] [Help] Problem with ximage in 7.3.2"}