{"body": "\n\nRadiance results over Ecotect results. But then again, this is just my\nopinion. The difference between Ecotect and Radiance results are simply\nbecause of the algorithm used. This does not necessarily mean that one\nis wrong and the other is right.\n\nI largely agree with what John wrote except that I would add that once\nthe material properties have been properly assigned in your Ecotect and\nRadiance models, Radiance should be your benchmark. In case you are\nclose to a window, the simulation results of both programs should (and\ndo) largely coincide, but if you use an L-shaped room with a single\nwindow in one of the 'end' walls and run an Ecotect DF simulation,\nyou'll see that as soon as a sensor does not 'see' the window any more,\nthe DF become zero which is of course physically incorrect. On the other\nhand, Ecotect is somewhat faster than Radiance so for the 'easy' cases\nit might be your preferred choice.\n\nIn the end you should think twice before using the daylight factor as\nits capability to improve your design is somewhat limited. You might\nwant to look at dynamic metrics instead such as daylight autonomy,\nuseful daylight index, or continuous daylight autonomy using either SPOT\nor DAYSIM. The new Daysim calculates all three metrics for you and you\ncan load the results back into Ectoect.\n\nOne useful feature that might be of interest is that the export function\nfrom Ecotect to Radiance can be set so that Ecotect checks whether a\nfile <layer name>.rad exists in the \"Material Export Directory\" (Menu\noption: FILE >>> USER PREFERENCES). If so, it uses the content of the\n*.rad file as the material description for the layer in the Radiance\nmodel.\n\nChristoph\n\n\n\n", "replyTo": "", "sender": "Reinhart, Christoph", "isquestion": true, "tags": [], "id": "<5910A0754536EA4AAD411AE8221C39620118A757@nrccenexb1.nrc.ca>", "refs": [], "datetime": "Wed May 10 14:24:21 2006", "email": "Christoph.Reinhart at nrc-cnrc.gc.ca", "subject": "[Radiance-general] Re: Radiance and Ecotect"}