{"refs": ["<124b40400812220456w7ac39da8s62f33b2fd2cb99b4@mail.gmail.com>\t<494F90F1.1070106@nus.edu.sg>", "<124b40400812220633k38dd9798v94b1a9346174e513@mail.gmail.com>"], "id": "<494FB269.4010602@visarc.com>", "subject": "[Radiance-general] rtrace parallelization", "email": "jedev at visarc.com", "body": "\nHi Marija,\n\nThe -PP option only allows for memory to be shared between processes on\na multi-core machine, however this is not at all essential for\nparallelization for radiance jobs. The -PP option does not distribute\nthe rays to be traced between multiple processes. That is whys currently\nyou see only one process actually doing any work.\n\nI think that there are probably a few different ways to distribute rays\nto multiple rtrace processes (using memory sharing or not). The basic\nidea is to take the view or grid points that you want to calculate and\nsubdivide. This subdivision could be in terms of the number of cores and\nor machines available. So lets assume that you have 2 machines with 2\ncores available, thus 4 cores. So if you divide your grid 2x2, then you\ncould do something like the following (lots of ways to run rtrace so\nthere are other approaches):\n\nFROM A SHARED NFS DIRECTORY on Machine 1 and 2 AND using memory sharing:\n\nOn Machine 1:\n\nrtrace [parameters] -PP m1.pp scene.oct  < points.1.1 >\npoints.1.1.output\nrtrace [parameters] -PP m1.pp scene.oct  < points.1.2 >\npoints.1.2.output\n\nOn Machine 2:\n\nrtrace [parameters] -PP m2.pp scene.oct  < points.2.1 >\npoints.2.1.output\nrtrace [parameters] -PP m2.pp scene.oct  < points.2.2 >\npoints.2.2.output\n\nWhen all the jobs are complete then you will need to use other radiance\ntools to recombine your output into one file. Since you know the indices\nof each subset of points this should not be too difficult.\n\nI think that this approach should work. We typically do something\nsimilar when distributing jobs using rpiece. I hope this helps.\n\n-Jack\n\nMarija Velickovic wrote:\n\n--\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20081222/3bd5008b/attachment.html\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] rtrace parallelizati", "tags": [], "sender": "Jack de Valpine", "datetime": "Mon Dec 22 07:29:56 2008"}