{"refs": ["<7b883ed90812260208j5189febbh424e7fcbbc245666@mail.gmail.com>", "<21854D2F-B7D4-401E-84A7-A1937A2D4134@lmi.net>"], "id": "<4958962F.5000601@nus.edu.sg>", "subject": "[Radiance-general] About Radinace - Lens material", "email": "akilog at nus.edu.sg", "body": "\nThere are even some open source and free packages available for such\nsystems, but I do not know anything about all this :-) I have attached\nsome info, but again, I do not really understand what I am posting here!\nTell us if it is useful for you! Again, if you want to model some basic\neffects of what happens in lenses, you may try the pmap-extension for\nradiance or Carsten's rewrite \"radzilla\", which allow e.g. caustic\neffects. Besides that you should read everything concerning glass,\ndielectric, trans and interface modifiers in radiance several hundred\ntimes ;-) You can also have a look at renderpark, a tool that has not\nbeen developed for a while, but has some radiance compatibility (it\nunderstands the mgf format) and implements several forward-raytracing\nengines. This software has always been considered as experimental, so it\nmay be great to experiment, not to sell...\n\nCU Lars.\n\n--\n\n- Tessa (install using apt-get install tessa on debian or other,\ndebian-based distributions):\n\nFrom Tessa's README (available e.g. from recent Ubuntu's):\n\"This is Tessa 3D-FDTD. This software is designed to study optical\nstructures at the wavelength scale using the finite-differences\ntime-domain method. The Tessa home-page is located at:\nhttp://alioth.debian.org/projects/tessa/\nYou can always find the latest version here.\n\nThis software is free software, and as such comes with ABSOLUTELY NO\nWARRANTY, to the extent permitted by applicable law.\n\n\nTessa was developed by:\nJosselin Mouette\nLaboratoire d'?lectronique, opto?lectronique et microsyst?mes (UMR 5512)\n?cole centrale de Lyon, France\"\n\n- Opus\n\nFrom the website (http://www.maxreason.com/software/optics/opus.html):\n\nopus is a software application for designing and evaluating optical\nsystems. The first release of this opus software application was created\nby greatly cleaning and simplifying the application the author had\nenhanced and extended over decades on an as-needed basis.  This was done\npurposely to create a reasonably clean, simple, straightforward code\nbase suitable for enhancement and extension by other programmers.  Some\ncapabilities were removed in this process - to be re-implemented more\ncleanly and efficiently.opus computes AKA \"traces\" the path of light\n\"rays\" from an \"entrance-aperture\" or \"object-plane\", through a series\nof \"optical surfaces\" (lens-surfaces, mirror-surfaces, vignette-stops)\nto a focal surface, where opus computes image error \"aberrations\" at\nseveral \"field-angles\" and colors AKA \"wavelengths\".\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] About Radinace - Lens materia", "tags": [], "sender": "Lars O. Grobe", "datetime": "Mon Dec 29 01:20:06 2008"}