{"body": "\nHi Ramana,\n\nJohn and Rob have mentioned two great resources from LBNL:\n\n1. Window\n2. Optics\n\nI have more experience with Optics so I am not that sure of the data\nexport capabilities from Window. I believe that Optics is the standard\ntool that is used to derive all the performance data for the glazing\nmanufacturers such as Viracon and that this data is then fed into\nWindow. Optics does have a facility for exporting Radiance material\ndescriptions. Depending on your requirements though these will not be\nsufficient.\n\nProbably the best way to get a more sophisticated material description\nfor a specific glazing make-up is to export glazing specs from Optics\none at a time (ie the glass used for surface 1/2 as one export and the\nglass used for surface 3/4 as another export) and then use the RGB and\nspecularity values with the glaze.csh script that comes with Radiance.\nThe script will enable you to output a more sophisticated material\ndefinition that better accounts for angular dependencies in the\nmaterial. Note that the geometry is normal dependent, requiring that the\nglass geometry be modeled with the normal being pointed to the interior\nof the building (hope I got this right, I am working off memory here).\n\nHope this helps.\n\n-Jack\n\nRamana Koti wrote:\n\n--\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20060501/111d52fd/attachment.htm\n", "replyTo": "Subject: [Radiance-general] RGB values for different glazings", "sender": "Jack de Valpine", "isquestion": false, "tags": [], "id": "<445618F7.60409@visarc.com>", "refs": ["<cdf76d820604300018s52238d54wc25af91dc53b18@mail.gmail.com>"], "datetime": "Mon May  1 16:19:50 2006", "email": "jedev at visarc.com", "subject": "[Radiance-general] RGB values for different glazings"}