{"body": "\nHi Ali,\n\nI will try to give you a few hints on this topic. To get geometry into\nRadiance one needs to export the geometry from their modeling\napplication of choice into a format that can be readily converted to\nRadiance's format. From Autocad, one solution is to use radout which can\nbe found on Georg Mischler's site:\n\nhttp://www.schorsch.com/download/radout/\n\nNote though that this will only work up through Autocad 2000 as far as I\nknow. However one of the nice things about this application is that it\nexports directly to Radiances file format.\n\nNow if your mesh needs to have \"mesh\" type properties such as local U,V\ncoordinates you will need to use an intermediate application such as\nRhino or PolyTrans which can read in Autocad .dwg format files and\nexport to .obj. This can then be converted with Radiance's obj2rad or\nobj2mesh command.\n\nNow I am not clear on what you mean about the files being\n\"automatically\" updated. Material assignment is done based on the\ngeometry groupings (such as by layer name or layer color are the two\nconventions available from radout). You will need to create a material\nfile that defines materials for each element of geometry that has been\nexported.\n\nNote, if you are going to use Radiance as part of your Thesis work, I\nwould strongly urge you to get a copy of \"Rendering with Radiance\" which\nis loaded with a great deal of very useful information.\n\nRegards,\n\n-Jack de Valpine\n\nsasa mj wrote:\n\n--\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20060613/d68b4f0a/attachment.html\n", "replyTo": "Subject: [Radiance-general] How can I...", "sender": "Jack de Valpine", "isquestion": false, "tags": [], "id": "<448EF9F5.8070305@visarc.com>", "refs": ["<BAY112-F94896B6589BC8804249979D8C0@phx.gbl>"], "datetime": "Tue Jun 13 19:46:42 2006", "email": "jedev at visarc.com", "subject": "[Radiance-general] How can I..."}