{"body": "\n\nThere are reasonable solutions to that, as mentioned before, NRV is really\ncool as an up-to-date rview/rvu replacement:\nhttp://www.aisarquitectura.com/nrv/\n\nAlso HDRshop is a terrific .pic viewer, its very, very fast:\nhttp://www.hdrshop.com/\n\nRadiance is a unix tool, we all know that, but really, stop this windows\nbashing, its not very constructive at all. A lot of new users will be on\nwin32, its part of life as we know it, so please, let's deal with it that\nway. There are respectable reasons for working on win32, there's simply no\nway of denying that. Autocad, Archicad, Rhino, Solidworks, Catia, Pro/E,\nTracePro aren't software that work on linux, and work fine with Radiance. So\nplease, let's be a little more mature and stop discussing platform as soon\nas the win32 question comes up...\n\nimho, Radiance on wintel isn't _nearly_ as crippled as suggested...\nAnd honestly, I'm really irritated of this win32 bashing. First of all, its\nsimply _not_ true. Radiance runs smooth on win32, and fast as well.\nIf you need to address more than 2GB of memory you really shouldn't be on\nwin32, otherwise its just fine.\n\nI've used it extensively on both linux and win32 and since most CAD packages\nrun on win32, it's a very important platform for Radiance to run on. Big up\nto Francesco for making the new binaries happen, his binaries are _such_ a\nmajor update in comparison to dtp-rad.\n\nCan we all please get to agree to __stop__ redirecting win32 newbies to\nancient, seriously outdated binaries, part of a project that did not reach a\nmature level at all? Seriously dtp-rad does is not representative of the\nstatus of where Radiance is and a dead project is __not__ at all\nrepresentative of the vivid Radiance community we are.\n\nDtp-Rad is DEAD, long live Francesco's binaries!\nOh, while I'm at it, I think dtp-rad is a monstrosity, and am happy to see\nit gone. Using Radiance isn't easy and perhaps shouldn't even have to be\neasy. It's a tool for experts, right! So there's no point in suggesting no\nexpertise is required to use these tools, the truth is quite the contrary.\n\nOh, and to throw oil on these flames, please, I understand unix-evangelism\nand all, but really; Radiance SUCKS on cygwin, I'm sorry, but I consider\nthis as quite an objective fact. A part from dtp-rad, cygwin is the worst\nuser-experience of Radiance one can obtain IMHO. Also bash isn't a nessecity\nfor running Radiance at all. Personally I much prefer python for doing so.\nThere are many ways of interfacing with Radiance, and unix-shells are just\none way of doing so.\n\nA lot of potential Radiance users are on win32, so let's get some kind of\ncoherent advice on how to use Radiance on this platform rather than reaching\nout trying to have these users chance platform.\n\nIf you don't have any real experience in working with Radiance on windows,\nplease stop giving this really bad advice and let's try to settle on more\nintelligent advice.\n\n-jelle\n\n\n", "replyTo": "", "sender": "Jelle Feringa / EZCT Architecture & Design Research", "isquestion": true, "tags": [], "id": "<002001c69131$4a0abac0$0c01a8c0@JELLE>", "refs": [], "datetime": "Fri Jun 16 12:37:37 2006", "email": "jelle.feringa at ezct.net", "subject": "[Radiance-general] coherent advice on running Radiance on win32"}