{"body": "\nHi Bob,\n\nI'll chip into what Mark and Ian indicated. First off Mark's benchmark\npage is very useful, so do make sure to take a look. All of our\nproduction render servers are dual cpu AMD machines, these range from\nsome of the first Athlon MP systems to more recent Opterons. We have not\nyet had the opportunity to look at any dual core systems, when we do AMD\nwill be the top of the list. It has been many years since I really\nlooked into it carefully. But initially the price/perfomance was pretty\nwell in AMD's favor. You might want to pole more broadly among others\ndoing scientific simulation (cfd for example) and see what kind of\nhardware they are using.\n\nAs far as graphics cards are concerned, this does not effect rendering\nspeed, however it may have some impact on viewing the images, perhaps\nothers can provide some good input on this particularly from the\nstandpoint of calibration...? It might also be interesting to see\nif/when (and how much) the new HDR display devices will be available and\nwhat some of the hardware requirements are.\n\nI would certainly suggest 2G of RAM, this should not increase the price\nvery much. If you do not want to do a dual processor system, you can\nprobably assemble a cheap system from parts for ~$800 or less (this\nasssumes a downloaded linux distribution such as Fedora Core), which I\nthink is amazing compared to what I remember paying for our first\nproduction machines back in 1996 (~$4,000 per machine, ouch).\n\n-Jack\n\nMark Stock wrote:\n\n--\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n\n\n\n", "replyTo": "Subject: [Radiance-general] PC hardware advice", "sender": "Jack de Valpine", "isquestion": false, "tags": [], "id": "<449EDF52.3070602@visarc.com>", "refs": ["<449E91C1.6080502@durham.ac.uk>", "<Pine.LNX.4.64.0606251135530.3717@gyruss.gpcc.itd.umich.edu>"], "datetime": "Sun Jun 25 21:09:28 2006", "email": "jedev at visarc.com", "subject": "[Radiance-general] PC hardware advice"}