{"refs": [], "id": "", "subject": "Re: [Radiance-general] IES file viewer", "email": "adiance-general-bounces@radiance-online.org", "body": "<49773301.B450.0049.0@wmtao.com><BDB941EB-B68F-4ED8-9DD9-D898CF30786D@lmi.net>\n<4977D155.9090309@nus.edu.sg>\nMessage-ID: <24A618F8B54C4348B54C8684C918963BD41D92@BUGS.ideasi.com>\n\nHello, I would definitely like to see some more photometric friendly\nfeatures with in Radiance.  As it is, I typically go to other programs\nwhen dealing with photometric files.  FYI, they are:\n\n1) There is a free version of the Photometric Toolbox available here,\nhttp://www.cooperlighting.com/content/design/etools.cfm\nI believe this is just an older version of the software created by AGI\nbut provided for free by cooper.  I do not think it has all the features\nthat the new Lighting Technologies Photometric Toolbox has but it\ndefinitely has some nice features, including a nice 3d photometric web\nand 2d plot options for comparison with published data.\n2) Visual 2.6 also has some nice photometric features including a\nphotometric web.  I believe this is available in the free \"Basic\"\nversion, it is definitely available in the \"Pro\" version.\n\nI have heard of some efforts to link softwares with online photometric\ndatabases to help avoid the cumbersome and mistake prone process of\nfinding the correct IES file for the luminaire (w/ options) that is\nbeing modeled.  For example, Visual comes with all Acuity brand\nphotometrics already in the database - not sure if it can be updated\neasily.  There is also a new xml format being developed by IESNA for the\ntransfer of Luminaire Component Data, separate from photometric data.\nPart of the intent with this format is to link it more directly to\nmanufacturers.  Just thought I'd throw that out there as we discuss any\nnew photometric tools for Radiance.\n\nRegards,\nZack\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of Lars\nO. Grobe\nSent: Wednesday, January 21, 2009 6:52 PM\nTo: Radiance general discussion\nHi Greg!\nthat.\nI have been looking in that, too. I think a great solution would be a\ntool that converts IES into\n\na) .rad: \"wireframe\" geometry, a bit like what genworm does, normalizing\nthe dimensions so that one scale it according to luminous output and\nplace it in a scene to explain light sources' qualities.\n\nb) .meta: polar line plots like the common diagrams we get, which is\nwhat we are used to look at. This would provide an easy way to compare\nthe data we get in our IES with the data the manufacturer published in\nprint.\n\nI think both is doeable even using nothing but shell scripts, genworm\nand the various plotting utilities coming with radiance. The problem I\nwas facing was the IES format, with all its variations. To create a\nparser that really handles all IES luminaire distribution formats seems\nto be not that easy, especially if you want to extract metadata, too\n(which would be nice to have included in the plot in case b) and as\ncomment lines in the scene in case a).\n\nMaybe these two could also be just options for ies2rad...\n\nCU Lars.\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "adiance-general-bounces@radiance-online.or", "datetime": "Wed Jan 21 20:59:18 2009"}