{"refs": ["<AAA27794.460@wmtao.com>", "<49773301.B450.0049.0@wmtao.com><BDB941EB-B68F-4ED8-9DD9-D898CF30786D@lmi.net>", "<4977D155.9090309@nus.edu.sg>", "<24A618F8B54C4348B54C8684C918963BD41D92@BUGS.ideasi.com>"], "id": "<82100A6A-80E4-4ACE-984A-C1270A98457C@u.washington.edu>", "subject": "[Radiance-general] IES file viewer", "email": "fritz at u.washington.edu", "body": "\nBy popular demand, PhotomView 0.2 may be downloaded from:\n\nhttp://students.washington.edu/rfritz/photom_view/\n\nuser/password = phoview/radiance\n\nThere are three files there:\npvsrc.zip (16KB) contains the sources; as far as I know they'll\nwork on any system that has a fairly recent python and supports wxpy\nand Python OpenGL.\nPhotomView.zip (15MB, no, that's not a typo--it's big).  A zipped\nMac OS application bundle; I expect it to work on any current Leopard\nMac--just unzip it and double-click on the app.  As far as I know it's\ncomplete in itself.\nies_files.zip (29KB)\n\nOperation, I hope, is simple: select the \"file>open\" menu item and\npick an IES file; if it's type C photometry, you'll see a wireframe\npicture of the photometry (types A and B aren't yet supported).  Hold\ndown the first mouse button and drag--you can rotate it.  The XY plane\nis the blue one.  If you select the \"Window>Show Photometric Data\"\nmenu item it shows the photometric data as formatted text.  That's the\nwhole functionality.\n\nIt's alpha.  The biggest limitation, of course, is that it only\nsupports type C photometry.  It would be, as we say, A Small Matter of\nProgramming to support types A and B but I'm frying other fish (and\nbeing graded on them!) at the moment.\n\nThe best thing, I think, in the sources is the iesphotom.py module,\nwhich is a general-purpose IES photometry parser.  I think it's pretty\ncomplete, though some of the odd corners of the 1995 spec may not\nwork.  ([BLOCK] keyword, anyone?  I did make an effort, but I've no\nidea if it's complete.  And no MGF support--sorry, Greg.)\nIesphotom.py uses the public domain markup.py module, which I've\nincluded, to generate HTML-formatted photometry output.  If you invoke\nit as \"python iesphotom.py file.ies\" it will send an HTML-formatted\nversion of the photometry to the standard output.\n\nIf you want to work with the PhotomView.py graphical file, you will\nneed Python (2.3.5 or higher) and the wxPython, numpy, and PyOpenGL\npackages; wxPython is bundled with MacOS 10.5.  It has problems on\nWindows, but does operate with Python 2.5.\n(There is no numpy on Windows Python 2.6 yet.)  If you try it on *nix,\nlet me know if it works.\n\nHave fun!  Let me know about the changes.\n\nRandolph\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] IES file viewer", "tags": [], "sender": "R Fritz", "datetime": "Wed Jan 21 23:23:27 2009"}