{"refs": [], "id": "", "subject": "[Radiance-general] Re: -ar, -ad, -as, ahh $#*@!", "email": "adiance-general@radiance-online.org", "body": "Message-ID: <01BA6617-E348-11D7-B772-000393824274@rumblestrip.org>\n\nHi Jack,\n\nOn Tuesday, September 9, 2003, at 08:06 PM, John de Valpine wrote:\n\n\nYep, I used version 1.  And I had the same concerns you cite.  This is\nwhy I made those diagrams (1Pic = 1Kword)!  I guess I thought the goal\nwas to tell mkillum about the major contributing surfaces to the\nluminous flux at the aperture, which is why I thought the inside of the\ncoffer needed to be defined as illums.  The normals of those polys were\nfacing toward the aperture, which in my mind was \"into the room\".\n\nNow, it's crystal clear.  Mkillum wants geometry near the aperture, but\nnot interfering with the aperture.  It will look backwards from this\ngeometry into the light fixture, to find sources, and convert that\ngeometry into a photometrically accurate distribution.  It truly is a\nway to generate an \".ies file\" for a custom fixture!\n\n\nTHanks for clarifying this; you have answered all my questions by\nsimply picking one image.  This is what I suspected, but wasn't sure.\nYes, this particular coffer detail has all the geometry above the\nceiling plane, so of course the single polygon (option 3) will work.  I\nsee now that you & Greg were asking me to drop the illum polys down\nbelow the ceiling to clear any geometry of the luminaire/coffer itself.\nWhich also answers my own question about how close the illum polygons\nshould be; it appears that the closer the better, as long as they don't\ntouch the luminaire.\n\n\nYes, that's where I still have work to do.  Greg spoon fed me the\nmkillum parameters for this model, but I still have no idea how he came\nup with them.  But yes, I see now that the parameters used in the\nmkillum process control the resolution of the resultant data files.  It\nmakes a lot of sense now, this wonderful tool called mkillum.  Thanks\nJack, I hope to try out your suggestions tomorrow.\n\nRob Guglielmetti\nrpg@rumblestrip.org\nwww.rumblestrip.org\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Re: -ar, -ad, -as, ahh $#*@!", "tags": [], "sender": "Rob Guglielmetti", "datetime": "Wed, 10 Sep 2003 00:34:03 -0400"}