{"body": "\nRaquel,\n\nWe bought an LS100 a year ago.  At the time of choosing, there didn't\nseem to be much in the way of competition, but that may have\nchanged.  Regarding your intended use, there are a whole raft of\nconfounding factors that can (and invariably do) make comparison of\nmeasured and modelled values in an urban setting highly problematic.\nI addressed some of these issues in a recent LR&T paper:\n\nVerification of program accuracy for illuminance modelling:\nassumptions, methodology and an examination of conflicting findings\nLighting Research and Technology, Volume 36, Number 3, 1 September\n2004, pp. 217-242.\n\nAbstract:\nThis paper examines the role of assumptions commonly made in\nvalidation studies for lighting simulation programs and quantifies\nthe sensitivity of results to uncertainties in key model parameters\nsuch as sky conditions and surface reflectivity. Actually occurring\novercast skies are often taken to approximate the CIE standard\novercast sky for the purpose of comparing predictions against\nmeasurements in real buildings. The validity of this assumption is\ntested against measurements of the sky luminance distribution for\nreal skies. Illuminance predictions are particularly sensitive to the\nassigned reflectance of surfaces when the direct component of\nillumination is small. A number of confounding factors that can lead\nto imprecise estimates of surface reflectivity for building facades\nare identified and a methodology to minimize their effect is\nproposed. This study reveals that commonly made assumptions with\nrespect to sky conditions and moderate imprecision in model\nparameters can lead to erroneous assessments of program accuracy. The\ndegree to which existing validation findings can be extrapolated to\nvery different application scenarios is discussed in the context of\nreported conflicting assessments of program accuracy.\n\nAlthough concerned mainly with illuminance predictions, much of the\ndiscussion applies also to luminance.  Contact me directly if you\nrequire a copy of this paper and don't have access to the journal.\n\n-John\n\nRadiance 2006 Scientific Workshop, 13-14 (Wed-Thu) September, De\nMontfort University, Leicester, UK.\nhttp://www.iesd.dmu.ac.uk/~jm/radiance2006work.html\n\n-----------------------------------------------\nDr. John Mardaljevic\nSenior Research Fellow\nInstitute of Energy and Sustainable Development\nDe Montfort University\nThe Gateway\nLeicester\nLE1 9BH, UK\n+44 (0) 116 257 7972\n+44 (0) 116 257 7981 (fax)\n\njm@dmu.ac.uk\nhttp://www.iesd.dmu.ac.uk/~jm\n\n\n\n", "replyTo": "", "sender": "John Mardaljevic", "isquestion": true, "tags": [], "id": "<9938921D-2FC3-4459-A7CA-E3A532B192C4@dmu.ac.uk>", "refs": [], "datetime": "Mon Jun 26 14:54:21 2006", "email": "jm at dmu.ac.uk", "subject": "[Radiance-general] Luminance meter"}