{"body": "\nThe need for speed 1\n\nHi Rob,\n\nI remember one mail of you half a year ago or so, when you already had\nanticipated that step.So the time has come now, maybe earlier than\nyou've thought .. :-).\n\nUnfortunately I don't know anything about Dual-processor Boards, and I'm\nnot up to date with the current state of Hardware, too. but I did some\nwork on parallell renderings some time ago.\n\nNow, when it comes to parallel processing, there are lots of different\nways, so probably each one of the newsgroup will give you another tip,\nadvertising his own solution, so let me just join in the howling of the\nwolfes.\n\nI've a reliably working PVM-Radiance Version ready at hand, if you're\ninterested. Currently, it's for Linux only, but the advantage of PVM is\nthat it can combine processes from several OS together. It would be\ninteresting to make it work for a combination of OS X and Linux\nmachines, but for this I would need some help of an OS X guru. How about\nyou, Rob, you probably already have developed one :) ??\nOf course it is only a parallel rpict, rview is difficult to execute\nparallely (cf. the discussion somewhat earlier on this list) and rtrace,\nwell, hmm, rtrace, I think I've never used it so far..\n\nI programmed the ambient value sharing via PVM, too, so there's no lock\nmanager problem. I did spend some time to make the whole stuff\nuser-friendly, but I cannot claim anything about memory efficiency, I\ndidn't care and just equipped every node with a sufficient amount of\nRAM. Quick and dirty. Of course you need the PVM library, but that\nshould not shock you, as it should come automatically with Linux\ndistributions (at least it does so with the SuSe one which is quite\noften found here in Europe.) So if you already have some machines in a\nLinux Network, probably you needn't buy  something new.\n\n@->Lars: yeah, mosix, it's the same with me, I would like to try it but\ndidn't find the time or opportunity so far.\n\nThe need for parallel treatment? Well, if you have just a big picture\nbut a rather easy scene with a little amount of sources, you may well\nget away without PP. But of course there's the fun of the PP just for\nitself ...\n\nSo long\n\n-Carsten\n\n", "replyTo": "", "sender": "Carsten Bauer", "isquestion": true, "tags": [], "id": "<3E280954.E2B15B8F@t-online.de>", "refs": [], "datetime": "Fri, 17 Jan 2003 14:47:00 +0100", "email": "radiance-general@radiance-online.org", "subject": "[Radiance-general] multiprocessor systems, Radiance, and youReferences: <3E26E825.4080607@rumblestrip.org>"}