{"body": "\nWithout debating the merits or drawbacks of Windows vs. Unix, let me\njust speculate that a reasonable Windows environment (e.g., VirtualPC\nor similar) will probably be available for Intel-based Apple hardware\nsoon, allowing one to run most Windows applications at native speed\nand sending files directly to Radiance running under OS X.  Since a\ndecent dual-core Mac mini can be had for less than $800 US, a\nfraction of the cost of most of the CAD systems we're discussing,\nthis may be a reasonable solution for some, and Radiance runs quite\nfast on that platform.  The current \"Boot Camp\" approach requires\nradical switching between systems, which is no fun in my opinion.\nThis situation is bound to improve since the hardware is capable --\nprobably before the year is out.\n\nHas anyone tried \"Wine Doors\" or found a convenient way to run\nWindows under a running Linux system, allowing files to be passed\nbetween?  This might also be a reasonable solution for those needing\nthe latest bits of Radiance.\n\nNative Windows binaries of Radiance are great, and it's wonderful\nthat Francesco has provided these to the community for free, and\nkudos as well to Ignacio for nrv!  From my limited experience with\nCygwin, I tend to agree with Jelle that this approach leaves much to\nbe desired.  It's much better to do away with the middleman,\nespecially when it keeps munging process memory.\n\nMultiprocessing and advanced Radiance features are going to be\nlacking or lagging on Windows for the indefinite future, since most\ndevelopment happens under Unix, and that's just the way it is.  Even\nso, being a year behind is better than being 8 years behind and\ngrowing, which is where Desktop Radiance is regrettably stuck.\n\n-Greg\n\n", "replyTo": "Subject: [Radiance-general] coherent advice on running Radiance on win32", "sender": "Gregory J. Ward", "isquestion": false, "tags": [], "id": "<10B2BDA8-72B6-42CF-B264-1BAEE8C0E9DC@gmail.com>", "refs": ["<002001c69131$4a0abac0$0c01a8c0@JELLE>"], "datetime": "Fri Jun 16 13:30:41 2006", "email": "gregoryjward at gmail.com", "subject": "[Radiance-general] coherent advice on running Radiance on win32"}