{"refs": ["<6F5225D6E15F954BB4E58EC25F6736C3017F6474@corp3005.CORPORATE.FOSTER.NETWORK>"], "id": "<EB124710ADB8554C930FADF760BB2BE7025DD2F9@n-yexc01.global.arup.com>", "subject": "[Radiance-general] Radiance and irradiation", "email": "Christopher.Rush at arup.com", "body": "\nGiovanni, right-click on My Computer, select Properties, go to the\nAdvanced tab, click the Environment Variables button near the bottom. In\nthe upper window you should have a variable called PATH and a variable\ncalled RAYPATH. If you don't have them, or the values don't match the\nfollowing, create  or edit them accordingly...\n\nPATH = .;C:\\Program Files\\MinGW-Radiance\\bin;$PATH\nRAYPATH = .;C:\\Program Files\\MinGW-Radiance\\lib\n\nAt least that's how it's set up on mine using the MingW binaries from\nhttp://www.bozzograo.net/radiance/\nIf your radiance bin or lib directories are located elsewhere on your C\ndrive, change accordingly.\n\n\n\n-------------------------------------\nGiovanni Betti\nSent: Tuesday, April 07, 2009 9:02 AM\n\n\nSounds quite different... I can't even find those files in my radiance\ninstallation!!\nThanks anyway!\nGiovanni\n\n\n-------------------------\nLars O. Grobe\nSent: 07 April 2009 12:54\n\n\nThe same command works here. Most probably something is wrong with your\nRadiance installation, the most common origin of all trouble are PATH\nand RAYPATH settings not pointing to the right directories. But here we\nhit a point that I cannot really help you - I have zero experience with\nRadiance on Windows, and usually it is guaranteed 100% more pain for\ndoing the same. Can you check your installation?\n\nCU Lars.\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Radiance and irradiati", "tags": [], "sender": "Christopher Rush", "datetime": "Tue Apr  7 07:42:06 2009"}