{"body": "\nHi Schorsch,\n\nooops, for several weeks the Radiance-mailing list was more or less\n'sleeping', but the issue of parallel processing still hasn't lost it's\nfascination ... so I think no one would mind if I answer your question\nright here:\n\nI had the idea of making the processes as independent as possible, so in\nthe PVM version there's one master distributing the blocks, the workers\nwhich do the tracing, a collector receiving finished scanlines (and in\nthe end  puzzles everything together for the big picture) and of course\nthe ambient slave, who receives amb. values and broadcasts them to all\nthe other workers. This ambient slave alone has access to the file for\nstoring them. Only at the beginning of a new run the workers can access\nan already existing ambfile for reading in values.\n\nIt's important not to start in one corner of the image and distribute\nthe blocks regularly. The master picks them randomly from the list, thus\nthe process resembles a bit the rview style, which is more appropriate\nfor filling up the ambfile with values from the whole room, as Charles\npointed out. so sharing will happen mainly at the end of the run, when\nmore and more blocks happen to be adjacent to one already processed.\n\nLet's stop here, I don't want to flush the general list too much...\n\nExcept of course with general remarks :-)\n\nThis sort of parallel processing of one picture is only adequate for\nreally big images of really complicated scenes (btw, - this means\nautomatically that bottleneck problems are unlikely to occur). For usual\nscenes and the majority of applications like sequences under different\nconditions, lots of rtrace runs etc etc, distributing the job with\nscripts or manually on some machines is easier and more efficient.\n\nA different thing is of course the idea of using PVM to couple OS X or\nWindows and Linux machines, which might be interesting for bureaus who\nalready have lots of hardware standing around. And another different\nthing is thinking about the future, what about parallel processing for\nthe photon-map ? I know that some have objections against using external\nlibraries, but at the same time its inefficient to reinvent the wheel\nagain and again, so why not use the features PVM has to offer?\n\n-Carsten\n\n", "replyTo": "", "sender": "Carsten Bauer", "isquestion": true, "tags": [], "id": "<3E293BBE.B65B6737@t-online.de>", "refs": [], "datetime": "Sat, 18 Jan 2003 12:34:22 +0100", "email": "radiance-general@radiance-online.org", "subject": "[Radiance-general] multiprocessor systems, Radiance, and youReferences: <Pine.BSF.4.44.0301171041051.39691-100000@emancholl.pair.com>"}