{"refs": [], "id": "", "subject": "[Radiance-general] Rendering with many spectral bands and RGBweighting", "email": "G.Harding1 at Bradford.ac.uk", "body": "Message-ID: <73D529D687144D77B030A34DCC1366E6@UNIVERSI047A23>\n\nHi,\n\n\n\nHopefully someone who has done this already can help out here..\n\nWe have been using a spectral rendering technique with radiance by splitting\nour material and light source data into 27 files (81 bands) and combining\nthe output of the 27 rpict processes.\n\nThe assumption here is that radiance has no calculations that differ across\nthe 3 \"RGB\" values in the material and light source files.\n\nHaving searched the archives, I have found a few seemingly conflicting\npieces of information:\n\n\n\nIn one correspondence (from Greg Ward) it is stated that \"Radiance does not\nhave any wavelength specific calculations\".\n\n\n\nHowever, Arne Dure has pointed us towards the source code in color.h:\n\n#define bright(col) (CIE_rf*(col)[RED]+CIE_gf*(col)[GRN]+CIE_bf*(col)[BLU])\n\n\n\n\n\nIs this calculation what Greg refers to in his reply here?:\n\n\n\nhttp://www.radiance-online.org/pipermail/radiance-general/2003-June/000869.h\ntml\n\n\n\n\"The only place RGB is assumed in the code is when it's\ncombining primaries to get brightness for a weight test or somesuch,\nand it shouldn't affect the result much for adjacent samples, which\nshould be fairly similar.\"\n\n\n\n\n\nI'm not really sure what this 'weight test' is or if we should be worrying\nabout this. Am I correct in thinking that although this calculation may not\ngreatly effect the result, for maximum accuracy when spectral rendering we\nshould render only one waveband at a time (R=B=G) and do it 81 rather than\n27 times?\n\n\n\n\n\nMany thanks,\n\n\n\nGlen Harding.\n\n\n\nGlen Harding\n\nBradford School of Optometry and Vision Sciences\n\nUniversity of Bradford\n\nBD7 1DP\n\nTel: 07969 797391\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20090424/f16fc311/attachment-0001.html\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "G HARDING", "datetime": "Fri Apr 24 07:43:12 2009"}