{"body": "\nHi folks,\n\none minor info about radiance-online itself:\n\nSix years after I started radiance-online, the configuration is about to\nchange.\n\nFlashback: It had started as an unofficial guerilla project in 2000,\nfilling the void of a mailing list and a maintained website. Over the\nyears, it grew to support the CVS software archive, hosted the Radiance\nmailing list with around 300 users and distributed the CDs of the past\nRadiance workshops. My idea had been to run a stable, no nonsense\nsystem: The system has been kept updated, and thanks to RAID, it\nsurvived two dying disks on the last 2 months without downtime. Various\nbackups and self checks helped to make sure the source code distribution\nand the mailing list system remained consistent. And -yes, - many thanks\nto the IT at Fraunhofer ISE Freiburg for providing bandwidth (see\nhttp://www.radiance-online.org/webalizer/stats/ for details) and\nrackspace generously.\n\nDuring the past months, it became obvious that new features would be\nuseful. However, I didn't feel it would be wise for me to broaden my\nfree support for it by a large scale, and trying to locate co-funding\nwas fruitless. Which I found a bit sad, and, IMHO, may correlate with\nthe management structure of Radiance.\n\nAnyway- The domain registration expires next week, so I wrote to the dev\nlist in May that I plan to \"pass on the torch\". Ideas then popped up on\nthe dev list and LBNL (Lawrence Berkeley Nat. Lab., Greg Ward's employer\nwhen he wrote the legacy parts of Radiance) suggested to take over. They\ncontacted me yesterday for the domain transfer, so we'll go ahead as\nplanned. Which, in some ways, seems a good thing to me, as it will merge\neverything back in one place. And I'm glad we found a reasonable\nsolution which allows me to focus back on what I want and need to do:\noptical material measurements.\n\nSo, with the old machine being shut down in the next weeks, and the new\none being set up, you may experience some transitional problems. My\napologies for any inconvenience this may cause.\n\nMany thanks to all the folks who, by their email or code contributions,\nenhanced Radiance, smoothed the way for newcomers, located problems and\nmade the Radiance community a lively place.\nAlso many thanks to Danny Fuller at LBNL (Windows&Daylighting) for\ntaking over the system administration.\n\nregards and happy rendering\nPeter Apian-Bennewitz\n\n--\npab-opto, Freiburg, Germany, http://www.pab-opto.de\n[see web page to check digital email signature]\n\n\n", "replyTo": "", "sender": "Peter Apian-Bennewitz", "isquestion": true, "tags": [], "id": "<44BC7C1B.4090904@pab-opto.de>", "refs": [], "datetime": "Tue Jul 18 08:15:01 2006", "email": "apian at pab-opto.de", "subject": "[Radiance-general] changes to radiance-online"}