{"refs": ["<49F85AE5.5030606@gmail.com>\t<124b40400904290716v13f3b8ecw881138a58723fc27@mail.gmail.com>", "<124b40400904290756o3cb46efh272cf6e931d30690@mail.gmail.com>"], "id": "<49FF0881.2090306@gmail.com>", "subject": "[Radiance-general] Description of complex glass systems (geometry+ material)", "email": "arina.aviles at gmail.com", "body": "\nHi Marija, hi Jack\n\nThanks for your mails.\nSome glass types I want to simulate are not in the IGDB, so I will\ndescribe the glasses with the measurements-method,\nbut I am not really sure I have understood this method properly. There\nare those precisions that make radiance so great, but sometimes also\ndifficult to learn. Could you tell me if this would be then right as\nfollows?\n\nThis is the hole double glazing geometry description:\n\n#window geometry:\n\ndouble_glazing_a    polygon    window\n0\n0\n12    0        -0.18    0\n0        -0.18    3.34\n4.13    -0.18    3.34\n4.13    -0.18    0\n\nThen I should measure the interior pane (a laminated float glass with an\ninterlayer) and separately the exterior pane (a 4 mm float glass). The\nhole input data are then:\n\nRed: 700nm --     rf1_r    rb1_r     rf2_r     rb2_r    t1_r     t2_r\nGreen: 546nm -- rf1_g    rb1_g    rf2_g    rb2_g    t1_g    t2_g\nBlue: 436 --         rf1_b    rb1_b    rf2_b    rb2_b    t1_b    t2_b\n\nThen substitute these in the formel you said and this would be the\ncomplete description of the double glazing material:\n\n#window material:\n\nvoid BRTDfunc double_glazing_a\n10\nif(Rdot,cr(fr(rf1_r),ft(t1_r),fr(rf2_r)),cr(fr(rb2_r),ft(t2_r),fr(rb1_r)))\nif(Rdot,cr(fr(rf1_g),ft(t1_g),fr(rf2_g)),cr(fr(rb2_g),ft(t2_g),fr(rb1_g)))\nif(Rdot,cr(fr(rf1_b),ft(t1_b),fr(rf2_b)),cr(fr(rb2_b),ft(t2_b),fr(rb1_b)))\nft(t1_r)*ft(t2_r)\nft(t1_g)*ft(t2_g)\nft(t1_b)*ft(t2_b)\n0 0 0\nglaze2.cal\n\n0\n9\n0 0 0\n0 0 0\n0 0 0\n\n\n\nI also try to understand how this calculation system is related to the\nphysical process. So I have another question.\nIf I measure with a spectrometer the complete normal reflectance and\ntransmittance of a double glazing, the interior reflectances are already\nin the total measurement. So I understand that, also when in the\nphysical reality the total reflectance of a double glazing could be the\ninput data for the simulation, the calculation system of radiance\ncalculates only right if you specify the interior reflectances and the\ncalculation take place within the BRTD function. Am I right on that?\n\nThanks again,\n\nMarina\n\n\n\n\n\n\nHi Marina,\n\nYes you want to describe the glass geometry, that is one polygon\nrepresenting the multiple layers of the physical makeup. The material is\nwhat should represent the behavior. If you take the output from Optics\nand run it through optics2rad you will get a single BRTDfunc material\ndescription. One thing to be careful of is that this is dependent on the\ncorrect orientation (normal) of the glass geometry. I believe that the\nnormal is supposed to be pointing \"into\" the interior of the building.\nOne way to check normal orientation in radiance is to assign\n(temporaryily) a \"glow\" material to the glass geometry and view it. The\nsides that are \"black\" are the back sides of the geometry, the sides\nthat are not black are the positive normal side.\n\nRegards,\n\n-Jack de Valpine\n\n\n\n\nMarija Velickovic wrote:\n\n\n", "isquestion": false, "replyTo": "<124b40400904290756o3cb46efh272cf6e931d30690@mail.gmail.com>", "tags": [], "sender": "marina aviles olmos", "datetime": "Mon May  4 08:23:51 2009"}