{"body": "<E0F4EDAA-F74B-4948-A815-F87C29758598@gmail.com>\n\nHi all,\n\nI've never had so many ppl help on a subject, thanks alot rob, halley, thomas, dave and christian. very much appreciated.\n\nDave and rob you both talk about a light loss factor, as a multiplier, i gather you mean the candela multiplier field in an ies file. no need to reply if im right...just please tell me if im wrong! i'll just leave this as 1 and then use the -m option if needed.\n\nill use the 380,000 lumens in my lumens per lamp value then, although by the sounds of things its not crucial what i use.\n\nthomas - i was aware that my terminology was mixed up, but now its not-thanks. got a copy of that lamp now thanks.\n\nhalley - i think that 38000 fixture output is a bit low, the efficiency should be higher.but ur information helped, thanks.\n\nrob - they do really throw out some light. from about 2m away we got about 100k lux. after using all of them (we have 5) for a couple of weeks some bright spark mentioned that we may be gettin a little bit too much UV so we had them tested. a single one from 2.5m away is above UV radiation safety standards after 20 mins, we had all 5 pointed at us from about 2m away, meaning we were only safe under their collective glare for 4 mins. we would spend all day under them......whoops. needless to say we installed some UV filters afterwards. yeah i presumed that the fresnal lens was taken into account already with the photometric data, dont know why i mentioned it really, but thanks anyway for confirming my suspicions ;)\n\nso my 2 final ies file will look as below,\n\nspot.ies\n\nTILT=NONE\n\n1 380000 1 12 1 1 2 -.376 0 0\n1 1 4000\n0 0.5 1.5 3 4 5 6 7.5 9 11 17 90\n0\n1880000 1800000 1600000 1000000 600000 400000 250000 120000 100000 60000 0 0\n\nflood.ies\n\nTILT=NONE\n\n1 380000 1 14 1 1 2 -.376 0 0\n1 1 4000\n0 7 10 13 16 22 26 30 36 40 44 50 60 90\n0\n176000 166000 168000 168000 160000 148000 142000 120000 44000 12000 6000 2000 0 0\n\nif anyone see's anything wrong with these please shout at me!\n\nthanks enormously\n\nchris\n\n\n-------------------------------------------------------------------\nThis e-mail and any attachments may contain confidential and/or\nprivileged material; it is for the intended addressee(s) only.\nIf you are not a named addressee, you must not use, retain or\ndisclose such information.\n\nNPL Management Ltd cannot guarantee that the e-mail or any\nattachments are free from viruses.\n\nNPL Management Ltd. Registered in England and Wales. No: 2937881\nRegistered Office: Serco House, 16 Bartley Wood Business Park,\nHook, Hampshire, United Kingdom  RG27 9UY\n-------------------------------------------------------------------\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20060804/ecd55f88/attachment.html\n", "replyTo": "", "sender": "Chris Foster", "isquestion": true, "tags": [], "id": "<2C2E01334A940D4792B3E115F95B722631AF39@exchsvr1.npl.ad.local>", "refs": [], "datetime": "Fri Aug  4 11:06:52 2006", "email": "chris.foster at npl.co.uk", "subject": "[Radiance-general] making my own ies fileReferences: <FCCB55B3313F2341AB3C91810FE1166B013E514F@ln-s3xch1.bdp.holdings.network>"}