{"refs": ["<63252a3e0905181732m3ddc2e50xd6a6d83e02979aff@mail.gmail.com>\t<D4244713-2A43-4268-9C7A-CAEC0CEE1C44@rumblestrip.org>", "<63252a3e0905182239u74d44d93hd9bbe63cafc7e7aa@mail.gmail.com>"], "id": "<4A1255FB.2070704@nus.edu.sg>", "subject": "[Radiance-general] Rendering large space with small detail (smallpicture now attached!)", "email": "lars.grobe at nus.edu.sg", "body": "\nHi,\n\nas Rob said, bringing the light source closer to the scene is a good\nstart ;-) You can do this in your case by using the gensky modifier for\nyour horizontal skylight's glazing, instead of defining a glass pane\nplus an outside sky dome (I assume that you do not have any visible\ngeometry that is seen through the horizontal skylight). The second is\nthat in your case, it may be possible to define an mkillum surface in\nthe vertical clerestory windows. This would produce an uniform illum\nsource accounting for the external blinds and certainly help a lot to\nimprove rendering times with acceptable image quality.\n\nI would try to go with such a set-up. Replace the (vertical) clerestory\nglazing with a mkillum surface, the (horizontal) skylight glazing with\nthe gensky modifier, and set higher ambient paramters as Rob suggested\n(and set a lower -ab, 2 or 3 should be fine with a good -av value!!!).\n\nIn case this is not enough - one COULD try to introduce a second mkillum\nsurface below the internal shades, as these probably also are a bit\ntricky to calculate. In this case, one would place a gensurf-generated\nsurface just below the internal shades, with a resolution to account for\nvariations in the structure (I would try something like 4x4 from what I\nsee on the image), which will be invisible, but replace all ambient\ncalculations on top of the internat shades by 4x4 illum sources. This\nwould lead to a very simple scene, with very short rendering times and\nvirtually no noise. BUT - first try the other options!\n\nCU Lars.\n--\nLars O. Grobe (Mr) :: Research Fellow, Solar Energy Research Institute\nof Singapore SERIS :: National University of Singapore :: Block 4\nEngineering Drive 3, #E4-01-01, Singapore 117576 :: 65-6516 5816(Tel) ::\n65-6775 1943 (Fax) :: serlog@nus.edu.sg (E) :: www.seris.sg (W) ::\nCompany Registration No: 200604346E\n\nImportant: This email is confidential and may be privileged. If you are\nnot the intended recipient, please delete it and notify us immediately;\nyou should not copy or use it for any purpose, nor disclose its contents\nto any other person. Thank you.\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: lars_grobe.vcf\nType: text/x-vcard\nSize: 299 bytes\nDesc: not available\nUrl : http://radiance-online.org/pipermail/radiance-general/attachments/20090519/05e2f32b/lars_grobe.vcf\n", "isquestion": false, "replyTo": "<63252a3e0905182239u74d44d93hd9bbe63cafc7e7aa@mail.gmail.com>", "tags": [], "sender": "Lars O. Grobe", "datetime": "Mon May 18 23:47:28 2009"}