{"refs": ["<be3956780905210213y23fb7b7fm9b2f1420267eb27b@mail.gmail.com>"], "id": "<EB124710ADB8554C930FADF760BB2BE70549248A@n-yexc01.global.arup.com>", "subject": "[Radiance-general] Daysim Electirc Lighting energy calculation", "email": "adiance-general-bounces@radiance-online.org", "body": "\nThere is actually a Daysim forum that can be found in Google Groups. You\ncan probably get more advanced advice there, and the software authors\ntrack that message board. I'll give some general comments:\n\nFirst, take a look at the tutorial which may answer your questions\nbetter than I can\nhttp://irc.nrc-cnrc.gc.ca/ie/lighting/daylight/daysim/docs/DaysimTutoria\nl.pdf\n\n1. I'd recommend giving an example of the error you found to the Google\nGroup for review so it's more clear what the problem is.\n\n2. I believe Daysim assumes that any time a daylight value over a\ncertain threshhold occurs that the user would draw the shades blinds and\ncut the daylight value by an assumed percentage. If you're sure that\nthere will not be any shades there should be a \"no blinds\" option.\n\n3. The user behavior for active or passive use (or mix) basically\nguesses whether occupants will actively raise blinds when glare is no\nlonger present or will be passive and leave them closed most of the day.\nI assume it's similar for user behavior with respect to switching of\nlights, but I'm not sure if that's based on daylight or occupancy.\n\nThe Lighting and shading controls should relate to any automated control\nsystem for the blinds or electric lights.\n\n4. Good question for the Daysim Google Group.\n\n5. If you set a particular work plane sensor I believe it will predict\nenergy on that one particular sensor instead of some other behavior, but\ncheck the tutorial for better explanation.\n\n________________________________\n\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of\nVictor Li\nSent: Thursday, May 21, 2009 5:13 AM\nTo: Radiance-general@radiance-online.org\n\nDear:\n\nI am using Daysim to calculate who much energy consumption for lighting\nto compensate the daylight.\n\n1, I found The total annual hours of occupancy at the work place and the\ntotal annual hours of electric lighting are wrong. I calculated it by\nhands according to the rules and methods from Tutorial. I found it is\ndifferent from the result of Daysim.\n\n2, User Behaviour,   \"Active\" means \"A user who operates the electric\nlighting in relation to ambient daylight conditions\"  I donot understand\nwhat does \"the ambient daylight conditions\" mean here?  For blinds, If\nthere is no blinds or other shading devices in my building, how can i\nset this for blinds?\n\n3, Lighting and Shading control system.  For blinds control, I really\ndonot know what is the difference between set in \"User Behaviour -\nblinds use\" and \"Lighting and Shading control system - blinds control\" ?\nLikewise, if there is no blinds how can i set it?  For lighting control,\ni tried the frist three types, which are \"Manual on/off switch near the\ndoor\",  \" Switch off occupancy sensor\", and \"switch on/off occupancy\nsensor\"  i didnot find any difference of the results between the three.\n\n4 in my building the electric lighting is only used when the daylight\ndoes not meet the 300 lux requirement. so who can i select the lighting\ncontrol type?  is the \" Photosensor controlled dimming system?\napropriate for my situation?\n\n5 what is the function of \"work plan sensor\"\n\ni am new to Daysim so i have many questions  Hope you can help!  Thank\nyou very much!\n\nBest Regards!\n\nvictor\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20090521/3ab68e9f/attachment.html\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Daysim Electirc Lighting energy calculati", "tags": [], "sender": "adiance-general-bounces@radiance-online.or", "datetime": "Thu May 21 07:12:24 2009"}