{"refs": ["<be3956780905210213y23fb7b7fm9b2f1420267eb27b@mail.gmail.com>", "<EB124710ADB8554C930FADF760BB2BE70549248A@n-yexc01.global.arup.com>"], "id": "<be3956780905211904w10fed496g1e3babeeaa44adbf@mail.gmail.com>", "subject": "[Radiance-general] Daysim Electirc Lighting energy calculation", "email": "victorpermanent at gmail.com", "body": "\nChristopher Rush : Thank you so much!\n\n1, I defined the occupancy time is from 8:00 to 17:00. The result from\nDaysim is 1568 hours totally in a year. However, i calculated it which is\n1827 hours. According to the descirption of Daysim tutorial. Occupants leave\ntwo times, one in the morning and one in the afternoon for 30 mins each time\nand leave in lunchtime for one hour. So there are 9 hours from 8:00 to 17:00\none day. And occupants leave for 2 hours totally each day. So there are 7\nhours occupancy time each day. Therefore, for one week there are 35 hours\nfrom monday to friday. There are 365 days one year which is 52 weeks plus\none day.  the occupancy time for one year would be 35*52+7=1827 hours, which\nis different to 1568 hours from Daysim result.\n\nBy the way, i donnot know how to calculate the total annual hours of\nelectric lighting in Daysim and i didnot find in Daysim tutorial. Anyone can\ntell me?\n\n2, Christopher Rush mentioned the daylight level i donot understand it. The\ndaylight value is the sky illuminance outside or the illuminance in the\nroom?  if it is for the inside room. I difined many illimance point. So\nwhich one can control the blinds?\n\nIn my building, there is no blinds. However, i donot have the \"no blinds\"\noption in my Daysim. what is wrong?\n\n3, I looked the tutorial. For user behavior. it defined the active and\npassive for when the blinds and lighting are open and when thay are closed.\nHowever, in Lighting and shading control system, its function is to define\nwhen thay are open and according to which control system, manual or other\nsensor. So the two have the same function. i am confused hwo the blinds and\nelectric lighting perform in Daysim?\n\n4 any one can answer this question?\n\n5 If i define a sensor point, is the whole lighting system controlled by the\nonly sensor point?  if i define two. How is the lighting system controlled?\n\n2009/5/21 Christopher Rush <Christopher.Rush@arup.com>\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20090522/c4e87085/attachment.htm\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Daysim Electirc Lighting energy calculati", "tags": [], "sender": "Victor Li", "datetime": "Thu May 21 19:04:03 2009"}