{"body": "\nhi all\n\nanyone who feels the need can answer this question but i think greg might know the answer after readin one of his previous emails.\n\ngreg, you including an email with a file for a LCD display on an email to yuni previously, with a hack in it to give the glowing screen some reflectance...helps but i need some more , please!!\n\ni want to shine light onto an ON display and measure the combined light reflecting off of it. this has to include the reflected light and the transmitted light of the display itself. how do i achieve this?\n\nim comfortable with using rcalc|rtrace|rcalc and bgraph so i dont need any help there. i require some assistance with the materials for the display. i currently have the material LIGHT emitting from one side of the display, would it be wise to put in GLASS in front of this light? can i model this glass so that it transmittes the light coming from behind it (from the display) and at the same time reflects the light incident on it from the front, from the spotlights.\n\nhope that was easy enough to follow. i feel brtd func would be more appropiate than glass but would appreciate any one's thoughts.\n\nthanks in advance\n\nchris\n\n-------------------------------------------------------------------\nThis e-mail and any attachments may contain confidential and/or\nprivileged material; it is for the intended addressee(s) only.\nIf you are not a named addressee, you must not use, retain or\ndisclose such information.\n\nNPL Management Ltd cannot guarantee that the e-mail or any\nattachments are free from viruses.\n\nNPL Management Ltd. Registered in England and Wales. No: 2937881\nRegistered Office: Serco House, 16 Bartley Wood Business Park,\nHook, Hampshire, United Kingdom  RG27 9UY\n-------------------------------------------------------------------\n\n", "replyTo": "", "sender": "Chris Foster", "isquestion": true, "tags": [], "id": "<2C2E01334A940D4792B3E115F95B722631A581@exchsvr1.npl.ad.local>", "refs": [], "datetime": "Wed Aug  9 10:31:22 2006", "email": "chris.foster at npl.co.uk", "subject": "[Radiance-general] displays"}