{"body": "\nFrom Rob Guglielmetti, who isn't able to get through to the list at\nthe moment...\n\nTo: \tRadiance general discussion <radiance-general@radiance-online.org>\n\nChris Foster wrote:\n\n\n\nHi Chris, et al.:\n\nChris, the fresnel lens has nothing to do with the lamp.  Just want\nto be clear on that.  The lens is part of the luminaire itself and\nits behavior should be accounted for in the candela values you got\nfrom the website. Arri makes luminaires, not lamps.  (And that 4K\nfresnel is a kick-butt luminaire!!  I used their 2K spots in my\ntheatre days; those 4K's must _really_ throw some light. The lamp\nsocket for the 2K was nuts, with its own mechanical clamp that held\nit in place.  I still remember the lamp code: CYX.  Don't ask me why\nthat tidbit remains in my brain sixteen years after the fact, when I\ncan't even remember what I had for dinner last night.  Anyway...)\n\nThe lumens/lamp field really should contain the initial lumens of the\nlamp used in the luminaire when it was photometered, per the\nspecification.  That's just good practice in case someone else ever\nuses that file and they have a different lamp; that way one can\ntailor the output to reflect a different lamp output using the\nmultiplier (see below).  The fact of the matter is that in Radiance\n(and I'm pretty sure this is true of AGI as well), it really doesn't\nmatter what you put in the lumens/lamp field in the ies file, as the\ncandelas are what they are, regardless.  Like I said, it's just good\npractice to follow the spec.  That said, in Lightscape, if you\nchanged the lumens in that field, you changed the output of the\nluminaire, but this is not really the way things are supposed to\nwork.  That's what the multiplier is for.  The multiplier field\nallows you to adjust the luminaire output to reflect a different lamp\noutput, as well as the effect of all the other elements that go into\nthe Light Loss Factor (LLF).\n\nThis brings me to mean vs. initial.  Lamp catalogs usually have both\nvalues, the mean value quantifying the lamp's lumen depreciation over\ntime.  It's nice to have both because then you can compute more\naccurate LLD multipliers (mean lumens/initial lumens=LLD), as they\nvary from lamp type to lamp type, and manufacturer to manufacturer.\nOf course LLD is only one element of the total LLF.\n\nNote also that ies2rad has its own multiplier (-m), so you could\nleave the multiplier in the ies file at 1 and use the -m to apply\nyour multiplier (this is what I do).\n- Rob Guglielmetti\nwww.rumblestrip.org\n\n\n\n", "replyTo": "Subject: [Radiance-general] making my own ies file", "sender": "rpg@rumblestrip.org", "isquestion": false, "tags": [], "id": "<E0F4EDAA-F74B-4948-A815-F87C29758598@gmail.com>", "refs": ["<FCCB55B3313F2341AB3C91810FE1166B013E514F@ln-s3xch1.bdp.holdings.network>"], "datetime": "Thu Aug  3 20:06:37 2006", "email": "Rob Guglielmetti", "subject": "\tRe: [Radiance-general] making my own ies fileDate: \tThu, 03 Aug 2006 10:12:00 -0600"}