{"refs": [], "id": "<544511591@web.de>", "subject": "[Radiance-general] Infrared scene simulation", "email": "AlexanderUtz at web.de", "body": "\nHi Greg,\n\nafter I put some more unsuccessfull effort in trying to find an alternative\nto Radiance for my infrared-simulation problem I decided to try it with Radiance\nand see what comes out. So I hope you don't mind if I bother you with some\nstupid questions again.\n\nI calculated the total amount of energy emitted by a 300?K blackbody as\n146.305W/(sr m^2). So the material for my source becones\n\nvoid light bright\n0\n0\n3  48.77 48.77 48.77\n\nright? Now my Problem is how to create a material mixed from a glow and a\nreflective material. I must admit I am not able to figure out how to do this\nfrom the available documentation. I tried the following\n\nvoid plastic brown\n0\n0\n5  .2  .1  .1  0  0\n\nbrown glow brown_glow\n0\n0\n4 100 100 100 100\n\nbrown_glow sphere BB\n0\n0\n4  2  1  1.5  .125\n\njust as a test. oconv runs over it without complaints - but when I wan't to\nwatch the scene using rvu it says:\nrvu: fatal - conflicting material \"lbrown\" for sphere \"BB\"\n\nBy the way what exactly does the maxrad parameter for the glow stand for (I\ndon't understand what is meant by shadow testing in this context)? Is it the\nmaximum distance from the glow which will be illuminated by it's radiation?\n\nI also checked the documentation on mixtures but again do not know how I could\nuse these to solve my problem.\n\nSo it would be really great if you could help me out or tell me how others\nsolved this as you said!\n\nThanks and Best Regards\n\nAlex\n\n---------------------------------------------------------------------\n\nSorry, Alex -- it's not really my area of expertise.\n\nAnyone else care to suggest something?\n\n-Greg\n\n\n\n____________________________________________________________\nText: GRATIS f?r alle WEB.DE-Nutzer: Die maxdome Movie-FLAT!\nJetzt freischalten unter http://movieflat.web.de\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Alexander Utz", "datetime": "Wed Jun  3 02:39:29 2009"}