{"refs": [], "id": "<575186217@web.de>", "subject": "AW: [Radiance-general] Infrared scene simulation", "email": "AlexanderUtz at web.de", "body": "\nHi Greg,\n\nfirst of all thank you for the last mail. Meanwhile I made some first tests and what I saw till now\nseems to be quite promising for my needs. Unfortunately I still have some problems understanding\nand handling the glow-reflection material mix. Maybe you can help me with this. So here is what I have done:\n\n# amount of radiation energy depends on the object's temperature and emissivity\n# BB@T=21?C\nvoid glow glow_e1\n0\n0\n4 135.13 135.13 135.13 100\n\nThis is my basic glow. 135.13W/m2/sr is about the radiation of a Blackbody at 21?C. I\nmixed this with some material the way you showed me:\n\nvoid mixfunc l_col040_\n4 glow_e1 col040_ e_plastic materials/emissivity.cal\n0\n0\n\nSo the fraction of total radiation of the mixture from the Blackbody's one is applied here.\n\nI rendered my scene and iradiance pictures and created the falsecolor picture and the distribution\nof irradiance looks quite as I expected. Only surfaces which are not illuminated by other glows\nappear absolutely \"black\", i.e. irradiance of 0. So it seems to me I only see reflection but not\nthe radiation emitted by the surfaces themselves.\n\nI thought I might have to increase the max range of the glow so I gave a maxrad value of 10000\ninstead of 100. The result was that the total iradiance of the whole scene was limited to a tiny\nfraction of the original one and this confused me completely.\n\nSo can you please tell me what I'm doing wrong?\n\nThanks in advance and Best Regards\n\nAlex\n\n\n-----Urspr?ngliche Nachricht-----\nVon: Greg Ward [mailto:gward@lmi.net]\nGesendet: Donnerstag, 4. Juni 2009 19:30\nAn: Alexander Utz\nCc: Radiance general discussion\nBetreff: Re: [Radiance-general] Infrared scene simulation\n\nHi Axel,\n\nThanks for explaining your exact problem.  The documentation for\nRadiance is scattered and frequently application-specific.  Did you\nbrowse the \"Seminars and Course Notes\" section of:\n\nhttp://radsite.lbl.gov/radiance/refer/\n\nFrancesco Anselmo's Radiance wiki is also useful:\n\nhttp://www.bozzograo.net/radiancewiki/doku.php\n\nCheck out Axel Jacob's tutorials at:\n\nhttp://luminance.londonmet.ac.uk/learnix/docs.shtml\n\nAs for describing a mixture, you need to use the \"mixfunc\" type.\nCorrecting what you gave in your e-mail:\n\n\nDon't bother dividing the value up, just give it three times:\n\nvoid light bright\n0\n0\n3  146.305 146.305 146.305\n\n\n\nShould be:\n\nvoid plastic brown\n0\n0\n5  .2  .1  .1  0  0\n\nvoid glow bit_of_glow\n0\n0\n4 100 100 100 100\n\nvoid mixfunc brown_glow\n4 brown bit_of_glow 0.5 .\n0\n0\n\nbrown_glow sphere BB\n0\n0\n4  2  1  1.5  .125\n\n--------\nNote that I gave half of each, so their actual values will be reduced\nby 50%.  In some cases,  you may wish to double the parameters to\ncompensate.\n\nCheers,\n-Greg\n\n\n\n______________________________________________________\nGRATIS f?r alle WEB.DE-Nutzer: Die maxdome Movie-FLAT!\nJetzt freischalten unter http://movieflat.web.de\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Alexander Utz", "datetime": "Fri Jun 19 05:06:19 2009"}