{"refs": [], "id": "<BAY2-F100soELCMIAw20003ca44@hotmail.com>", "subject": "[Radiance-general] OCONV Error", "email": "adiance-general@radiance-online.org", "body": "\nDear Group\n\nRecently, I have encountered a problem with OCONV. As a note, I run the\napplicaiton from Windows. I should also note that the scene that I am\nattempting to compile is composed of approximately 200K  non-instanced\npolygons. With the binaries that were compiled for Desktop Radiance, when\nusing oconv, I recieve an error message in a separate dialog box outside of\nthe shell that I am using (CYGIN BASH Shell) that reads, \"Application Error\nThe instruction at \"0x00406266\" referenced at \"0x0796db94\". The memory could\nnot be read. I later decomposed my 1 scene file into 2 separate files. When\nI oconv'ed them separately, there was no problem. When I attampted to\nrecombine them using the -i option, the same error message occured. I then\nattempted to use the latest version of RADIANCE binaries compiled for\nWindows via CYGWIN. Basically the same thing happened as in the Desktop\nRadiance version of the binaries with the exception that instead the error\nmessage being in a separate dialog box, the error was listed in BASH shell\nas \"Segmentation Fault\" with the stackdump listed into a separate file as:\n\nException: STATUS_ACCESS_VIOLATION at eip=0040A1DE\neax=FFD6B441 ebx=FFFF49A2 ecx=0000FFF7 edx=00000177 esi=0000B506\nedi=0005083F\nebp=0022F958 esp=0022F940 program=c:\\Radiance\\bin\\oconv.exe\ncs=001B ds=0023 es=0023 fs=0038 gs=0000 ss=0023\nStack trace:\nFrame     Function  Args\n0022F958  0040A1DE  (0CA52130, 00410460, 00000000, 0CA4D524)\n0022F978  0040A0BA  (0005083F, 0A040824, 0A040824, 610C5D49)\n0022FA38  004039D8  (615F1F08, 0A040824, 0A040824, 00000000)\n0022FE68  00403665  (615F1F08, 610CB320, 610CB320, 00000001)\n0022FEF0  004012D1  (00000006, 615F1F58, 0A040328, 0022FF24)\n0022FF40  61007408  (610D1F58, FFFFFFFE, 00000030, 610D1E7C)\n0022FF90  610076ED  (00000000, 00000000, 80430D77, 00000000)\n0022FFB0  0040EF02  (00401190, 037F0009, 0022FFF0, 77E97D08)\n0022FFC0  0040103C  (0022FAE0, 0022FADC, 7FFDF000, 0022E70C)\n0022FFF0  77E97D08  (00401000, 00000000, 000000C8, 00000100)\nEnd of stack trace\n\n\n\n\nI have not try to oconv't the file with the Linux binaries yet. I wil try to\nthis evening but I am expecting the same error to occur.\n\nFirstly, does anyone know what is causing this problem? I am familiar with\nthe oconv error messages. I know that my error did seize when I broke down\nthe scene file. It seems to me that if I had to many objects, I would\nrecieve the \"Hash table overflow in fullnode\" error message instead of a\nSegmentation fault. Also, for many of you who have much more experience with\nusing Radiance than I do, what would be a good estimate of the maximum\nnumber of non-instanced polygons that could be compiled into an octree\nbefore the \"Hash table overflow in fullnode\" error would be reached.\n\nThanks\n\nMarcus D. Jacobs\n\n_________________________________________________________________\nGet MSN 8 Dial-up Internet Service FREE for one month.  Limited time offer--\nsign up now!   http://join.msn.com/?page=dept/dialup\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Marcus Jacobs", "datetime": "Mon, 29 Sep 2003 16:50:17 +0000"}