{"refs": ["<4A4B2751.5080702@nus.edu.sg> <4A4B472E.8080303@nus.edu.sg>"], "id": "<A386248F36A677429B35C46A6A057CA3010D1B477F98@AUEXC01.global.arup.com>", "subject": "Re: [Radiance-general] SSLD skies and zenith radian", "email": "adiance-general-bounces@radiance-online.org", "body": "\nHi Lars,\n\nThe SSLD creation process is a bit old and clunky.  It does require a few hand calcs and a little interaction with the text file.  It really could be scripted to create it automatically...  One day...\n\nTo start with, you need to know what type of sky you're trying to create, where the sun is, and the direct and diffuse horizontal illuminances.\n\nFor the diffuse sky distribution, step 4 of my old documentation says just put in any old number for the zenith radiance - it doesn't matter what it is at that stage.  That model is then tested and the zenith radiance is altered to create the correct diffuse horizontal illuminance in step 12.\n\nThe ground radiance is found in step 3, requiring knowledge of the global horizontal illuminance and the ground reflectance.\n\nI'll have a search around here for a script that automates the process.  I vaguely remember someone has done this before...\n\nCheers,\nPhil.\n\n\nDr Phillip Greenup\nSenior Consultant - Lighting and Sustainability\n\nArup\nLevel 17\n1 Nicholson St\nMelbourne VIC 3000\nPh +61 3 9668 5669\nwww.arup.com/lighting\n\n\n\n-----Original Message-----\nSent: Wednesday, 1 July 2009 9:23 PM\nTo: Radiance general discussion\nHi,\n\na short update, for now I am dividing the task to set-up a sky into two\nsteps:\n\n1) Create a gensky-description. The zenith radiance as calculated by gensky can be found in the skyfunc definition (it is the third number on the last line of the output, so it can easily be extracted using awk).\nThe horizontal illuminance that is to be found for the ground luminance can be either calculated from the sky model using rtrace, or, for skies WITHOUT sun, be derived by multiplying the \"ground ambient level\" by pi*179. The sun position can also be read from the comment lines.\n\n2) Set-up the ssld-description using the values found in step 1).\n\nMaybe it would be worth to create a script that can do all that (and also set the ssld-coefficients from a look-up table for a given sky type).\n\nCheers Lars.\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] SSLD skies and zenith radianc", "tags": [], "sender": "radiance-general-bounces@radiance-online.org", "datetime": "Wed Jul  1 15:58:01 2009"}