{"body": "\nJack de Valpine wrote:\n<snip>\n\nHi Jack.  Thanks for weighing in.  (and thanks to the others who had\ninput late last week.)  And yeah Jack, I know all about the weather\nyou're having, because we're having some of your Boston-style cold down\nhere in NYC today.  Brrrrrrr!\n\n\n\nYes.  As usual, my questions seem rather stupid immediately *after* I\nask them.  Absolutely right, mine is a process management problem and\ncould be solved just as easily with intelligent scripting over two\nmachines, there's no inherent gain to a dual box except that for one\nsoftware installation I essentially have two cpus available for\nrtrace(s), and of course it's a cheaper way to have two cpus.  I should\nnote at this time that the RedHat installer is busily copying files to\nthe new computer as I type this.  I ended up going with a single,\nprimarily for financial reasons.  But I do appreciate all the info and\nadvice everyone gave me on this list.  Further to that:\n\nWhile it is not clear exactly what the task is, my\n\nYes, it's rather like the directions on the shampoo bottle:  lather,\nrinse, repeat.  Except in my case, it's rtrace (optionally performing\nsome low-resolution rpicts too), increment hour, repeat.\n\nRight now I'm using a modified version of the time-of-day image sequence\nshell script that John Mardaljavec wrote and published in \"rendering\nwith Radiance\".  Mine uses rad instead of calling the rpict directly (at\nleast when I do renderings).  It's still quite basic, but I hope to work\non it some more soon.  Basically I set up a rif file the way I want it,\nand have a file of calculation points for rtrace.  Then I set the\nvariables in the shell script for the particular run (June 21/clear sky\nor Dec 21/overcast sky, etc), and it's off to the races.  If I ask for\nrenderings, the script calls rad and renders an image as well, putting\ntitles on it based on the variables, and \"pcond-ing\" it too.  The data\nfrom rtrace gets \"lam-ed\" to the previous hour's data.  Then the process\nloops around again:  gensky creates a new sky for the next time\nincrement, sed modifies the rif file with new filename prefixes (so we\ncan keep track of everything later), and we go again.  I wanna add stuff\nlike report building, graph generation with gnuplot or somesuch, and a\nhost of other things, but my application for the 36 hour day is\napparently still held up in processing. =8-)\n\nIt's just the sheer number of simulations, and high number of ambient\nbounces that had me looking toward a dual cpu machine.  I see now that I\n*could* still put a dual box to good use (through scripting), but in the\nend economics decided the road I was to travel.  Like I said before, if\nI now buy a second single-cpu box, I essentially have the same\nfunctionality (to me) as a dual box, and I gain redundancy, for just a\nfew more bucks.\n\nMaybe someday I'll need the dual for rpiece, but right now my models are\npretty basic and I'm doing more with numbers than pixels, so...\n\nP.S.\nRHL8 install complete, installer didn't find my NIC.  Sigh.  So close...\n\n----\n\nRob Guglielmetti\n\ne. rpg@rumblestrip.org\nw. www.rumblestrip.org\n\n\n", "replyTo": "", "sender": "Rob Guglielmetti", "isquestion": true, "tags": [], "id": "<3E30743B.5010402@rumblestrip.org>", "refs": [], "datetime": "Thu, 23 Jan 2003 18:01:15 -0500", "email": "radiance-general@radiance-online.org", "subject": "[Radiance-general] multiprocessor systems, Radiance, and you"}