{"refs": ["<7792B71B342F49C38BDBA8683FA0BDD7@micr817p>", "<89355c0f0907160945p25ca271ud6b9af389c2a4b45@mail.gmail.com>"], "id": "<DF4A9C5A0CC2DF438AC1834530C59EE001D66D2E11@MAILBOX1.nrel.gov>", "subject": "Re: [Radiance-general] daylight factor and rtrace cmd", "email": "adiance-general-bounces@radiance-online.org", "body": "\nValere, as Chris and Thomas have mentioned, you want to use the -i option for that field.\n\nHonestly, I've never noticed this -I option before. The man page doesn't mention the 1m offset, either. Frankly, I don't understand the point of this option. If I want irradiance, I usually want it on some surface or virtual plane (a uniform grid on the front of a library stack, for example), and I just make a field of points normal to that surface and use the -i option to compute irradiance at that point. If for some reason I wanted irradiance offset from some surface (dark sky / light pollution calc or something), I would just arrange the points offset from the surface, and oriented at the surface, and still use the -i. What are people generally using the -I option for? I'm curious.\n\nRobert Guglielmetti  IES, LEED AP\nBuilding Energy Efficiency Engineer\nNational Renewable Energy Laboratory (NREL)\n1617 Cole Blvd, MS-5202\nGolden, CO 80401\nrobert.guglielmetti@nrel.gov\n303.275.4319\n\n-----Original Message-----\nSent: Thursday, July 16, 2009 10:46 AM\nTo: Radiance general discussion\nAs Chris wrote, -I implies an observer point 1m above the 'point of interest'.\nBut it also turns around the view vector (your output shows -1.000000e+000).\n\nBasically rtrace introduces a virtual plane of lambertian properties and looks\ndown onto this plane to calculate the irridance from the reflection (which is\nidentical).\n\nThe offset of 1m is only a problem if you want to use the output to anchor\nyour results in a model or if your workplane is close to an obstruction that's\nlower than 1m above the plane. Then the rtrace rays would hit the back\nof the obstruction and not the ideal reflector.\n\nBut then, perhaps Greg has anticipated this case and added some magic to\navoid it ...\n\nThomas\n\n\nOn Thu, Jul 16, 2009 at 5:17 PM, PAUPELIN-HUCHARD\nValere<v.paupelin-huchard@elioth.fr> wrote:\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] daylight factor and rtrace cmd", "tags": [], "sender": "radiance-general-bounces@radiance-online.org", "datetime": "Thu Jul 16 10:01:55 2009"}