{"refs": ["<4a6668a5.1c07d00a.09e3.2718@mx.google.com>"], "id": "<4A667645.7090605@nus.edu.sg>", "subject": "[Radiance-general] Simulating light ray movement inside swimmingpool water. Light sources not in the water", "email": "lars.grobe at nus.edu.sg", "body": "\nHi and welcome,\n\nyou have choosen a difficult topic, as there are many unknown variables\nin what you want to simulate.\n\nBut first of all, what glare are you refering to? Glare caused by\nreflections, which could be experienced by someone next to the pool?\n\nWater could be modeled purely as a dielectric. Mist would show the\neffects of bubbles, small particles, anything that makes the clear water\nbecome somehow misty ;-) So you would have to know whether the water in\nyour pool is perfectly clear (e.g. a diver in it would not see a light\nbeam when you point a strong spot to it), or whether you would expect\nany kind of particles in there (which would make that light beam become\nvisible due to scattering). You may also use mist if there is mist in\nthe air over your water surface due to condensation in the (compared to\nthe water) colder air.\n\nSecond, what is the surface of the water body looking like? On earth,\ndue to gravity, you would expect it to be almost perfectly plane, but\nexperience tells us that there are small waves and such due to air\nmovement, swimmers and such. Unfortunately, the surface geometry of a\ndielectric material has a huge influence on how you perceive it. So you\nwould need to know the shape of the water surface in order to simulate\nit. If you go into this, the photon mapping extension may be valuable,\nas it can show caustics as you would see them under a wavy water surface\non the ground of the pool.\n\nCheers, Lars.\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: lars_grobe.vcf\nType: text/x-vcard\nSize: 299 bytes\nDesc: not available\nUrl : http://radiance-online.org/pipermail/radiance-general/attachments/20090722/8134bb3f/lars_grobe.vcf\n", "isquestion": false, "replyTo": "<4a6668a5.1c07d00a.09e3.2718@mx.google.com>", "tags": [], "sender": "Lars O. Grobe", "datetime": "Tue Jul 21 19:15:41 2009"}