{"body": "\nHi Lars,\n\nJust finished with the Radiance workshop, so catching up on e-mails.\nThis is an interesting thread...\n\n\nThe \"glow\" type with an effective radius still illuminates the scene\ncorrectly.  Base your radius on the distance over which you expect\nyour sources to be important.  Past that distance, they will be\nconsidered as \"indirect\" sources.  One important caveat:  the smaller\nand brighter they are, the more artifacts you will see from them if\nyour radius is too small.\n\nAnother tip to reduce calculation time if you are using a recent\nversion of Radiance (3.6 or later) is that large surfaces in the main\noctree will be tracked in the shadow cache.  Neither instances nor\nmeshes will work as obstructors, so if you must instantiate geometry,\nleave at least some large occluders in the main octree to help in the\nshadow cache.\n\n\nIt's a curious idea.  I'm not sure whether or not it will help, but\nI'd love to see the results.\n\n\nThere is no such hack.  It's not really physical, is the problem.\n\nOne other note -- you might try setting -ar 0 in your case.  If you\nhave really large and small geometry that require enormous -ar\nsettings, you may be better off without it.  Alternatively, you can\ntry excluding your ground plane from the indirect calculation with a -\nae option.  You can have a close-up ground plane that you include to\ncatch the indirect from the building, then forget it outside a\ncertain distance.  This will avoid the placement of excess indirect\nvalues where nothing really is going on.\n\n-Greg\n\n", "replyTo": "Subject: [Radiance-general] ambient resolution and memory", "sender": "Gregory J. Ward", "isquestion": false, "tags": [], "id": "<766CA576-5B55-4012-8E33-AB76EE85106A@gmail.com>", "refs": ["<4506A61F.4000305@gmx.net> <4508428A.2000203@visarc.com>", "<450A5276.8010201@gmx.net>"], "datetime": "Fri Sep 15 11:52:57 2006", "email": "gregoryjward at gmail.com", "subject": "[Radiance-general] ambient resolution and memory"}