{"refs": [], "id": "<4A684BC7.8030705@gmx.net>", "subject": "[Radiance-general] pmap, mkillum and photon ports", "email": "grobe at gmx.net", "body": "\nHi all,\n\nI just want to share my experiences with the pmap for radiance 3.7p2,\nthe use of photonports and mkillum. Maybe it is interesting to someone\nhere, and maybe I even get some comment on what I am doing ;-)\n\nFirst, to introduce, the problem with the pmap is that, for large angle\nsources, it is only performing well when used with photon ports. The\ndrawback of photonports is, that no interreflection calculation happens\noutside the port. That means that, when modeling a simple room with a\nwindow, only unobstructed parts of the visible environment contribute -\nbuildings, ground planes etc. do not contribute any reflected illuminance.\n\nTo solve this, I played a bit with the combination of pmap and illum\nsurfaces. Carsten did that before, but with a different scene, different\nset-up and different goals. To get the indirect component of light flux\ninto my photon ports, I have to place my illums outside the ports, so\nthat they become (unobstructed) light sources accounting for the light\nreflected from outside geometry.\n\nI have set up a simple scene as follow: a room 10mx10mx5m, with its\nfloor level at +5m. In the floor of that room, a hole of 5mx5m (pointing\nDOWN!). At -1m, a ground geometry (disk, diameter 50m). A photon port in\nthe 5mx5m hole. And five mkillum-surfaces, again 10mx10mx5m, so the\ngeometry of the room mirrored over the rooms floor. This means that the\nbottom mkillum surface is located at +-0m, just 1m above the the ground\ndisk. This bottom surface is generated by gensurf, and is actually an\narray of 20x20=400 squares of .5mx.5m each.\n\nI place a view at 0,0,5.1 (10cm above the photon-port), pointing\nupwards, using vth-fisheye view type with 180 degree vertical and\nhorizontal. And now I render four images and sum up all pixel values for\neach image:\n\nscene classic (no illum, no pmap, ab 10): 1180668\nscene with pmap (no illums, but also no photonport): 1013533\nscene with illums (no pmap): 1522379\nscene with illums and pmap: 1695772\n\nmkillum was started with default values and -ab 10. Rendering with\nphotonport and without mkillum does not really work, as the port does\nnot see a light source.\n\nSo for now, the result is that, as long as mkillum is involved, the\nresults are pretty stable. I would not call the two results close, but\nat least they have similar scales ;-) Having the two pixel value sums\nfor the runs without mkillum being that much lower, I got worried\nhowever. Would I have to set much higher ambient parameters, or is there\nsomething wrong in my set-up? Is the use of exterior mkillum-koffers\nallowed?\n\nCheers, Lars.\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Lars O. Grobe", "datetime": "Thu Jul 23 04:38:51 2009"}