{"refs": ["<4a673c26.1818d00a.7ebb.ffffbb30@mx.google.com>", "<4A67C982.5090409@gmx.net>"], "id": "<4a684d00.0508d00a.0738.ffffc785@mx.google.com>", "subject": "Re: [Radiance-general] Simulating light ray movement insidswimming pool water. Light sources not in the water", "email": "adiance-general-bounces@radiance-online.org", "body": "\nHello Lars,\n\nIt would be great to run the simulations with moving water surface but since\ni want to compare the simulations with the measurements it would be\ndifficult to create similar conditions in the real pool. Your suggestions\nwere very useful though and i will start working immediately with a simple\nmodel to understand how it works and eliminate possible problems that may\ncome up.\n\nThanks again\n\nSotiris\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of Lars O.\nGrobe\nSent: 23 July 2009 03:23\nTo: Radiance general discussion\n\nHi!\nWow, this sounds like a not so trivial problem... ;-) I think you need\nfirst to study on what surface shapes to expect. On a perfectly even\nsurface, you could easily look through to the ground, as long as you do\nnot hit the total reflection by very low angles. But as the lifeguard\nwill usually be interested in the pool when there are occupants, the\nsurface will not be a plane any more, but wavy. And now everything\ndepends on the shape - having big, smooth waves will allow good view,\nbut small wrinkly waves (ok, here I hit the limits of my English\nlanguage skills) would cause a lot of reflections by total reflection,\nand at the same time caustics resulting in uneven illuminances on the\nground. If you are able to model the water surface geometries which you\nneed to consider, it will be possible to make some estimates on\nvisibility of anything below the surface. There are two ways afaik, one\nbeing rtcontrib, the other one pmap. rtcontrib comes with recent\ndistributions, but is not really documented. pmap comes with a nice\ndocumentation, but is currently supported only with radiance 3.7.\n\nBy the way, I think there are two effects to consider. One is glare.\nEven more important may be the total-reflection that simply does not\npermit you to look through a water-air interface (aka the water surface)\nunder narrow angles, with or without glare. Glare alone might render the\ntask of the lifeguard tiring, but non-visibility renders it impossible...\n\nCheers, Lars.\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n", "isquestion": false, "replyTo": "<4A67C982.5090409@gmx.net>", "tags": [], "sender": "adiance-general-bounces@radiance-online.or", "datetime": "Thu Jul 23 04:44:07 2009"}