{"refs": ["<4A82798E.7030908@gmx.net>"], "id": "<A386248F36A677429B35C46A6A057CA3010D2EF61220@AUEXC01.global.arup.com>", "subject": "[Radiance-general] Using SSLD skies with sun", "email": "adiance-general-bounces@radiance-online.org", "body": "\nHi Lars,\n\nThe SSLD sky generator creates a diffuse sky distribution.  If you don't put a sun in there, there won't be one.  If you're sky model involves a diffuse sky that is brightest in the sun direction, but the sun itself is not directly visible, then you'll just need to ensure you get the diffuse horizontal illuminance you're looking for (and that's the hard part - what should the diffuse horizontal illuminance be?).\n\nSo you won't end up with two sun definitions.  And you control the diffuse and direct components of global horizontal illuminance.  If the sun is not visible, it shouldn't be in the model, the direct illuminance component will be zero and the global will equal the diffuse illuminance.\n\nThis is assuming you are using my old SSLD sky generator / cal file.  Could be a different story if you're using something else?\n\nCheers,\nPhil.\n\n\n-----Original Message-----\nSent: Wednesday, 12 August 2009 6:13 PM\nTo: Radiance general discussion\nHi,\n\nI know that not many here use the SSLD skies, but maybe one or another\nhas a comment on it...\n\nI am currently using gensky to find the brightness levels and sun\nposition required to use the SSLD skies. Now I am wondering whether this\ncombination hides some risks.\n\nFirst, when I add a gensky-sun to the ssld-sky, in my understanding this\nshould not change the horizontal illuminance but be kind of a technical\noptimization, replacing the bright glow spot where the sun is seen by a\nsource of type light, thus making sure that shadow-test actually hit it.\nThis would require the flux of the sky (glow) part to be covered to be\nthe same as the flux of the sun light source.\n\nSecond, gensky manipulates the sun position when coming close to the\nzenith and sets it to 87.5 altitude. I am in a tropical country, where\nthis 90 degrees can be reached. In such a case, I would have two suns in\nmy sky definition - the one in the ssld glow source (at 90 degree) PLUS\nthe gensky light source at 87.5 degree, right?\n\nI am just trying to debug my sky setups, so any comments are appreciated :-D\n\nCheers Lars.\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Using SSLD skies with su", "tags": [], "sender": "radiance-general-bounces@radiance-online.org", "datetime": "Wed Aug 12 01:23:07 2009"}