{"refs": [], "id": "<200908132305.n7DN5MFH028249@smtp8.server.rpi.edu>", "subject": "[Radiance-general] Shadow above highlight?", "email": "schwaj3 at rpi.edu", "body": "\nWow, reducing the -as to 0 seems to have relieved the problem. I had no\nidea that they don't shoot directly up (I had guessed it might have been\nsomething along those lines, but couldn't track it down).\n\nThe RwR book seems to suggest that you use a -as equal to 1/4 your -ad,\nso I can't imagine that reducing the -as to 0 should be the correct\nsolution... Perhaps the model I am using simply exacerbates this issue?\n\nCould you explain when it's reasonable to use -as 0 and a large -ad, as\nopposed to the values recommended in the book? Does it depend on the size\nof the highlight on the floor (smaller = more/less -as  )?\n\nNaturally like you suggested Andrew, this model is much faster to do with\nradiosity. It's really just a test model, and naturally more complex\nmodels would have to be used. However after I saw this, I naturally\ncouldn't proceed with image comparisons until I figured out what I was\ndoing wrong! As you've probably seen, I've sent out the scene, so if you\nhave any further insights, especially into what rpict options I should be\nusing, do tell.\n\n--John Schwartz\n\n==============Original message text===============\nOn Thu, 13 Aug 2009 18:01:09 EDT Andrew McNeil wrote:\n\nJohn,\n\nI'd also like to see your scene, but while I wait I'll go out on a limb:\nAFAIK in radiance, an ambient sample ray is never emitted normal to a\nsurface.  I suspect your shadow results from the (slightly) decreased\nprobability of sampling the highlight from the area directly above the\nhighlight.  This effect can be compounded by the -as setting (which never\nsamples the upper edge of a division, but can sample the lower edge of a\ndivision).\n\nMy suggestion: try a high ad value coupled with no ambient super samples.\n-ad 20000 -as 0\n\n\nAs far as your comparison between raytracing and radiosity, You pick a scene\nthat plays to all the strengths of radiosity.  Radiosity with a dense mesh\nproduces a highly accurate result in relatively little time for scenes that\nhave very simple geometry and are limited to completely diffuse reflection\nand completely specular transmission.\n\nIf you had semi-specular reflection, semi-diffuse transmission or complex\ngeometry raytracing is more likely to result in higher accuracy in less time\nthan radiosity.\n\nAndy\n\n\n\nOn 8/13/09 1:58 PM, \"Greg Ward\" <gregoryjward@gmail.com> wrote:\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n\n\n===========End of original message text===========\n\n\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "schwaj3@rpi.edu", "datetime": "Thu Aug 13 16:05:32 2009"}