{"refs": ["<200908132305.n7DN5MFH028249@smtp8.server.rpi.edu>"], "id": "<39F7679C-0DCF-4647-8877-5AF69D3D74FF@lmi.net>", "subject": "[Radiance-general] Shadow above highlight?", "email": "gregoryjward at gmail.com", "body": "\nHi John,\n\nI spent a little time looking at your model, and there are some\nirregularities that I'm not sure are intentional.  Specifically, I\nrendered a view from the darker region of the ceiling looking down\nlike so:\n\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: from_ceil_ab2.jpg\nType: image/jpeg\nSize: 14446 bytes\nDesc: not available\nUrl : http://radiance-online.org/pipermail/radiance-general/attachments/20090813/83904086/from_ceil_ab2-0001.jpg\n-------------- next part --------------\n\n\n\n(apologies for breaking my own rule about not attaching images, but\nI'm in a rush and I shrunk it down quite a bit)\n\nThe light patch is the one seen at the bottom of your original view,\nbut the dark patch below it (actually towards the camera in your first\nview) is peculiar.  It appears to be an opening, where light goes but\ndoes not return.  Was this what you meant to do?  Are you radiosity\ncalculations OK with this?  Infinite rays may cause some oddities in\nthe interpolation, which I think is at least part of what we are\nseeing in the 10-20% level drop in the dark patch on the ceiling.\n\nSetting -aa 0 reduces this problem considerably, since it turns the\nindirect interpolation off altogether, but something is noticeable\neven so.  (I suggested setting -aa 0 in my first reply by the way -- I\nthought you had tried that.)  The only way to get rid of the dip\nentirely is to set -as 0 as well.  You may have to increase -ad at the\nsame time.  Let's explain why this is so...\n\nThe -as samples are sent only to those places where Radiance\ndetermines there is significant variance.  If you don't send out\nenough initial samples, then the additional samples may not go where\nthey need to.  The polar region is doubly-cursed with respect to the -\nas setting, because the sampling density is low at the zenith AND\nthere is no check for \"over the top\" differences.  Thus, the zenith\nregion tends to be underestimated if all the variance is there.\n\n-Greg\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Shadow above highlight?", "tags": [], "sender": "Greg Ward", "datetime": "Thu Aug 13 16:44:56 2009"}