{"body": "\n\nNick.\n\nI've done that a evaluation of that sort of calculation\na while ago.\n\nIf you use rtrace you will get a reference value from\nthe horizontal plane calculation. You don't need to create\na new model for that, just select a point higher than the\nscene geometry. This reference value is your 100% VSC.\nYou have to normalise the results of your window calculations\nto that value.\n\nYou can also specify a sky with a nice diffuse illumination\n(say 10000 lux, gensky option '-B 55.866') and use the\nresults of the following rtrace calculations directly.\n\nFor the model setup:\na) use a 0% reflectance for the geometry in your scene\nno ground glow or a black ground plane\n\nor b) use only one bounce (-ab 1) for the rtrace\ncalculation (you need that one bounce because rtrace\ncreates a virtual plane at the sample point and\ncalculates the light falling on that plane)\nYou still have to eliminate the ground glow.\n\nBecause you have a low '-ab' you can increase '-ad'\nquite a bit to suit your geometry details.\n\nIf you want to verify your methods, you can calculate\nthe geometric obstruction of a simple setup (like a\nstraight wall) according to established methods and\ncompare that to your Radiance calculations.\n\nYou still have to create an input file for rtrace\nthat contains all the centre points of the windows\n(outside wall surface). Getting those will be the\nmost time consuming task.\n\nHTH,\nThomas\n\n\n\n***********************************************************************************\nThis e-mail, (and any attachments) is confidential and may be privileged.  It may be read, copied and used by the intended addressee only.  If you have received this in error please contact BDP immediately.\n\nIf you have any queries, please contact the sender.\n***********************************************************************************\nBuilding Design Partnership\nRegistered in England No 2207415:\nRegistered Office: Building Design Partnership Ltd, Sunlight House, PO Box 85, Quay Street, Manchester, M60 3JA, http://www.bdp.co.uk\n***********************************************************************************\n\n", "replyTo": "", "sender": "Bleicher, Thomas", "isquestion": true, "tags": [], "id": "<FCCB55B3313F2341AB3C91810FE1166B013E520E@ln-s3xch1.bdp.holdings.network>", "refs": [], "datetime": "Fri Sep 22 15:02:26 2006", "email": "T-Bleicher at bdp.co.uk", "subject": "[Radiance-general] BRE Vertical Sky Component Calculations"}