{"body": "\nHi Greg,\n\nno problem, it's allright with me :-) (I caught that phrase once in a\nPhillip Marlowe movie ..)\n\nThe whole Radiance suite is simply too inspiring not only in terms of\napplication, but also in terms of experimenting with the code base and\nwith modifications and addons, as to leave all these paths untreaded.\nBut I couldn't agree more that all this must not have an influence on\nthe reliability and validation of the original code base.\n\nAnd the whole point of physically realistic simulation definitely is not\nan easy one, I don't mean the technical/software part right now, but the\nexpectations it can generate on the users side. Ok, everyone knows the\nphrase 'garbage in, garbage out', but in reality life isn't that simple.\nThere are a lot of different steps between 100% rubbish and 100%\naccurate, and accuracy itself is a relative term, accurate with respect\nto which criteria? And sometimes it occurs to me like a two sided medal,\nwhat makes Radiance so unique and useful in many fields of application,\nmakes it also unnecessarily difficult and restraint in other cases,\nespecially for those applications it wasn't made for originally :-),\nregardless of the fact that it is nevertheless used for them. And that's\nthe interesting point then, stepping further or in different directions\nwithout losing the contact to the roots.\n\n\nmany greetings\n-Carsten\n\nPS: Thank you for appreciating the radzilla branch. I mean, without your\nwork this would not be possible :-). The latter is evident of course,\nbut still worth to be mentioned.\n\n\n--\n---------------------------------------------------------\n\n\"Der Deckel mu? zugehen.\"    (P.K?lsch)\n\n---------------------------------------------------------\n\n", "replyTo": "Subject: [Radiance-general] ambient resolution and memory", "sender": "Carsten Bauer", "isquestion": false, "tags": [], "id": "<450B4653.5030302@cb-d.de>", "refs": ["<4506A61F.4000305@gmx.net>\t<4508428A.2000203@visarc.com>\t<450A5276.8010201@gmx.net>\t<766CA576-5B55-4012-8E33-AB76EE85106A@gmail.com>\t<450A8D8A.3010800@gmx.net>", "<39E360E1-F9A4-45EE-AB5F-357C6F2FC928@gmail.com>"], "datetime": "Sat Sep 16 02:33:28 2006", "email": "captainb at cb-d.de", "subject": "[Radiance-general] ambient resolution and memory"}