{"body": "\nHi Greg!\n\n\nI am curious to hear about it, will there be a documentation cd\navailable again? Hope ou had a nice time.\n\n\nI will hide it behind an illum. The configuration is as follows: I group\nmy (artificial) light sources and define one illum sphere per groups of\nsources. That way, first I will have much less sources in the indirect\ncalculation, and second avoid these artefacts. Actually I was not aware\nabout the advantage of using glow instead of light modified sources. The\nactual sources are small oil lamps, which I expect to be effective only\nindirect a groups - the room is too large compared to the lamps.\n\n\n;-) Do you know my model that well? Thank you, this may help a lot. My\nmodel is build up in a hierarchic way, with the top elements often being\ninstances. Maybe I should even accept overlaps just to get some\noccluders without changing the model too much. If I keep the visible\ngeometry in instances, but have some large faces in the main octree a\napproximations to these main elements, which are invisible because\ncompletely covered by the instances' geometry, should I expect some\nperformance gain from the shadow cache?\n\n\nI will try it. I think it highly depends on the point of view related to\nthe scene, but in my case it may help (important viewpoints all in\ncentral hall-like room, window openings mainly in adjacent\naisles/galleries etc).\n\n\nYes, but it is useful to exclude patterns and textures from the ambient\nand stay with the base modifier.\n\n\nI was at around 2000, I will try 0 now.\n\n\nThere is none. I use the sky/ground-sphere only. It is the building's\ndimensions related to its details.\n\nThank you for your help! CU Lars.\n\n\n", "replyTo": "Subject: [Radiance-general] ambient resolution and memory", "sender": "Lars O. Grobe", "isquestion": false, "tags": [], "id": "<450A8D8A.3010800@gmx.net>", "refs": ["<4506A61F.4000305@gmx.net>", "<4508428A.2000203@visarc.com>\t<450A5276.8010201@gmx.net>", "<766CA576-5B55-4012-8E33-AB76EE85106A@gmail.com>"], "datetime": "Fri Sep 15 13:25:05 2006", "email": "grobe at gmx.net", "subject": "[Radiance-general] ambient resolution and memory"}