{"refs": ["<005601ca458c$5cb7fc60$1627f520$@com><F65C1ECF836F09418EBE88D3E33A8D2D054AEEBA@eurxmb06.global.arup.com>\t<006901ca45a4$c91d1580$5b574080$@com>\t<F65C1ECF836F09418EBE88D3E33A8D2D054AF014@eurxmb06.global.arup.com>", "<007901ca45ac$6cfe7f70$46fb7e50$@com>"], "id": "<4AC9EBAA.2060704@visarc.com>", "subject": "[Radiance-general] Help on BRTDfun", "email": "jedev at visarc.com", "body": "\nHi Jun and Erik,\n\nTo clarify a bit. The radiance material descriptions exported from\nOptics 5 are as follows:\n\n* front side as BRTDfunc\n* back side as BRTDfunc\n* glass\n\nThe front and back descriptions use a simple version of BRTDfunc, simple\nin that they do not call any functions for additional calculations that\nwould help account for angular dependencies for transmittance and\nreflectance. However they do start to capture higher reflectance\nqualities of certain types of glass. The glass material will account for\nthe transmittance (transmissivity) of the material but will not account\nfor higher reflectances and differing front and backside reflectances.\n\nBRTDfunc is a full material in Radiance, thus like a glass, plastic,\nmetal, etc material type, it can be applied directly to geometry. The\ndownside of the BRTDfunc descriptions exported from Optics is that they\ndo not account for angular dependencies found in glazing materials for\nreflectance and transmittance, to do this you need to do a bit more\nconversion. To have a material description that integrates both front\nand back side characteristics as well as accounts for angular\ndependencies, there are two ways to go:\n\n1. optics2rad - converts the radiance format file output from optics\nto a more robust BRTDfunc material description.\n2. glaze - look at the glaze script for building up material\ndescriptions for different types of glass. Note that this can be\nmodified to include data for other glass types that you may export\nfrom Optics (these must be exported as single layers, not composites).\n\nHope this helps.\n\n-Jack de Valpine\n\n\n\nEdilberto Calixihan wrote:\n\n\n--\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20091005/6daa5e83/attachment-0001.htm\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Help on BRTDfunc", "tags": [], "sender": "Jack de Valpine", "datetime": "Mon Oct  5 05:51:41 2009"}