{"refs": [], "id": "", "subject": "Re: [Radiance-general] getting irradiance from source defined in photometric units", "email": "\"Lars O. Grobe\"", "body": "Message-ID: <C6F37FD1.D66%robert.guglielmetti@nrel.gov>\n\nHi Lars,\n\nlamp.tab provides information to adjust the lamp chromaticity and apply a lamp lumen depreciation factor based on the source type. Up until now, I always thought using -t white for all sources in the scene was safer (OK, easier) because I like to roll in my lamp lumen depreciation factor with all the other things that go into a total light loss factor (LLF). I consider lamp lumen depreciation, luminaire dirt depreciation and room surface dirt depreciation, maintenance factor, and the product of all those is the LLF, which I apply all at once with the -m option of ies2rad. This was my main rationale for using -t white for all sources, but also the distinct coloration of the different sources was a problem. I forgot that you could white balance the image after the fact with pfilt, though, which leads me to my next rabbit hole:\n\nGiven that one can do a final white balancing after the fact, it does seem that we should be striving for maximum accuracy with our electric light source descriptions and specifying the lamp type/color. Just playing with the lampcolor script, I get some different luminances by changing the lamp type. I used white, incandescent, and fluorescent, and spread 200 lumens over a 1 meter polygon, and ended up with 63.7, 60.5, and 54.1 cd/m^2 respectively. Since lampcolor uses the same lamp.tab data file as ies2rad does, we can expect similar variation in light sources created using ies2rad and using different lamp types. Seems like a potential for error to me, but then again obtaining accurate CIExy data and lumen maintenance values for all the new lamps coming out seems a bit daunting too. Is this splitting hairs? I'm curious what others in the community are doing in this regard.\n\n--\nRobert Guglielmetti  IES, LEED AP\nBuilding Energy Efficiency Engineer\nNational Renewable Energy Laboratory (NREL)\n1617 Cole Blvd, MS-5202\nGolden, CO 80401\nrobert.guglielmetti@nrel.gov\n303.275.4319\n\n________________________________\nReply-To: Radiance general discussion <radiance-general@radiance-online.org>\nTo: Radiance general discussion <radiance-general@radiance-online.org>\nJack de Valpine wrote:\nI hope not ;-) Still, I am not really sure whether I am doing right...\nDoes anyone know whether the lamp,tab-lookup done by ies2rad also\naccounts for the luminous efficacy of a source? This would be required\nto get correct radiance values for rgb from the candela-distribution of\na source. I would e.g. assume an efficacy of 100lm/W for my source, and\nif ies2rad would use 179 instead, the radiance values in my simulation\nwould be by far too low...\n\nCheers, Lars.\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n", "isquestion": false, "replyTo": "<4ACDD260.2060100@gmx.net>", "tags": [], "sender": "grobe@gmx.net", "datetime": "Thu, 8 Oct 2009 05:52:00 -0600"}