{"refs": ["<C6F3BA96.D80%robert.guglielmetti@nrel.gov>,", "<4AD0AFEC.4080409@gmx.net>"], "id": "<DF4A9C5A0CC2DF438AC1834530C59EE008269E0FD5@MAILBOX1.nrel.gov>", "subject": "Re: [Radiance-general] getting irradiance from source  defined inphotometric units", "email": "adiance-general-bounces@radiance-online.org", "body": "\nHi Lars,\n\nI'm a little hazy on a couple of your questions. When you say \"used a WHITE keyword in your IES\", do you mean using the \"-t white\" option in your ies2rad command, or actually adding a keyword to the ies file? Because ies2rad ignores the keywords in the ies file (as well as # of lamps and lumens/lamp entries); it simply reads the luminous distribution and intensity and makes an appropriate .rad and .dat file set for use in Radiance.\n\nNow, what do you mean by \"line spectrum\"? Christopher gave a good summary of the issues with using ies data to create valid radiometric light source descriptions with ies2rad. In short, source efficacy was already taken care of when the luminaire was photometered, since the measured data is in photometric units (cd). ies2rad merely translates the candela values from the ies file to correct rgb radiance values for use in Radiance. As I mentioned, I did a quick test with different sources from lamp.tab, and the radiance values spit out by lampcolor, when weighted by V lambda, were different, but the differences exactly matched the lumen depreciation factor applied for that particular light source (as defined in lamp.tab).\n\nI guess I'm mainly concerned with photometric quantities so I may be misunderstanding your concern. What exactly are you trying to model?\n\n- Rob\n\n________________________________________\nSent: Saturday, October 10, 2009 10:01 AM\nTo: Radiance general discussion\nHi!\n\n\nHm, would that reflect the photometry to radiometry conversion in the\ncase of a source with line spectrum? I would have usually done the same,\nand used a WHITE keyword in my IES. However, I am not sure about the\nconversion of a source with a non continous spectrum to radiometric\nunits (which is what I need). I had been hoping that the lamp-lookup in\nies2rad might care about this.\n\nCheers, Lars.\n\n", "isquestion": false, "replyTo": "<4AD0AFEC.4080409@gmx.net>", "tags": [], "sender": "radiance-general-bounces@radiance-online.org", "datetime": "Sun Oct 11 12:04:58 2009"}