{"refs": [], "id": "", "subject": "Re: [Radiance-general] getting irradiance from source defined  inphotometric units", "email": "Thomas Bleicher", "body": "Message-ID: <C6F8A446.DD6%robert.guglielmetti@nrel.gov>\n\nHi Thomas,\n\nTwo words: \"my bad\". You are absolutely correct; if left to its own devices, ies2rad will scan the header lines for a lamp type and look for a match in the lamp.tab. Sorry about that! I guess I forgot about that option because it seemed so random I never understood why anyone would want to leave it up to such a potentially unreliable method, and have defaulted to using the -t option to explicitly specify my lamp types. Indeed, Greg notes in the manpage, regarding the whole [LAMP] header:\n\n\"This method of assigning colors to fixtures is less than perfect, and the IES would do  well to  include  explicit  spectral information somehow in their specification.\"\n\nIn any event, I apologize for the mis-information. If you ask me, I feel like this is one more reason to always use the -t option.\n\n\n________________________________\nReply-To: Radiance general discussion <radiance-general@radiance-online.org>\nTo: Radiance general discussion <radiance-general@radiance-online.org>\nHi Rob.\n\nOn Sun, Oct 11, 2009 at 7:15 PM, Guglielmetti, Robert\n<Robert.Guglielmetti@nrel.gov> wrote:\n\nThat's not quite correct. ies2rad looks at the [LAMP] entry and\ntries to match an entry in lamp.tab to the string found. Mostly\nthat doesn't work because there is no standard in naming lamp\nsources. The few matches I remember were accidental.\n\nIt's better to specify the lamp type on the command line even\nif you're not actually interested in the light color. I even thought\nabout patching ies2rad to make the WHITE type the default and\nskip the lookup altogether. That would garantee a predictable\nconversion.\n\nRegards,\nThomas\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n", "isquestion": false, "replyTo": "<89355c0f0910120136o456776c7o630bd12f16734f79@mail.gmail.com>", "tags": [], "sender": "tbleicher@googlemail.com", "datetime": "Mon, 12 Oct 2009 02:36:48 -0600"}