{"refs": ["<4AD25E0E.10900@gmail.com>"], "id": "<91E51F7F4028B54D81D0032C591A222235EFD707F4@MAILBOX1.nrel.gov>", "subject": "[Radiance-general] rsensor file forma", "email": "adiance-general-bounces@radiance-online.org", "body": "\nHi Axel,\n\nThis is a timely question. Zack and I are going to give a review of rsensor at the Radiance Workshop and I need to refresh on these issues anyway. SPOT includes spatial sensitivity files for the sensors tested in the NLPIP report you referenced, so you can download the program and take a look at the files and implementation - if you haven't already.\n\nAnswers to your specific questions:\n\na) and b) For the comparison you want to do, the values would be relative sensitivity - relative to a cosine response with maximum of 1 as you described. This would allow the result with a cosine distribution to be computed as illuminance depending on parameters and the result with any other file to be \"signal\" relative to illuminance. For the NLPIP report, the zero azimuthal direction (view up vector) coincides with a prominent feature on the photocell housing, such as an arrow. This is probably not clear for all sensors tested.\n\nc)I might be misunderstanding the question but you should just multiply the sensitivity values by 2 if you want double the signal. This will increase the volume by 2^3 but is not used to scale the sensitivity file.\n\nremainder) Good point about file format. I think the answer is that Greg developed rsensor for AEC/SPOT and AEC received the sensitivity files from the LRC in the format shown in the manpage. So it is not really a SPOT format as much as it is testing output. Ian Ashdown is proposing an extension to IESNA LM-74-05 to give a formal definition for photosensor test reporting. I am unsure of the status of this right now. Assuming this gets published then maybe a parallel or extension to ies2rad makes sense. Other comments, Zack or Greg?\n\n\nI hope this is helpful,\n\nJennifer\n\n-----Original Message-----\nSent: Sunday, October 11, 2009 4:37 PM\nTo: radiance-general@radiance-online.org\nI have just measured the spatial response of some of our photocells and\ndiscovered some rather serious deviations from the standard cosine response.\n\nI am looking at the new rsensor tool to model this response, so I can\nestimate the errors compared to a proper cosine-corrected cell for\ncertain configurations. However, the sensor format is not entirely clear\nto me.\n\na) What are the units in the sensor file? Is it normalised to anything?\nAn IES data file, for instance is normalised to 1000lm.\n\nb) What would the sensor file for a normal, cosine corrected illuminance\nmeter look like? Does it need to have its maximum at 1.0 for an angle of\n(0,0)?\n\nc) Suppose I wanted to model an illuminance meter that has a correct\ncosine response, but gives a reading twice as high as is should be.\nWould I need to multiply the values from b) by the cube root of 2? Cube\nroot because the overall response appears to be proportional to the\nvolume contained within the 3d shape of the curves.\n\nd) After a bit of googling around, I found this page:\nhttp://www.lightingresearch.org/programs/nlpip/publicationdetails.asp?ID=916&type=1\n\nWhich appears to be the photosensor report referred to on the SPOT web\nsite. The NLPIP don't seem to make suggestions about the actual file\nformat for electronically transmitting the spacial response (or any\nother photocell characteristics for that matter). I am therefore\nwondering why the rsensor data file is what it is. It seems that the\nstandard Radiance data file would have been sufficient to describe the\nsensor's characteristics. What is the advantage of using the SPOT\nformat? Why not have a spot2rad (similar to ies2rad) import filter instead?\n\nExample:\n\nThe example from the rsensor man page:\ndegrees   0    90   180  270\n0    .02  .04  .02  .04\n45   .01  .02  .01  .02\n90   .001 .002 .001 .002\n\nAs a Radiance dat file, this would look like (I think):\n2\n0 270 4\n0 90 3\n.02 .04 .02 .04\n.01 .02 .01 .02\n.001 .002 .001 .002\n\nMany thanks for sharing your thoughts\n\nAxel\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] rsensor file format", "tags": [], "sender": "radiance-general-bounces@radiance-online.org", "datetime": "Mon Oct 12 12:37:04 2009"}