{"body": "\nHi Rob,\n...\n\n+ compile changes - most certainly not (Greg relies on the general idea\nof copy-on-demand page reuse for standard fork/exec, that seems to work.\nI'm not a system guru, maybe threading would be better for whatever\nreasons) . There's no general, UNIX internal, way to present two CPUs as\none to a program. Except PVM (parallel virtual machine) or other\nlibraries (which are operating in user space and not kernel space, if\nI'm correctly aligned). LBNL had a project which extended Radiance for\nthat, - don't know if and when that gets merged back into mainstream\nRadiance.\n\n+ Linux distributions - Slackware 8.0 seems ok (gcc version 2.95.3,\n/lib/libc-2.2.3.so), if others experienced problems, I'd suggest adding\noutput of (\"gcc -v\" and \"ls -la /lib/libc*so\", maybe more)\n\n+ MP hardware - dual PIII/1Ghz on Tyan motherboard, no known problems,\n(dual PII/400 on ASUS had been fine too, some years ago)\n\n+ rpiece/ambient/rpict - rpiece organizes just the rpicts; sharing\nambient values works with rtraces started by hand too. Running two\nrtraces/rpicts on the same octree is memory efficient, as the scenery is\nshared (that's what the earlier \"copy-on-demand page reuse\" yuckspeak\nwants to say). If scene memory is not a limiting factor, I wouldn't care\nhow rendering is organized. Depends on your coding style of shell\nscripts, makefiles, m4 etc.\n\n+ NFS (now, I fear this will haunt me for years) is working between\nslackware boxes if nfs-3 is used. However, I do had weird experiences\nwith lockd/statd on IRIX,HP-UX,Linux over the years, so anyone building\non NFS file locking for commercial work should add a few weeks of\ntesting before going productive with the machines. (file locking is\ncrucial to sharing ambient files via NFS)\n\ncheers\nPeter\n\n--\npab-opto, Freiburg, Germany, www.pab-opto.de\n\n", "replyTo": "", "sender": "Peter Apian-Bennewitz", "isquestion": true, "tags": [], "id": "<3E2735F4.DD1546CC@pab-opto.de>", "refs": [], "datetime": "Thu, 16 Jan 2003 23:45:08 +0100", "email": "radiance-general@radiance-online.org", "subject": "[Radiance-general] multiprocessor systems, Radiance, and youReferences: <3E26E825.4080607@rumblestrip.org>"}