{"body": "\nHi All,\n\nIt's been a bit delayed this year, but I finally put together an\nofficial 3.8 release, with Peter Apian-Bennewitz's help.  There isn't\na lot of new functionality over 3.7, but there are some important bug\nfixes, and I expect this release to be especially stable as it's been\nunder test for many months.  A complete list of changes can be found at:\n\nhttp://radsite.lbl.gov/radiance/refer/Notes/ReleaseNotes.html\n\nThe more significant additions and changes are excerpted at the end\nof this message.\n\nWe have compiled binaries for Linux (Linux Debian Intel, Sarge) and\nMac OS X (10.4 Tiger, Universal PPC/Intel).  Sources and binaries are\navailable from:\n\nhttp://www.radiance-online.org/software\t\t(Freiburg, Germany)\n\nhttp://radsite.lbl.gov/radiance/framed.html\t(Berkeley, California)\n\nIf I get some requests for FreeBSD binaries (please specify version),\nI'll see what I can do.  It should compile without too much trouble\nunder FreeBSD, which is substantially similar to Mac OS X.  Remember\nif you do download the binaries to also pick up the whole\ndistribution and run \"./makeall library\" in the ray directory to\ninstall them.\n\nIf you have time and haven't gotten to it yet, please help us out by\nanswering Peter's online survey:\n\nhttp://www.radiance-online.org/survey1\n\nAs always, let me know if you run into any problems compiling or\napplying the new release.\n\nCheers,\n-Greg\n\n-----------------------------------------------\nChanges since 3.7.2 patch release\n-----------------------------------------------\n\nCreated fieldcomb script to combine alternate fields in a rendering\nsequence.  (Development generously sponsored by Iebele Abel.)\n\nAdded missing preload of mesh objects for more efficient memory use\nduring parallel rendering -- this was a serious oversight.\n\nCreated ran2tiff program to automate exposure setting of animation\nsequences using a moving histogram in combination with pcond, and\nconverting frames to TIFF.\n\nAdded -pj option to vwrays to allow jittering of sample locations.\n\nRearranged struct's for better efficiency on 64-bit architectures.\n\nAdded -i option to rlam so it works with binary input formats.\n\nImproved color scale for falsecolor output.\n\nAdded threshold test for Fresnel approximation to prevent its use\non smooth surfaces with unrealistically low specularities (less than\n1.8%).\nWater has a specular reflectance of 2.1% at room temperture.\n\nRemoved NICE macro settings in rpict and rtrace, which was slowing down\nthe processes under Mac OS X (10.4) by about 60% due to processor\nnapping.\n\nFixed problem in genblinds, where it was generating slats that were too\nwide with the +/-r option.  (Thanks to Helena Buelow-Huebe for\ndiscovering\nthis bug.)\n\nAdded -V option to rtcontrib to report actual contributions, rather than\njust ray coefficients.\n\nFixed problem with large sample sets, so -u+ option now is truly random.\nThanks to Rick Mistrick and Younju Yoon for identifying this problem,\nwhich was related to a poorly designed hash function.\n\nChanged -u+ to be the default setting in rtrace (only).\n\nCreated optics2rad.csh script to convert from Optics 5 material output\nto something correct for Radiance.  Built on old glazing.cal function,\nwhich is actually incorrect so removed from the distribution.\n\nFixed nuisance bug in ximage under some SGI machines that caused it to\nchoose an inappropriate visual and display incorrect colors.  (Thanks\nto Oskar Itzinger for debugging the problem.)\n\nFixed bug related to alias of alias.\n\n****** COMPATIBILITY CHANGE ********\nChanged default sky turbidity in gensky from the original default of\n2.75 to the CIE 110-1994 standard value of 2.45.  Thanks to Marilyne\nAnderson of MIT for pointing out this discrepancy.\n\nAdded -o option to ra_xyze to produce original pixel values.\n\nFixed bug in tracing of virtual sources, where intervening glazing was\nnot being accounted for properly.\n\nAdded -h option to pcompos and pcomb to eliminate verbose headers.\n\n", "replyTo": "", "sender": "Gregory J. Ward", "isquestion": true, "tags": [], "id": "<0DDC274D-9A37-46AE-8CE7-97FE5B188D9D@gmail.com>", "refs": [], "datetime": "Sat Oct 21 02:54:19 2006", "email": "gregoryjward at gmail.com", "subject": "[Radiance-general] Radiance 3.8 release announcement"}