{"refs": ["<e3330ba60910310923s272d5798t8f1913da30ffb79@mail.gmail.com>"], "id": "<7667FBDF-8D5D-431B-80B4-0021F3853F79@rumblestrip.org>", "subject": "[Radiance-general] Radiance installation on Mac OS X 10.5.6", "email": "pg at rumblestrip.org", "body": "\nHi David...\n\nOn Oct 31, 2009, at 10:23 AM, David Appelfeld wrote:\n\n\nInspiring is the word I feel always best sums up these Workshop\nexperiences.\n\n\n\nOK, you actually did double work there. If you downloaded the binaries\nand put them in the proper place(s), and added those places to your\nenvironment, you should already have a working installation of\nRadiance. You ALSO downloaded the source code and did this:\n\n\nHere, you are actually trying to compile the source code -- in\nessence, making your own copies of the binaries you already\ndownloaded. THe reason this didn't work (errors below) is because you\ndon't have a couple of the necessary utilities needed to compile\nsource. I recommend you DO learn to compile from source, since it's\nfairly easy on the Mac and this gives you access to the latest-\ngreatest features of Radiance, some of which were demoed at the\nWorkshop. So, read on...\n\n\nOK, see the error \"make: not found\"? This is telling you that the make\nprogram, which is essential to the entire compilation/installation\nprocess, is not installed on your computer. What you need to do is\ndownload and install the developer tools from Apple's website. It's\ncalled XCode, and it's free, just a hefty download. Head here and grab\nit:\n\nhttp://developer.apple.com/TOOLS/Xcode/\n\nOnce that's installed (and you may need to register on the Apple\ndeveloper website before you can download it, I can't remember), you\nshould make sure you have the latest HEAD release along with the\nsupport files and that they've been unpacked to one \"ray\" directory\nstructure. The instructions and download links for these two files are\nlocated here:\n\nhttp://www.radiance-online.org/software/\n\nScroll down to the section called \"Download newer CVS snapshots from\nthis server\", and grab radiance-HEAD.tgz, and rad3R9supp.tar.gz. Save\nthem in the same directory, and unpack them according to the\ninstructions on that page. Then change to that ray folder, and type\n\"sudo ./makeall install\", give the admin password, and you're off to\nthe races. This process will compile the latest source and install\neverything to the correct locations, overwriting the older binaries\nyou already put in there.\n\nNext step is to --\n\n(Mark Stock just posted the next step (the path stuff); I love this\nlist.)\n\nBTW, I usually put the environment variables in my .profile, but the\ndefault shell on OS X is BASH, so Mark's suggestion will work fine\ntoo. As Mark said, post any other errors or issues here and we'll get\nyou going!\n\n- Rob Guglielmetti\n\n\n\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20091031/5639956e/attachment.htm\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Radiance installation on Mac OS X 10.5.6", "tags": [], "sender": "Rob Guglielmetti", "datetime": "Sat Oct 31 09:45:00 2009"}