{"refs": ["<fdd7db810911231738hf78acakc4bf2a5af647f7f6@mail.gmail.com>"], "id": "<4D16A091CF93B04D91453602000F97C42D5BA2@eurxmb05.global.arup.com>", "subject": "[Radiance-general] Re: Re: Re: Adding the sun to image basedlighting environmen", "email": "adiance-general-bounces@radiance-online.org on behalf of Anne Iversen", "body": "\nHi Anne,\n\nThat could be a problem with the mapping function in your .cal file. To me it seems strange to get 360 degree information only from one image, but I've never used a chrome sphere for ibl. Anyway, it seems strange that the image is white (did you change the exposure) You can check the .cal file to find why is it giving a division by zero, or you can post it to the list?\n\nAlso, note that mksource ignores any local geometry (i.e. it considers only source objects), which makes sense because otherwise you'd have to define the viewpoint origin. That's why it was ignoring the sphere, so you should have no problems now.\n\nHope this helps.\n\nSantiago\n\n\n________________________________\n\nSent: Tue 24/11/2009 01:38\nTo: radiance-general\n\nThanks Lars and Santiago,\nYes you are right, it doesn't make any sense to have the sun at infinite distance outside the sphere of finite distance. And yes, I'll keep it simple, no optimization with mksource at this point ;o).  And a third: Yes - Radiance is tricky, therefore it is so good that this list is active!\n\nHowever, when changing the 'sphere environment' from sphere to source I cannot display my scene any longer. My source description is\nenv_glow source sphereenv\n0 0\n4 0 1 0 360\nThe simulation approach now follows exactly the one in the Image Based Lighting tutorial from Debevec, p. 31, http://www.debevec.org/CGAIBL2/ibl-tutorial-cga2002.pdf. I get a white image and the rvu message:\nrvu: warning - compute error for colorpict \"hdr_env\"\nrvu: Division by zero\nrvu: Division by zero\n\nDo you maybe also have tips on how I can solve this?\nThanks!\nAnne\n\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: not available\nType: application/ms-tnef\nSize: 5769 bytes\nDesc: not available\nUrl : http://radiance-online.org/pipermail/radiance-general/attachments/20091124/504fb6bd/attachment.bin\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "adiance-general-bounces@radiance-online.org on behalf of Anne Iverse", "datetime": "Tue Nov 24 02:08:21 2009"}