{"refs": ["<4524202860667517542@unknownmsgid>\t<89355c0f0911190607v5a7803b9l2f3b4b57656dc8bc@mail.gmail.com>\t<-2159304064395356976@unknownmsgid>", "<89355c0f0911250941q258d19c7n87234e3532892b82@mail.gmail.com>"], "id": "<000501ca6e7e$1a453bc0$4ecfb340$@geissler@intergga.ch>", "subject": "Re: [Radiance-general] \"Sensor Surfaces\"", "email": "adiance-general-bounces@radiance-online.org", "body": "\nThomas\n\nthat script-solution sounds quite interesting and what you describe as what\nyou did with it sounds more like what I am looking for. The multitude of\npossible switches for rtrace is quite a challenge, though.\n\nWhat I want to do is this: I have a large building with external shading\nthat has a non-trivial geometric form. This shading is to be opened (to a\ncertain degree) at a given azimuth only if no direct radiation which would\nhit the facade can get past in this location. So the task is to let the sun\ntravel around the building and for each position of interest check if any\ndirect hits can be found on any surface of the building fa?ade behind the\nshading.\n\nYour suggestion seems to imply that this should be possible with rtrace.\nDoes setting -dr 0 mean that only direct beams are considered by rtrace? Or\ndoes one need a good combination of -ds, -dt and -dc? The sun is the only\n\"active\" source of light. I would set reflection of all shading surfaces to\nZero.\n\nI am not sure what your input example describes. Having the material names\nof \"hit\" surfaces given would seem O.K. if this can be constrained to\n\"direct\" only, as the goal is to have \"no direct hit\".\n\nRegards\nAchim\n\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of Thomas\nBleicher\nSent: Mittwoch, 25. November 2009 18:42\nTo: Radiance general discussion\nAchim.\n\nI'm afraid I don't quite understand what you want to do.\n\nOn Wed, Nov 25, 2009 at 7:40 AM, Achim Geissler\n<achim.geissler@intergga.ch> wrote:\ndoes\ndue\n\nI recently implemented a script that checks for a hit and miss\nof the sky at possible sun positions. I just used the rtrace output\noption to produce the material name of the hit surface.\n\nExample input:\n0 0 0 0 0 1\n0 0 0 0 1 1\n0 0 0 1 1 1\n\nExample output:\nskyglow\ngrey_40\ngrey_40\n\nIf you use a unique material name you can afterwards parse the\noutput with a simple awk one-liner to get the number of hits. Is\nthat more what you need?\n\nhelp,\n\"hit\"\n\nThe output is a picture if you want rtrace to produce a picture.\nIt only depends on the options for rtrace. The nice thing about\nthe stencil method is that it generates ray origins and directions\nover a surface, instead of a fixed size grid.\n\nhttp://www.radiance-online.org/radiance-workshop7/Content/Augsburger/Germain\n\nStencil could create the x,y,z,dx,dy,dz coordinates but only\nfor one half of the cylinder (the one facing you). And the\nresolution would degrade towards the edges.\n\nPerhaps you could outline your problem. Someone might have\nanother idea.\n\nRegards,\nThomas\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] \"Sensor Surfaces\"", "tags": [], "sender": "adiance-general-bounces@radiance-online.or", "datetime": "Thu Nov 26 01:52:08 2009"}