{"body": "\nHi Greg,\n\nWell, I have been using the new falsecolor scale (in conjunction with\nthat very cool vwrays trick you developed with John M. to render\nnon-planar clipping \"planes\" a while back -- very nice!!!), and I have\nto agree with Axel that it's very unusual.  While I totally applaud the\neffort to provide more color points from which to pick off values, there\nare a couple of issues I'd like to point out:\n\nFirst off, everyone I've ever \"trained\" in the use of these images and\nindeed most lighting professionals who are facile with the\ninterpretation of these images expect blue to represent the lowest and\nred to represent the most intense values.  I'm not up on color spaces\nand indeed even have partially \"defective color vision\", as the FAA\nkindly calls it, but my brain seems to understand a low-to-high\nintensity progression of blue-cyan-green-orange-red.  It makes sense to\nme, but more importantly it's what I've been generating (and teaching)\nfor years.  So to force my brain to remember that blue now trumps\nmagenta in intensity has been a bit of a trick this morning.  I wonder\nwhat the impact will be with clients already versed in the\ninterpretation of the older scale of these images.\n\nSecond, I have generally overcome the limited color range by playing\nwith scale limit and logarithmic mappings whenever a more finite scale\nis required.  This often limits the usefulness of the scale range to a\nspecific area of interest in the image, perhaps a wall with a subtle\nluminance gradient that I wish to study, but it works.  I agree it's\nmore work, but again it successfully applies the currently-accustomed\ncolor scale to a fine-grained area of interest.\n\nI propose two solutions to this.  One, re-ordering the colors to better\nfit the old scale, at the very least putting blue at the bottom and red\nback at the top, spectral/thermal realities notwithstanding.  Two, give\nthe user an option of using the old scale or the new one.  Like I said,\nI think the additional colors help, and maybe your new scale really is\nsuperior, once a little adaptation occurs; the option to use either\nscale might ease that transitional process.  Thoughts?\n\n- Rob G.\n\n", "replyTo": "", "sender": "Rob Guglielmetti", "isquestion": true, "tags": [], "id": "<4554E25B.2000907@rumblestrip.org>", "refs": [], "datetime": "Fri Nov 10 21:34:47 2006", "email": "rpg at rumblestrip.org", "subject": "[Radiance-general] 3.8 Falsecolor Scale"}