{"body": "\nMarcus Jacobs wrote:\n\n\n\nYou know that there is a radiance-dev mailing list on the same\nsite here? That's where we're discussing non-user topics, and the\nissues involved with the imminent porting of 3.4 to Windows are\nan important topic of those discussions.  If you haven't\nsubscribed there yet, I's suggest you do so and also consult the\nrecent archives, so you can avoid doing any duplicate work, or\ngoing off on a tangent that conflicts with other plans.\n\nPlease note specifically, that the most recent version of 3.4\nwill be made available on public CVS soon. It has also seen a\nnumber of changes since the version that you're probably working\nwith. Specifically, Greg has started with the ANSIfication of the\ncode, which will make porting much easier. You might want to wait\nwith any of your changes until you can apply them to the cutting\nedge, so that they can be merged back into the official code base\nwith less effort.\n\nIt currently looks like I might become responsible for\ncoordinating the Windows porting efforts, but I'm sure nobody\nwill object to other people doing at least part of the work.\nI also hope that LBNL will allow me to use code from the Windows\nversion 3.2 as included in Desktop Radiance and Rayfront (the\nlatter with some improvements of my own).  We won't be able to\njust copy those sources, as they are based on a Radiance version\nthat was forked off the main code base earlier on, but there are\nsome parts that might reduce the amount of work we'll have to do.\n\nAs to the actual question, the header file aux.h seems to be a\npart of the OpenGL/X11 API, and is sometimes named glaux.h.\nI don't see it actually in use anywhere, so you're probably save\nto just leave it away.\n\n\n-schorsch\n\nPS:\nCrossposting to radiance-dev, please reply there.\n\n--\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n\n\n\n", "replyTo": "Subject: [Radiance-general] Porting to Windows", "sender": "Georg Mischler", "isquestion": false, "tags": [], "id": "<Pine.BSF.4.44.0302110623390.910-100000@emancholl.pair.com>", "refs": [], "datetime": "Tue, 11 Feb 2003 07:14:41 -0500 (EST)", "email": "radiance-general@radiance-online.org", "subject": "[Radiance-general] Porting to Windows"}