{"body": "\nHi All,\n\nI appreciate Thomas' notes and thoughts. I think that people obviously\nhave a lot to contribute when it comes down to it. I really think though\nthat we need to just assume that the CMS is going to be Plone. This\nlooks to be quite a robust tools with a wide range of functionality.\nLet's move the discussion up to the next level please.\n\nAgain what we need to do is identify what some valuable content areas\nare and who can contribute content. Greg has already put some energy\ninto a preliminary outline of content areas. He can't write everything.\nSo who out there is ready willing and able? What are you able to\ncontribute? Where do we have content (papers, presentations, whatever)\nthat with some editing could be contributed? Where do they fit into the mix?\n\nHere is what Greg, originally suggested in his initial email on the topic:\n\nI strongly encourage others to rearrange these topics, change names,\nadd categories, etc.\n\nOK. I am not sure the best way to keep track of this and/or if there\nshould be an approval process. We need an item as follows:\n\nMaterials\n\nprimitives\nmodifiers\nacceptable/typical ranges\nhow to correctly define a trans material!\nhow to incorporate glazing information from Optics\nprocedural materials (eg modifiers using the .cal functional language)\nmethods for sampling (measuring) physically materials\n\nObviously some of this comes from existing content, some of this\nprobably needs to be updated, some could perhaps be integrated from\nother sources (assuming their agreement), for example Georg has a really\nexcellent diagram/explanation that I think goes a long way to explaining\ntrans materials, and some needs to be written or codified from multiple\nemail/list exchanges.\n\nAnother possible area where I know at least two other have some interest\n(Lars, Francesco and myself at least), running distributed jobs on\ncomputing clusters.\n\nI guess I will leave it here as my thoughts are not extremely well\ncomposed at this point.\n\nBest,\n\n-Jack\n\n--\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20061104/0196aa6a/attachment.html\n", "replyTo": "Subject: [Radiance-general] Radiance documentation organization", "sender": "Jack de Valpine", "isquestion": false, "tags": [], "id": "<454D3B86.7090904@visarc.com>", "refs": ["<20061104155615.1742B267521@mail.unb.br>\t<454CD459.1000901@visarc.com>", "<5353D698-9598-4266-8E24-87510441E65B@arcor.de>"], "datetime": "Sun Nov  5 02:17:30 2006", "email": "jedev at visarc.com", "subject": "[Radiance-general] Radiance documentation organization"}