{"body": "\nHi,\n\nonce more the documentation thread, seams that Greg wants us to get\nsomething done before the end of the year ;-)\n\nIt is possible to enforce authentication in Wikis, while I doubt that\nideas like access rights, user management and publishing workflow are\nWikis' strengths. One the other hand, many of us are familiar with\nwiki-syntax, and if the idea is to get a platform where everyone can\njust start entering his ressources, this may be a solution. Actually, we\nalready had such a Wiki for some time in the past, and Schorsch is\nmaintaining a very useful lighting-wiki:\n\nhttp://lightingwiki.com/FrontPage\n\nI opted for a more (pre-)structured system, more in a classical content\nmanagement way, with users, authors and editors, and with the\npossibility to generate offline-documentation. I have a\ndemo-installation up and running at\n\nhttp://radiance.free-architecture.org\n\nThe installation is based on Drupal (www.drupal.org) and allows\nauthenticated users to create and edit content, while this has to be\napproved by editor users before being published. Drupal allows not only\npdf-export, but also ex- and import of chapters of its\n\"book\"-document-type, allowing offline editing. For Radiance, I would\nlike to enable two more features, cvs-access integrated in the content\nmanagement (which would require to have the Drupal set-up and the\ncvs-repository on the same machine) and Tex-input, because Radiance\ndocumentation (and useage ;-) relies a lot on maths... For Tex, I would\nhave to extend the space I rent from my provider a bit, and I would do\nso if I knew that there is interest in this.\n\nBesides, there is a third option, a directory linking to external\nressources, as Axel's webring project, which was an advanced\nkeyword-based system.\n\nAnyway, I just wanted to offer again others here to play around with the\ninstallation and also to maintain it for some time (I mean more then a\nyear), given that there are one or two willing to do some editor-work\nlike approving new registrations, reviewing the articles / contributions\netc. If there is a decision for another kind of documentation, I will\nstop these efforts and try to contribute there. Anyway, I think we\nshould take this decision in the not too far future, as all those small\ndocumentation projects eat up our time and ressources, and cause a lot\nof frustration if there is no visible success and acceptance.\n\nBTW, IMHO we face not a technical or financial problem - we have to\nmotivate people to spend their spare time on a project where they have\nto work together for free and not only for some weeks. That is why we\nhave so many small projects and few working examples of large maintained\nsites...\n\nCU and have a nice week-end!\n\nLars.\n\n\n", "replyTo": "Subject: [Radiance-general] Radiance documentation organization", "sender": "Lars O. Grobe", "isquestion": false, "tags": [], "id": "<454C9461.2000504@gmx.net>", "refs": ["<BF9D74D0-E5F6-4B7C-9559-C6DD1419D786@gmail.com>\t<453F6FFD.5050909@iebele.nl>\t<5EA816F7-C073-4CAC-A799-9FD062A32AC0@gmail.com>\t<454AF585.4040608@iebele.nl>\t<A611F599-A310-49E1-B7EB-3F4531349C2D@gmail.com>", "<454BDC0F.1010606@gmail.com>"], "datetime": "Sat Nov  4 14:23:56 2006", "email": "grobe at gmx.net", "subject": "[Radiance-general] Radiance documentation organization"}