{"body": "\n\nFriedemann,\n\nI assume you only try to approximate the effect on the shadowing\nof the room, then, not modelling the real reflectance of the material.\n\nYou could start with your base material (aluminium - see the example\nmaterials in the distribution) and add a mixfunc with void as second\nmodifier. Thus the areas defined in the function file should simply\nbe transparent like a hole in the material.\n\nThere was a function file that created a dot pattern by Georg\nMischler; I just can't remember the name now. You have to specify\nthe right dimmensions of the dots for your 85/15 ratio. I think\nyou could apply a scale to it so that it created oval dots instead of\ncircles (but that might have been a different function file).\n\nhth,\nThomas\n\n\n\n________________________________\n\nSent: 03 November 2006 08:42\nTo: Radiance general discussion\n\nHi all,\nI agree, but my simulation should give results for LEED minimal requirements. There it is only one defined sky (midday, equinox, clear sky) and a minimum average illuminance in the room behind the facade (+ turnable but not moveable lamellas) is required.\nThe lamellas I've to simulate are not the perforated mini blinds, but get  a dimensions of 0.5 meter width and a length of about 3 meters.\nThe surface is brushes aluminum (adapted for redirect the daylight into the room).\nWith this starting position, I need a material definition which reflect the daylight (direct and diffuse)  at  85% of lamella area and, on account of the 15% of gaps in the lamellas, a light transmission of 15%.\nDoes anybody have an idea?\n\nThanks\nFriedemann\n\n\n-----Urspr?ngliche Nachricht-----\nVon: radiance-general-bounces@radiance-online.org [mailto:radiance-general-bounces@radiance-online.org] Im Auftrag von Mark de la Fuente\nGesendet: Dienstag, 31. Oktober 2006 15:45\nAn: radiance-general@radiance-online.org\nBetreff: Re: [Radiance-general] perforated lamellas\n\n\nWouldn't the transmission and distribution vary depending on the angle of the lamellas?  These are like perforated metal mini blinds right?\n\nMark\n\n\n***********************************************************************************\nThis e-mail, (and any attachments) is confidential and may be privileged.  It may be read, copied and used by the intended addressee only.  If you have received this in error please contact BDP immediately.\n\nIf you have any queries, please contact the sender.\n***********************************************************************************\nBuilding Design Partnership\nRegistered in England No 2207415:\nRegistered Office: Building Design Partnership Ltd, Sunlight House, PO Box 85, Quay Street, Manchester, M60 3JA, http://www.bdp.co.uk\n***********************************************************************************\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20061103/71867dcb/attachment.htm\n", "replyTo": "", "sender": "radiance-general-bounces@radiance-online.org", "isquestion": true, "tags": [], "id": "<FCCB55B3313F2341AB3C91810FE1166B029B3C95@ln-s3xch1.bdp.holdings.network>", "refs": [], "datetime": "Fri Nov  3 10:40:42 2006", "email": "radiance-general-bounces@radiance-online.org", "subject": "AW: [Radiance-general] perforated lamellas"}