{"refs": ["<bb2ec83d0b9282a5ace703bb6c0a6411.squirrel@calmail.berkeley.edu>", "<0c7c37d52e1eaad11e2f70ccbac71fc4.squirrel@webmail.rumblestrip.org>"], "id": "<EB124710ADB8554C930FADF760BB2BE706C91C33@n-yexc01.global.arup.com>", "subject": "Re: [Radiance-general] Properly defining a roller shade fabrias a TRANS material type", "email": "adiance-general-bounces@radiance-online.org", "body": "\nI would have guessed if your total measured transmission was 20%, and\nyou know the openness is 3%, the 3% would correspond to specular\ntransmission and the other 17% must be diffuse transmission, no?\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of Rob\nGuglielmetti\nSent: Thursday, January 21, 2010 1:59 PM\nTo: Radiance general discussion\n\nHi Kyle,\n\nI am not at all the materials measurement/definition guru on this list,\nbut I do have some comments. First off, you should not use .03 for\nspecular transmittance based on the openness factor. You should specify\nthe transmittance. Have a look at the product specs for the shadecloth;\nsomewhere there should be a reporting (however roughly it may have been\nestimated) for the transmittance of the shade.\n\nNext, even though in theory the holes are allowing light to pass\nstraight through, there will be some scattering at that interface due to\nthe weave (especially in the case of your white colored shade), so there\nwill be some diffuse component to this material. And therein lies the\nrub:\nfiguring out how much of a diffuse component...\n\nI recommend finding out the transmittance of the cloth, and than taking\nsome fraction of that and putting that into the diffuse transmittance\nportion of the material definition. For example, if the shade has a\ntransmittance of 20%, maybe specify Td = .05 and Ts = .15. I'd also\nrecommend getting a sample; even if you can't measure it, you could at\nleast observe it under different lighting conditions and then mix and\nmatch Td and Ts until you achieve L^ar (looks about right). =8-)\n\n- Rob\n\n\nOn Thu, January 21, 2010 10:45 am, kkonis@berkeley.edu wrote:\n\n\nare\n70%\n\n\n\n===================\nRob Guglielmetti\nwww.rumblestrip.org\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n\n\n", "isquestion": false, "replyTo": "<0c7c37d52e1eaad11e2f70ccbac71fc4.squirrel@webmail.rumblestrip.org>", "tags": [], "sender": "adiance-general-bounces@radiance-online.or", "datetime": "Thu Jan 21 11:11:13 2010"}