{"body": "\n\nOn Dec 27, 2006, at 9:11 AM, Arvinder Dang wrote:\n\n\nHi Arvinder,\n\nWelcome back to the Radiance world!\n\n\n\nThe output from Optics5 is essentially \"two in one\", both a simple\nglass description of the material and the more accurate BRTDfunc\ndescription.  Honestly, I don't know which one of the BRTDfuncs would\nbe the correct one to use in your lightshelf application.  You could\ntry the glass description instead...\n\nIf all of these descriptions are in a single materials file (let's\ncall it materials.rad) you can then call them and apply them to your\nlightshelf polygons.  You just have to make sure you define a\nmaterial before it's applied to a piece of geometry.  When working on\na project I typically have one file with all my materials definitions\nin it, and then I just make sure that that file gets listed first in\nany oconv command, to ensure that materials I have assigned will\nalready \"exist\" when the actual scene files get fed to oconv.\n\n\n\nThe glaze script will give you a definition of a material that mimics\nthe overall transmittance change resulting from the frit, but not the\nappearance of the frit.  As I recall, the script has a library of\nmaterials you can select from, but it's not extensive. You could also\nsimulate this with a trans material; most glazing manufacturers\npublish the clear glass transmittance resulting from the application\nof various frit densities, you could use that as part of your trans\nmaterial definition.\n\nIn both of these responses I realize I have suggested a gross\nsimplification for the simulation of these materials.  But sometimes\nthis is the best medicine, especially starting out.  I'm sure some\nfolks on the list can offer more info on using the more fanciful\nmaterial primitives, but my experience doesn't really go beyond trans\njust yet.\n\nGood  luck, keep asking questions and post results as well.  And\nhappy holidays, everyone!\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20061227/6ebe3889/attachment.htm\n", "replyTo": "<20061227161135.53543.qmail@web52306.mail.yahoo.com>", "sender": "Rob Guglielmetti", "isquestion": false, "tags": [], "id": "<C285E143-3BA7-44E0-9E65-4D45F2636BDE@rumblestrip.org>", "refs": ["<20061227161135.53543.qmail@web52306.mail.yahoo.com>"], "datetime": "Thu Dec 28 07:28:17 2006", "email": "rpg at rumblestrip.org", "subject": "[Radiance-general] Modeling reflective glazing and glazing withceramic frit"}