{"refs": ["<4b5b5562.aa13f30a.77e2.ffff9f3eSMTPIN_ADDED@mx.google.com>", "<4B67512D.2010807@gmail.com>", "<D00D4CFE-C2ED-45AC-8878-C2CE7D7A64EA@coolshadow.com>", "<E470DBB2-4E70-4A03-AA7F-2C0CB2B54B71@lmi.net>", "<E11DB03F-E4CB-428F-A3C9-B6B544F67915@coolshadow.com>", "<9C267E30-B8F0-486C-8DCF-E8DCC908DCE3@lmi.net>"], "id": "<89355c0f1002070154r2272bf55n41896f88fc09295f@mail.gmail.com>", "subject": "[Radiance-general] Understanding rtcontri", "email": "tbleicher at googlemail.com", "body": "\nI was following Axel's tutorial myself yesterday and had the same\nproblem that Chris describes. At least I managed to change my\nfile limit ...\n\nOn Sat, Feb 6, 2010 at 9:38 PM, Greg Ward <gregoryjward@gmail.com> wrote:\n\nOn Mac OS X the max number of open files is limited to 256 per\nuser process. That's pretty low and not sufficient for any subdivision\nof the Tregenza sky pattern.\n\nTo change the open files limit (on OS X!) I created a file\n\"/etc/launchd.conf\" with the line \"limit maxfiles 1024 unlimited\"\nand I set the kernel limit with \"sysctl -w kern.maxfiles=1024\".\n\nAfter a reboot I could set the shell's limit with \"ulimit -n 1024\".\nThis can go into your \".profile\" if you're going to use it a lot.\n\nI had a few odd observations regarding the missing or incomplete\npatch files but that seems to be solved now  (just tried it with MF:2\nand it worked fine). I am still puzzled by the fact that creating all\nthese image doesn't seem to take much time at all (a few minutes\nat max). When I tried the \"vwrays | rtrace\" example yesterday it\ntook half an hour to produce the image ...\n\nFurther down the tutorial you will have to replace the \"seq\"\ncommand in Axel's scripts (not available on OS X). A simple\nloop with a counter will do.\n\n\nBefore Axel's tutorial I didn't know about reinhart.cal and the\nuse of genskyvec. It feels very elegant this way; better than\ndoing a separate calculation for defined sun positions like\ndaysim.\n\nAt the moment I just have a major problem with the quantities\nin my simulation. At the end I achieve roughly 10% of Axel's\nexample values and the TFS values look just wrong ...\n\nAnyway, a big thanks to Axel for this introduction.\n\nRegards,\nThomas\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Understanding rtcontrib", "tags": [], "sender": "Thomas Bleicher", "datetime": "Sun Feb  7 01:54:51 2010"}