{"body": "\n\nHi Nicholas.\n\nDefine 'accurate'.\n\nWe have done a small evaluation with a reference\nmodell which could be calculated following formulas\npublished in various BS (British Standard) papers.\n\nThe results for Dialux where around 10% over the\npaper-and-pen calculations the Radiance results where\n2-3% below, depending on the setting for ambient bounces.\n\nGiven that everything is reduced to ADF anyway you\ncan go with Dialux if the space is simple enough\nto be modelled in Dialux. The images Dialux creates\nare nice but not worth much if you want to evaluate\nthe appearance of the space.\n\nThe bigger problem with Dialux is that you realy\ndon't know what it's doing internally and you don't\nhave much controll over the rendering parameters\nto test the effects. I'd say that it is crucial for\nrenderings where you have to rely on the accuracy\nto know how the parameters affect the result. In\nRadiance you'd do a few renderings with different\nsettings first to find a good compromise between\naccuracy and rendering time. In Dialux you can only\nclick 'go' and accept what's dropping out at the end.\n\nNevertheless, it's a simple tool for simple jobs.\n\nCheers,\nThomas\n\n\n\n***********************************************************************************\nThis e-mail, (and any attachments) is confidential and may be privileged.  It may be read, copied and used by the intended addressee only.  If you have received this in error please contact BDP immediately.\n\nIf you have any queries, please contact the sender.\n***********************************************************************************\nBuilding Design Partnership\nRegistered in England No 2207415:\nRegistered Office: Building Design Partnership Ltd, Sunlight House, PO Box 85, Quay Street, Manchester, M60 3JA, http://www.bdp.co.uk\n***********************************************************************************\n\n", "replyTo": "", "sender": "Bleicher, Thomas", "isquestion": true, "tags": [], "id": "<FCCB55B3313F2341AB3C91810FE1166B029B3D27@ln-s3xch1.bdp.holdings.network>", "refs": [], "datetime": "Wed Dec  6 11:02:05 2006", "email": "T-Bleicher at bdp.co.uk", "subject": "[Radiance-general] Dialux"}