{"body": "\nHi All,\n\nYes, trans is very confusing. The link to Schorsch's page is very\nhelpful, particularly the diagram. You should also look at pages 325 and\n326 of Rendering with Radiance to see how parameters for the trans\nmaterial can be derived. It would probably also be worthwhile to do a\nsearch on the archives as the trans material is a recurring topic of\nquestion, discussion and answer.\n\nI am a bit unclear though about the makeup of your material. You use the\nword \"screen\" to describe it, this could be interpreted as a material\nthat actually has holes in it, in which case the material would also\nneed to have a specular transmittance component (arg 7), that is the\nportion of light that pass un-diffused through the material. I am not\nsure but this might even need a more complex material description.\n\nAlso you may have some more basic problems in the definition of your\nmaterial. You have the following:\n\nscreen trans spec-diff_80-10\n0\n0\n7 1 1 1 .8 0 .1 0\n\nNote that this implies that there is actually some material modifier\ncalled \"screen\" that is modifying the material (of type trans) called\n\"spec-diff_80-10\". Is this what you intend? Or do you mean:\n\nvoid trans screen\n0\n0\n7 1 1 1 .8 0 .1 0\n\nwhere \"screen\" then gets applied to geometry?\n\nNote one other item. I believe that it would be extremely unusual for\nthe first three parameters to be 1 1 1. Schorsch's page indicates a\nrealistic range of .2 to .9. The first three arguments are derived based\non the interaction of the \"diffuse\" reflectance of the material with the\n\"reflected specularity\" (arg 4) and along with (arg 6).\n\nRegards,\n\n-Jack de Valpine\n\nReinhart, Christoph wrote:\n\n--\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20070126/3f2674fb/attachment.htm\n", "replyTo": "Subject: [Radiance-general] trans material", "sender": "Jack de Valpine", "isquestion": false, "tags": [], "id": "<45BA0937.5050002@visarc.com>", "refs": ["<5910A0754536EA4AAD411AE8221C3962029D8924@nrccenexb1.nrc.ca>"], "datetime": "Fri Jan 26 14:59:56 2007", "email": "jedev at visarc.com", "subject": "[Radiance-general] trans material"}