{"body": "\nI'm a relatively new user of Radiance and using it from within IESve\n(the IES virtual environment program suite), which means there are\ncertain limitation for the input to the program. I'm currently working\non a research project on glass lamellas for daylight directing and solar\nshading purposes at the technical university of Denmark.\n\nHere's the question:\nWhat is the best way to model the glass blinds in Radiance?\nThe glass that I'll be using for the project has the following\ncharacteristics:\n\nVisual properties\nExt. Reflectance, LR [%]\t31\nInt. Reflectance, LR [%]\t31\nTransmittance, LT [%]\t59\nRA-index\t97.3\n\nSolar properties\nSolar reflectance [%]\t32\nDirect solar transmittance [%]\t40\nSolar Absorption [%]\t20/8\ng-vl/solar factor\t0.48\n\nI have been trying to use the material types \"trans\" and \"dielectrica\",\nin order to benefit from the angular dependent properties of the glass,\nI would prefer to use a matrial type which includes the refraction\nindex.\nHere comes my dilemma:\nThe material type \"glass\": in IESve the type does not include the\nrefraction index which means that the only input is the transmissivity\nof the glass.\nThe \"trans\" material type: same problem but at least I'm able to define\nthe reflectance of the glazing.\nThe \"dielectrica\" material type: IESve only allows me to enter values\nbetween 1 and 2 for the refraction index which in this case have no\nsignificant effect.\nI'm sure that the best thing I could do is to model the whole thing over\nagain in the \"original\" Radiance - but as I have a short deadline, I\nprefer to get it done in IESve!\n\nHope someone out there is able to help me out on this one!\n\nKind Regards\n\nJacob B Laustsen, DTU, Denmark\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20070105/351cc1a2/attachment.html\n", "replyTo": "", "sender": "Jacob Birck Laustsen", "isquestion": true, "tags": [], "id": "<51FF0016B877EA4B8105EB56B5BC34E01A5D1A@mail2.byg.dtu.dk>", "refs": [], "datetime": "Fri Jan  5 15:43:08 2007", "email": "jbl at byg.dtu.dk", "subject": "[Radiance-general] Modelling glass lamellas in Radiance."}