{"body": "\nThanks for help, Jack and Christoph,\n\nI know about the wonderful rayfront user manuel from Schorsch, espacially the nice diagram, but\nthe description of trans I found there is a little bit imprecise if \"spec\" is speciefied with   \"Values greater than 0.1 are unusual\". Does \"unusual\" mean impossible for RADIANCE to calculate correct if a greater values is set? Is there an other reason which I should know?\nAn other question about \"trans\" is if it transmits only direct source rays or additionally diffuse one (i.e. from sky hemisphere)\nJack, I wasn't interrested about the absorption caused by color filtering, my focus was only  on reflected specularity. For more realistic renderings I should use other parameters, of course. By the way: I can count myself lucky to say that there are no \"other basic problems\" to assign the matirial to my model...\n\nThanks for additional comments!\nFriedemann\n\n\n\n\n-----Urspr?ngliche Nachricht-----\nVon: radiance-general-bounces@radiance-online.org [mailto:radiance-general-bounces@radiance-online.org] Im Auftrag von Jack de Valpine\nGesendet: Freitag, 26. Januar 2007 14:59\nAn: Radiance general discussion\nBetreff: Re: [Radiance-general] trans material\n\n\nHi All,\n\nYes, trans is very confusing. The link to Schorsch's page is very helpful, particularly the diagram. You should also look at pages 325 and 326 of Rendering with Radiance to see how parameters for the trans material can be derived. It would probably also be worthwhile to do a search on the archives as the trans material is a recurring topic of question, discussion and answer.\n\nI am a bit unclear though about the makeup of your material. You use the word \"screen\" to describe it, this could be interpreted as a material that actually has holes in it, in which case the material would also need to have a specular transmittance component (arg 7), that is the portion of light that pass un-diffused through the material. I am not sure but this might even need a more complex material description.\n\nAlso you may have some more basic problems in the definition of your material. You have the following:\n\n\nscreen trans spec-diff_80-10\n0\n0\n7 1 1 1 .8 0 .1 0\n\n\nNote that this implies that there is actually some material modifier called \"screen\" that is modifying the material (of type trans) called \"spec-diff_80-10\". Is this what you intend? Or do you mean:\n\n\nvoid trans screen\n0\n0\n7 1 1 1 .8 0 .1 0\n\n\nwhere \"screen\" then gets applied to geometry?\n\nNote one other item. I believe that it would be extremely unusual for the first three parameters to be 1 1 1. Schorsch's page indicates a realistic range of .2 to .9. The first three arguments are derived based on the interaction of the \"diffuse\" reflectance of the material with the \"reflected specularity\" (arg 4) and along with (arg 6).\n\nRegards,\n\n-Jack de Valpine\n\nReinhart, Christoph wrote:\n\nHi Friedemann,\n\nThe trans material is indeed a bit confusing (no offense Greg:)). We did a validation last year for a translucent material along with some measurements of a real material. Maybe you'll find the paper useful: Reinhart C F, Andersen M, \"Development and validation of a Radiance model for a translucent panel\", Energy and Buildings 38:7 pp. 890-904, 2006.\nhttp://irc.nrc-cnrc.gc.ca/pubs/fulltext/nrcc48165/nrcc48165.pdf\n\nAlso, you might want to have a look at http://www.schorsch.com/rayfront/manual/transdef.html to bette undrstand the trans material.\n\nChristoph\n_____\n\nSent: Friday, January 26, 2007 6:39 AM\nTo: Radiance general discussion\n\nHi all,\nI should simulate a screen material with highly specular reflection (0.8) at one side like aluminized matrial  an a totally diffuse transmission of  about 0.1.\nThe parameter of spec for trans material isn't described very well in 'Rendering with Radiance' so I couldn't understand it. Does a numer of 1 spec means a totally specularity for diffuse and direct light ? If so should I use somthing like this:\n\nscreen trans spec-diff_80-10\n0 0 7 1 1 1 .8 0 .1 0\n\ncorrect? Or does anybody know a BRTDfunc material definition for this issue?\n\nThanks for help!\n\nFriedemann Kik\nTranssolar Stuttgart\n\n\n\n_____\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n--\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20070201/63543fc2/attachment.html\n", "replyTo": "", "sender": "radiance-general-bounces@radiance-online.org", "isquestion": true, "tags": [], "id": "<FE872D9C4591BF44AAFD986BF73368FF01C92A6E@webmail.transsolar.com>", "refs": [], "datetime": "Thu Feb  1 12:25:38 2007", "email": "radiance-general-bounces@radiance-online.org", "subject": "[Radiance-general] trans material"}