{"refs": ["<4b8979e0.8713f30a.04ea.7cc1SMTPIN_ADDED@mx.google.com>"], "id": "<4B8A7CAF.5060706@gmail.com>", "subject": "[Radiance-general] Asking the crystal ball", "email": "jacobs.axel at gmail.com", "body": "\nDear all,\n\nI've been re-reading some of the sections in RwR,\nand started pondering about graphical methods which might\nhelp in determining good settings for -av and -ad.\n\nFor demonstrating the concept, I've rendered some glow cups\ninto a simple test room. The cups form iso-elevation bands\nin 10 deg steps that are all at the same distance from the\nsensor position and are 2 deg wide. The blue band is at\nelevation zero. Red ones are below the working plane, green\nones above it. This is an equiangular projection as seen\nfrom the position of the sensor:\n\nhttp://www.luxal.eu/pickup/images/cball_sensor.jpg\n\nHere is my train of thought:\n\na) Stratified Monte-Carlo projection for -ad\n============================================\n\nWhen taking interior illuminance measurements, it's\nimportant to make sure that all windows are hit by at least\none of the ambient sampling rays. When the windows are\nfairly small and/or very far away, setting -ad appropriately\ncan be tricky. Raphael's tutorial, rc97tut.pdf on\nhttp://radsite.lbl.gov/radiance/refer/index.html has a table\non page 38 listing -ad against the required angular\nresolution down to 1 degree.\n\nI was wondering about a more visual approach to do this. The\nambient samples are not sent out with a cosine correction,\nlike an 'inverted' lux meter would do. Instead, a what is\ntermed stratified approach is taken which is essentially a\nprojection of the hemisphere onto the plane that ensures\neach are of the projection is identical to every other area.\nI'm not entirely sure if this can be called an 'equi-area\nprojection', but it probably can.\n\nRwR, 2ed, pp. 536--537\n\nTo put this in other words: If we generate a special fisheye\nview that has the same properties as the 'stratification\nprojection' employed by Radiance's Monte Carlo sampling, we\ncan visually judge if the image dimensions are sufficiently\nlarge to ensure that even small window openings show up as\nat least one bright pixel. The number of pixels in the\nsmallest image that allows us to see all of our small/far\naway windows would then be the equivalent to the minimal\nrequired -ad setting. Each ring in the image below has the\nsame area:\n\nhttp://www.luxal.eu/pickup/images/cball_equiarea.jpg\n\nUnlike the MC sampling that sends out the rays randomly\nwithin each area of the stratified region, the rays in the\nimage do not have any jitter if we use a cal file and rtrace\nto compute the view. This is because rtrace does not have\nrpict's -pj option. For this reason, it's probably safe to\nset the -ad to a little more than the number of pixels in\nthe just-about-big-enough image.\n\nFurthermore, the sensor can only see above the working plane\nand the corners of the fisheye projection would not\ncontribute to the ambient illuminance. Counting just the\npixels in the image would thus overestimate the required\nsamples: area_circle = 0.785 * area_square. We might use\nthis discrepancy as a safety margin.\n\nb) The crystal ball: Setting -av\n================================\n\nRwR, 2ed, p 552, ch 12.2.1 Computing Indirect Irradiance:\n\n\"This ambient value is set by the -av option, given in units\nof watts/steradian/m2. It corresponds to the average\nradiance measured in all directions over the visible scene\n(excluding light sources) and is used in place of a locally\ncomputed average from hemisphere samples.\"\n\nThis again appears to be the job for a special projection.\nThis time, what we need is an 'equi-solid-angle' projection\nof the sphere. Because we don't want 'dead' corners in the\nprojection, we'll project onto a cylinder.\n\nhttp://www.luxal.eu/pickup/images/cball_equisolidangle.jpg\n\nEnsuring that all our windows are accounted for (see a)\nabove), we can simply render an image with this projection,\nand let pvalue and total work out the average. It's\nprobably a good idea to take the weighted average of R,G,B\nto avoid any colour cast. We place the crystal ball in the\ncorner of the room this is furthest away from any window.\n\nIt is also important to exclude any direct light sources\nthat might be visible, so we set -dv-.\n\nThis, I believe, should produce good ambient value for the\nscene.\n\nDoes this all make sense?\n\nCheers\n\nAxel\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Asking the crystal ba", "tags": [], "sender": "Axel Jacobs", "datetime": "Sun Feb 28 06:24:45 2010"}