{"refs": [], "id": "<71A60AFA-04E3-4C45-944E-4FDF5D507F1C@dmu.ac.uk>", "subject": "[Radiance-general] Annual illuminance simulation anomaly", "email": "jm at dmu.ac.uk", "body": "\nDavid,\n\nAs it happens, I use the EPW Abu Dhabi weather data to illustrate a\npoint re: the Pearls Design System (sort of LEED specifically for Abu\nDhabi). A visualisation of direct normal and diffuse horizontal\nilluminances doesn't show the effect you refer to -- scroll down to\nsection 'Abu Dhabi climate':\n\nhttp://www.iesd.dmu.ac.uk/~jm/doku.php?id=academic:daylight-compliance\n\n[See page 'Daylight and Compliance' if the link gets mangled by your\nmailer.]\n\nI had a closer look at the weather file data and it seems OK.\n\nI have noticed an effect when processing weather files that can result\nin direct normal illuminances steadily (and unrealistically)\nincreasing throughout the day.  However, that happens when direct\nnormal has to be calculated from global horizontal and diffuse\nhorizontal.  An offset in the time calibration of just half an hour\ncan result in massive sunset values for direct normal.  Also, I have\ncome across EPW files where the the direct normal in particular can be\ndodgy -- perhaps because it was derived from other quantities with\nflakey time calibration.\n\nNone of this however helps to explain what you noticed.  Also, I would\nhave thought that your method would have resulted in a more-or-less\nexact match between weather file direct normal and predicted direct\nnormal (ab=0).  I'm guessing you are aiming your sensor towards the\nsun using the direction vectors you get from gensky, yes?\n\nI'm puzzled too.\n\n-John\n\n-----------------------------------------------\nDr. John Mardaljevic\nReader in Daylight Modelling\nInstitute of Energy and Sustainable Development\nDe Montfort University\nThe Gateway\nLeicester\nLE1 9BH, UK\n+44 (0) 116 257 7972\n+44 (0) 116 257 7981 (fax)\n\njm@dmu.ac.uk\nhttp://www.iesd.dmu.ac.uk/~jm\n\n\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "John Mardaljevic", "datetime": "Mon Mar  1 04:47:53 2010"}