{"refs": ["<694e132c1003021605o2b27d2fbgbadb99571da24f07@mail.gmail.com>"], "id": "<89355c0f1003030214u1b96ce45k9f0958c40fb1a66f@mail.gmail.com>", "subject": "[Radiance-general] Annual illuminance simulation anomaly", "email": "tbleicher at googlemail.com", "body": "\nHi David.\n\nI have played with gendaylit recently and also thought about the\nproblems it has.\n\nOn Wed, Mar 3, 2010 at 12:05 AM, David Smith <dbs176@gmail.com> wrote:\n\nGiven the information available in data files and the input our\ngenerators expect using radiation data seems to be a good choice. It\nmight be more accurate to use illuminance data instead and divide this\nby Radiance's built in sky efficacy of 179. If you use irradiance and\nsolar radiance you imply that the sky has this same efficacy, which is\nnot true. However, illuminance data is not always available (EPW files\ndo have this information, other climate files do not).\n\nBTW: I noticed in your plot that you labeled the gensky parameters as\n\"-B\" and \"-r\". I think you have to use \"-r\" because the information in\nthe EPW file is direct _normal_ radiance not direct _horizontal_\nirradiance. This might well be the cause of your odd spikes because\nwith \"-R\" you ask for a cosine correction which will be quite extreme\nfor low angles.\n\nI hope someone can confirm this because I don't know too much about\nthe EPW file. I just found the units for the various radiation data.\nDirect normal is given in Wh/m2. Does that mean we have to convert to\nWh/sr/m2 if we want to use it with \"-r\" or apply a cosine correction\nif we want to use \"-R\"?\n\n\nGensky implements a number of sky models (uniform, overcast,\nintermediate and clear). When you use gensky you will have to decide\nwhich of the models you want to use. There is not much guidance on how\nto do this. You could go by cloud cover and visibility if you have\nthat information.\n\nGendaylit does not need this information. It will calculate the\nbrightness distribution based on the radiation input which makes it\nmuch easier to use in a script.\n\nThere are certainly sky conditions where neither of the models creates\nan accurate description. Depending on the climate this might be true\nfor a large number of the records in the climate data file. However,\nwithout an alternative you have to make a choice which of these models\nyou want to use and hope that over the whole year these errors have no\nsignificant impact on the distribution.\n\n\n\nYep. Script seems fine.\n\n\nAxel has used gendaylit with loads of climate data records recently\nand came up with two basic error scenarios:\n\na) The direct component is 0. Some records refer to a time where the\nsun is actually not visible and more. Gendaylit can't handle that and\nso it will create no output at all. You can help yourself here by\nadjusting the time as Andrew proposed until the sun is above the\nhorizon again.\n\nb) Gendaylit simply segfaults. This seems to be rare. Perhaps cheating\nwith the values a bit might help (change by a few % or so) or simply\nreplace that sky with a gensky generated one which seems to be more\ngenerous in what it accepts.\n\nStill, it's worth validating the generated sky as you did in your\ngraphs to see how big the error actually is. That will give you an\nidea of how accurate your simulation results are going to be.\n\nRegards,\nThomas\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Annual illuminance simulation anoma", "tags": [], "sender": "Thomas Bleicher", "datetime": "Wed Mar  3 02:14:54 2010"}