{"refs": ["<89355c0f1003080156s3441ca95t145fa8a65c026d3@mail.gmail.com>"], "id": "<103660623888940418377@LAPTOP2>", "subject": "=?ISO-8859-1?B?QVc6IFJlOiBbUmFkaWFuY2UtZ2Vu?==?ISO-8859-1?B?ZXJhbF0gcnRjb250cmliIGFuZCBydHJhY2UtcGFyYW1ldGVycw==?=", "email": "artin at lichttechnik.co.at", "body": "\nHi Thomas,\n\nmany thanks for your comments. They are very helpful and encouraging.\n\nYes, you are absolutely right, sorry.\n\nOK, I understand.\n\nThat would mean, if I am only interested in daylight (in combination with rtcontrib), I can forget\naa and dj and reduce as.\n\nYes and sorry again.\n\nThat is a good point. I am quite sure, that the differences are coming from the\npatch contributions. The calculation time for the rtcontrib run is extremely short,\nat least I think so.\nWhat are the critical parameters concerning accuracy for a rtcontrib run, I really\nwouldn't have any problems with longer computation time.\n\n\nOK, they are constatnt over simmilar calls to genskyvec.\n\nThank you for that comment. Yes that is true. But can I say that as long as I compare\ndifferent daylighting solutions with the same (inaccurate) processes, I will get still\nvalid results?\n\nMany thanks and best regards\nMartin\n\n\n-----Urspr?ngliche Nachricht-----\nVon: Thomas Bleicher <radiance-general@radiance-online.org>\nDatum: 08.03.2010 10:56:37\nBetreff: Re: [Radiance-general] rtcontrib and rtrace-parameters\n\n\nHi Martin.\n\nOn Sat, Mar 6, 2010 at 5:37 PM, Martin Klingler\n<martin@lichttechnik.co.at>wrote:\n\n\n[graph removed]\n\n\n\nI think you wanted to write 'rtcontrib runs' - at least that's what your\nlabels say.\n\nWhen you use genskyvec you also remove the sun 'source' from the sky\ndescription and distribute its brightness to the surrounding sky patches.\nrtace treats a sky with sun differently than a sky without sun. Therefore\nyou will not achieve identical results from rtrace and rtcontrib.\n\n[graph removed]\n\n\n\nThat obviously depends on your scene complexity. If you have blinds in front\nof your window I would say that the results you get are sufficiently\naccurate for climate data studies.\n\nIf you have a simple geometry like in Axel's tutorial I think that the -as\n2048 is overkill. You already have a high -ad setting which should account\nfor window openings in a typical room.\n\nEffectively you have turned off ambient caching by setting -aa to 0.\nrtcontrib does not use ambient caching anyway so that's probably not going\nto make a difference. Ambient caching might have smoothed out your\nindividual point results a bit.\n\nYour -dj value seems high, but given that there are no sources it should not\nmatter.\n\n\n\nAs I said above, you can not reproduce the direct calculation with\ngenskyvec. You could split out the direct component and do a separate\ncalculation just for the sun. It will just make things far more complicated,\nthough.\n\nYou could try and switch off Monte Carlo sampling with '-u-'. That should\ngive you a deterministic sampling pattern which should result in 'identical'\nvalues.\n\n\n4.) Can I reduce the differences between different rtrace-runs with the\n\nrtcontrib-runs?\n\nPerhaps you should investigate where the error originates in your\ncalculation chain. When you use rtcontrib to calculate illuminance values at\na point the only value affected by the rtrace options is the contribution of\neach sky patch. This is only a fraction of the 'brightness' the patch is\nultimately assigned so small variations in the contribution can result in\nnoticeable changes of the illuminance values. I would start by comparing the\npatch contributions between rtcontrib runs. If they are reasonably constant\nyour error is introduced somewhere else.\n\nIIRC the multiplier for each patch contribution is calculated via genskyvec\nat specified directions (saved in tregsamp.dat). That should result in\nconstant values for the multipliers but you can still check.\n\n\nOverall I think that your current values are sufficiently accurate. In the\nend you will apply these values to a large number of (inaccurate) sky\ndescriptions to then calculate an average from all these results. The error\nyou introduce by the use of insufficient sky models should largely exceed\nthe error resulting from the rtcontrib/genskyvec process.\n\nAnyway, good that there is more interest in validating climate data\ncalculations.\n\nRegards,\nThomas\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20100308/1e879b62/attachment.html\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Martin Klingler", "datetime": "Mon Mar  8 11:51:57 2010"}