{"refs": ["<89355c0f1003080156s3441ca95t145fa8a65c026d3@mail.gmail.com>", "<103660623888940418377@LAPTOP2>"], "id": "<89355c0f1003090534t4d2b1917ofd73443cfad8e295@mail.gmail.com>", "subject": "[Radiance-general] rtcontrib and rtrace-parameters", "email": "tbleicher at googlemail.com", "body": "\nOn Mon, Mar 8, 2010 at 7:51 PM, Martin Klingler\n<martin@lichttechnik.co.at> wrote:\n\n\nI would think that '-as' can be reduced but that depends on your geometry.\n\nAs far as I understand it options affecting the ambient interpolation\n('-aa' and '-ar') will have no effect because rtcontrib needs to\ndisable the interpolation ('-aa 0'). Any source related option will\nhave no effect because the base sky used to calculate the patches does\nnot have a source. After that any sky is sampled at predefined angles\nwhich makes most rtrace options obsolete.\n\n\nYes, that surprised me, too. I haven't done any testing on serious\nscene where multiple reflections should lead to a contribution of\nalmost every sky patch. In my test scene at first every patch 'behind'\nthe window wall was ignored because there was nothing to bounce light\nback into the room. The I introduced another building in front of my\nroom to reflect a more realistic scenario.\n\nI don't know what good values for rtcontrib would be. It simply uses\nrtrace in a fancy way so all parameters that apply to an rtrace\ncalculation in the same scene should be fine (see exceptions above).\n\n\nPerhaps we just have to use ridiculously high '-ad' values to make\nsure the sky is sampled at a high density. This would result in less\nvariation due to the number of rays that hit a specific sky patch.\n\n\nAh, good to know.\n\n\nWith Radiance there will always be some 'inaccuracy'. All we can do is\ntry to understand where the error is introduced and how we can\nestimate its magnitude (as you're doing right now). If your rtrace\nresults are within 5% of the rtrace results for the same scene then\nthat might be the built-in inaccuracy of rtcontrib.\n\nAdd that to the difference between sky model and real sky and you may\nend up with 20-30% inaccuracy for the whole climate data based\napproach. That's what we have to live with until we can  coax another\nstudent into writing a better sky generator or a more accurate\nrtcontrib ...\n\nHowever, even with this high error margin we can now at least start to\nwork on daylight models that take into account the weather, seasons,\nlocation and orientation of buildings. I won't start calculating ADF\nwith rtcontrib; rtrace is much better in doing that. But perhaps there\nis some information to be found in a RDF ('real daylight factor') that\ncan efficiently only be calculated with something like rtcontrib.\n\nRegards,\nThomas\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] rtcontrib and rtrace-parameters", "tags": [], "sender": "Thomas Bleicher", "datetime": "Tue Mar  9 05:34:46 2010"}