{"body": "\nJiangto,\n\nWelcome to the wonderful confusing world of radiance.\n\nFirstly, I am a big fan of Ecotect, as it is a great tool for modeling. I\ncertainly prefer it to Autocad, 3d studio etc. It's development was always\nintended for use during early design stages by providing quick iterative\nresults.\n\nHowever, I would also suggest that using it with Desktop Radiance will not\nonly seriously limit the analysis process by limiting access to the newer\nRadiance functions, but also potentially compromise the validity of your\nresults and cloud your understanding of the various Radiance analysis\nfunctions and parameters.\n\nSo, if you have access to Linux and the latest Radiance versions, I would go\nwith that, but use Ecotect to build your models and export the relevant .rad\nfiles. You can also export the analysis girds locations etc for use with\nRtrace directly within Linux version. Finally, you can then re-import the\nvalues to Ecotect for certainly visualization tasks.\n\nI run Ubuntu Linux on my windows machine through VMware workstation, where\nyou can set up shared folders to move data between linux and windows.\n\nI would however strongly recommend that you have a look at Axel's Radiance\ntutorials from London Metropolitan University as these are on the money as\nthey say. They can be found at:\nhttp://www.learn.londonmet.ac.uk/student/resources/notes.shtml.\n\nGood luck..\n\nNick\nNick Devlin Associates\n\n\n\n------------------------------\n\nMessage: 2\nTo: radiance-general@radiance-online.org\nContent-Type: text/plain; charset=\"iso-8859-1\"\n\nHi, friends,\n\nI am a post-graduate student in Sheffield University. My project is atrium\ndaylighting and I want to simulate atrium daylight using Radiance. As a\nbeginner of this tool, I have many questions:\n\n1. Do you think Ecotech 5.5 with Desktop Radiance control panel (the\nnewest version ) is the right tool to do my atrium research? I like using it\nfor its clear GUI, but if it could finish similar work and achieve the same\nresults as its UNIX/LINUX brother?\n\n2.  I think a lot of complex atrium roofs have to be researched and\nconstructed in my project, if UNIX/LINUX Radiance is the most suitable tool?\nIf Linux version is good, could I use the Radiance on Cygwin Environment?\n\n3. Someone has told me that Radiance in Adeline is a cut-version, but I\nfound some atrium daylight papers which have used this tool (Anca D.\nGalasiu, Morad R. Atif from Canada, B. Calcagni, M. Paroncini from Italy).\nHow about your opinion?\n\n4. Mac Radinace is a new choice , I found some researchers recommended the\nSketchup + Radiance is a good way. Could you compare this with Sketchup (or\nAutocad) + Ecotech +Radiance?\n\nMany thanks to your help.\n\nJiangtao Du\nMphi/phd student in School of Arch in Sheffield Univ\n\n\n\n", "replyTo": "Subject: [Radiance-general] Radiance tool and Atrium daylight", "sender": "jiangtao.du@yahoo.co.uk", "isquestion": false, "tags": [], "id": "<20070326213211.80900.qmail@web28114.mail.ukl.yahoo.com>", "refs": [], "datetime": "Mon, 26 Mar 2007 22:32:11 +0100 (BST)", "email": "Jiangtao Du", "subject": "[Radiance-general] Radiance tool and Atrium daylightsimulation"}