{"body": "\nSteve,\n\nRob is pointing you in the right direction.  But be careful when you wrap the fixture in an illum box as the light output may be quite right.  It's been a while since I've had to do this, but I recall having issues with \"flatcorr\" and \"lboxcorr\" in my brightdata definitions (created by IES2RAD).  I'm not sure where these are documented, but I'm sure other functions are used for spheres and rings.  I believe the sphere option is the easiest to work out, but only works if you can wrap your fixture in the illum sphere and the sphere does not bisect geometry.  In my case I've had to work out linear fluorescent pendants which have required a box.\n\nMark\n\n------------------------------\n\nMessage: 3\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\n\nsteve michel wrote:\nYou need to use a procedure where you wrap your geometry with an illum\nsphere or box and you apply the luminous distribution to that illum\nenclosure. Then you also have to generally create some glow polygons\nwithin the fixture geometry to make the geometry appear correct (the\nglow will not be evaluated beyond the illum boundary so you won't affect\nthe distribution of the fixture on the scene).  I would say it's not\nstraightforward, but the procedure is outlined in Charles Ehrlich's\nchapter of Rendering with Radiance. The process is very much streamlined\nwhen you use Georg Mischler's Rayfront interface.  Personally, I am\nusually interested in the calculation result from electric light\nsources, so I tend to just use the simple geometry that ies2rad creates\nfor me.  But the visual result of going the distance and actually\nsetting up the whole illum enclosure can be fantastic.  I have very\nlimited experience with this, but I hope others will chime in here with\nsome tips.\n\n- Rob Guglielmetti\n\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20070426/c876ab96/attachment.htm\n", "replyTo": "Subject: [Radiance-general] Re: Radiance-general Digest, Vol 38, Issue 14", "sender": "rpg@rumblestrip.org", "isquestion": false, "tags": [], "id": "<462FA602.8030703@rumblestrip.org>", "refs": ["<65230364.210@wmtao.com>"], "datetime": "Wed, 25 Apr 2007 13:03:30 -0600", "email": "Rob Guglielmetti", "subject": "Re: [Radiance-general]ies photometry+geometry?To: Radiance general discussion <radiance-general@radiance-online.org>"}