{"body": "\n\n\nI contacted Jan over pmap when I started working on the latest LEARNIX\naround September last year. He was very busy at the time (and probably\nstill is) with his PhD. He was about to talk to their programmer about\nsome minor changes he liked to see implemented in pmap on top of the\nobvious adjustments necessary to move it from Radiance 3.7 to 3.8. Seems\nthat Jan has just been too busy.\n\nCarsten Bauer was kind enough to tweak the 3.7 pmap so it would compile\nwith 3.8. I did, however, decide not to ship it with LEARNIX since it was\nnot officially endorsed by the maintainer. This tough decision was\neased by the fact that one or two of the test routines shipping with pmap\nfailed.\n\nAs regards to Radzilla (radzilla/RADZILLA ???) -- There are three types of\nphotons in pmap, of which Carsten implements two. Don't ask me what they\nare and when you need them. I guess that the third, unimplemented type is\nnot used very often, otherwise it would probably be there in Radzilla.\n\nBecause of LEARNIX, I have been following the progression of RZ very\nclosely and am pleased to report that it has improved tremendously over\nthe last 6 months. However, one thing that you always must remember is\nthat RZ is a complete re-write of Radiance 'classic' in C++. While the\nalgorithms are obviously the same, RZ has not seen as much bug-testing and\nvalidation as 'Classic' has enjoyed over the years. This is also true for\nthe pmap plug-in. I am not saying that RZ is buggy, but it might be an\nissue. Carten actually considers RZ 'alpha'.\n\nSo, to cut a long story short: Unless you go back to R 3.7, there is no\n'official' pmap for Radiance. I would personally very much like to see\npmap integrated into the main Radiance tree and available with the same\ndownload, but there are probably issues (license, maintainership, coding\nstyle etc.) that have prevented this from happening. So far, anyhow.\n\nAxel\n\n", "replyTo": "", "sender": "Axel Jacobs", "isquestion": true, "tags": [], "id": "<100441490705180454i3bde5f5bt2f673bcfb8fed3bd@mail.gmail.com>", "refs": [], "datetime": "Fri May 18 13:54:25 2007", "email": "jacobs.axel at gmail.com", "subject": "[Radiance-general] Re: pmap"}