{"body": "\nHi Axel,\n\nAxel Jacobs wrote:\n\nYes,  I'm really sorry for that! I'm still working on my PhD, now\nparallel to projects, which is really difficult.\n\nWe had to develop a virtual goniophotometer for pmap in order to\ngenerate btdfs for special materials. At the first stage, we thought,\nthat we had to make some changes to pmap to realize that project. Then,\nit would have been no big deal to make the changes to 3.8. But then it\ncame out, that we didn't have to make changes for that. And besides\nthis, at that time we got some new (non-radiance related) projects for\nour programmer and therefore the \"upgrade\" of pmap from 3.7 to 3.8\nunfortunately sloped down in the priority list.\n\nFor us it is really difficult to maintain software, when no related (and\nfinanced) projects are available. Additionally the author of  pmap,\nRoland Schregle, is not at the institute any more, which increases for\nus the needed effort to make changes on the code.\nBesides the financial aspects,  our programmer is \"loaded\" at the moment\nwith more than 120% with other projects until fall of the year, so I\ndon't see a quick solution for that.\nSo in the next months, we can  maintain pmap only , if bugs encounter.\n\nI really support your and Lars'  wish to include it in main tree!\nThe question is, how? We need a volunteer, who is maintaining it.\nThis is the main issue. License is absolutely no problem.\n\nJan\n\n\n\n\n\n--\nDipl.-Ing. Jan Wienold\nProject Manager\nFraunhofer-Institut f?r Solare Energiesysteme\nThermal Systems and Buildings, Lighting and Daylighting\nHeidenhofstr. 2, 79110 Freiburg, Germany\nPhone: +49(0)761 4588 5133 Fax:+49(0)761 4588 9133\njan.wienold@ise.fraunhofer.de\nhttp://www.ise.fraunhofer.de\n\nIn office:\nMo,Tue: 9:00-18:00\nWe-Fr:  8:30-14:00\n\n\n", "replyTo": "Subject: [Radiance-general] Re: pmap", "sender": "Jan Wienold", "isquestion": false, "tags": [], "id": "<46558322.2020805@ise.fraunhofer.de>", "refs": ["<100441490705180454i3bde5f5bt2f673bcfb8fed3bd@mail.gmail.com>"], "datetime": "Thu May 24 14:20:11 2007", "email": "jan.wienold at ise.fraunhofer.de", "subject": "[Radiance-general] Re: pmap"}