{"refs": ["<i2t3ccbd68d1005041903jf67fd22bsad3f767af78947f0@mail.gmail.com>\t<4BE1986A.5030207@visarc.com>\t<o2x3ccbd68d1005051001p8b0375cke581f768915c041b@mail.gmail.com>\t<4BE1A5FA.7010402@visarc.com>\t<m2l3ccbd68d1005051112i4daacba8k1680a3da53401381@mail.gmail.com>\t<g2v3ccbd68d1005060035j6e9cfb8eq2eb1a795db84a61c@mail.gmail.com>", "<4BE2A1A6.4090903@gmx.net>"], "id": "<4BE2D2C4.6040405@visarc.com>", "subject": "[Radiance-general] import to Radian", "email": "jedev at visarc.com", "body": "\nHi Jia and Lars,\n\nA few thoughts here.\n\nFBX\nI think that if you are going to use fbx in your workflow from Revit,\nunless you are using Max, you will need to use the FBX Converter, to\nprocess the fbx to some other format, such as obj. Note though that the\nFBX Converter does enable you to process fbx to older versions of the\nfbx format. Perhaps with some experimentation you can determine which of\nthese might work with Rhino's fbx import capability.\n\nDWG\nThe problem that I have noticed with dwg exported from Revit is that the\nlayer organization is vastly simplified, so that while the geometry will\nall be there, it may not be broken out by layer the way you want and\ntrying to reorganize the geometry in Autocad is probably impractical.\nFBX on the other hand does maintain correct material associations with\nthe type of work flow that I have outlined previously. NOTE however that\nfor some simulation purposes a model in dwg format and layering may be\nperfectly sufficient!\n\nREVIT\nI think it is pretty obvious that Autodesk would like to achieve some\nlevel of vendor lock-in across their product family (I think that for\nthe most part they have been successful in this regard looking at their\nacquisitions and product offerings). Thus, all the pains (over the many\nyears) that we have had to deal with in trying to get usable geometry\nout of applications such as Autocad and now Revit. I agree that there\nare other good solutions for modeling that are probably more open in\nterms of their import/export formats and other functionality. However,\nmy observation is that more and more architectural design firms are\nmoving towards Revit which I have to say actually produces models that\nare reliable and reasonably well organized, to the extent that I feel\nthat we can actually make use of client produced models. I think that it\nmake a lot of sense to figure out how to leverage this model data from\nRevit for simulation purposes, to do otherwise is impractical and\nmissing how the architectural design process/industry is evolving.\n\nRegards,\n\n-Jack de Valpine\n\n--\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n\n\n\nLars O. Grobe wrote:\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] import to Radianc", "tags": [], "sender": "Jack de Valpine", "datetime": "Thu May  6 07:31:39 2010"}