{"refs": ["<D537B22C-55D6-4085-A0F9-769067408D97@dmu.ac.uk>", "<A8B896C4-7E4A-4E08-8C1E-5143E69A41B7@lmi.net>", "<4BF0B79D.8050600@gmx.net>"], "id": "<9C42D730-8D39-4287-A9A7-1C76300FCA8B@lmi.net>", "subject": "[Radiance-general] Re: Rtcontrib-BSDF and DAYSIM-pmap: where arwe\theading?", "email": "gregoryjward at gmail.com", "body": "\nHi Lars,\n\nThanks for starting the conversation...  It may work best if the\noriginators/maintainers of the various software explain what they see\nas the strengths and weaknesses of what they've developed, and those\nwho have used it can chime in with their experiences.\n\nRtcontrib is essentially an interface to rtrace that runs it in such a\nway that individual ray contributions can be tallied.  Because there\nare so many ways one might want to do this, the command-line interface\nis quite complicated, as is interpreting the output.  There is no\ninterface directly to weather files or data, and a lot of other tools\nand scripts are needed to make it truly useful.  That said, here is a\nquick list of strengths and weaknesses, with mention of related tools\nfor rtcontrib:\n\nStrengths\n========\n\no Records contributions or coefficients between source rays and scene\nsurfaces.\n\no Separates the notion of ray-tracing from the notion of generating\nimages or values.\n\no Can compute daylight coefficients or lighting contribution components.\n\no May also be used to track flux through optical systems.\n\no Output is binary or ascii data files or component/coefficient\npictures.\n\no Use with genklemsamp, genskyvec, and dctimestep for annual\nsimulations with BSDFs (illuminance values, animations, etc.)\n\no Use with pcomb for combining component images.\n\nWeaknesses\n==========\n\no Difficult to use in a stand-alone fashion.\n\no Uses Monte Carlo path tracing, which does not make use of irradiance\ncaching.\n\no Results can be noisy if parameters are set improperly.\n\no Won't explicitly do forward ray-tracing, but with some effort it is\npossible to trace flux and create a candlepower distribution.  (See\n2006 Radiance workshop presentation below.)\n\no Less useful for single time-point calculations.\n\nLinks:\n-------\n2005 Workshop talk:\thttp://www.radiance-online.org/radiance-workshop4/cd/website/PDF/Ward_rtcontrib.pdf\n2006 Workshop talk:\thttp://www.radiance-online.org/radiance-workshop5/2006_Radiance_Workshop/Presentations/Ward_rtcontrib.mov\nAxel's tutorial:\thttp://luminance.londonmet.ac.uk/learnix/docs/rtcontrib_lesson.html\n\n------------\nComments welcome as always.\n\nCheers,\n-Greg\n\n\n", "isquestion": false, "replyTo": "<4BF0B79D.8050600@gmx.net>", "tags": [], "sender": "Greg Ward", "datetime": "Tue May 18 11:04:48 2010"}