{"refs": ["<8EF421DC-E12D-4AF0-B1F4-C24AC56D1346@dmu.ac.uk>", "<AANLkTimEH3PJZPuUxYyyH812S_jw9zPjirCbHXr8Ar8P@mail.gmail.com>"], "id": "<8342DDAA-380E-4DE5-9387-FDC830191009@rumblestrip.org>", "subject": "[Radiance-general] objline doesn't seem to work properly and X11window flash and gone very quickly", "email": "pg at rumblestrip.org", "body": "\nHmmm, that's odd. The error means that the program could not open the file vchars.mta in a read-only capacity. Following a normal installation of Radiance on Mac OS X, that file should indeed live in /usr/local/lib/ray/meta and be read-only accessible to everyone.\n\nSo yeah it's possible that something didn't go right during installation. The correct and not-totally-detailed procedures for installing Radiance on the Mac are:\n\ngo to www.radiance-online.org, click the link on the left for \"download radiance\", and follow the procedures found under \"Download official release from this server\". Basically you grab the source code, and compile. Compiling on the Mac is easy, you run ./makeall install from the directory where you unpack the archive, and follow the prompts. You need to run this as an admin, and in Mac OS this is easy:\n\nsudo ./makeall install\n\nThis will prompt you for the administrator password, and then you just follow the prompts.\n\nNOTE: you must have the directory /usr/local/lib/ray already existing so the installer can place all the library files. This is done with\n\nsudo mkdir /usr/local/lib/ray\n\nMaybe this was your problem the first time around? Here's a quick rundown of the steps:\n\n1. download http://www.radiance-online.org/software/rad3R9all.tar.gz\n2. at the command prompt, go to the directory where you saved the rad3R9all.tar.gz file\n3. type: gunzip < rad3R9all.tar.gz | tar xf -\n4. go to the archive directory (cd ray)\n5. create /usr/local/lib/ray directory if it does not exist (sudo mkdir /usr/local/lib/ray)\n6. type sudo ./makeall install (supply admin password when asked)\n7. follow the prompts, responding to defaults; definitely answer 'y' when asked if you want to install libraries, accept default location\n8. make the PATH changes recommended after installation.\n\nGive that a go, and retry objline.\n\n- Rob\n\nOn Jun 11, 2010, at 10:37 AM, Ji Zhang ?? wrote:\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20100611/fc20c538/attachment-0001.htm\n", "isquestion": false, "replyTo": "<AANLkTimEH3PJZPuUxYyyH812S_jw9zPjirCbHXr8Ar8P@mail.gmail.com>", "tags": [], "sender": "Rob Guglielmetti", "datetime": "Fri Jun 11 10:02:41 2010"}