{"refs": ["<AANLkTilkZG4CNUvnqdjLrTiNJcF5z7Wezfs08ZMtG0fn@mail.gmail.com>", "<AANLkTikL0gflw2ixcGZtIlrelwS7pJbavW8LjGbwbcqN@mail.gmail.com>"], "id": "<28285BAEA8C0814DBF1B199C876EC5B04792E95529@AMXEXC01.global.arup.com>", "subject": "Re: [Radiance-general] rtrace result varies for each calculation", "email": "adiance-general-bounces@radiance-online.org", "body": "\n-ar - (ambient resolution) This may also improve accuracy by setting the -ar parameter higher than the default. This would help mainly if you have a large scene with a small area of interest (eg a model of an entire large office tower but seeking high level of accuracy for points within one small private office).\n\n-Chris\n\n-----Original Message-----\nSent: Tuesday, July 13, 2010 4:40 AM\nTo: Radiance general discussion\nJi.\n\nYou can always expect some variations in Radiance calculations. The trick is to modify your ambient parameters (in general options starting with \"-a\") until you're satisfied that the error has no relevant impact on the results. The \"right\" ambient parameters depend on your scene complexity and and the rendering time you can afford to spend.\n\nA few further comments on your parameters are below:\n\nOn Tue, Jul 13, 2010 at 5:41 AM, Ji Zhang <hope.zh@gmail.com> wrote:\n\n-aa - (ambient accuracy) seems a bit high (although I don't know anything about your scene). A value of 0.2 allows for 20% error in the ambient calculation. If the sky in your scene is hardly visible this will lead to significant errors. In general I prefer values of 0.05 and less. Reducing this value will increase your rendering time. If you set it to 0 you will turn ambient interpolation (and the associated errors) off but it will take much longer to calculate.\n\n-ab - (ambient bounces) is generous. If you have a simple scene where the sky is visible from most locations you can safely reduce this to 6 or even 5 which will reduce your rendering time to a quarter of the previous run. Note that your average results will increase a bit with each additional bounce. You should do a series of calculations with increasing -ab values to estimate the effect of one bounce more or less.\n\n-ad - (ambient divisions) could be a bit higher. I use 4096 these days. It doesn't have a big impact on rendering time.\nIn a simple room with one or two large windows and no external shading\n1024 will do. If you have lots of small windows or external shading devises use a larger number.\n\n-oov - You will find that the origin (second \"o\") is reported differently from your input file. This is an effect of the -I setting of rtrace. Don't worry about it. If you want to convert it you have to reduce the z-value by 1.\n\n\n\nAs stated above, some variation is normal. For you can add \"-u-\" to your rtrace command line which changes the random sampling algorithm used to a \"low-discrepancy sequence\". That and setting \"-aa\" to 0 should give you the most reproducible results. However, that alone does not guarantee that the results are correct.\n\nHomework:\n\nReduce your set of sampling points to a line from the front (window) of the room to the back. Then start with your command line above and modify the parameters as discussed. Do more than one calculation with the same set of parameters and plot and compare the results. Also keep a record of the rendering times.\n\nA good set of options generates a smooth DF curve from the front of the window to the back of the room that does not change a lot between separate calculation runs. If the curve is not smooth your error is too high and you have to increase/decrease some values.\n\n\nRegards,\nThomas\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] rtrace result varies for each calculati", "tags": [], "sender": "radiance-general-bounces@radiance-online.org", "datetime": "Tue Jul 13 06:54:53 2010"}