{"refs": ["<AANLkTilkZG4CNUvnqdjLrTiNJcF5z7Wezfs08ZMtG0fn@mail.gmail.com>", "<AANLkTikL0gflw2ixcGZtIlrelwS7pJbavW8LjGbwbcqN@mail.gmail.com>", "<AANLkTinnYqBrmggHvNRW36vFOFwuTOrfbf1LhChyowgR@mail.gmail.com>"], "id": "<28285BAEA8C0814DBF1B199C876EC5B04792E95674@AMXEXC01.global.arup.com>", "subject": "Re: [Radiance-general] rtrace result varies for each calculation", "email": "adiance-general-bounces@radiance-online.org", "body": "\nFrom Rendering With Radiance there are a few tables describing how the rad command calculates the various ambient settings. The ?ar setting is determined by a formula a*d. The value of ?a? ranges from 8 for low accuracy to 64 for high accuracy. The value of ?d? is largest scene dimension divided by dimension of zone of interest.\n\nSo for example trying to get high accuracy for a model that?s 50x50x50m and looking for detailed results in a 5x5x5m room:\n\na * d = ar setting\n64 * (50/5) = 640\n\nThat should give you a starting point, and if you still see too much variation between calculation you can try setting parameters even more rigorously.\n\n\nSent: Tuesday, July 13, 2010 10:09 AM\nTo: Radiance general discussion\nDear Thomas,\n\nThank you very much for your detailed explanation! We'll try out the parameters according to your suggestions later.\n\nMay I also ask:\n1) how are these parameters relates to model size?\n2) The formula (6) in Axel's tutorial (p.33) is about the radius of the \"splotches\". If the model is fairly large, e.g. 100m, then what would you suggest for \"aa\" and \"ar\"?\n\nThank you again!\n\nJi\n\nOn Tue, Jul 13, 2010 at 4:40 PM, Thomas Bleicher <tbleicher@googlemail.com<mailto:tbleicher@googlemail.com>> wrote:\nJi.\n\nYou can always expect some variations in Radiance calculations. The\ntrick is to modify your ambient parameters (in general options\nstarting with \"-a\") until you're satisfied that the error has no\nrelevant impact on the results. The \"right\" ambient parameters depend\non your scene complexity and and the rendering time you can afford to\nspend.\n\nA few further comments on your parameters are below:\n\nOn Tue, Jul 13, 2010 at 5:41 AM, Ji Zhang <hope.zh@gmail.com<mailto:hope.zh@gmail.com>> wrote:\n-aa - (ambient accuracy) seems a bit high (although I don't know\nanything about your scene). A value of 0.2 allows for 20% error in the\nambient calculation. If the sky in your scene is hardly visible this\nwill lead to significant errors. In general I prefer values of 0.05\nand less. Reducing this value will increase your rendering time. If\nyou set it to 0 you will turn ambient interpolation (and the\nassociated errors) off but it will take much longer to calculate.\n\n-ab - (ambient bounces) is generous. If you have a simple scene where\nthe sky is visible from most locations you can safely reduce this to 6\nor even 5 which will reduce your rendering time to a quarter of the\nprevious run. Note that your average results will increase a bit with\neach additional bounce. You should do a series of calculations with\nincreasing -ab values to estimate the effect of one bounce more or\nless.\n\n-ad - (ambient divisions) could be a bit higher. I use 4096 these\ndays. It doesn't have a big impact on rendering time.\nIn a simple room with one or two large windows and no external shading\n1024 will do. If you have lots of small windows or external shading\ndevises use a larger number.\n\n-oov - You will find that the origin (second \"o\") is reported\ndifferently from your input file. This is an effect of the -I setting\nof rtrace. Don't worry about it. If you want to convert it you have to\nreduce the z-value by 1.\n\n\nAs stated above, some variation is normal. For you can add \"-u-\" to\nyour rtrace command line which changes the random sampling algorithm\nused to a \"low-discrepancy sequence\". That and setting \"-aa\" to 0\nshould give you the most reproducible results. However, that alone\ndoes not guarantee that the results are correct.\n\nHomework:\n\nReduce your set of sampling points to a line from the front (window)\nof the room to the back. Then start with your command line above and\nmodify the parameters as discussed. Do more than one calculation with\nthe same set of parameters and plot and compare the results. Also keep\na record of the rendering times.\n\nA good set of options generates a smooth DF curve from the front of\nthe window to the back of the room that does not change a lot between\nseparate calculation runs. If the curve is not smooth your error is\ntoo high and you have to increase/decrease some values.\n\n\nRegards,\nThomas\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org<mailto:Radiance-general@radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n--\nZHANG Ji ?? (PhD) :: Research Fellow :: Centre for Sustainable Asian Cities :: School of Design and Environment :: National University of Singapore :: 4 Architecture Drive,  Singapore, 117566 :: Contact: 65-6516 5046 :: Email: sdezj@nus.edu.sg<mailto:sdezj@nus.edu.sg>\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20100713/64eb3b16/attachment-0001.htm\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] rtrace result varies for each calculati", "tags": [], "sender": "radiance-general-bounces@radiance-online.org", "datetime": "Tue Jul 13 07:38:54 2010"}