{"refs": ["<AANLkTimlBt-sih4IvjyCA4-au6QSqBmGaZ_PHHX8aoLL@mail.gmail.com>"], "id": "<AANLkTinMNj3z6aRAY0-9sEV7BErG5kg5sOBOeNGJ6BpP@mail.gmail.com>", "subject": "[Radiance-general] Prismatic glazings", "email": "aricanis at gmail.com", "body": "\nHi,\n\nI've searched list's archive to find out some data related to prismatic\nglazing simulation in Radiance. Here are some related questions.\n\n\nFirst question is where to find valid optical and geometrical data related\nto prismatic glazings. On various manufacturers' sites, like Siteco or\nInglas, there is only some descriptive info ,without any data useful for\nsimulations. I've found that some measuremens have been taken by Martin\nMoeck few years ago for Siteco glazings. Are results available somewhere?\n\n\nMy idea is to use these glazings in light pipe simulation, on top and/or\nbottom of pipe for light redirection, so I would go with pmap approach.\nSince prism material calculation is not implemented in pmap, I suppose some\ngeometrical definition of glazing would be necessary with usage of\ndielectric or interface material and then simulation with pmap.\nDoes anyone has some experience with geometrical definition and how much\naccurate it should be (beside examples in Ronald Schregle thesis)?\n\n\nIn Lars mail\nhttp://www.radiance-online.org/pipermail/radiance-general/2009-February/005793.htmlhe\nput some questions related to Fresnel diffusers simulation. Lars, have\nyou succeeded in these simulations? Can you share with us your experience?\n\n\nBeside pmap, would be rtcontrib be able to calculate light distribution from\nlight pipes, with new 3-phases method. In that case how to calculate and\ndefine BTDF for complete sun pipe system (collector + pipe + diffuser)?\n\n\nLots of questions, and don't know where to go next. So any info would be\nuseful.\n\nMarija,\nDe Luminae\nwww.deluminaelab.com\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20100714/a8bf2cfb/attachment.htm\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Prismatic glazings", "tags": [], "sender": "Marija Velickovic", "datetime": "Wed Jul 14 01:47:39 2010"}