{"refs": [], "id": "<402D54B5.3090107@lbl.gov>", "subject": "[Radiance-general] virtual lighting laboratory", "email": "adiance-general@radiance-online.org", "body": "\nThis is a multi-part message in MIME format.\n--------------000705070404080202000603\nContent-Type: text/plain; charset=us-ascii; format=flowed\nContent-Transfer-Encoding: 7bit\n\n\nHello. I would like to provide the link of my dissertation to the\nRadiance group. The dissertation is titled \"Transformations in\nArchitectural Lighting Analysis: Virtual Lighting Laboratory\". I had\npresented very early stages of the research during the 1. Radiance\nworkshop and some of you have asked about its progress during the 2.\nRadiance workshop. The link is:\nhttp://www-personal.umich.edu/~inanici/vll/vll.html\n<http://www-personal.umich.edu/%7Einanici/vll/vll.html>\n\nThis dissertation presents a framework for a computer generated luminous\nenvironment that supports the knowledge acquisition between the theory\nand the practice of architectural lighting. Per-pixel lighting\ninformation is extracted from the high dynamic range images (Radiance\nimages) through virtual meters and photometry systems. Formation and\nutilization of these virtual meters (luminance meter, illuminance meter,\ncontrast meter, integrating sphere, colorimeter, and scotopic meter) are\ndemonstrated. The total, regional, and per-pixel lighting data are\nprocessed to study the quantity, distribution, directionality, and\nspectral content of lighting.\n\nI would like to thank everybody in the Radiance online group, not only\nfor answering my questions, but for contributing to the rich information\nin the archives. I did not even have to ask many of the questions\nbecause the answers were readily available. Special thanks to Greg: I\nhave referred to many of his articles and of course, I have generated\nall of the images with Radiance.\n\nPlease let me know if you have questions or comments.\nThank you,\nMehlika Inanici\n\n--------------000705070404080202000603\nContent-Type: text/html; charset=us-ascii\nContent-Transfer-Encoding: 7bit\n\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\n<html>\n<head>\n<meta http-equiv=\"Content-Type\" content=\"text/html;charset=ISO-8859-1\">\n<title></title>\n</head>\n<body text=\"#000000\" bgcolor=\"#ffffff\">\n<big><br>\nHello. I would like to provide the link of my dissertation to the\nRadiance group. The dissertation is titled \"Transformations in\nArchitectural Lighting Analysis: Virtual Lighting Laboratory\".<big> </big>I\nhad presented very early stages of the research during the 1. Radiance\nworkshop and some of you have asked about its progress during the 2.\nRadiance workshop. The link is</big><big>: &nbsp; </big><big><a\nhref=\"http://www-personal.umich.edu/%7Einanici/vll/vll.html\">http://www-personal.umich.edu/~inanici/vll/vll.html</a><br>\n<br>\nThis dissertation presents a framework for a computer generated\nluminous environment that supports the knowledge acquisition between\nthe theory and the practice of architectural lighting. Per-pixel\nlighting information is extracted from the high dynamic range images\n(Radiance images) through virtual meters and photometry systems.\nFormation and utilization of these virtual meters (luminance meter,\nilluminance meter, contrast meter, integrating sphere, colorimeter, and\nscotopic meter) are demonstrated. The total, regional, and per-pixel\nlighting data are processed to study the quantity, distribution,\ndirectionality, and spectral content of lighting.<br>\n<br>\nI would like to thank everybody in the Radiance online group, not only\nfor answering my questions, but for contributing to the rich\ninformation in the archives. I did not even have to ask many of the\nquestions because the answers were readily available. Special thanks to\nGreg: I have referred to many of his articles and of course, I have\ngenerated all of the images with Radiance.<br>\n<br>\nPlease let me know if you have questions or comments.<br>\nThank you,<br>\nMehlika Inanici <br>\n</big>\n</body>\n</html>\n\n--------------000705070404080202000603--\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Mehlika Inanici", "datetime": "Fri, 13 Feb 2004 14:50:29 -0800"}