{"body": "\nHello,\n\nI am trying to simulate a window optical daylighting system (LightLouver) in Radiance and am seeing some weird behaviour.\n\nThe IES file I am modeling is completely asymmetric and it appears as if Radiance treats the horizontal angles in a clockwise fashion whereas the IESNA standard is to treat the horizontal angles in a counter-clockwise fashion.? A photometric representation of the file can be seen here:\n\nhttp://home.comcast.net/~z.rogers/LiLo_photometric1.jpg\n\nand here:\n\nhttp://home.comcast.net/~z.rogers/LiLo_photometric2.jpg\n\nThis is an IES file that I made for a daylighting system that sits vertically in a window using a forward ray-tracing program (TracePro).? I defined it with Type C photometry; the 0 vertical angle is perpendicular to the window pointing into the room and the 0 horizontal angle is up (+Z).? The window is roughly 5' wide by 2' high and can be seen in these images as the blue rectangle.? It is apparent that the main daylight distribution is entering the room, above the horizontal and angled to the left as it enters the space.? This is as expected as this is for a south-west facade at noon.? This illustrates that the IES file was defined with the horizontal angles proceeding in a counter-clockwise fashion according to a right-hand rule.? And the the 0 horizontal angle is defined as up or in the direction of the smaller window dimension.\n\nI then attempted to place this IES file into the room I am modeling, seen here:\n\nhttp://home.comcast.net/~z.rogers/Lilo_room.jpg\n\nwhich gives me this rendering (low quality but the distribution of light is apparent):\n\nhttp://home.comcast.net/~z.rogers/lilo_e12pm_bad.gif\n\nSo my first question is relative to the 0 horizontal angle and which axis IES2RAD assumes for this.? It reads in the source.cal file that +x axis is the 0 horizontal angle and the -y is the 90 deg angle.? However, to get the rendering shown above I had to have my replmarks marker with +y up which seems to disagree with the header of the source.cal file.? I also have to define the longer dimension as x and the shorter dimension as y, similarly in disagreement with the source.cal file header.? When I try rendering it with +x as up I get a strange and obviously incorrect rendering.? Is this a bug or am I mis-interpreting this?\n\nMy second question is relative the progression of horizontal angles.? The rendering obviously disagrees with the photometric illustration as the light is entering the room to the right rather than to the left as it was in the photometric view and as it should be given my daylight conditions.? Does Radiance treat the horizontal angles in a clockwise (left-hand rule) fashion or am I mis-interpretting this?? IESNA does define the other way.\n\nThe fix I figured out for this second issue is in the source.cal file.? Instead of this:\n\nsrc_phi = mod( Atan2(Dy, -Dx) / DEGREE, 360 );??? { 0-360 }\n\nI made the -Dx a positive like this:\n\nsrc_phi = mod( Atan2(Dy, Dx) / DEGREE, 360 );??? { 0-360 }\n\nand this gave me a rendering with the light going in the direction I was expecting.\n\nOne final question; anybody have a way to get Type B photometry into Radiance?? It seems like IES2Rad does not like this type.\n\nI hope all that made sense.? Any help is much appreciated!? I hope to see some of you at the upcoming conference!\n\nRegards,\nZack\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20070921/43ea2dfb/attachment.html\n", "replyTo": "", "sender": "Zack Rogers", "isquestion": true, "tags": [], "id": "<1249713113.8861190432374279.JavaMail.root@babel.archenergy.com>", "refs": [], "datetime": "Fri Sep 21 20:39:43 2007", "email": "zrogers at archenergy.com", "subject": "[Radiance-general] IES2Rad questions"}