{"body": "\n(apologies for cross postings)\n\n\n\nCall for abstracts - eSim 2008\n\n\n\n21-22 May 2008\n\nQu?bec City, Canada\n\nwww.esim.ca\n\n\n\nThe bi-annual conference of IBPSA-Canada is being organized to bring together professionals, academics and students interested in building performance simulation issues and applications. It will be held in Qu?bec City, Canada on May 21 and 22, 2008 (pre-conference workshops May 20, 2008). The conference will be hosted by l'?cole d'architecture de l'Universit? Laval in Qu?bec City, in collaboration with the National Research Council of Canada.\n\n\n\nL'?cole d'architecture, part of the Facult? d'am?nagement, d'architecture et des arts visuels de l'Universit? Laval, is located within the fortifications of the historic district of Qu?bec City. The nearby Mus?e de la civilisation, located in the city's old port district will serve as the main conference venue (www.mcq.org <http://www.mcq.org/> ). 2008 will be a landmark year for Qu?bec as the city will be celebrating the 400th anniversary of its founding in 1608. Although most celebrations will be held from June to August, the end of May is expected to be a festive - and busy - time of year in this part of the city (www.monquebec2008.com <http://www.monquebec2008.com/> ). Attendees are encouraged to book hotel rooms as soon as possible. Please visit the conference web site www.esim.ca <http://www.esim.ca/>  for more information.\n\n\n\nOnly original papers related to the conference topics and not published elsewhere will be accepted. All accepted papers accompanied by a conference registration will be published in the conference proceedings, and presented at the conference in parallel oral sessions. In the event submissions exceed the conference presentation quota, poster sessions will be held to accommodate additional papers. Each registration entitles the author to submit a single paper/poster. One additional paper/poster per registration is allowed against a special fee.\n\n\n\nConference themes\n\n*         Recent developments for modelling the physical processes relevant to buildings (thermal, air flow, moisture, lighting).\n\n*         Algorithms for modelling conventional and innovative HVAC systems.\n\n*         Methods for modelling the whole-building performance, including integrated resource management, renewable energy sources and combined heat, cool and power generation.\n\n*         Building simulation software development and quality control approaches.\n\n*         Use of building simulation tools in code compliance and incentive programmes.\n\n*         Moving simulation into practice. Case studies of innovative simulation approaches.\n\n*         Validation of building simulation software.\n\n*         User interface and software interoperability issues.\n\n*         Architectural and engineering data visualization and animation.\n\n*         Optimization approaches in building design\n\n\n\nThe deadline for abstracts is: Monday, October 22, 2007.\n\nThe abstract must be in plain text and be a maximum of 500 words. eSim 2008 is a bilingual conference and abstracts, papers and presentations will be accepted in either English or French.  Please submit abstracts to the eSim 2008 web site at: www.esim.ca <http://www.esim.ca/>\n\n\n\nAt least two reviewers will be assigned by the Scientific Executive Committee to examine each abstract in a double-blind review process. Corresponding authors will be informed of the abstract review results by December 4, 2007.\n\n\n\nConference Chair:\n\nDr. Denis Bourgeois denis.bourgeois@arc.ulaval.ca\n\n\n\nChair of the Scientific Committee:\n\nDr. Christoph Reinhart christoph.reinhart@nrc-cnrc.gc.ca\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20070917/6f9c7ee6/attachment.htm\n", "replyTo": "", "sender": "Denis J. Bourgeois", "isquestion": true, "tags": [], "id": "<DF36C80B7884EE4A86EB6FD397921C382BF1FF@exch-be02.ulaval.ca>", "refs": [], "datetime": "Mon Sep 17 18:42:32 2007", "email": "Denis.Bourgeois at arc.ulaval.ca", "subject": "[Radiance-general] eSim 2008 - Call for Abstracts"}