{"body": "\nDear Radiance users\n\nContinuing the discussion on the use of global illumination, I'd like to\ncontribute three points to the discussion.\n\n1)  Orientation of the HDRI background image on the global environment cube.\n\n2)  Lighting ratios for correct exposure when using other light sources in\nconjunction with a global illumination background.\n\n3) Excluding materials and geometry with -ae argument in relation to -ar\nargument and determination of scene bounding cube values.\n\n-----------------------------------------------------------------------\n\n1)  When I was first experimenting with a global illumination background,\nthe background was rendering rotated through 90 degrees.  This issue was\nmentioned by another user on this thread.  I corrected this problem by\nsimply transposing two values in the CAL file angmap.cal.  Different CAD\nsoftware sometimes re-orient the CAD model through 90 degrees, so\nexperimentation may be necessary.  Here is the first\nversion by Paul E. Debevec :\n\n####################################\n\n{\nangmap.cal\n\nConvert from directions in the world to coordinates on the angular sphere\nimage\n\n-z is forward (outer edge of sphere)\n+z is backward (center of sphere)\n+y is up (toward top of sphere)\n}\n\nsb_u = 0.5 + DDx * r;\nsb_v = 0.5 + DDy * r;\n\nr = 0.159154943*acos(DDz)/sqrt(DDx*DDx + DDy*DDy);\n\nDDy = Py*norm;\nDDx = Px*norm;\nDDz = Pz*norm;\n\nnorm = 1/sqrt(Py*Py + Px*Px + Pz*Pz);\n\n####################################\n\nHere is the corrected file for use with a cube with inward facing normals\ncreated in CAD software:\n\n####################################\n\n{\nangmap2.cal\n\nConvert from directions in the world to coordinates on the angular sphere\nimage\n\n-z is forward (outer edge of sphere)\n+z is backward (center of sphere)\n+y is up (toward top of sphere)\n\nDDy and DDz were transposed for correct alignment.\n}\n\nsb_u = 0.5 + DDx * r;\nsb_v = 0.5 + DDy * r;\n\nr = 0.159154943*acos(DDz)/sqrt(DDx*DDx + DDy*DDy);\n\nDDz = Py*norm;\nDDx = Px*norm;\nDDy = Pz*norm;\n\nnorm = 1/sqrt(Py*Py + Px*Px + Pz*Pz);\n\n####################################\n\n-----------------------------------------------------------------------\n\n2)  When using other light sources in conjunction with a global illumination\nbackground, it is necessary to consider the lighting ratios between\ndifferent light sources and the global illumination background.  Radiance is\nso similar to real world lighting that a Radiance user should try and think\nlike a photographer balancing lighting ratios on a set, for example.\n\nWhen I first experimented with global illumination backgrounds, I found\nthat the HDRI image on the global environment cube was\nemitting light several thousand times more intense than spotlights in the\nscene, so when PFILT exposed for the background, illumination from the\nspotlights disappeared.  Either the spotlight intensity could be increased\nto an appropriate ratio, or in my case, I re-exposed the HDRI background\nwith PFILT, reducing its intensity by several thousand times before using\nit as a global illumination background.  Experimentation is often necessary.\n\n-----------------------------------------------------------------------\n\n3)  Please can the issue be clarified concerning excluding materials and\ngeometry with -ae argument in relation to -ar argument, ambient resolution\nand determination of scene bounding cube values.\n\nFor example, if a small object is surrounded by a huge cube being used as\nthe global illumination background, it would be desirable for the ambient\nresolution to be concerned only with the small object, otherwise a huge -ar\nvalue would be required, adversely influencing rendering time.  If the -ae\nargument is used to exclude a material and thus the associated geometry\n(preferably of the global illumination cube), does the ambient resolution\ndetermined by -ar now only consider the small object and divide the ambient\nresolution across this small object, or does it still look at the bounding\ncube for the whole scene, including the global illumination cube?\n\n-----------------------------------------------------------------------\n\nUsers interested in viewing a high quality render using global illumination\nmay be interested in viewing a current project (under construction) at the\nfollowing Internet address:\n\nwww.daiservices.btinternet.co.uk/Virtual_Sculpture/Virtual_Sculpture.htm\n\n\nJohn Graham\nDAI Services\n\n\n\n\n\n", "replyTo": "", "sender": "Digital Architectural Illustration Services", "isquestion": true, "tags": [], "id": "<000301c329e5$355ddfa0$6c6c8751@register>", "refs": [], "datetime": "Tue, 3 Jun 2003 16:17:09 +0100", "email": "radiance-general@radiance-online.org", "subject": "[Radiance-general] Re: physically-based landscapes"}