{"refs": ["<AANLkTilwA0Btv5QF0O7_GjZQ_h5TkQfvWkh3XsKmA5cm@mail.gmail.com>", "<4C3F6A8C.6000804@visarc.com>", "<AANLkTimq8awsr48-gammiikQaLSjNHPVNVNTU3Xv8H1t@mail.gmail.com>"], "id": "<28285BAEA8C0814DBF1B199C876EC5B047930DF0ED@AMXEXC01.global.arup.com>", "subject": "Re: [Radiance-general] revising geometry", "email": "adiance-general-bounces@radiance-online.org", "body": "\nIf you have a rad file of a piece of furniture, with the furniture origin at 0,0,0, but you want to array it within your model, try the following xform command. Check the manpage of xform and adjust parameters as needed. The rad file to define your individual item must be in the same directory. This example makes a 2x3 array with 40x70 unit spacing starting at x,y,z of 500,200,0. Scripting makes this an easy way to vary your furniture or lighting layout. Leave off the ! if you run xform yourself or directly from a script, or keep the initial ! for the following line within a rad file of its own to include with your scene. Use multiple xform commands with only the first \"-t x y z\" if your added geometry is not a neat and tidy array.\n\n!xform -t 500 200 0 -a 2 -t 40 0 0 -a 3 -t 0 70 0 singlefurniture.rad\n\n\n\nSent: Thursday, July 15, 2010 4:16 PM\nTo: Radiance general discussion\nHello Jack:\n\nI create the majority part of the geometry in Revit and then export the geometry to Radiance. In Radiance, I will add some other geometries (not complicated), such as lighting, blinds , simple furniture and windows. Another reason I want to know the coordinates is that when I adjust some view parameters such as the view point I also need to know the coordinate.\n\nThank you,\n\nJia\nOn Thu, Jul 15, 2010 at 4:07 PM, Jack de Valpine <jedev@visarc.com<mailto:jedev@visarc.com>> wrote:\nHi Jia,\n\nHow did you create your geometry? What kinds of changes are you trying to make? Depending on the extend of the changes, updates or modifications it probably makes much more sense to use a 3D modeling application to make these changes and then re-export the geometry to Radiance.\n\nRegards,\n\n-Jack de Valpine\n\n--\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com<http://www.visarc.com/>\n#\n# channeling technology for superior design and construction\n\n\n\nJia Hu wrote:\nHello:\nIf I intend to revise the model in Radiance, I need to know the coordinate so that I can transform or generate new geometry.\nMy current methods of checking coordinates are\n(1) using rvu option \"trace\" to see the coordinate of the image.\n(2) export rad to other software to view the geometry (I saw a recent post by\nRandolph to discuss about \"Radiance Geometry Export\", but I have not tried)\nIs there a better way to show the x, y z axis in the image of Radiance and easily check the\ncoordinate? What is your practice of adding or revising geometry in Radiance?\nThank you for sharing your experience,\nJia\n------------------------------------------------------------------------\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org<mailto:Radiance-general@radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org<mailto:Radiance-general@radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20100715/47d6a739/attachment-0001.html\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] revising geometr", "tags": [], "sender": "radiance-general-bounces@radiance-online.org", "datetime": "Thu Jul 15 13:54:02 2010"}