{"body": "\n(apologies for cross-postings)\n\n\n\nCall for software demos - eSim 2008\n\n\n\n21-22 May 2008\n\nQu?bec City, Canada\n\nwww.esim.ca\n\n\n\nThe bi-annual conference of IBPSA-Canada will be held in Qu?bec City, Canada on May 21 and 22, 2008 (pre-conference workshops May 20, 2008). The event will be hosted by l'?cole d'architecture de l'Universit? Laval, in collaboration with the National Research Council Canada.\n\n\n\nSoftware companies and individuals are invited to take part in special software demos sessions during the conference. Much like technical presentations, the software demos sessions will consist of presentations in front of an audience. However, these presentations will not be peer-reviewed and therefore not included in the conference proceedings - although the submission of a technical paper on the software that meets one of the conference themes is encouraged! To be eligible for a presentation during the software demo sessions, the software must be a commercial product or be freely available (on a web site for example). Furthermore, the presenter must be a registered participant. Please note that the scientific committee has the right to limit the number of software tools being presented.\n\n\n\nThe deadline to submit a software is November 27, 2007. To submit your software, just click on the \"Software Demo Submission\" tab on www.esim.ca <http://www.esim.ca/>\n\n\n\nPlease also be reminded that the deadline for submitting a paper abstract is October 22 - less than 10 days from now!\n\n\n\nConference Chair:\n\nDr. Denis Bourgeois denis.bourgeois@arc.ulaval.ca\n\n\n\nChair of the Scientific Committee:\n\nDr. Christoph Reinhart christoph.reinhart@nrc-cnrc.gc.ca\n\n\n\n\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20071013/da54363a/attachment.htm\n", "replyTo": "", "sender": "Denis J. Bourgeois", "isquestion": true, "tags": [], "id": "<DF36C80B7884EE4A86EB6FD397921C382BF26D@exch-be02.ulaval.ca>", "refs": [], "datetime": "Sat Oct 13 03:58:25 2007", "email": "Denis.Bourgeois at arc.ulaval.ca", "subject": "[Radiance-general] eSim 2008 - Call for software demos"}