{"refs": ["<AANLkTikbPYYjhl4cIxUwZ-z7DfsXHAKg5pB65o0xtwrU@mail.gmail.com>", "<993B3947-4363-489B-A4E5-1BDE62B6FD95@lmi.net>"], "id": "<AANLkTilwabHRsAAdvNm5nFcPcEhrMkPrz13oWRC50HdX@mail.gmail.com>", "subject": "[Radiance-general] ar and aa", "email": "hujia06 at gmail.com", "body": "\nSorry for the typo, I meant to compare \"-ar\" and \"-aa\".   I can understand\nyour explanation as to -ar and -aa.\n\nThe book and some online materials also discussed about the meaning of -ar\nand -aa. And they seem to explain it from a different perspective. For my\nunderstanding of those statements, the interpolation will always happen when\nthe distance between two points is less than minimum spacing distance\n(sceneSize * aa /ar). When the distance between two points is larger than\nthe minmum spacing distance, interpolation may happen if the point is within\nthe \"radius of validity\" of another point. In other words, the minimum\n\"radius of validity\" is sceneSize *aa /ar?\n\nAccording to Greg's explanation, when the point falls within SceneSize / ar,\nthe accuracy starts to relax. Can I say that when the error gets its\nmaximum, -aa, when the point falls within the minimum spacing distance\n(SceneSize *aa /ar)?   I know there must be something wrong with my\nunderstanding about this issue. But I can not find where the problem is.\nThe book Rendering with Radiance says \"  -ar parameter acts as a limiting\ndevice and If you are already running up against the -ar limit, increasing\nthe setting will result in a higher density of sampling. If the limit has\nnot been reached, then increasing -ar should have no effect.\" I also have\ndifficulty in understanding the term \"limiting device\".\n\nThank you for help.\n\nJia Hu\nOn Mon, Jul 19, 2010 at 2:31 AM, Greg Ward <gregoryjward@gmail.com> wrote:\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20100719/2fb79030/attachment.htm\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] ar and aa", "tags": [], "sender": "Jia Hu", "datetime": "Mon Jul 19 10:47:55 2010"}