{"refs": ["<AANLkTikbPYYjhl4cIxUwZ-z7DfsXHAKg5pB65o0xtwrU@mail.gmail.com><993B3947-4363-489B-A4E5-1BDE62B6FD95@lmi.net>", "<AANLkTilwabHRsAAdvNm5nFcPcEhrMkPrz13oWRC50HdX@mail.gmail.com>"], "id": "<C5E1527F129BF545A250B5AD0B0C26EF07654670@ENTWEXMB0000000.university.harvard.edu>", "subject": "Re: [Radiance-general] ar and aa", "email": "Jia Hu", "body": "\nI share Jia's confusion. Greg, I remember that we had asked you the same\nquestion during the Radiance workshop last year but I still do not get\nit? Could you explain the relationship between aa and ar one more time?\n\n\n\nChristoph\n\n\n\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of Jia\nHu\nSent: Monday, July 19, 2010 1:48 PM\nTo: Radiance general discussion\n\n\nSorry for the typo, I meant to compare \"-ar\" and \"-aa\".   I can\nunderstand your explanation as to -ar and -aa.\n\n\n\nThe book and some online materials also discussed about the meaning of\n-ar and -aa. And they seem to explain it from a different perspective.\nFor my understanding of those statements, the interpolation will always\nhappen when the distance between two points is less than minimum spacing\ndistance (sceneSize * aa /ar). When the distance between two points is\nlarger than the minmum spacing distance, interpolation may happen if the\npoint is within the \"radius of validity\" of another point. In other\nwords, the minimum \"radius of validity\" is sceneSize *aa /ar?\n\n\n\nAccording to Greg's explanation, when the point falls within SceneSize /\nar, the accuracy starts to relax. Can I say that when the error gets its\nmaximum, -aa, when the point falls within the minimum spacing distance\n(SceneSize *aa /ar)?   I know there must be something wrong with my\nunderstanding about this issue. But I can not find where the problem is.\n\n\nThe book Rendering with Radiance says \"  -ar parameter acts as a\nlimiting device and If you are already running up against the -ar limit,\nincreasing the setting will result in a higher density of sampling. If\nthe limit has not been reached, then increasing -ar should have no\neffect.\" I also have difficulty in understanding the term \"limiting\ndevice\".\n\n\n\nThank you for help.\n\n\n\nJia Hu\n\nOn Mon, Jul 19, 2010 at 2:31 AM, Greg Ward <gregoryjward@gmail.com>\nwrote:\n\nI assume you meant to compare \"-aa\" and \"-ar\" in your first sentence.\nThese are not two variables that affect the same behavior -- not much\npoint in that.  Rather, think of the -ar setting as determining a scene\nresolution below which the accuracy of the indirect calculation (as\ndetermined by the -aa parameter) will start to relax.  If you divide\nyour global scene size (the fourth value reported by \"getinfo -d\noctree\") by the -ar setting, you will get the scene size below which the\nindirect calculation will begin to lose accuracy.\n\nBest,\n-Greg\n\n\n\n\nHello experts:\n\nIs that right doubling the value of \"aa\" has the same effect as\ndecreasing the value of \"aa\" by half?  The minimum distance between\nsampling points is the same according to the formula: SceneSize * aa /\nar.\n\nCheer,\nJia\n\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20100720/3698519d/attachment.html\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] ar and aa", "tags": [], "sender": "hujia06@gmail.com", "datetime": "July 16, 2010 8:17:48 PM PDT"}