{"body": "\nDear Dr. Ward.\nHello. My name is Ji-hyun Kim, majoring Architectural Visual Environment at\nthe Hanyang graduate school in Korea.\nI hope this e-mail will not bother your busy time.\n\nNow, I am analyzing solar specular reflection effect by buildings' coated\nglass with the RADIANCE program.\nThe purpose is to measure characteristics of coated glass materials which\nare considered in real design process and to make a simulation applying the\ndata.\n\nIn order to figure out the characteristics of ordinary materials, I used\nSpectraphotometer to measure reflectance value and input the other data,\nI could not see solar specular reflection effect clearly so I have tried to\nuse BRTDfunc option to make a simulation of coated glass materials'BRDF\ncharacteristics.\n\nWhile I was looking for the research materials, I found out that the input\ndata of BRTDFunc option is various as below.\n\nMod BRTDfunc id\n10+ rrefl  grefl  brefl\nrtrns  gtrns  btrns\nrbrtd  gbrtd  bbrtd\nfuncfile   transform\n0\n9+  rfdif  gfdif  bfdif\nrbdif  gbdif  bbdif\nrtdif  gtdif  btdif\nA10.\n\nI roughly understood the definition of input data. I tried to find out what\nmethod I can use to measure it but I could not find the suitable\ninformation.\nSo I would like to ask you some questions.\n\n1. When I simulate materials, which I use in real, on RADIANCE, how I can\nmeasure the input data that is needed in RADIANCE,\nand how I can divert the measured data to BRTDfunc input data such as rrefl,\nrfdif, rbdif. rtdif etc. in order to apply it?\n\n2. Ordinarily BRDF is defined by intensity of the wavelength according to\naltitude angle of incident light and azimuth angle and altitude angle of\nreflected light and azimuth angle.\nI figured out that the dat file by four values above is needed like IES file\nbut I could not find the data about applied cases and composition of dat\nfile.\nIs there any method to use data in dat file form? If there is, I wonder how\nI can make dat file form.\n\nIf it is possible, I am going to use gonioreflectometer, which we made, to\nmeasure and apply BRDF data in artificial sky-dome.\n\n3. In case of LBNL_glz\\blue_refl.rad file in DATABASE of Desktop RADIANCE,\nBRTDfunc is defined as below.\n\nvoid \tglass \tblue_refl_glass\n0\n0\n3\t0.206104\t0.194473\t0.17589\n\n\nvoid \tBRTDfunc\tblue_refl_front\n10\n0.188941\t0.178277\t0.161239\n0.356133\t0.400754\t0.340173\n0 0 0\n.\n0\n9 0 0 0 0 0 0 0 0 0\n\nvoid \tBRTDfunc\tblue_refl_back\n10\n0.188941\t0.178277\t0.161239\n0.084167\t0.17056\t0.175861\n0 0 0\n.\n0\n9 0 0 0 0 0 0 0 0 0\n\nI think this case is a bit different. The part of void  BRTDfunc\nblue_refl_front, I think blue_refl_glass is suitable instead of void.\nI understood that when identifire is void it is defined as a new material so\nI wonder what kind of definition is made above.\nAlso, when it set up blue_refl glass material, all input data related to\ndiffuse reflection have 0 values. It means that diffuse is not at all\nconsidered?\nIn my opinion, when I simulate BRDF effect by coated glass the values\nrelated to diffuse reflection would be important. How about your opinion?\n\n4. While I was studying related materials, I found rayinit.cal file,\nglazing.cal file and glaze1.cal file.\nIn case of Glazing.cal file, reflectance and transmittance of coated glazing\nare measured by using window 4 programs.\nIn my opinion, the RADIANCE option we needed is using glazing.cal file and\nit depends on clear and bronze-coated glazing.\nWhen I apply the glazing.cal file on various coated glasses, how can I set\nup the variables to simulate?\n\nCould you give me advice about the way of simulation or setting rendering\noption of rpict command\nwhen I simulate glare due to the solar specular reflection?\n\n\nI am using RADIANCE program personally. I fully understand how to make basic\nimage but\nI have a trouble with understanding of making and revising cal file and\nFunction File so it is difficult to use RADIANCE Program entirely.\n\nI am waiting your advice to make the best use of RADIANCE.\n\nSincerely your,\nJi-hyun Kim.\n\n\n", "replyTo": "", "sender": "jhkim94@aesl.hanyang.ac.kr", "isquestion": true, "tags": [], "id": "<200710221516.l9MFGDsJ000644@aesl.hanyang.ac.kr>", "refs": [], "datetime": "Mon Oct 22 08:09:00 2007", "email": "jhkim94 at aesl.hanyang.ac.kr", "subject": "[Radiance-general] Question regarding the BRTDFunc..."}