{"refs": [], "id": "<DC0CAEEA090E984C911D3B85B16C3F90FAF291@l-gnts05>", "subject": "Re: [Radiance-general] mixfunc for dichroic film?", "email": "adiance-general-bounces@radiance-online.org", "body": "\nI tried simulating caustics in Radiance classic (3.6a) by using mixfunc\n(mirror + plastic with pattern)\nI realized that Radiance does not look for virtual sources into mixed\ndefinitions:\ncould you confirm that?\n\ncheers,\n\ngiulio\n\n\nPS sorry for the slightly different topic, it is just another mix-question\nto add...\n\n\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org]On Behalf Of Greg\nWard\nSent: 01 March 2004 17:10\nTo: Radiance general discussion\n\nHi John,\n\nAnother argument for using the BRTDfunc or transfunc types is that they\ndon't require new ray evaluations for each new material type, which is\na penalty you pay when you blend materials with a mixfunc.  Although it\nis tempting, you really should avoid using mixfunc with materials\nunless there really is no other way.  Originally, mixfunc would only\nblend patterns and textures, and this is still its primary purpose.\nHowever, using mixfunc as a this-or-that switch with materials doesn't\nincur the same penalty as smoothly blending them, because only one or\nthe other material is ever evaluated.  If one of the materials is\n\"void,\" you can get a kind of selective absence of a surface, which can\nbe useful for screen doors, gratings, etc.\n\nI'm not familiar with dichroic materials in an architectural context.\nCan you be more specific as to the behavior you wish to simulate?\n\n-Greg\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n___________________________________________________________________\nElectronic mail messages entering and leaving Arup business\nsystems are scanned for acceptability of content and viruses.\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "adiance-general-bounces@radiance-online.or", "datetime": "Mon Mar  1 18:21:43 2004"}