{"refs": ["<E35477F1A321144D897D44CCAAFF202C048D146D6B@AD-MAILBOX01.aau.dk>"], "id": "<AANLkTin0NaiaR0vJ+781uQGPx+jBtYzXiSxTU+DsKNYb@mail.gmail.com>", "subject": "[Radiance-general] Computing irradiances for glow materials", "email": "tbleicher at googlemail.com", "body": "\nMorning.\n\nMy comments are below to keep the context of the question.\n\n2010/8/4 Claus Br?ndgaard Madsen <cbm@create.aau.dk>:\n\nAs a side note: You can get rid of light sources with the \"-dv\" switch\nof rpict. However, sky domes are usually made out of the \"glow\"\nprimitive which is treated differently than a proper \"source\".\n\nIn any case, to eliminate the sky dome in your second image just set a\n\"-va\" clipping plane just behind your geometry.\n\n\nIf I understand correctly, you want to use the projected texture as\nHDR light source. Your problem now is that you can not show irridiance\nvalues because your scene is made up of glow materials for which rpict\ndoes not show irridiance values (that's why it's called \"glow\").\n\nOne idea would be to split the texture image in two or more parts and\ndefine only the surfaces covered by a partial image as glow. The rest\nis an ordinary plastic material which will show irridiance values. You\nthen create separate images and add up all the irridiance values to\ncreate the final image. You probably have to use \"-dv\" as well to keep\nthe glow surfaces out of the partial image (although I don't really\nknow if that affects \"glow\").\n\nWhen you split the image you have to check which surfaces can\nilluminate others. For example the roof can illuminate the chimney but\nnot the walls. This also shows a problem of  your method of projecting\nthe image from a single camera view point: The lantern on top of the\nbuilding is partially hidden by the chimney so it's texture will not\ncover the full geometry. However, the roof could receive light from\nthe whole structure but because there is no texture there the hidden\npart will not contribute to the irridiance on the roof. Of course\nthat's only a problem if you only do have a single camera view point.\n\nAnother more complex solution to your problem would be the following:\n\n1) You create the view point and direction of each image pixel with vwrays.\n2) Along each ray you check for an intersection with the geometry.\n3) At the intersection point you calculate the irridiance value with\n\"rtrace -I\" using the intersection point and surface normal as origin\nand direction. The calculated value gives you the RGB values for this\npixel.\n4) You compile a new image pixel by pixel out of individual irridiance values.\n\nAlthough that sounds complicated it is possible to do this in Radiance\nwith a single (long) command line. You can find an introduction to the\nvarious tools and their command options here:\n\nhttp://sites.google.com/site/tbleicher/radiance/stencil\n\n\nHappy reading,\nThomas\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Computing irradiances for glow materials", "tags": [], "sender": "Thomas Bleicher", "datetime": "Wed Aug  4 02:39:54 2010"}