{"body": "\nHi Rob,\n\nRob Guglielmetti wrote:\nWell, I've been known to be a bit of a curmudgeon myself....\nparticularly on this topic\nNo and I would suggest that real BIM is completely disruptive, so it\ngoing to be interesting. And I am trying to consider how this technology\nmight be useful for us, not close to any answers at all though.\nYeah, I have never really understood the layering standards (not that I\never paid much attention to them). We have always tried to be pretty\nfunctional in terms of naming conventions (glass-vision, glass-frit,\nint-wall, int-ceil ....), it just make the layers more intelligible at\nleast for our needs.\nHmm, well I will be interested to hear more about this. I guess my\nrecent experience with the tool make me feel like washing my hands (but\nthis has more to do with a big ugly model than anything else)... I still\nhave my evaluation going so I should do some experiments on real models.\n\nI think bigger picture though, the real intermediate file format for\nbetter or worse is obj, the main problem with this in my mind is then\nloosing out on selected Radiance primitives such as spheres, cylinders,\nand polygons of vertices > 4... as well as having more potential issues\ncontrolling tessellations of geometry that must NOT be tessellated such\nas geometry being used in any illum source location.\n\n--\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n\n", "replyTo": "Subject: [Radiance-general] dxf2rad", "sender": "Jack de Valpine", "isquestion": false, "tags": [], "id": "<471E6F40.30309@visarc.com>", "refs": ["<DIIE.00001C26000268F1@192.168.0.81>\t<DC5F0632-A893-4754-943A-DA681EB0B545@mac.com>\t<471DEC69.6090706@visarc.com>\t<59F80A78-BBB8-412C-9F9B-6D8DC4042DA6@arcor.de>\t<471E4582.7050304@visarc.com>\t<471E4DD5.3080106@rumblestrip.org>", "<471E515C.1010208@visarc.com>\t<471E5722.7060402@rumblestrip.org>", "<471E59FF.7030809@visarc.com> <471E6503.30105@rumblestrip.org>"], "datetime": "Tue Oct 23 15:02:03 2007", "email": "jedev at visarc.com", "subject": "[Radiance-general] dxf2rad"}