{"refs": ["<E35477F1A321144D897D44CCAAFF202C048D146D6B@AD-MAILBOX01.aau.dk><AANLkTin0NaiaR0vJ+781uQGPx+jBtYzXiSxTU+DsKNYb@mail.gmail.com><4C59C3B1.9080602@gmx.net><53712E7580A846E28012D3BAF84D288D@mmgsal.com><AANLkTim8MXA1x0NTcWzm-X6bG+9Z4HLCo+7SO6S-01mf@mail.gmail.com><BA215A87697445D184DF6485C9693577@mmgsal.com>", "<AANLkTin-X_YsmiTDd+ZGyk73CYdiDyZjMbwt0OyKXFdK@mail.gmail.com>", "<3CB2191A006D4424A22300C12B2D95C3@mmgsal.com>\t<4C5C1A38.9010106@visarc.com>", "<bad2a9c420a855683ead8109a30eb859.squirrel@www.eegroup.info>"], "id": "<28285BAEA8C0814DBF1B199C876EC5B048631FDE02@AMXEXC01.global.arup.com>", "subject": "[Radiance-general] Rado", "email": "Christopher.Rush at arup.com", "body": "\nIf you want to stick with AutoCAD, have you tried TORAD.lsp that has been posted (with modification as required for your version)?\n\nMy 2 cents on other options...\n\nI would comment that Rhino and Sketchup both produce good OBJ files that can be converted with obj2rad. You will have to start paying attention to material assignments (instead of or in addition to layers that you would have been used to in AutoCAD). Rhino is probably more expensive, but handles curved geometry much better, and has a more flexible command line interface similar to AutoCAD. Sketchup focuses on being more intuitive, but can be limited in some ways like coordinate entry. Sketchup has the su2rad plugin, and Rhino now has DIVA for additional options to get models into Radiance based simulations.\n\nLars has suggested FormZ, which seems comparable to Rhino but maybe less popular.\n\nThere is also Blender, which is an open source software similar to 3DSMax. It claims to export to OBJ, so may be a good try for a free test before putting money into another modeling package.\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Radout", "tags": [], "sender": "Christopher Rush", "datetime": "Fri Aug  6 13:31:33 2010"}