{"body": "\nHi,\n\nhere come the interesting parts of the mails between Greg and me (my stuff\nquoted, a few additional links added):\n\n------------------------------------------------------------------------------\n\n\nIt probably works with the new version.  My problem was getting the newer\nversion to compile on Macs and FreeBSD was proving problematic, and I didn't\nneed any of its features so I was lazy and just fell back to one that worked.\n\n------------------------------------------------------------------------------\n\n\nGeorg Mischler <schorsch@schorsch.com> is responsible for the SCONS build\nsystem, which is there to make compiling under Windows less painful.  I don't\nknow what its status is, and Schorsch has been pretty difficult to raise these\ndays.\n\n------------------------------------------------------------------------------\n\n\nDefinitely the renderers, \"rpict,\" \"rtrace,\" and \"rvu\" built in src/rt.  After\nthat, maybe some of the libraries in src/common, especially the cal*.c routines.\nI'd have to think about it after that....\n\n------------------------------------------------------------------------------\n\n\n\nI never wrote man pages for these, as they are specialty programs used by\nexperts, for the most part.  Some aren't used at all, and probably shouldn't be\ncompiled (like pcwarp and plot4).  No one else has written man pages for\nanything, as far as I know.  You are welcome to give it a go if you have time,\nbut I don't even have time at the moment to go through them, really.\n\nhttps://ssl.recluse.de/svn/debian/trunk/packages/radiance/debian/radiance-experttools.sgml\n\n------------------------------------------------------------------------------\n\n\n\nI don't think the trad code works anymore, and I haven't had time to update it.\nI imagine it would take some effort -- a day or two or three.\n\n(trad is not included in Debian therefore)\n\n\n------------------------------------------------------------------------------\n\n\n\nActually, we did a build clean-up a while ago and pulled out all the completely\nuseless programs.  The plot4 program actually serves a purpose, which I only\nremembered after I sent the e-mail.  The pcwarp program is more experimental,\nand should probably be pulled.\n\n\n------------------------------------------------------------------------------\n\n\n\nAs I recall, Paul Haeberli had a really simple polygonal font format, similar to\nmy own, and it was a snap to convert.  If you have something that already parses\nthe foreign format, and it's not difficult to add a new output format, the one I\nuse is quite simple.  It's described in:\nhttp://radsite.lbl.gov/radiance/refer/filefmts.pdf\n\n\n------------------------------------------------------------------------------\n\n\nhttps://ssl.recluse.de/svn/debian/trunk/packages/radiance/debian/patches/rholo-missing-devpath-fix.dpatch\n\nIf the DEVDIR is not set, and it usually isn't, rholo searches for its device\ndrivers in subdirectories named dev/ in each of the executable PATH locations.\nIn other words, installing the drivers in dev/ under the Radiance executable\ndirectory should always work.  I put DEVDIR in there as a precaution for strange\nsystems that might cause a collision.  It's never happened.\n\n\nThe files you're putting in /usr/lib are executables if that makes any\ndifference -- did you mean /usr/local/lib?  It seems odd to install things in\nthe main system directory.  I wouldn't want them there if I were a user\ninstalling a third-party package.\n\nRholo calls rtrace to do most of the CPU-intensive work, but you can compile it\nhowever you think best.\n\nTo test, go to the ray/obj/cabin directory and trun \"make nholo.\"  You might\nalso alter the nholo target to set -n 2 to make sure multi-processing is working\nright, and \"-o x11\" rather than \"-o ogl\" to try out the quadtree driver.\n\n\n\n\nI'm sorry but not surprised to hear the OGL driver doesn't work under Linux.\nThey seem to have a pretty loose idea of this standard.  It works under Mac OS\nX, but then, that's where I'm able to test and debug it.\n\nAs for -ffast-math, there shouldn't be a problem for Radiance.  It doesn't rely\non exact trig calculations or the like.\n\n------------------------------------------------------------------------------\n\n\n\nThe rview program was renamed to rvu just to avoid the conflict with vim.  I put\na soft link in for backwards-compatibility, but you can safely remove it if it\ncauses problems.\nhttps://ssl.recluse.de/svn/debian/trunk/packages/radiance/debian/patches/no-rview-please.dpatch\n\n------------------------------------------------------------------------------\n\nAnd last but not least:\n\nbzed@hal:~$ wget -q -O - http://www.radiance-online.org/main.html |\ngrep hemp\n<a href=\"hemp://radsite.lbl.gov\" target=\"_top\">LBNL</a>, <a\nhref=\"hemp://www.epfl.ch\" target=\"_top\">EPFL</a>, then\n\n\n--\nBernd Zeimetz\n<bernd@bzed.de>                         <http://bzed.de/>\n\n", "replyTo": "Subject: [Radiance-general] Re: Radiance in Debian!", "sender": "Bernd Zeimetz", "isquestion": false, "tags": [], "id": "<47128B44.4080606@bzed.de>", "refs": ["<100441490710141230l4408ef68k9a76f83b78206d82@mail.gmail.com>\t<471272A8.3050004@bzed.de>", "<9F41AF95-5593-4891-B442-8266896D10BE@lmi.net>"], "datetime": "Sun Oct 14 14:34:05 2007", "email": "bernd at bzed.de", "subject": "[Radiance-general] Re: Radiance in Debian!"}