{"body": "\nHey, thanks you all for the help you gave me (really much more than what I expected). I'm sorry for the late I'm replying but I was not at my computer I did have just time to read your mails and not to reply them. And sorry also 'cosue I guess I'll send more then one reply (to keep them readable by the people I'm replying to.\n\nSo this one is for Rob and Erwin.\n\n\nROB : Thanks Rob. Mardalljevic's gave me access and I did take a fast look at that thesys and it looks really interesting. I'll print it and start studying it.\n\nERWIN : thank you very much for your long and interesting reply. If you have time to send me some links  and documents it will be great (the more material I have, the more accurate my studies will be) . As about the german language pubblication, I studied a little german, so maybe I could orient myself through the text and hopefully there  will be images and charts which don't need to be translated to be understood, in the end I have some friends and a cousin from Austria who could help me. (and still the more material.. :-P)\n\nAs about why should university pay.. well, the point is that my thesys is not yet defined. Being so 'sperimental' and about such 'new' themes, we do not know yet what to do. I'll try to explain - and this will be quite an answer to another reply.\n\nIDEA : Firstly my teacher wanted to simulate tunnel's illumination to avoid the incredible power waste tunnels are involved in. As you could now this is quite a problem in Italy 'couse we do not have much energy and we do have more tunnels than any other country (in proportion), and of course for pollution deriving by power-wastes.\n\nWHY RADIANCE : Considering my interest in linux, opensource and so on and the fact that radiance is increasing in importance and power and looks to be one of the more accurate softwares abnout light simulation, and of course, for it beeing free, the choose was immediate. And while going through the studying it, I realized we really didn't mistake.\n\nARE WE REALY SURE? : But beeing an engeneeristic thesys it should have strong basys, so it's not enough to read all over that radiance is accurate and so on, mainly said by developers. And it is not even enough to realize that commercial softwares integrate it, We do need proofs  it is really accurate. So we decided : did anyone already checked it and do we have scientific proofs about it? So get them, and , with authors permission report them or refer to them in thesys and let's go on with tunnel's project. Do we not have this resuorces or  are them missing some important informations (about tunnel's project or not)? Let's improve documentation aboput it.\n\nSO, WHEN WILL IT BE CONSIDERED FINISHED? Not known. Actually, probably, it will start as a thesys, but it will end up to be a research project, so there will not really be the need to finish the thesys as it will be continued after graduation.\n\nGeuss I have been a little to long explaining and I hope it is understandable, if not, just ask !! ;)\n\nLucio\n\n\nPs, thanks for advises about how to build my test scenarios !\n\n\n\n.Hi Lucio,\n.\n.I am working with Radiance since 1993 and over the years I have collected quite a few documents that might be of interest to you. If you want I can send you a list or download links (or the actual documents since some of them have disappeard from the net in the meantime).\n.\n.In 2004/2005 I initiated a research project which was funded by the EU and the Tyrolean government and together with Bartenbach (a lighting designer and developer) and the University of Innsbruck, Department for Mathematics and Informatics we did a benchmark between the Radiance simulation package and conventional methods, i.e. building a 1/10 model of a real/existing room. The goal was to eveluate the strengths and weaknesses of both methods under different aspects. The benchmark included evaluating/comparing both visual and numerical results.\n.\n.Unfortunatly this publication is only available in German language but I guess it could be translated to English quite easily. On the other hand I can't promise that I would have time to do this myself any time soon.\n.\n.However, if you decide to go through a comparison process yourself I would advise you to use an existing room/building as a basis. This way you can measure real world data to use as a reference. Then you would build both, a conventional and a computer model and mesure the results again and compare them with your real world data. I hope I am making sense? There a many aspects which will come up (like how for instance you scale your luminaires or certain materials in a 1/10 model) but I dont want to take away all the fun - in the end it's your thesis ;-)\n.\n.What I dont quite understand is why your university would pay for an existing publication that already covers what you want to do? Or did I misunderstand that part completely?\n.\n.Regards,\n. Erwin\n.\n.-------- Original Message --------\n.Subject: [Radiance-general] Looking for some pubblications for my thesys. (30-Okt-2007 12:58)\n.From:    loscotec\\@libero\\.it <loscotec@libero.it>\n.To:      radiance-general@radiance-online.org\n.\n.> Hello everybody!\n.>\n.> I'm Lucio Boscolo Mezzopan an itlaian student of electrical engeenering,\n.> new member of this mailinglist.\n.>\n.> I'm italian as I told, so, sorry for my bad english and feel free to\n.> correct me if you like.\n.>\n.> Now, my first question and a little more presentation.\n.>\n.> I'm doing my thesys project to quit with university.\n.>\n.> The projects involves Radiance and it is not yet defined how it will be in\n.> the end, but for the moment, my task is to check Radiace precision.\n.>\n.> In other words, I have to find out if Radiance simulates well reality. I\n.> could it in two ways: building up a model and measuring real behaviour and\n.> simulating it and comparing the datas, or look for someone else who did the\n.> same.\n.>\n.> Can you help me? Do you know about some pubblication having done this\n.> already ? It would be better it to be free of charge, but also if I (\n.> actually my university) has to pay for it, it could be great!\n.>\n.> Many thanks in advance\n.>\n.> Have good time :)\n.>\n.> Lucio\n.>\n.> _______________________________________________\n.> Radiance-general mailing list\n.> Radiance-general@radiance-online.org\n.> http://www.radiance-online.org/mailman/listinfo/radiance-general\n.>\n.> To: radiance-general@radiance-online.org\n.\n.\n._______________________________________________\n.Radiance-general mailing list\n.Radiance-general@radiance-online.org\n.http://www.radiance-online.org/mailman/listinfo/radiance-general\n.\n\n.. Caminante no hay camino, solo se hace camino al andar ..\n\n", "replyTo": "", "sender": "loscotec@libero.it", "isquestion": true, "tags": [], "id": "<JR168G$78BE0F51E8E412DE34855E03DCC21A74@libero.it>", "refs": [], "datetime": "Mon Nov  5 03:30:21 2007", "email": "loscotec at libero.it", "subject": "[Radiance-general] Looking for some pubblications for my thesys."}