{"body": "\nHi Lars !!\n\nThank you very much for your reply !!\n\nI described what's my thesys about in the previous reply, so, no need to rewrite everything here.. just a little add: according to what my teacher said thesys will probably be mainly about street illumination.\n\nLucio\n\n\n.Hi Lucio!\n.\n.I think it is necessary to give you a hint before you start this. Every simulation tries to approach the reality of a system. That means you must know the system you want to simulate before you can select a simulation technique.\n.\n.Radiance is a simulation application that was made with architectural / building models in mind. You can simulate lots of effects that are relevant in finding glare, getting the illumination levels (e.g. to decide if lighting is efficient for a given use of a space) etc. On the other hand, Radiance was not developed to e.g. model the effects of reflector or lense systems. It is a question of scale, materials, effects relevent for the application.\n.\n.So what I want to explain is - it does not make sense to find out \"how accurate\" Radiance is. If you have a problem to solve (e.g. simulating a given type of facade, or modeling a new material), it will be easy to find out if Radiance is a suiteable tool. And only than, people will be interested in accuracy (qualitive or/and quantitive).\n.\n.In other words, I am (and I guess others are, too) curious what system (building, solar system, christmas tree) you want to simulate, and what effects are important and determine accuracy for you...\n.\n.Good luck, CU Lars.\n.\n._______________________________________________\n.Radiance-general mailing list\n.Radiance-general@radiance-online.org\n.http://www.radiance-online.org/mailman/listinfo/radiance-general\n.\n\n.. Caminante no hay camino, solo se hace camino al andar ..\n\n", "replyTo": "", "sender": "loscotec@libero.it", "isquestion": true, "tags": [], "id": "<JR1DJ8$F780FB99E610259ADA1FED22E1069C3E@libero.it>", "refs": [], "datetime": "Mon Nov  5 05:59:54 2007", "email": "loscotec at libero.it", "subject": "[Radiance-general] Looking for some pubblications for my thesys."}