{"refs": ["<1F994EE20CC4154DBB59DDE3100F906B045D4E3E@USNWK102MSX.ww017.siemens.net>"], "id": "<4C9A694B.5040906@visarc.com>", "subject": "[Radiance-general] CAD input and lamps", "email": "jedev at visarc.com", "body": "\nHi Marion,\n\nThere are a number of 3D modeling applications that can be used to\ndevelop models that can then be exported and used in Radiance. Some\ntools that people use to do this include:\n\n1. Autocad\n2. Revit\n3. Rhino\n4. Sketchup\n\nThere are certainly other tools that can be used as others will likely\npoint out. Depending on what tool you pick there will be various steps\nfor converting the geometry for use in Radiance. Rhino and Sketchup\nprobably have the most direct path to Radiance currently, however it is\ncertainly possible to go from Autocad or Revit to Radiance as well.\n\nFor lighting there are two basic things to understand:\n\n* Layout - layout of different lights in the building can be\naccomplished in your modeling application. This is typically done\nusing triangular reference markers as placeholders for the\nlighting distribution\n* Lighting Distribution (IES photometry) - with markers indicating\nthe position of the lights exported to Radiance, lighting\ndistribution data can then be located relative to these markers.\n(using the radiance tools: \"replmarks\" to locate objects relative\nto markers and \"ies2rad\" to convert ies data files to radiance\nlight objects)\n\nPlease note this is a very cursory explanation to give you some idea\nthat yes it is possible to go from 3D modeling application to Radiance!\nHow much you can accomplish is going to be dictated in part by you\nexperience with 3D modeling tools and a willingness sink yourself into\nlearning Radiance for what you want to accomplish. What kind of 3D\nmodeling applications are you familiar with?\n\nRegards,\n\n-Jack de Valpine\n\n--\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n\n\nOn 9/22/2010 3:52 PM, Kerl, Marion (SCR US EXT) wrote:\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20100922/30d69c2d/attachment.htm\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] CAD input and lamps", "tags": [], "sender": "Jack de Valpine", "datetime": "Wed Sep 22 13:39:09 2010"}