{"refs": [], "id": "<DC0CAEEA090E984C911D3B85B16C3F90FAF3D2@l-gnts05>", "subject": "[Radiance-general] Exterior light levels and daylight factors", "email": "adiance-general-bounces@radiance-online.org", "body": "\nI did some validation measurements, some years ago, for my thesis... (not as\ngood as some others did before me... )\nThe values I had were quite different from the expected (radiance\ncalculated).\nAt the time I had not reliable information on the value of the turbidity\nfactor for the area I was studying.... what happened then it is another\nstory...\nbut going back to your problem:\n\nI think that calculated illuminance can be the same only if you have a way\nof measuring the sky luminance distribution.... (not CIE standard but\nreal...)\nI think that the best paper you can find on it is the Mardaljevic PHD\nthesis...\n(http://www.iesd.dmu.ac.uk/~jm/sg98.htm)\n\nThe values that you have aren't so bad... compared to mine (I remember\nsomething like 30% RER..)\n;-((\n\nPS - a recent post pointed out the limits of simulating low altitude sun\nskies... (Perez sky model have the same limitation with low angles, where\nuncertainty is really high) ... so the only way is to override the sky\ndefinition and constrain it to a known illuminance value... I guess... but\nyou have still no way of knowing the luminance dist...\n---------------------\nabout the falsecolor images you should try to use on the dos terminal:\nfalsecolor -s maxvalue -n numberof intervals -l label -m multiplier -i\nyourpicture > finalimage\n\nif gives you an error try this:\nfalsecolor -s maxvalue -n numberof intervals -l label -m multiplier -ip\nyourpicture > finalimage\n\nwhere multiplier is:\n179 for illuminance and luminance (depending on the type of image)\n179/external_illuminance for daylight factor plots\n\ncheers,\ngiulio\n----------------------------------------------------------------------------\n------------------------\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org]On Behalf Of\nCaroline Prochazka\nSent: 06 April 2004 14:46\nTo: radiance-general@radiance-online.org\n\nHello,\nI am a graduate student in architecture at the\nUniversity of Waterloo, Canada. My thesis centres on\nthe modelling of two Canadian 'sustainable' buildings\nto investigate the relationship between daylighting\nand energy consumption for heating and cooling. I am\nmodelling each building in Desktop Radiance in order\nto evaluate the performance of both Ecotect and\nEnergy-10 in daylighting analysis.\n\nI had hoped to use Desktop Radiance to evaluate\ndaylight factors in key areas of the buildings. While\nI am able to model fairly realistic interior\nillumination results and analyse these using the False\nColour plot I have encountered several problems:\n\n1. When I opt for a daylight factor plot, the scale\nremains at a range of 0 to 1.0 and is unaffected by\nany changes I try to make through the analysis\ndialogue box.  The result in Radiance is a washed out\nimage all in the 'maximum' colour (my other software\nsuggests DF% between 2 and 4%) confirming DF%>1.0\nHow can I adjust the scale for DF% readings in Desktop\nRadiance?\n\n2. I am trying to assess the effect of changing\nglazing types. For daylight studies in the late winter\nafternoon (based on sun charts and other software, I'm\nusing 4pm Dec21, where the sun is not yet set, but\nvery low in the sky), where I have not modelled any\nsurrounding obstructions such as trees or buildings,\nmy internal illuminance levels are consistently about\n200 lux, even on the east side of the building. Common\nsense tells me there should be MUCH MUCH less light\nthan this...probably no more than 100 lux. Also, when\nchanging glazing types (ie, from clear to reflective)\na significant change is noticed for noon hour\nlighting, but the 4pm Dec21 lighting remains at 200\nlux. What could I be mis-assuming?\n\nI have recently run a few simplified test models and\ncompared my results to true exterior light conditions\nusing a hand-held light meter. The results are\nsomewhat frustrating, but interesting nonetheless.\n\nMy questions here are particularly:\n3. How does Radiance calculate the external light\nlevels?\n4. On a perfectly clear morning in a low pollution\narea (assumed turbidity=2) my light meter reading read\napprox. 55600 lux. A Radiance test (modelling an\nunobstructed horizontal plane outdoors) for the same\ndate and time, and lat. long settings, with\nturbidity=2 produced an exterior light level of 47000\nlux (15% off the true reading!). While there may have\nbeen some diffuse reflection off nearby buildings,\nthere was certainly no direct reflection or shadow on\nthe light meter. This seems to be much too large a\ndifference. Any suggestions?\n\nApologies for the long email. I often read that these\nsoftware applications are tested and confirmed but my\ndata isn't showing an appropriate correlation of the\nsimulation to reality. Any remarks would be greatly\nappreciated.\n\nCaroline Prochazka\nM.Arch candidate\nUniversity of Waterloo\n\n\n__________________________________\nDo you Yahoo!?\nYahoo! Small Business $15K Web Design Giveaway\nhttp://promotions.yahoo.com/design_giveaway/\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n___________________________________________________________________\nElectronic mail messages entering and leaving Arup business\nsystems are scanned for acceptability of content and viruses.\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "adiance-general-bounces@radiance-online.or", "datetime": "Tue Apr  6 16:39:15 2004"}