{"body": "\nGreg,\nthis is a great idea!\nWe will definitely look into it (perhaps not today but soon enough).\nrtcontrib is just surprising every day with its potential...\nthanks for your help,\nand thanks for calling it 'not easy'...\nthis make a failure less of a problem\n:-)\nCiao\nG.\n\n\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of Greg\nWard\nSent: 14 November 2007 04:02\nTo: Radiance general discussion\nHi Guilio,\n\nI'm still catching up with e-mail after a week's absence.  This one\nalso required some thought...\n\nIt would be a fair amount of work, but it's possible to use rtcontrib\nto give you a nice incident light field on the bottom of a swimming\npool.  You could then model this as a glow source and see it\nreflected back through the wavy dielectric surface of the water.  If\nyou were extra-ambitious, you could even model the water's surface as\na height field, but it would have to be really choppy for that to\neven matter, visually.\n\nI would have to spend some time to create an example of this\napproach, but the basic idea is to flag the surfaces defining the\nunderwater portion of the pool so they can gather rays using\nrtcontrib.  You would have to also define bin numbers corresponding\nto pixels in (5) low-resolution images you would create and map back\nonto the surfaces for subsequent rendering.  The rays given to\nrtcontrib would correspond to the solar radiation on a rectangle\ncovering the pool's surface.  Normalization for this data would\nrequire a bit of math as well, but it's all doable.  I won't call it\neasy.\n\n-Greg\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n\n", "replyTo": "", "sender": "radiance-general-bounces@radiance-online.or", "isquestion": true, "tags": [], "id": "<CC0B19F4C6132F4D9FDDEBF194200FB50467B4DD@ldcexc02.global.arup.com>", "refs": [], "datetime": "Wed Nov 14 09:52:23 2007", "email": "radiance-general-bounces@radiance-online.org", "subject": "Re: [Radiance-general] water - any news???"}