{"refs": ["<201009280926.o8S9Qefp020887@mta2.lbl.gov>"], "id": "<C5E1527F129BF545A250B5AD0B0C26EF07D2653A@ENTWEXMB0000000.university.harvard.edu>", "subject": "[Radiance-general] Next year's workshop", "email": "adiance-general-bounces@radiance-online.org", "body": "\nI agree with Peter that having a Radiance workshop in Asia would help to widen or firmer establish the Radiance community in an important region. Having said this, the workshop will only be effective if a sufficient number of us are planning to go. It might be beneficial to piggyback on another conference, e.g. Building Simulation will be in November in New Zealand. I do not think that too many people will want to fly to Asia twice in only a couple of months.\n\nChristoph\n\n\n\n-----Original Message-----\nSent: Tuesday, September 28, 2010 5:26 AM\nTo: radiance-general@radiance-online.org\nHi folks,\n\nmy two cents thoughts:\n\nAirfares from Europe would be very much the same. In fact, in late August, the north-Atlantic-to-west-coast route is likely even more expensive then Europe to Singapore. Aug to Mid-Oct is still high season for USA, but not so much for Singapore (except during racing days down there, around end of September). With hotel prices and cost of living lower in Singapore, the whole trip is likely even more economic for Europeans.\n\nA hands-on approach to the tropics might also remind us Westerners on the northern sphere about different sun paths, shading strategies and materials.\n\nLast, but not the least, Asia, the regions around Singapore and relatively close-by India are regarded as upcoming regions, with an increase in building activities. So for advances in daylighting in those regions and helping to avoid mistakes already experienced by others, it would be more efficient to show expertise in Singapore than an annual gathering of the already converted at LBNL. The audience would include more new users and perspectives that way, which would be in the interest of LBNL as well.\n\nAnd that's not even mentioning our Radiance folks down-under and ongoing work there.\n\nbest regards\nPeter\n\n\n-----Original Message-----\nSent: 28 September 2010 02:23\nTo: Radiance general discussion\nThanks to all who came to this year's workshop, especially to Jan Wienold and Sandra Mende who did an excellent job on organization.  Thank you also to the presenters -- I thought this was a very interesting set of new developments this year from multiple quarters!\n\nOn the topic of next year's workshop, we have two proposals:\n\nA)  The first is from LBNL to host the 10th Radiance workshop in Berkeley, California, where it was last held in 2003.\n\nB)  The second proposal is from Rapha??l Compagnon, the host of the first workshop in 2002, who forwarded an offer from SERIS to host next year's workshop in Singapore.  The workshop has never been held in Asia.\n\nWe had an informal vote at the workshop, and there seemed to be some interest in both venues, with a slight leaning towards Berkeley.  I didn't think it fair to make a decision on the spot, however, since many parts of the world were under-represented in the audience.  So, I am writing to the general list in hopes of getting some further opinions and eventually reaching a consensus on the matter, so that plans may be laid.  In particular, I wonder who would be able to make it to a workshop in Singapore, given airfares and funding approval, etc.\n\nAt the same time, if people have a preference for dates, please speak now.  We are looking either at late August or early October if the workshop is held at LBNL.  I don't know if SERIS has a preferred time -- perhaps Rapha??l can fill us in on that?\n\nFinally, I need to clarify a misunderstanding I seem to have caused by an earlier e-mail regarding LBNL funding.  While it is true that there is money this fiscal year to further Radiance developments, LBNL is not hiring at present nor looking to spend the funds elsewhere, as the positions that were available at the beginning of the year are now filled, and the funds have been earmarked for projects already underway.\n\nHowever, if other research organizations are interested in cost-sharing collaboration (i.e., each institution covers its own expenses and personnel), this could be possible if the project goals are suitably aligned.  This is nothing new, except for the fact that there is significant ongoing work now at LBNL, particularly in the area of complex fenestration, controls, and annual simulation.\n\nBest,\n-Greg\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n--\npab-opto, Freiburg, Germany, http://www.pab-opto.de\n[see web page to check digital email signature]\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Re: Next year's workshop (Gregory J. Ward)", "tags": [], "sender": "radiance-general-bounces@radiance-online.org", "datetime": "Tue Sep 28 04:43:32 2010"}