{"refs": ["<i7980a$ir8$1@dough.gmane.org>\t<AANLkTincRpTDCs-19rL4-97rvBVEjyLohbNBfH2hLRXA@mail.gmail.com>\t<i7dtuq$fec$1@dough.gmane.org>", "<80BE2D21-1611-46CC-8BC1-BD7640726AE7@lmi.net>"], "id": "<4CA1FCD8.4000603@visarc.com>", "subject": "[Radiance-general] Re: obj2rad: \"bad face\" and \"bad triangle\"", "email": "jedev at visarc.com", "body": "\nHi Randolph,\n\nGreg added a feature to obj2rad to enable it to continue in the case of\nbad normals such as: vn 0 0 0. Previously obj2rad would exit with an error.\n\nBacking up a bit, I think what I am interested in seeing is conversion\ntools that further support .obj as an intermediate file format for\nRadiance. There are lots of good applications (Rhino, SketchUp Pro,\nBlender, etc) that support export of .obj format files. And for those\napplications that do not (eg, Autocad and Revit), one route is that it\nis possible to get .fbx out of these applications which can then be\nconverted to .obj. However the data output from these applications is\nnot always perfect, which results in obj2rad exiting with errors\nrelating to: bad normals, bad faces and bad triangles. So the issue is\nwhat to do in these cases:\n\n1. bad normals (vn 0 0 0) - are now passed through using the updated\nversion of obj2rad from the head release.\n2. bad faces and bad triangles - In some case this is something that\ncan be fixed in an application like Rhino or Blender (these are\nthe ones that I know) using the repair mesh functionality.\nHowever, I have also noted that the following can sometimes be\nincluded by the exporting application: #QNAN0 or #IND. This is\neasy to check for using grep. Typically I have seen this:\n-1.#QNAN0 or -1.#IND. Since these errors occur upstream from\nobj2rad, Greg is rightly loathe to have ob2rad try to fix them. If\nyou cannot fixes these in the upstream application, then the easy\nfix in these cases is to use sed or perl to zero out these\nconditions. This can be done as follows (pick your tool):\n1. perl -p -e 's/\\#QNAN0/0/g;s/\\#IND/0/g' fname.obj | obj2rad >\nfname.rad\n2. sed 's/\\#QNAN0/0/g;s/\\#IND/0/g' fname.obj | obj2rad > fname.rad\n\nIf anyone has other suggestions for managing and processing .obj files\nfor use in Radiance please chime in! I know that Mark Stock has had good\nexperience with MeshLab, for example.\n\nBest,\n\n-Jack\n\n--\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n\n\nOn 9/27/2010 5:48 PM, Greg Ward wrote:\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20100928/52966d8e/attachment.htm\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Re: obj2rad: \"bad face\" and \"bad triangle\"", "tags": [], "sender": "Jack de Valpine", "datetime": "Tue Sep 28 07:35:03 2010"}