{"refs": [], "id": "<5B472090ED0BC64EA8F81B330169D3D4F74DA0@CLOEXM1.cjp.co.uk>", "subject": "[Radiance-general] Evalglare - Luminance or Illuminan", "email": "a.bissell at cundall.com", "body": "\nSorry for what must be obvious questions.  I have just compiled\nevalglare for Linux and I have run a few test images albeit the images\nwere very low res.  I have read various papers and posts on the net and\nseen the images referred to as luminance images and illuminance images.\nSo which is it?  Part of me says luminance as brightness is more\nrelative to glare, on the other hand my understanding of DGP is that it\nmeasures illuminance at the eye.  Which led to me confusing myself over\nthe type of image required.  Certainly if you try both, the results are\ndifferent, however the images I am using are crude with just 1 bounce so\nthat could easily explain the difference.\n\n\n\nAlso I read the luxeuropa2005.pdf on the evaluation method etc.  However\nI was still at a loss as to what the DGP results really meant.  E.g. if\nthe DGP result is 0.4756 what does that mean.  The document talked about\nlevels below 0.2 not being reliable.\n\n\n\nThe other evalglare posts were useful wrt -vth and -vta, also the\npicture header.  Thank you.\n\n\n\nRegards\n\n\n\nAndrew\n\n__________________________\nAndrew Bissell\n\nB.Eng(Hons) C.Eng MSLL MCIBSE MIET\nAssociate Lighting Designer\n\nCundall Light4\nDirect: 0161 200 1235\nMobile: 07899 907 978\n\nOffice: 0161 244 5660\n\nP Please consider the environment before printing this e-mail\n\n\n\nCundall Johnston & Partners LLP is a limited liability partnership registered in England and Wales.Registered number OC300389.\nRegistered office: Horsley House, Regent Centre, Gosforth, Newcastle upon Tyne, NE3 3LU\nPrivilege and Confidentiality Notice: Use of this email and any attachments is subject to the terms on our Website at http://www.cundall.com/email.htm\nIf you cannot access these terms, please email terms@cundall.com with SEND TERMS in the subject heading or telephone +44 (0191) 213 1515 and we will send you a copy.\n--------------------------------------------------------------------------------\nThis email message has been scanned for viruses by Mimecast. For more information please visit http://www.mimecast.com\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20101002/c1bacac1/attachment.htm\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Bissell, Andrew", "datetime": "Sat Oct  2 13:07:01 2010"}