{"refs": [], "id": "<5B472090ED0BC64EA8F81B330169D3D40100F380@CLOEXM1.cjp.co.uk>", "subject": "[Radiance-general] LBNL Window6 & dctimestep", "email": "a.bissell at cundall.com", "body": "\nHi all,\n\n\n\nAndy, thanks for a great tutorial, very easy to follow along with Axel's\nexcellent diary of trials and errors.  I have a quick question, I have\nno doubt it is a lack of linux knowledge on my behalf but would welcome\nany help.\n\n\n\nI have got so far as to generate the vmx, dmx and skv files.  I have\nalso generated a simple window detail in window6 and copied the xml and\ncsv across to the linux box.  When I run the dctimestep script I get the\nerror 'warning cannot find the BSDF 3mmClear.xml' file.  It is there in\nthe correct folder, I have checked and checked again that the script\nuppercase / lowercase matches the filename, I have checked that I am\nsearching the correct folder and I have checked in the xml file that the\nfilename is the same.  I am now at a loss.\n\n\n\nThanks in advance.\n\n\n\nRegards\n\n\n\nAndrew\n\n__________________________\nAndrew Bissell\n\nB.Eng(Hons) C.Eng MSLL MCIBSE MIET\nAssociate Lighting Designer\n\nCundall Light4\nDirect: 0161 200 1235\nMobile: 07899 907 978\n\nOffice: 0161 244 5660\n\nP Please consider the environment before printing this e-mail\n\n\n\nCundall Johnston & Partners LLP is a limited liability partnership registered in England and Wales.Registered number OC300389.\nRegistered office: Horsley House, Regent Centre, Gosforth, Newcastle upon Tyne, NE3 3LU\nPrivilege and Confidentiality Notice: Use of this email and any attachments is subject to the terms on our Website at http://www.cundall.com/email.htm\nIf you cannot access these terms, please email terms@cundall.com with SEND TERMS in the subject heading or telephone +44 (0191) 213 1515 and we will send you a copy.\n--------------------------------------------------------------------------------\nThis email message has been scanned for viruses by Mimecast. For more information please visit http://www.mimecast.com\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20101024/6922246c/attachment.htm\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Bissell, Andrew", "datetime": "Sun Oct 24 00:17:24 2010"}