{"refs": ["<4cc876f5.0d1d640a.7378.2bc2SMTPIN_ADDED@mx.google.com>\t<4CC8865C.7080908@gmail.com><6F5225D6E15F954BB4E58EC25F6736C305DD20DE@corp3005.CORPORATE.FOSTER.NETWORK>\t<4CC9761E.6070500@visarc.com>\t<6F5225D6E15F954BB4E58EC25F6736C305DD20F8@corp3005.CORPORATE.FOSTER.NETWORK>\t<4CC9A04A.8080702@visarc.com>\t<4CC9A14F.1040806@visarc.com>", "<4CD1B496.7030104@audice.com>"], "id": "<4CD27917.5030609@gmx.net>", "subject": "[Radiance-general] Diffuse reflectance measurements andGretagMacbeth ColorChecker reflectance values", "email": "grobe at gmx.net", "body": "\nHi Ilya!\n\n\nYes, the integrating sphere is only one possible instrument. \"Diffuse\nreflectance\" is usually referring to direct-hemispherical reflectance\nwithout whatever is defined as specular. The problem with turning it the\nway that you measure it as hemispherical-direct (incident light over\nhemisphere, measured at perpendicular angle) is that you must know the\nBRDF, and as far as I understand the idea, would need a uniform\nhemispherical source (overcast is non-uniform). A small integrating\nsphere is not all that expensive, by the way...\n\n\nAgain - using an integrating sphere, a stabilized light source, and a\ncalibrated detector as a reference. One example where we did that was\npresented at the Radiance Workshop in 2008:\n\nhttp://www.radiance-online.org/radiance-workshop7/Content/Jacobs/jacobs-fribourg2008d.pdf\n\n\nThey are printed on its back, and you can assume the chart to be a nice\ndiffuse surface. However, the pixel values in you picture represent\nluminance (or radiance), not reflectance!\n\n\nI think the spec-file is the reference giving the chart, while the\npub-chart may be used for calculations, but I am not sure now. The image\nfiles are used for macbethcal-\"calibrations\".\n\n\nIf you have measured the BRDF (which is done using other instruments\nthen an integrating sphere, and a bit more complicated), you can derive\nthe diffuse reflectance by integrating the transmission hemisphere's\ndata and substracting the integral of the specular range. If you start\nwith estimating a BRDF, I have my doubts that you will end up with\ncorrect values. Using a grey-chart and comparing using you eyes may be\nmore promising. But maybe you do both and compare your results.\n\nCheers, Lars.\n\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: smime.p7s\nType: application/pkcs7-signature\nSize: 3740 bytes\nDesc: S/MIME Cryptographic Signature\nUrl : http://radiance-online.org/pipermail/radiance-general/attachments/20101104/e90ca2b5/smime-0001.bin\n", "isquestion": false, "replyTo": "<4CD1B496.7030104@audice.com>", "tags": [], "sender": "Lars O. Grobe", "datetime": "Thu Nov  4 02:12:48 2010"}