{"refs": ["<AANLkTimwYfk4rFE6p+xsKgkX8kv1s_rKVHp0R3+k0JwW@mail.gmail.com>", "<loom.20101108T145929-866@post.gmane.org>", "<C9FC79B1-1499-437F-A9BD-F750CC1C6FB5@lmi.net>", "<AANLkTinRBS_KFi1TbaO=6SZM0nx7+S=GMnjmZZSB7=3N@mail.gmail.com>", "<ib9fps$75g$1@dough.gmane.org>"], "id": "<AANLkTimXuVN7OCZLThqW9JiO6CZAYfoa1eJ1t4OepkNy@mail.gmail.com>", "subject": "[Radiance-general] Re: Python Radiance Packag", "email": "dbs176 at gmail.com", "body": "\nWow, thanks to all who replied. I'll try to address some of the raised\neyebrows now, and answer the more technical ones later.\n\nMy goal was an easier way to do some analysis that would require more\nthan simple shell scripts. Or rather, a way to do some things that\nwould probably be easier in a higher level language. I just so happen\nto do a lot in Python, and I think it's a relatively simple language\nto pick up, and its syntax looks like pseudocode.\n\nSome more complicated scripts can get hard to follow with lots of\nsystem calls, stringing together variables, or keeping track of and\ndeleting temporary files. I think that a Python package could be more\nuser friendly by making a simple interface and taking care of that\nsort of thing automatically and invisibly. Also it could take\nadvantage of some of the more interesting Python capabilities such as\nusing distributed tasks (multiprocessor/multi-machine), pre-written\ndata processing libraries, image libraries, etc.\n\nSince, as has been pointed out, the same code can run essentially\nunmodified on any modern system that can run Radiance, there is the\npossibility that this can create an easy way to exchange ideas and\ncreate novel approaches to analysis. The architecture scripting\ncommunity is surprisingly active.\n\nHowever, all I really wanted to do initially was provide a simple\ninterface back to Radiance, then step back and maintain/optimize it. I\nhadn't given much technical thought other than it ought to at least\nstart out as a wrapper program. Because of the modularity of it all,\nthat could be changed later. I wasn't really aiming to replace things\nlike the csh scripts, although this would make it easy for someone to\ndo so if they wanted. I wanted for it to be as transparent as possible\nthrough to Radiance proper.\n\nFinally, I really appreciate the volunteers. I'm not a programming\nnovice, but I'm certainly not a guru either. Collaboration is much\nappreciated.\n\nI've registered a Google code page (for now, Mercurial, because I've\nnever used it and want to learn it - I hear it's like subversion with\nthe benefits of git) at http://code.google.com/p/python-radiance . I\nthink that the conversation should be continued in the\ncode-development thread, where it will likely get more technical.\n\n--Dave\n\n\n\n\nOn Mon, Nov 8, 2010 at 1:33 PM, Randolph M. Fritz <RFritz@lbl.gov> wrote:\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Re: Python Radiance Packag", "tags": [], "sender": "David Smith", "datetime": "Mon Nov  8 21:13:46 2010"}