{"refs": ["<AANLkTimwYfk4rFE6p+xsKgkX8kv1s_rKVHp0R3+k0JwW@mail.gmail.com>"], "id": "<28285BAEA8C0814DBF1B199C876EC5B04876C57B92@AMXEXC01.global.arup.com>", "subject": "[Radiance-general] Python Radiance Packag", "email": "Christopher.Rush at arup.com", "body": "\nIt sounds like what you're looking to write is an enhanced version of the 'rad' program with ability to go through multiple geometries or light conditions for batch processing and comparison purposes with the additional flexibility of file naming that would be required, and maybe automatic falsecolor generation or pcond calls, rtrace data processing routines, etc.\n\nI think the challenge would be to make it generic enough that it is still useful for all the unique scenarios that come up, but at the same time make it worth the effort of creating and maintaining this extra interface - instead of the current M.O. of any user putting to use whichever shell or scripting package they're most comforable with. There is a danger that it makes it makes Python expertise necessary to keep up to date with the most current developments, and be able customize as needed. Although maybe there's something to be said for moving toward a common cross-platform scripting language amongst the community.\n\nI suppose it takes a little bit of effort to try it and determine if it would fit the purpose.\n\nPS, I write this from the perspective of someone using bash and unix commands and who has (very briefly) looked into Python several times, but could never figure out why I would want to re-write the bash shell commands I'm already familiar with into Python with all the same information just within parantheses and with the word \"subprocess\" before it  = )\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20101109/97ef144b/attachment.html\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Python Radiance Packag", "tags": [], "sender": "Christopher Rush", "datetime": "Tue Nov  9 07:33:17 2010"}