{"refs": ["<e5eb7b6560f5be43d0de5cbea439fe87@212.203.77.246>"], "id": "<4CDD3400.3060907@gmx.net>", "subject": "[Radiance-general] Just discovered", "email": "grobe at gmx.net", "body": "\nHi Achim & list!\n\n12.11.2010 10:25, Achim.geissler wrote:\n\nI think so, this is quite an advanced system for embedding Radiance into\na simulation framework.\n\nStill, as a general answer to how to communicate with Radiance:\n\nRadiance closely follows the Unix philosophy of breaking up the problem\ninto many small tasks, that are performed by specialized tools. So\nRadiance consists of dozens of programs, and all these talk to each\nother - or external programs. Communication happens through files (or\npipes). More or less all data that is exchanged in between the tools can\nbe ASCII text, allowing to apply all kind of filters. They can be binary\nif needed in some cases (mostly for performance reasons), the only tool\nthat I am aware of always producing binary output is oconv.\n\nSo basically, you can connect anything that can handle text in- and\noutput and start processes. This generic approach has e.g. made it\npossible to run simulations over clusters easily, scripting of scenes\nand processing of output.\n\nWhile \"Building Controls Virtual Test Bed\" is a comfortable help to\ncreate the tool-chains, it is nothing else but adding some clever\nfront-end to the chaining ability of Radiance and similar tools. Worth\nto be aware of. Another recent development is the idea to create a nice\npython-interface to Radiance, something that may be helpful if you want\nsome more specific application.\n\nCheers, Lars.\n\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: smime.p7s\nType: application/pkcs7-signature\nSize: 3740 bytes\nDesc: S/MIME Cryptographic Signature\nUrl : http://radiance-online.org/pipermail/radiance-general/attachments/20101112/63947650/smime.bin\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Just discovered", "tags": [], "sender": "Lars O. Grobe", "datetime": "Fri Nov 12 04:33:06 2010"}