{"refs": ["<31A1F95173EDC043A63B0B06D158CE0742510B7D49@NTEXCHAN.kellercomp.local>"], "id": "<7F4BCCD7D34E9F41824AC55F857E8FF6329FCC6FFF@ca-win-mbs02.artesis.be>", "subject": "[Radiance-general] ECOTECT", "email": "adiance-general-bounces@radiance-online.org", "body": "\nDear Alexis\n\nI would like to add to this topic with our findings that large differences in daylight factor calculations exist between the different versions of Ecotect.\n\nBest regards\n\nSaskia Gabri?l\nPhD candidate in architecture\n\nDesign Sciences\nArtesis University College of Antwerp Belgium\n\n\n\nSent: maandag 22 november 2010 16:27\nTo: radiance-general@radiance-online.org\nDear Alexis,\nI will say that the internal analysis methods (split flux) is not entirely accurate. I am wondering about your radiance export please explain how they are different.\n\nTim Metcalfe\nKalwall Corporation\nDaylight Modeling Group\n1111 Candia Road\nManchester, N.H. 03105\n1(800)258-9777 X4483\nP  Please consider your environmental responsibility before printing this e-mail\n\n\n________________________________\nThis email and any files transmitted with it are confidential and intended solely for the use of the individual or entity to whom they are addressed. If you have received this email in error please notify the system manager. This message contains confidential information and is intended only for the individual named. If you are not the named addressee you should not disseminate, distribute or copy this e-mail. Please notify the sender immediately by e-mail if you have received this e-mail by mistake and delete this e-mail from your system. If you are not the intended recipient you are notified that disclosing, copying, distributing or taking any action in reliance on the contents of this information is strictly prohibited.\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20101122/466bf3d5/attachment.htm\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] RE: ECOTEC", "tags": [], "sender": "radiance-general-bounces@radiance-online.org", "datetime": "Mon Nov 22 08:33:34 2010"}