{"refs": ["<31A1F95173EDC043A63B0B06D158CE0742510B7D49@NTEXCHAN.kellercomp.local>,", "<7F4BCCD7D34E9F41824AC55F857E8FF6329FCC6FFF@ca-win-mbs02.artesis.be>"], "id": "<BAY158-w150372584F071476970066833D0@phx.gbl>", "subject": "[Radiance-general] ECOTECT Dear Alexis,  I will say that the internal analysis methods (split flux) is not entirely accurate. I am wondering about your radiance export please explain how they are different. Tim MetcalfeKalwall CorporationDaylight Modeling Group1111 Candia RoadManchester, N.H. 031051(800)258-9777 X4483P  Please consider your environmental responsibility before printing this e-mail  This email and any files transmitted with it are confidential and intended solely for the use of the individual or entity to whom they are addressed. If you have received this email in error please notify the system manager. This message contains confidential information and is intended only for the individual named. If you are not the named addressee you should not disseminate, distribute or copy this e-mail. Please notify the sender immediately by e-mail if you have received this e-mail by mistake and delete this e-mail from your system. If you are not the intended recipient you are notified that disclosing, copying, distributing or taking any action in reliance on the contents of this information is strictly prohibited._______________________________________________", "email": "saskia.gabriel@artesis.be", "body": "\n\nDear All,\n\n@ saskia:\n\nif the results are different, which version should i trust?\n\n@ Kalwall:\n\nI've got my 3d model in Ecotect, I export my model to radiance (the grid in fact) , run the calculation and display results in Ecotect.\n\nMy model is a large floor for an office, one part of this office can't receive any external lights, my room is 30 m depth with only one side (SE) with windows.\nWith Ecotect v5, in the back of the room i've 0.2 where with Ecotect 2011 i've 3.2 for the DF.\n\nRegards,\n\nAlexis\n\nTo: radiance-general@radiance-online.org\n\n\n\nDear Alexis I would like to add to this topic with our findings that large differences in daylight factor calculations exist between the different versions of Ecotect. Best regards Saskia Gabri?l\nPhD candidate in architecture\n\nDesign Sciences\nArtesis University College of Antwerp Belgium   From: radiance-general-bounces@radiance-online.org [mailto:radiance-general-bounces@radiance-online.org] On Behalf Of Tim Metcalfe\nSent: maandag 22 november 2010 16:27\nTo: radiance-general@radiance-online.org\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20101122/06bc36ba/attachment.html\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] RE: ECOTEC", "tags": [], "sender": "saskia.gabriel@artesis.b", "datetime": "Mon, 22 Nov 2010 17:33:07 +0100"}