{"refs": ["<1773335.454131290542592530.JavaMail.defaultUser@defaultHost>\t<4CEC21B0.6060103@visarc.com>", "<CC7B52EF0E443D45B11162FB554D97DF06B915F81C@EURXMBC02.global.arup.com>"], "id": "<4CED0866.2080807@visarc.com>", "subject": "[Radiance-general] Instances", "email": "jedev at visarc.com", "body": "\nHi Lucio,\n\nYes, instancing is a way to deploy an object multiple times for the\nrelative memory price of one of the objects. We do this all the time for\nrepetitive objects such as furniture or trees (for example).\n\nIt is possible to use xform or replmarks to deploy copies of geometry\nalso (eg files that contain material and geometry definitions). This\nhowever will not result in memory saving. To get the memory saving the\nobject needs to be an octree. A frozen octree is self contained whereas\na regular (unfrozen octree) contains references to other data/files that\nmust be read in at load time. I believe from an \"in-memory\" point of\nview (eg when running) the memory size would be the same. I think that\none difference is that frozen octrees will load faster in addition they\ncan be treated as library objects and moved around from project to\nproject without having to move around a lot of other source files.\n\nAnother option from a memory saving point of view is to use mesh object\n(obj2mesh) which is another compiled representation that may even be\nmore compact and can also be treated like an octree instance.\n\nHope that helps.\n\nRegards,\n\n-Jack\n\n--\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n\n\nOn 11/24/2010 4:37 AM, Lucio Boscolo wrote:\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20101124/7640772e/attachment.htm\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Instances", "tags": [], "sender": "Jack de Valpine", "datetime": "Wed Nov 24 04:43:04 2010"}