{"refs": [], "id": "<4ceed382.4a4acc0a.7cbc.0911@mx.google.com>", "subject": "[Radiance-general] iso for specularity and roughness", "email": "sotos.enveng at gmail.com", "body": "\nDear list,\n\n\n\nHello from Greece. I am trying to find a standard for measuring specularity\nor roughness for walls (plastic description), or some values that can lead\nto a correct estimation/ description of these values. Is there any standard\nfor this description? I have read Lars mail from the 24th of June, but I\nstill can't configure how to find the correct value to describe correctly\nthese values\n\n\n\nLars mail:\n\n\n\nDear Saskia,\n\n\n\nI try to help out a bit, even though I will not provide you with any such\nvalue here. I hope that I will be able to explain why.\n\n\n\nFirst, the term. I guess you are referring to specular reflectance, maybe\nalso direct transmittance. These define the fraction of light getting\nreflected / transmitted directly. With a lot of simplification something\nlike incident angle equals outgoing angle for reflection (mirror), or light\npassing straight through (glass). Be aware that the real world is not that\nsimple, but let us assume it is.\n\n\n\nIf you want to measure the specular reflectance, you typically do it\nindirect. A very common approach is to use an integrating sphere with either\na photocell (if you do not need color information) or a spectrometer\nconnected. In a first run, you would measure the total reflectance. In the\nsecond, you would open a small hole in the sphere so that light reflected\naccording to the \"incident=outgoing angle\"-rule would simply escape the\nsphere and thus be skipped in the measurement.\n\nThis leads to the diffuse reflectance. Substracting both would give you the\nspecular reflectance. For transmissive samples, the procedure works more or\nless the same. Doing a direct measurement is rather complicated...\nMeasurements on an integrating sphere are a standard measurement.\n\n\n\nThe procedure seems to be straight forward. However it is not. First, you\ncan never measure only one outgoing direction, and you never have only one\nincident direction. There is always an angular range, larger than zero.\nImagine the device for the measurement described above - there will be a\nlight beam used, and that is not perfectly parallel and has a diameter. And\nif you open a hole in the sphere, that has more than zero mm^2 area - thus\nit excludes more than one direction. In other terms, you are always talking\nabout solid angles.\n\n\n\nThe reason is not only imperfection in making measurement devices. Even a\nvery good mirror reflects light not only into one direction. For each\nincident direction you will always get a distribution of reflected and,\nsometimes, transmitted light. There are some labs offering measurement of\nsuch distributions (maybe you have seen candela distributions for electrical\nlighting - it is something like that), I have been working at one until just\nrecently. Using the measured data is not simple, as the data isn't. That is\nwhy the observation that for some surfaces, there are predominant directions\nwhere most of the light is directed to, led to the use of terms such as\nspecular and diffuse. We use these simplifications to be able to describe\nthe characteristics and, in simulation, we use these to optimize algorithms.\n\n\n\nNow, for building materials, you will find very different levels of support\nfrom manufacturers. Some will give you detailed information on reflective\nand transmissive properties (go to the website of Alanod, they let you\ndownload the bidirectional reflection distribution data of their frontside\nmirrors - the distribution I describe in the paragraphe above at a high\nangular resolution). Quite a lot of manufacturer of materials where lighting\nis involved will give you some values like direct/specular and diffuse\n(glazing, sunshades, ...) but not more. And then, a lot of manufacturers may\nbe able to give you color information.\n\n\n\nYou will also find that, depending on the application, different terms are\nused when talking about reflective and transmissive characteristics.\n\nGloss, shininess, application standards differ often from what is more\nestablished in physics.\n\n\n\nThe conclusion is that there is no way to simply collect specularity values\nof building materials. Define what you are interested in and what your\napplication is. If you are talking about appearance, energy transports, ...\nAre you looking at facades? Glass? Paints? Different polishing techniques?\n\n\n\nI hope that this helps to find a starting point...\n\n\n\nCheers, Lars.\n\n\n\nAny Suggestions???\n\n\n\nSotiris Papantoniou\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20101125/dfa85426/attachment.html\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Sotiris Papantoniou", "datetime": "Thu Nov 25 13:22:01 2010"}