{"refs": ["<loom.20101228T160819-777@post.gmane.org>"], "id": "<AANLkTi=-D5uoYh_OKFH-CYyXUnr38vNOHoovZP-_VYnr@mail.gmail.com>", "subject": "[Radiance-general] window glass modeling", "email": "tbleicher at googlemail.com", "body": "\nMerry Christmas Milan.\n\nPlease find answers to your questions below.\n\nOn Tue, Dec 28, 2010 at 12:17 PM, Milan Cakanovic\n<milan.cakanovic at hotmail.com> wrote:\n\nJust a comment here: You should calculate the illuminance\nat a few points around your actual sample point and then\naverage the results, especially when you want to use blinds.\nThis will avoid peak values due to direct sunlight passing\nbetween the slates and hitting your single measurement point.\n\n\nThese are definitions you can use directly in Radiance. The first\nfour lines define the base glass material the second and third\ngroup define separate materials for the front and back of the\nsandwich which are different due to the glass pane thickness\nand coatings (if there are any).\n\nI have not used a BRTDfunc material so far, but I think you would\npick the right definition for your scene (GlzSys1_back probably)\nand use it to define the window polygon. It is a very crude approach\nand does not account for a number of effects. There have been\na couple of discussions on this here on the list which you can\nresearch if you want.\n\n\nThis is just a general representation of the angular dependent\ntransmission/reflection of the glazing. You would have to convert\nthis to a format Radiance can understand (but you already have\nthe description above).\n\n\nTo define a basic glass material you would use the Vtc (visual\ntransmittance) for a 0 degree angle (orthogonal to surface). Some\nof the angular dependence is accounted for in the material primitive\n\"glass\" so we don't have to fuzz about with all the angles. It's not\nvery accurate but for a scene that includes blinds and artificial\nlighting an accurate glazing representation is probably less important.\nYou have to decide about this of course.\n\nThe transmittance(Tn) has to be converted to transmissivity(tn) via\nthis formula:\n\ntn = (sqrt(.8402528435+.0072522239*Tn*Tn)-.9166530661)/.0036261119/Tn\n\nWith a base transmittance of 0.798 we get a transmissivity of 0.869 and\ncould define a simple glass material as\n\nvoid glass GlzSys1_simple\n0\n0\n3 0.869 0.869 0.869\n\nThis is not that far of from the GlzSys1_glass above.\n\n\n\nNo. See above. If you only have one value for the transmittance and\nno information on the spectral distribution you can use the same Tn\nfor the red, green and blue values. Using different R, G and B will\nonly give the glass a slight colour tint.\n\n\nIf you use mkillum you have to replace the window material with\nthe definition created by mkillum. You also have to make sure that\nthe polygon normal points inwards or you won't get any light.\n\n\nThat is a reasonable approach but only accounts for the light\ncontributed by the sun. (See below about the sky).\n\n\nYou can scale the values of the glow material. It only needs\naverage to 1 because the actual brightness of this particular\nsky is already defined in the definition of \"skyfunc\". But you\nwant to reduce that brightness by 1/4 so you can apply the\ntransmittance values directly to the RGB values as above.\n\nHowever, this will not take into account the specific angular\ndependent transmission of glass for the light from the sky.\nTherefore, light that hits the glass from the sides will be\nequally reduced as the light from in front of the window.\nThis introduces some difference into the two calculation\nresults you have to be aware of.\n\n\n\nSounds incredibly complicated and is not at all necessary.\nThere is no difference in the definition for glass for sunlight and\nglass for skylight. The various transmission values you have\nin your Window6 output are approximated/accounted for in the\nbase primitive \"glass\" or the BRTDfunc definition.\n\nI think this also deals with Case 3 and Question 6.\n\nIf you want to split you calculation into sun, sky and ground\nyou can do so in the scene definition and later add the individual\nresults. However, your scenario is not a good candidate for\nthat because the problem you see does not really exist.\n\n\nRegards and enjoy the holidays/in-between-days.\n\nThomas\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] window glass modeling", "tags": [], "sender": "Thomas Bleicher", "datetime": "Tue, 28 Dec 2010 14:03:28 -0500"}