{"refs": ["<loom.20101228T160819-777@post.gmane.org>\t<4D1A321A.9090809@gmx.net>", "<loom.20101229T033010-194@post.gmane.org>"], "id": "<4D1B3B84.9040506@gmx.net>", "subject": "[Radiance-general] window glass modeling", "email": "grobe at gmx.net", "body": "\nHi Milan!\n\n\nAs Marija wrote, you can also just put a grid of sensor points into the\nscene. The background of my proposal was that a rpict-generated image\nmay be useful to track problems in the scene, even though the irradiance\nvalues you get would certainly be affected by the geometry added as a\nworking plane (which is not necessary when using a grid as rtrace\ninput). So if you take this approach, do not compare the results of a\nrendered image including work plane geometry to sensor point\nilluminances rendered without such geometry - they must be different.\nBut look out for suspicous shadows, splotches, noise, gradients that\nlook too smooth or not as smooth as you would expect it from the\ngeometry. Do all the basic checks (Afternoon sun coming in from\nEast...?) to find out whether the model is ok, this may help avoid a lot\nof trouble. For illuminance readings, you will have to remove the work\nplane geometry before running rtrace.\n\n\nAs long as the blinds are outside the glass, everything is fine and you\ncan use the glass surface as an mkillum input. If you ever should have\nto render a model with blinds on the inner side of the window, it is\nimportant to remember that the mkillum pane has to be inside the\ncomplicated geometry to precalculte.\n\n\nAs you may already know, rpict per default gives you an image according\nto choosen projection, which means it results in an array of luminance\nvalues. You may however use the -i switch to get an image showing\nirradiance values on the visible surfaces. Using falsecolor, you can get\na quick idea on how illuminance is distributed over the surfaces of your\nscene.\n\nCheers, Lars.\n\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: smime.p7s\nType: application/pkcs7-signature\nSize: 3740 bytes\nDesc: S/MIME Cryptographic Signature\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20101229/56005269/attachment.bin>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] window glass modeling", "tags": [], "sender": "Lars O. Grobe", "datetime": "Wed, 29 Dec 2010 14:45:40 +0100"}