{"refs": ["<1773335.454131290542592530.JavaMail.defaultUser@defaultHost>", "<4CEC21B0.6060103@visarc.com>", "<CC7B52EF0E443D45B11162FB554D97DF06B915F81C@EURXMBC02.global.arup.com>", "<4CED0866.2080807@visarc.com>", "<CC7B52EF0E443D45B11162FB554D97DF06B935FE90@EURXMBC02.global.arup.com>", "<4D05F826.5060009@gmx.net>", "<CC7B52EF0E443D45B11162FB554D97DF06B947B2E3@EURXMBC02.global.arup.com>", "<C43A7C7D-072A-469E-A5BE-8BA6FAC32AF3@lmi.net>"], "id": "<CC7B52EF0E443D45B11162FB554D97DF101ABD7B72@EURXMBC02.global.arup.com>", "subject": "Re: [Radiance-general] Instances", "email": "Greg Ward", "body": "\nHi Greg,\n\nThank you so much for your detailed answer (and sorry for being late again exploring it).\n\n-aa method is a good one, but I am a little concerned this will impact a lot on rendering time in a scene like mine in which many ab are required and a very high number of rays (it is a comparison between shading systems to work out transmittances).\n\nThe -PP option seems to be what I need, but I am not sure I understand it. Please tell me if the following is correct.\n\nI start an rpict (or rtrace) with a -PP namefile option.\n\nI start other rpict or rtrace wit -PP namefile (the same) and they will share memory (ram?)\n\nAmbient file instead will be shared by using -af and the same ambient file for all the processes.\n\nIs this correct?\n\nI believe -S is not needed with the -PP option, am I right?\n\nCan I share with -PP between rpict and rtrace processes?\n\nThank you for your help, one of my colleagues run into the same issue today, so it would be very good if we manage to solve this!\n\nHave a nice day!!!\n\nLucio\n\n-----Original Message-----\nSent: 23 December 2010 17:33\nTo: Radiance general discussion\nHi Lucio,\n\nIf you are executing in parallel on a shared memory machine, are you using the -PP option to rtrace (or rpict)?  This can help to reduce memory, especially on jobs where you are loading in a substantial ambient file to start.\n\nAnother approach is to abandon ambient caching entirely, which makes sense in scenes where you have a lot of important detail, but what's most important about it is the aggregate behavior.  I think your problem falls into that category.  Unfortunately, whatever -a* settings you have worked out will have to be rethought when you do this.  I should have a good guide for how to set these parameters, but you basically start by setting -aa 0, at which point -af, -ar, and -aw settings become irrelevant (no caching), and the -ad and -as settings should be changed.  You also should look at the -lw and -lr settings, because they will have a strong influence over how deep the ray tree is explored.\n\nAxel Jacobs offers a brief treatment of these settings on page 12 of his rtcontrib tutorial, currently linked at:\n\nhttp://luminance.londonmet.ac.uk/learnix/docs/rtcontrib_lesson.pdf\n\nIt's probably worth a try.  I use -aa 0 routinely when modeling blind systems in mkillum, for example.\n\nBest,\n-Greg\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Instances", "tags": [], "sender": "gregoryjward at gmail.com", "datetime": "Fri, 7 Jan 2011 18:40:39 +0000"}