{"body": "\nThank you Rob!\n\nActually I didn't want to continue an unfinished sequence, but to start a new one. Erasing the 3 files I was creating for the process, didn't work either (in fact the script already was overwriting them, so it was just to not leave anything untried that I tried it).\n\nI managed just a few minuts ago to solve the problem. Instead of writing the numbers of divisioni to the sync.file as written before, I wrote them in the normal way : -X 8 -Y 8 .\n\nThis solved my problem but leaves opened the question on why it didn't work in the other way (as it was copied right from the manual).\n\nLucio\n\n\n\n.loscotec@libero.it wrote:\n.> So I tried to implement it at least for rpict with rpiece.\n.>\n.> first time i used it everything worked properly, but relaunching it with some changes, it stops processes reporting :\n.>\n.You have to use the -R option instead of the -F option on a restart, I believe.\n.>From the manpage:\n.\n.The /-R/ option may be used instead of /-F/ if some of the pieces were  not\n.\n.       properly  finished  by  previous  (killed) runs of /rpiece./  This option\n.       should be used by at most one /rpiece/ process,  which  must  be  started\n.       first and with /no/ /other/ /rpiece/ /processes/ /running/ or else it will reren-\n.       der the same pieces other  processes  have  begun.   Once  the  recover\n.       process  is  started, you may start other /rpiece/ processes using the /-F/\n.       option to run simultaneously.  If some processes die during  execution,\n.       leaving one or more half-finished pieces in the picture even though the\n.       other processes think the work is done, you may  run  a  single  /rpiece/\n.       with the /-R/ option by itself to repair the holes.\n.\n.\n.\n.\n.\n.\n._______________________________________________\n.Radiance-general mailing list\n.Radiance-general@radiance-online.org\n.http://www.radiance-online.org/mailman/listinfo/radiance-general\n.\n\n.. Caminante no hay\ncamino, solo se hace\ncamino al andar ..\n\n\n---   o\nmeglio   ---\n\n.. Caminante el\ndestino no es al\nfinal de el viaje,\npero en todo el\nandar ..\n\n\n", "replyTo": "", "sender": "loscotec@libero.it", "isquestion": true, "tags": [], "id": "<JWAPCJ$D3D6F4D5157D5B4449BA590AB538AD88@libero.it>", "refs": [], "datetime": "Fri Feb 15 11:41:16 2008", "email": "loscotec at libero.it", "subject": "[Radiance-general] Problems with rpiece - Solved"}