{"refs": ["<AANLkTik9DO1qNL3sggYdUD4+6BGjuTBqOQkWW1E0bhW4@mail.gmail.com><98EC0CDF-0531-40A6-A94A-367A5724EB4C@lmi.net><AANLkTinunUUG5yNWncAY1K1=Jn7UTP793r5bWDH+0ZN2@mail.gmail.com><6F5225D6E15F954BB4E58EC25F6736C30661E405@corp3005.CORPORATE.FOSTER.NETWORK><4D5A5CE8.8000301@gmx.net><6F5225D6E15F954BB4E58EC25F6736C30661E40F@corp3005.CORPORATE.FOSTER.NETWORK><4D5A6E8F.4000105@gmx.net><6F5225D6E15F954BB4E58EC25F6736C30661E415@corp3005.CORPORATE.FOSTER.NETWORK>", "<AANLkTimxBaTXGHnch_gCeM4sZNQ2ixGrum0wKUmEmB63@mail.gmail.com>"], "id": "<C5E1527F129BF545A250B5AD0B0C26EF088B8678@ENTWEXMB0000000.university.harvard.edu>", "subject": "Re: [Radiance-general] Sunlight hours calculation in radian", "email": "Thomas Bleicher", "body": "\nFor those of you using Daysim, there is a fast subprogram called\ngen_directsunlight that you can use for this purpose. The program places\nyour  scene in a glowing sphere and  then shoot rays from your work\nplane sensor towards the direction of the sun if the direct radiation\ncomponent is above 50WM/m2 (according to the annual climate file). The\nresulting *.dir file reports a \"1\" if direct sunlight hits the sensor\nand '0' otherwise for every hour in the year.\n\n\n\nChristoph\n\n\n\nSent: Tuesday, February 15, 2011 10:02 AM\nTo: Radiance general discussion\n\n\nOn Tue, Feb 15, 2011 at 7:28 AM, Giovanni Betti\n<gbetti at fosterandpartners.com> wrote:\n\n\n\nI would be interested as well in seeing how other people\napproached the\nsame problem though.\n\n\n\nIn the UK you have to calculate sunlight hours on the ground for\nplanning purposes.\n\n\n\nWe used a grid (as opposed to an image) and traced rays from each grid\npoint to the sun (direction was calculated from the gensky sun angle\ninformation). We modified the rtrace command to print the material of\nthe surface it hits instead of the radiance. If the ray hits the sky (or\nnothing) it returns \"*\", if it hits an obstruction it returns the\nmaterial name. Then you just need to count the \"*\"s in the output file\nto know your number of sunlight hours.\n\n\n\nFor planning this is done on one day only, so we ran it with a 5 minute\nresolution. It only took minutes for a reasonably sized grid and that\nincluded all the preparation and evaluation in Lua (Ecotect). This\nmethod generates a data array (x,y,n) which you have to visualise in a\nseparate step.\n\n\n\n[On second thought you can probably combine this method with an vwrays\nbased preprocess to find all the surface points in the scene. For these\nscene points you then evaluate the number of sunlight hours as above and\nreturn the number as value for the image. Sounds like a longish\nsimulation, though.]\n\n\n\nIf you want pictures your idea with rtcontrib and optimised suns seems\nvery promising. A Tregenza subdivision is not optimal because the sun\nonly occupies about a quarter to a third of the sky. But you can run\nrtcontrib on defined light sources so you just need to give all your\nsuns a unique identifier and you're set (the command line length might\nbe somewhat excessive, though). You can also interpolate between the sun\npositions without loosing too much accuracy so you really only need to\nevaluate a few hundred positions. It might be worth to split the summer\nfrom the winter.\n\n\n\nIf you want to read the sun light hours directly from the final image\nyou have to use a unified sun source and combine all the images with a\ncosine corrected intensity for this particular surface which results in\na 1 for each bright pixel on that surface. The final image gives you a\ndirect representation of the sunlight hours. If you have more than one\nsurface (more than one surface orientation, that is) you should go with\nLars' recommendation and apply a threshold value to convert all bright\npixels to a 1 value, regardless of the intensity.\n\n\n\nRegards,\n\nThomas\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20110215/a14b8871/attachment.html>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Sunlight hours calculation in radianc", "tags": [], "sender": "tbleicher at googlemail.com", "datetime": "Tue, 15 Feb 2011 13:41:24 -0500"}