{"body": "\nThank you very much Jack !!\n\nI cannot have access to the laboratory pc 'till thursday, then I'll check your suggested step (at evening just not to spend all the day fixing possible problems! :-P even if I don't think they will occurr).\n\nWhen tried I'll let you know the exits.\n\nJust a (hope not too much) stupid question : what does it mean : \" g++-4.1 - pick a version that matches the level of your current gcc\" ?\n\nAt home (where compiling Radiance is possible) I've got all the things you suggested installed in fact.\n\nI hope I will manage to compile it by myself with your directives, anyhway: what's the machine you have compiled it for?\n\nThank you again !\n\nLucio\n\n\n\n\n.Hi Lucio,\n.\n.I just wanted to follow-up. I went through the steps of compiling\n.radiance on a machine with a relatively stock install of Ubuntu 7.10\n.(gutsy) (a workstation install). In order to get Radiance to compile I\n.had to add the following using the Synaptics package manager:\n.\n.    * Libraries (these are needed for compiling stock Radiance)\n.          o libc6-dev\n.          o libx11-dev\n.    * Development (these are needed for compiling libtiff and trad)\n.          o g++-4.1 - pick a version that matches the level of your\n.            current gcc\n.          o tcl 8.4\n.\n.Note that in using the Synaptics package manger, the system will also\n.install any needed dependencies for the above packages, so this is the\n.way to go. Note if you do not have csh installed you will also need to\n.install csh.\n.\n.While working through this I also encountered a couple of minor issues\n.in the Radiance Head from last week. I passed some fixes along to Greg\n.and I believe that an updated Head is available.\n.\n.With all of this Radiance compiles with no problems. As an additional\n.though, if there is enough interest (although learning to compile is a\n.good thing to know), I can tar up the binaries I made and make them\n.available for download. Let me know.\n.\n.-Jack\n.\n.loscotec@libero.it wrote:\n.> Thank you very much jack, very kind of you !\n.>\n.> It wasn't directly radiance breaking my system.\n.>\n.> Im running Ubuntu Gutsy.\n.>\n.> At home I don't have problems, but in my laboratory I do.\n.>\n.> According to someone who tried to help me, I was missing some libraries . And it was trying to install those library that I messed up too much with gcc components installing 'till my system broke.\n.>\n.> I later spoke with a friend of mine, who is using Linux since more than me, and he told me that sometimes happen changing compilers version that programs don't run good anymore. My system actually deinstalled X11 and many basilar components. I tried reinstalling them later on to fix the problem, but no way to solve it fastly. In the meanwhile someone elses told me : why don't yuo use binaries? :-P So, I preferred that very fast way ;o)\n.>\n.> Anyway, if you wanna have a look, this is the first error reported.. but MANY MANY other are following..\n.>\n.> \" Making programs...\n.> ~/Scrivania/ray/src/common ~/Scrivania/ray/src\n.> In directory common...\n.> gcc -Dlinux -D_FILE_OFFSET_BITS=64 -Dfseeko=fseek -L/usr/X11R6/lib -I/usr/include/X11 -DNOSTEREO -O2   -c -o cone.o cone.c\n.> In file included from rtio.h:9,\n.>                  from standard.h:10,\n.>                  from cone.c:10:\n.> /usr/include/stdio.h:686: error: conflicting types for 'fseek'\n.> /usr/include/stdio.h:654: error: previous declaration of 'fseek' was here\n.> make: *** [cone.o] Error 1 \"\n.>\n.> If you patience to read this mail thank you and let me know, else thank you anyway and don't mind.\n.>\n.> Lucio\n.>\n.>\n.> .Hi Lucio,\n.> .\n.> .Compiling Radiance should not results in general operating system\n.> .instabilities. It has nothing to do with the operation of the OS. I run\n.> .a few different linux distributions, fedora core, ubuntu and caos. If\n.> .you can tell me what compilation problems you ran into and what version\n.> .of linux  then I can try to offer some input.\n.> .\n.> .-Jack\n.> .\n.> .loscotec@libero.it wrote:\n.> .> Thank you very much Greg for explanation about HEAD.\n.> .>\n.> .> Luckily I'm linux user, but unluckily for head to be installed, if I read right, compiling is required.\n.> .>\n.> .> Compiling gives me much problems .. I tried to solve them (it seemed it was gcc problems) but the only result was that my system became very unstable and finally didn't even boot, so I had to reinstall the system and feel satisfied of binaries.. !\n.> .>\n.> .> Lucio\n.> .>\n.> .>\n.> .> .Hi Lucio,\n.> .> .\n.> .> .The lamp color data also includes depreciation factors, which\n.> .> .probably account for the 10% difference.  I assume the \"white\" value\n.> .> .is larger.\n.> .> .\n.> .> .A long-standing bug has been recently pointed out by Zack Rogers\n.> .> .related to the orientation of full photometric distributions, and has\n.> .> .been included in the latest HEAD available from radiance-online.org.\n.> .> .A statement has also been added to clarify the assignment of the\n.> .> .width (along y) and length (along x) axes.\n.> .> .\n.> .> .Hope this helps.\n.> .> .-Greg\n.> .> .\n.> .> .> From: \"loscotec\\@libero\\.it\" <loscotec@libero.it>\n.> .> .> Date: February 6, 2008 6:28:49 AM PST\n.> .> .>\n.> .> .> Hi everybody !\n.> .> .>\n.> .> .> I've got a problem I'm not sure how to deal with.\n.> .> .>\n.> .> .> I'm using a Disano light to simulate a tunnel lighting. It is a\n.> .> .> fluorescent light.\n.> .> .>\n.> .> .> I converted it to radiance format from ies format (previously\n.> .> .> translated from eulumdat format) using ies2rad with no specific\n.> .> .> value. Then I calculated illuminance on road surface visualizing\n.> .> .> isolux scheme.\n.> .> .>\n.> .> .> Then I converted the same light with the \"-t white\" option. And\n.> .> .> calculated illuminance's isolux as before.\n.> .> .>\n.> .> .> The two isolux schemes are different, being value for the white\n.> .> .> case almost 10 % bigger.\n.> .> .>\n.> .> .> Shouldn't them be equal?\n.> .> .>\n.> .> .> I tried simulating same case in dialux and calculux, and they do\n.> .> .> report  almost same values as the white case.\n.> .> .>\n.> .> .> What's wrong? Am I missing some knowledge / trick / anything?\n.> .> .>\n.> .> .> Lucio\n.> .> .>\n.> .> .> Ps : I also discovered some problems both in ies2tab and in\n.> .> .> eulumcnv. The second, badly converting photometry (some dark\n.> .> .> circles appear in the lighted scene as missing photometric values),\n.> .> .> the first badly converting geometry (flipping x and y definitions).\n.> .> .> But I have to check this things a little more.\n.> .> .\n.> .> ._______________________________________________\n.> .> .Radiance-general mailing list\n.> .> .Radiance-general@radiance-online.org\n.> .> .http://www.radiance-online.org/mailman/listinfo/radiance-general\n.> .> .\n.> .>\n.> .> .. Caminante no hay camino, solo se hace camino al andar ..\n.> .>\n.> .>\n.> .> _______________________________________________\n.> .> Radiance-general mailing list\n.> .> Radiance-general@radiance-online.org\n.> .> http://www.radiance-online.org/mailman/listinfo/radiance-general\n.> .>\n.> .>\n.> .\n.> .--\n.> .# Jack de Valpine\n.> .# president\n.> .#\n.> .# visarc incorporated\n.> .# http://www.visarc.com\n.> .#\n.> .# channeling technology for superior design and construction\n.> .\n.> .\n.> ._______________________________________________\n.> .Radiance-general mailing list\n.> .Radiance-general@radiance-online.org\n.> .http://www.radiance-online.org/mailman/listinfo/radiance-general\n.> .\n.>\n.> .. Caminante no hay camino, solo se hace camino al andar ..\n.>\n.>\n.> _______________________________________________\n.> Radiance-general mailing list\n.> Radiance-general@radiance-online.org\n.> http://www.radiance-online.org/mailman/listinfo/radiance-general\n.>\n.>\n.\n.--\n.# Jack de Valpine\n.# president\n.#\n.# visarc incorporated\n.# http://www.visarc.com\n.#\n.# channeling technology for superior design and construction\n.\n.\n\n.. Caminante no hay\ncamino, solo se hace\ncamino al andar ..\n\n\n---   o\nmeglio   ---\n\n.. Caminante el\ndestino no es al\nfinal de el viaje,\npero en todo el\nandar ..\n\n\n", "replyTo": "", "sender": "loscotec@libero.it", "isquestion": true, "tags": [], "id": "<JW54B7$390AF0E9875729F41AC2934A412329FD@libero.it>", "refs": [], "datetime": "Tue Feb 12 11:18:58 2008", "email": "loscotec at libero.it", "subject": "[Radiance-general] HEAD - Radiance on Ubuntu - 7.10"}