{"body": "\nI finally tried the isolux plot from a different view as you suggested me, Greg .\n\nThank you very very very much for your help !\n\nit does wark properly and I did not even had to correct formula \"wrays..\" as it was already correct !\n\nI tried aslo the pinterp strategy, but, having my observer a very small angle of view on the street, the requested resolution of the first image would have been far to big.\n\nI figured out that the vwrays method does not work correctly if there are some obstructions between observer and calculated point . As I'm feeding rtrace view view directions.. !\n\nIs there a stratagem to control this in some way? I dont really need it right now, but i could in the future and I'm really interested in trying to build up some solid calculation program.. !\n\nThank you very much again !\n\n\nLucio\n\n\n.Hi Lucio,\n.\n.Yes, it is true that pinterp needs to fill in missing pixel values,\n.which is why you need a very high resolution image.  (In fact, it\n.would make sense to set the vertical resolution higher than the\n.horizontal resolution, with the -pa 0 option to allow non-square\n.pixels.)  However, the results should still be valid.\n.\n.If you are concerned about calculation efficiency, then you could\n.write a script as you suggest.  First, you would use vwrays to feed\n.rtrace and get it to generate intersection points for all the\n.positions on the orthogonal view.  Second, you would apply a script\n.to convert these positions to directions from the observer for a\n.second rtrace run that would compute your radiance values.  This\n.would be output to an image.  I guess it would go something like:\n.\n.% vwrays -ff -vf ortho.vf -x XRES -y YRES -pa 0 \\\n.\t| rtrace -h -ff -op roadway.oct \\\n.\t| rcalc -if3 -of -e '$1=OX;$2=OY;$3=OZ;$4=$1-OX;$5=$2-OY;$6=$3-OZ' \\\n.\t| rtrace -ffc -x XRES -y YRES roadway.oct \\\n.\t| falsecolor -cl -s auto \\\n.\t| ra_tiff - roadway_lum.tif\n.\n.where XRES and YRES are the desired map resolution and OX, OY, and OZ\n.are the observer coordinates.  (E.g., add -e 'OX:10.5;OY:-3.9;OZ=2'\n.to the rcalc line.)\n.\n.I hope this makes sense.  It may require some adjustments -- I didn't\n.test it out!\n.\n.-Greg\n.\n.> From: \"loscotec\\@libero\\.it\" <loscotec@libero.it>\n.> Date: February 4, 2008 9:39:02 AM PST\n.>\n.> Wonderfull!!!\n.>\n.> So powerfull is Radiance!! :o)\n.>\n.> That's really what I wanted ! Thank you very much !!!\n.>\n.> Now let's see if I'm able to really do it ! :-P\n.>\n.> Just a curiosity. Pinterp just interpolates datas, right? So as\n.> much going far from the observer, as loosing detail, isn't it? This\n.> is probably the reason why I need high resolution image.\n.>\n.> It is not possible to just calculate the points needed for the last\n.> image orthogonal one) from the observer point of view , and save\n.> results in an image format? It would probably need just a quite\n.> simple script (which calls rtrace many times) and could save much\n.> render time (definition is only were needed). Am I right? Or there\n.> is something I didn't contemplate?\n.>\n.> Lucio\n.>\n.\n._______________________________________________\n.Radiance-general mailing list\n.Radiance-general@radiance-online.org\n.http://www.radiance-online.org/mailman/listinfo/radiance-general\n.\n\n.. Caminante no hay camino, solo se hace camino al andar ..\n\n\n", "replyTo": "", "sender": "loscotec@libero.it", "isquestion": true, "tags": [], "id": "<JVX9CK$43B718F3ADEF76BCBD8E55F8B17B9B68@libero.it>", "refs": [], "datetime": "Fri Feb  8 05:26:50 2008", "email": "loscotec at libero.it", "subject": "[Radiance-general] Re: falsecolor's isolux on observer's luminance."}