{"body": "\nThank you very much Greg for explanation about HEAD.\n\nLuckily I'm linux user, but unluckily for head to be installed, if I read right, compiling is required.\n\nCompiling gives me much problems .. I tried to solve them (it seemed it was gcc problems) but the only result was that my system became very unstable and finally didn't even boot, so I had to reinstall the system and feel satisfied of binaries.. !\n\nLucio\n\n\n.Hi Lucio,\n.\n.The lamp color data also includes depreciation factors, which\n.probably account for the 10% difference.  I assume the \"white\" value\n.is larger.\n.\n.A long-standing bug has been recently pointed out by Zack Rogers\n.related to the orientation of full photometric distributions, and has\n.been included in the latest HEAD available from radiance-online.org.\n.A statement has also been added to clarify the assignment of the\n.width (along y) and length (along x) axes.\n.\n.Hope this helps.\n.-Greg\n.\n.> From: \"loscotec\\@libero\\.it\" <loscotec@libero.it>\n.> Date: February 6, 2008 6:28:49 AM PST\n.>\n.> Hi everybody !\n.>\n.> I've got a problem I'm not sure how to deal with.\n.>\n.> I'm using a Disano light to simulate a tunnel lighting. It is a\n.> fluorescent light.\n.>\n.> I converted it to radiance format from ies format (previously\n.> translated from eulumdat format) using ies2rad with no specific\n.> value. Then I calculated illuminance on road surface visualizing\n.> isolux scheme.\n.>\n.> Then I converted the same light with the \"-t white\" option. And\n.> calculated illuminance's isolux as before.\n.>\n.> The two isolux schemes are different, being value for the white\n.> case almost 10 % bigger.\n.>\n.> Shouldn't them be equal?\n.>\n.> I tried simulating same case in dialux and calculux, and they do\n.> report  almost same values as the white case.\n.>\n.> What's wrong? Am I missing some knowledge / trick / anything?\n.>\n.> Lucio\n.>\n.> Ps : I also discovered some problems both in ies2tab and in\n.> eulumcnv. The second, badly converting photometry (some dark\n.> circles appear in the lighted scene as missing photometric values),\n.> the first badly converting geometry (flipping x and y definitions).\n.> But I have to check this things a little more.\n.\n._______________________________________________\n.Radiance-general mailing list\n.Radiance-general@radiance-online.org\n.http://www.radiance-online.org/mailman/listinfo/radiance-general\n.\n\n.. Caminante no hay camino, solo se hace camino al andar ..\n\n\n", "replyTo": "", "sender": "loscotec@libero.it", "isquestion": true, "tags": [], "id": "<JVVACW$9886A4A07D6C2AD758D7CE0A7137FEBF@libero.it>", "refs": [], "datetime": "Thu Feb  7 03:53:27 2008", "email": "loscotec at libero.it", "subject": "[Radiance-general] HEAD"}