{"body": "\nThank you Thomas!\n\nI thought too something like that, but it does not fit my needs.\n\nI would like to generate the isolux via script .\n\nAnd your technique could also be quite unprecise, 'couse it doesn't actually calculate rays from the observer eye, in a 'radial' way but from a plane placed in the observer position with parallel rays ...\n\nIf I'm wrong, please tell it to me! ;-)\n\nThank you anyway for your suggestion !\n\nnow I'll try the suggestions from Greg, and then I'll let you know !\n\nLucio\n\n.\n.On 4 Feb 2008, at 15:10, loscotec@@libero..it wrote:\n.\n.> Good day to everybody!\n.>\n.> I need yuor help!\n.>\n.> I would like to know if it is possible to do what I'm going to\n.> explain and how could I obtain such result.\n.>\n.> So.. what I need is to have in the end an orthogonal view from\n.> above a street which shows isolux lines of luminance from a\n.> determined poin of view.\n.\n.Alternative to Greg's proposal:\n.\n.Render a first image as a parallel projection with view point and\n.direction of\n.the observer. Create a falsecolor image from this rendering. Then use\n.the\n.generated image as a texture to colour your street. The texture\n.rotation would be\n.the view direction of your observer. Render the street from above\n.just for the\n.texture effect (no second falsecolor).\n.\n.Again the first image should be large to provide more details. The\n.second rendering\n.could be done in any 3D modeller with sufficient control for texture\n.mapping (Blender\n.for example).\n.\n.Thomas\n.\n._______________________________________________\n.Radiance-general mailing list\n.Radiance-general@radiance-online.org\n.http://www.radiance-online.org/mailman/listinfo/radiance-general\n.\n\n.. Caminante no hay camino, solo se hace camino al andar ..\n\n\n", "replyTo": "", "sender": "loscotec@libero.it", "isquestion": true, "tags": [], "id": "<JVRH6M$4F4F3807DCCDDD71D0E30415266BD82A@libero.it>", "refs": [], "datetime": "Tue Feb  5 02:30:29 2008", "email": "loscotec at libero.it", "subject": "[Radiance-general] falsecolor's isolux on observer's luminance."}