{"refs": ["<E35477F1A321144D897D44CCAAFF202C0E2B0FE224@AD-MAILBOX01.aau.dk>", "<BANLkTimeyD2fKoG=rN4a2xjOuXY2uoAO0g@mail.gmail.com>"], "id": "<E35477F1A321144D897D44CCAAFF202C0E2BB93205@AD-MAILBOX01.aau.dk>", "subject": "Re: [Radiance-general] su2rad: problems with texture mapping", "email": "Thomas Bleicher", "body": "\n\nHello Thomas,\n\nWell, I tried both your suggestions to no avail.\n\nThen I more or less stumbled upon a \"solution\". If I avoid placing any part of the geometry in octants with negative coordinates then texturing works with no problems.\n\nHave no idea why that would be the case, though.\n\nAfter export I can !xform the object to any octant of the scene no problem...\n\nBest,\nClaus\n\n\n\n\n\nSent: 18. april 2011 14:57\nTo: Radiance general discussion\nHello Claus\n\nUnfortunately the texture export in su2rad is not very sophisticated. It's not a good way to produce Radiance textures anyway.\n\nTo solve your problem you can try one of the two options:\n\n1) Select all the textured faces, right click and choose \"texture -> make unique\" from the context menu. This will create six identical materials with a uniform mapping for each face.\n\nor 2) Use the attached script to export the cube to *.obj and then use obj2mesh to convert the *.obj file to a Radiance mesh with textures. The author of this OBJ exporter says it does the \"make unique\" step during the export. Please note that I have not used this script myself and I don't know if it modifies your  materials during the export.\n\nRegards,\nThomas\n\n2011/4/18 Claus Br?ndgaard Madsen <cbm at create.aau.dk<mailto:cbm at create.aau.dk>>\n\n\nDear List (Thomas ?)\n\n\nI have been experimenting a little with getting geometry into RADIANCE by exporting to 3ds formation from 3ds Max, importing into SketchUp, and then exporting to RADIANCE using su2rad.\n\nSo far I have only tested simple models, for example a 1x1x1 meter cube, with all six faces textured with the same square image.\n\nI export in \"by color\" mode, as that has been most successful thus far.\n\nI attach a .jpg of the result. I have tried a million different things in SketchUp to try to get rid of the uv-mapping problem which is very evident in the attach render.\n\nAny suggestions? When exporting a more complicated (sculpture) model, textured with a single \"marble\" albedo map, the same uv-mapping problem is experienced.\n\nBest,\nClaus\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20110419/a32fb08f/attachment.html>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] su2rad: problems with texture mapping", "tags": [], "sender": "tbleicher at googlemail.com", "datetime": "Tue, 19 Apr 2011 15:08:11 +0200"}