{"refs": ["<BANLkTinH5PhKwxKW32h1sLfCC6QtgoQ3DA@mail.gmail.com>"], "id": "<ACA5649B-2FCF-49FE-BE9D-E9F26054C9DB@lmi.net>", "subject": "[Radiance-general] rpict image rendering problem", "email": "gregoryjward at gmail.com", "body": "\nHello Ji,\n\nI won't address all of your issues, but you seem to be laboring under a basic misunderstanding regarding image file names and types.  Simply specifying a different suffix doesn't cause Radiance to write out whatever format file you choose.  Rpict and most Radiance tools that don't start with \"ra_\" output only to Radiance RGBE (.hdr) format.  MacOS X and Photoshop are smart enough to ignore the suffix and interpret the file correctly, though they may perform different tone-mapping operations to display them.  Hence, the differences you are seeing.\n\nThere are no converters to JPEG or PNG image formats included with Radiance.  You can get to BMP, TIFF, GIF, Targa, Pict, PPM, and PostScript.  A typical conversion might go like this:\n\nrpict [options] octree > result.hdr\nra_bmp -e auto result.hdr result_tm.bmp\n\nI have added \"_tm\" to the name to indicate that it has been tone-mapped.  A general tool for performing tone-mapping, which outputs to Radiance format but in a restricted range, is pcond.  A similar result to the above in PPM format may be obtained with:\n\npcond result.hdr | ra_ppm > result_tm.ppm\n\nAny other formats than those listed above will have to be reached using Photoshop, Photosphere, Preview, or other tools.  As I mentioned, they each have their own notion of tone-mapping, so your mileage may vary.\n\nAs for the splotches and so forth, there are a plethora of options that affect rendering quality, and if there is nothing wrong with your model, the use of \"rad\" or \"trad\" is highly recommended to help you set up your simulation.\n\nBest,\n-Greg\n\nP.S.  As an interesting side-note, Unix tools do not even see the file suffix if you use redirection, i.e., \"> output_file.sfx\".  In the Unix tradition, none of the Radiance tools look at or enforce any particular file suffix usage, and everything is done by convention for the user's benefit.\n\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] rpict image rendering problem", "tags": [], "sender": "Greg Ward", "datetime": "Tue, 26 Apr 2011 08:32:54 -0700"}