{"refs": [], "id": "<DC0CAEEA090E984C911D3B85B16C3F90FAF4AA@l-gnts05>", "subject": "[Radiance-general] replmarks and mirroring", "email": "Lars O. Grobe", "body": "\nthe simplest and quickest thing is to use two different geometries:\nthe mirrored (xform -I) and the default (from acad).\n...then replmark separately the two geometries.\nhope it helps\ngiulio\n\n\n\n\n-----Original Message-----\nSent: 09 May 2004 23:11\nTo: radiance-general@radiance-online.org\n\nHi!\n\nOn may way using replmarks and instances to split down a large model, I\nfound a problem that makes the use of the replmark tool quite hard. I\nuse this to build the model from lots of small files, which are\nexported from CAD. The markerfiles are generated by replacing the\nexternal references with triangles. Works really fine.\n\nThe replmarks manpage says: \"The longest side is the hypoteneuse, the\nsecond longest side is the x?-axis, and the third longest side\nindicates the direction of the y?-axis. Any additional sides will be\nignored (ie. a quadrilateral may be used instead of a triangle if the\nextra side is small). The z?-axis is determined by the cross product of\nthe x? and y? axes, and the origin is the common vertex between x? and\ny?.\" This just brings one limitation - I cannot define mirroring with\nthis kind of markers. In my CAD, the mirrored References give mirrored\ntriangles, fine, but radiance won't mirror the instance geometry, but\n(z' as cross product of x' and y') will rotate it, so that it is upside\ndown in the radiance scene.\n\nIs there any way to circumvent this problem? It is quite bad to be\nunable to use mirroring in CAD, and makes the use of markerfiles\ndifficult. I wonder why z' is not determined from the surface normal.\nIs there a reason not to use it, is it just to avoid further confusion\n(surface normals are usually where they shouldn't go;-) ?\n\nTIA+CU Lars.\n--\nLars O. Grobe\ngrobe@gmx.net\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n___________________________________________________________________\nElectronic mail messages entering and leaving Arup business\nsystems are scanned for acceptability of content and viruses.\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "grobe@gmx.net", "datetime": "Mon May 10 14:47:55 2004"}