{"refs": [], "id": "<39E82ED1-BCF3-41F6-BFB9-1D795B6F1713@lbl.gov>", "subject": "[Radiance-general] 2011 International Radiance Workshop", "email": "amcneil at lbl.gov", "body": "\nAnnouncing the 2011 International Radiance Workshop\n\nWe are still working on the details, and to get a website up for registration.   In the meantime, I want to share what details we have so everyone can start to arrange travel.  I will send another notification when the registration website is ready to accept registration & payment.\n\nDates\nWednesday, August 24 - Seminar day\nThursday, August 25 - Workshop Day 1\nFriday, August 26 - Workshop Day 2\n\nWe're still planning the seminar day, though I can fill you in on some specifics.  John Mardaljevic will present a crash course on the Radiance ambient calculation.  We will also have a few presentations covering measurement and simulation of complex fenestration from Greg Ward, Jacob Jonsson and Peter Apian-Bennewitz.  Someone from LBNL will present a preview of the complex glazing database (database for optical properties of non-specular fenestration).  There will also be a presentation covering a new Radiance material primitive!\n\nCall for Presenters\nAs always, we rely on attendees to present their own work during the two-day workshop.  We are now officially opening the call for presenters.  Please email presentation abstracts to Andy McNeil (amcneil at lbl.gov) by Wednesday August 3.\n\nRegistration Fee\nWe are working to get prices for everything.  In the meantime, I can tell you that the fee will be less than $300 for all three days.  Presenters will receive a small discount.  We'll announce the official cost probably when the registration website is launched.\n\nHousing\nWe've reserved a small block of rooms at the Berkeley Lab Guest House (http://www.berkeleylabguesthouse.berkeley.edu/).  The guest house is located on the lab property and is conveniently located for the workshop.  However it is a bit removed from restaurants and nightlife of Berkeley.  The lab provides a shuttle bus to downtown Berkeley during normal lab hours.  A taxi service is available after lab hours.\n\nWe also recommend the following two hotels:\n- Hotel Shattuck Plaza - 1 block from the BART and 3 blocks away from the shuttle up to the lab, a short walk to the restaurants of gourmet ghetto.  http://www.hotelshattuckplaza.com/index.cfm\n- Hotel Durant - a 20 minute a walk from BART.  A 12 minute walk across UC campus to the LBL shuttle bus.    http://www.jdvhotels.com/hotels/sanfranciscoeastbay/durant\n\nWe look forward to hosting everyone here in Berkeley!\n\nAndy\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20110516/a16dc779/attachment.html>\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Andy McNeil", "datetime": "Mon, 16 May 2011 09:58:55 -0700"}