{"refs": ["<4dd37f3a.d94fcc0a.6514.5074@mx.google.com>\t<A5763843-F697-4B6C-B016-7D652BC852C4@gmx.net>", "<4dd39f9d.d94fcc0a.43c5.5c8c@mx.google.com>"], "id": "<4DD3B84C.7090507@visarc.com>", "subject": "[Radiance-general] Running multiple rpict commandsfor\tdifferent scenes", "email": "jedev at visarc.com", "body": "\nHi Sotiris,\n\nThere are several things that you are going to have to figure out in\norder to take advantage of the compute resources available at your\nuniversity. Hopefully there is some administrative support that can\nprovide some basic advice. But I think that you will need to figure out\nthe following, and this is likely not going to be an fast learning curve\nunless you are accustomed to working with this type of system and the\nscripting that will likely be involved. It will take some trial and\nerror, but once you get it figured out it will probably be well worth\nthe effort to have such a resource available.\n\n1. You will need to figure out how you need to install your\napplication (Radiance) to make it accessible to the cluster.\n2. You will need to figure out how to script radiance to to make the\nscene changes that are needed. This might involve some selection\nof: make, csh, perl, python or whatever other scripting language\nyou enjoy. I think that it may also be possible to control through\nMatlab/Octave (see\nhttp://web.mac.com/geotrupes/iWeb/Main%20site/RadBlog/E549E7F4-6DA2-4D78-8F91-74A4691ED86A.html\nat Giulio Antonutto's site). If the only variation in your scene\nis going to be the orientation of the individual blind slats, then\nthere are a number of ways to script this and one option might be\nto consider looking at the radiance program ranimate with the\nANIMATE variable set to a script to rotates the slat geometry by a\ngiven increment or parameter, with this you could also change\nother scene conditions such as the position of the sun/sky\ncondition. But this could also be done with the other scripting\nmethods I indicate.\n3. Lastly you will need to figure out how to submit your radiance\nrendering job to the grid. Based on the information that you\nprovide it is most likely that this would be done via \"qsub\" which\nis a job submital routine for Torque, which looks to be the\nqueuing system for the cluster (Maui takes care of how the\nresources are actually allocated). Unfortunately this (job\nsubmittal with qsub) also requires some scripting, however there\nshould be \"howto\" resources available from the system\nadministrators of the cluster. Such a script will have parameters\nindicating what resources (nodes, cpus, cores and time are needed\nfor the job) as well as what the job comprises. In this case you\nwould probably want to script something that actually generates\n1200 separate \"jobs\" that can then be submitted individually to\nthe cluster as resources become available. If you \"owned\" the\ncluster you would be able to do things more simply using ranimate\nto distribute the job over selected cluster nodes.\n\n\nRegards,\n\n-Jack de Valpine\n\n--\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n\n\nOn 5/18/2011 6:29 AM, Sotiris Papantoniou wrote:\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20110518/93cc8249/attachment-0001.html>\n\n", "isquestion": false, "replyTo": "<4dd39f9d.d94fcc0a.43c5.5c8c@mx.google.com>", "tags": [], "sender": "Jack de Valpine", "datetime": "Wed, 18 May 2011 08:15:08 -0400"}