{"refs": ["<39E82ED1-BCF3-41F6-BFB9-1D795B6F1713@lbl.gov>", "<2BC45EBFC3EB9F45BF5F860C7751088D115A615B32@VA3DIAXVS551.RED001.local>"], "id": "<C66715D2-10DA-4FDA-9EEA-F9E2066D80C5@lbl.gov>", "subject": "[Radiance-general] 2011 International Radiance Workshop", "email": "amcneil at lbl.gov", "body": "\nHi Sandy,\n\nI'll start by saying that we are very welcoming of beginners at the workshop.  We haven't planned a beginners tutorial during the seminars but  beginners will probably find John's seminar presentation on the ambient calculation parameters (-ab -ad -ar -aa etc) to be helpful.\n\nThe presentations during the workshop are given by attendees.  At this point there is no way to know what they will be.  Presentations at past workshops have cover a range of topics.\n\nWhen I was a beginner I found the workshop to be inspiring.  While much of the detail was beyond my capability, conceptually it was all very interesting.  I also found the time between presentations, (coffee breaks, lunch and workshop dinner) when I had the opportunity to talk with more experienced users to be particularly valuable for beg.  The workshops provided the motivation I needed persevere.\n\nIf you are a complete beginner I'd suggest working through tutorials before the workshop.  But if your using Radiance now, you're probably know enough to find value in the workshop.\n\nBest,\nAndy\n\nPS - Here's a great presentation from Rob at his second workshop (after attending the workshop a year before as self-described newbie).   http://www.radiance-online.org/radiance-workshop2/cd/Guglielmetti/abstract.html  Hopefully well have some presentations from relatively new users this year too.\n\n\n\n\n\nOn May 19, 2011, at 12:18 PM, Sandy Houck wrote:\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20110519/f85a1c7f/attachment-0001.html>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] 2011 International Radiance Worksh", "tags": [], "sender": "Andy McNeil", "datetime": "Thu, 19 May 2011 14:06:08 -0700"}