{"refs": [], "id": "<20040511005952.59712.qmail@web80306.mail.yahoo.com>", "subject": "[Radiance-general] Rendering With Radiance, Revised Edition", "email": "ckehrlich at yahoo.com", "body": "\nDear Radiance Users,\n\nFirst I would like to apologize for the unprofessional way that BookSurge has handled the publishing of the revised edition of Rendering with Radiance.  And, I would like to thank those of you who pointed out that the book was available even before WE knew it was available--twice!  Greg has accurately summarized the situation.  We never authorized a paperback nor an e-book, and we never authorized the lower price that was momentarily available.\n\nThere was only one copy of the e-Book sold, and we know his name.  He will be getting a free copy of the hardback.   If you ever come across the illegal e-book, we respectfully request that you let us know and destroy it so that it does not proliferate.\n\nIf you have a copy of the paperback and would like a hardback version, send me a check for the difference in price along with the original title page from the paperback, and I will send you a copy of the hardback book.  It looks like there were seven folks who inadvertently got the paperback version at a price of 31.99, and one person who paid $42.95.  Let me know how you'd like it shipped (FedEx or UPS--1 day, 2-day, or whatever) and figure out the cost from USA ZIP code 95616 and add half of that cost to your check--we'll pick up the other half of the shipping up to $15.00.\n\nNow that the book is out, I would like to encourage all of you who maintain web sites about your work with Radiance to include a hyperlink to your favorite online book reseller carrying Rendering with Radiance, Revised Edition.  We, the authors, do not expect to make any money on this venture.  But if we did, it would be the first in seven years! The new ISBN is 1-59457-433-2.\n\nHere is a link to oder the book in case you'd like make the book available right away:\nBookSurge: http://www.booksurge.com/author.php3?accountID=IMPR02587\nAlibris: http://www.alibris.com/search/detail.cfm?chunk=25&mtype=&qisbn=1594574332&qtit=rendering%20with%20radiance&S=R&bid=8217366102&pqtynew=&page=1&matches=1&qsort=r\n\nAmazon.com and half.com will carry the book eventually, but they do not have the new ISBN listed yet.\n\nThose who placed orders at the Radiance workshop should expect the shipments to begin in a week or two (my order for 10 books has not yet arrived.)  We are offering bulk sales of 20 books or more books to educational institutions at a 20% discount, and orders of 100 or more books to non-educational organizations at a 10% discount.  This offer is good until June 30, 2004 and may be extended.  Being a self-publisher, our shipping costs for fewer than 10 books would not save you any money.  The book is also printed overseas so shipping to Europe should be reasonable when ordered from EU-based online retailers.  One Radiance user ordered two books in London (I think) for $65.00 each, shipping included!  For the orders you place through me (actually my nascent consulting firm/publishing house called Space & Light) you can be confident that the 100% of the proceeds are going directly to the authors of the book.  I can accept payment by check or money order (via postal mail), or by Paypal.\n\nPlease direct inquiries for bulk book purchases of Rendering with Radiance, Revised Edition to: chasehrlich-rwr@yahoo.com.  Please include your street mailing address, delivery requirements, and payment preference.\n\nThank you for your patience and support,\n-Chas\nCharles Ehrlich\nSpace & Light\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20040510/5d934b9d/attachment.html\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Charles Ehrlich", "datetime": "Tue May 11 03:26:40 2004"}