{"refs": [], "id": "", "subject": "[Radiance-general] Odd values when using gensky and ambienaccuracy is zero...", "email": "p.g.lovell at st-andrews.ac.uk", "body": "Message-ID: <4DEF4B1B.60406@st-andrews.ac.uk>\n\nHi Everyone,\n\nPlease excuse me if this question has come up before (or if it's simply\na dumb question). I'm using mingw radiance with a matlab wrapper to make\nstereo stimuli for perceptual experiments. Up until now my illumination\nhas been made by specifying a hemifield of small lights. I'm beginning\nto prepare an experiment which will involve the creation of a larger\nnumber of images, hence I'm trying to speed up my rendering. One option\nseems to be to use gensky to specify a more natural illumination field,\nthis seems to halve my rendering times.\n\nHowever, I only get satisfactory reproduction of the shadows when I use\nlow values of ambient accuracy (not surprising). Shadows created with\nnon zero ambient accuracy seem to be interpolated to a certain extent.\nBecause my rendered images form a stereo pair, the differences between\nthe shadows become very noticeable as irregularities in the surface\ndepth, rather than as changes in brightness, this is a problem. I get\nmuch better rendering of the shadows when I  specify an 'aa' value of\nzero. But when I do this the reflectances seem to get messed up. The\nattached images include a series of monochrome tiles towards the bottom,\nthese are linearly spaced in reflectance from 0.2 to 0.8. However for\nthe gensky rendered image with aa set to 0 the darkest tile seems too\ndark. This jump in radiance disappears when I increase aa to 0.1, it\nalso disappears when I change to multiple spherical lights and leave aa\nat zero.\n\nSome example images:\n\nhttp://i1235.photobucket.com/albums/ff431/GeorgeLovell/RadianceProblems/SkyType_sphere200Lights_aa_000_ar_0256.png\n\n- Things seem fine, though the rendering takes 780 seconds\n\n\nhttp://i1235.photobucket.com/albums/ff431/GeorgeLovell/RadianceProblems/SkyType_gensky_aa_010_ar_0256.png\n\n- Rendering is quicker with gensky but with an aa value of .1 there\nare problems with the shadows.\n\n\nhttp://i1235.photobucket.com/albums/ff431/GeorgeLovell/RadianceProblems/SkyType_gensky_aa_000_ar_0256.png\n\n- Here the darkest tile along the bottom of the image is too dark.\n\n----\nFor reference: the leftmost and middle images form a cross-fuseable\nstereo pair, i.e. you cross your eyes when you look at them left eye\nlooks at the middle image and the right eye looks at the leftmost image\n(this can give you a headache!). The rightmost image can be viewed using\nred/green glasses.\n----\n\nDoes anyone have a clue why setting aa to zero seems to change the\nbrightness of the darkest tile?\n\nThanks,\n\nGeorge\n\n\n\n--\nDepartment of Psychology, University of St Andrews\n\nRM 1.05 (The white room).\nPhone      (01334) 462090\n\n\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "P George Lovell", "datetime": "Wed, 08 Jun 2011 11:12:43 +0100"}