{"refs": ["<BANLkTimYDcdBkFeLtttCjBSayb6bd4wSYg@mail.gmail.com>", "<E13D6120-8E8B-4144-98AC-A6E36CC3906C@lmi.net>", "<BANLkTinTUUQ=cf+ByRgMAaq=7AHOf7jrPg@mail.gmail.com>", "<BANLkTi=JkY-arNrzBK1zKL6KXhO_xzL9Tw@mail.gmail.com>", "<BANLkTikcm_Y00cot0ivUs6wVxVDcsTeuyw@mail.gmail.com>", "<4DFFB568.2050006@gmx.net>"], "id": "<BANLkTikO3n_AzJbChoeDEv1bqYfP-uLWWQ@mail.gmail.com>", "subject": "[Radiance-general] Use Python to execute Radiance command", "email": "hope.zh at gmail.com", "body": "\nHi, Lars, Thanks a lot for your advice!\n\nYes, Dr Janssen is guiding us in a research project in which we try to\nexamine the environmental performance (view, daylight, insolation, energy\nconsumption, etc) of various high density building forms.\n\nHoudini is used as a parametric modeling platform to create 3D models. But\nit's strong customizability allows us to define our own toolset to perform\nspecific types of simulation tasks. Basically, these tools 1) retrieve the\n3D model information and pass it to simulation software (e.g. Radiance,\nEnergyPlus), 2) activate simulation software and feed in the parameters\nrequired by the software, 3) retrieve the simulation results and bring the\ndate generated back to the 3D model for visualization and other analysis\npurpose. So, Python is like a \"glue\" in this process that connects\nparametric modeling software and simulation software, and Houdini is the\nplatform where we built tools and control panels to manipulate forms and\nsimulation processes. Radiance is used to simulate Sky View Factor, Daylight\nFactor, and facade insolation. We're still working on key performance\nindicators and benchmark values to be used to compare across cases, and\nthese indicators and benchmark values might be used to drive the design\noptimization process.\n\nActually, Patrick will demo this workflow in a workshop in the upcoming CAAD\nFuture 2011 conference next month:\nhttp://www.lucid.ulg.ac.be/conferences/caadfutures2011/Workshop3.html\n\nYes, Lars, I think you nurtured fans here in SDE, e.g. Daniel, who still\ntalks about your expertise in Radiance quite often. hehe.\n\n- Cheers, Ji\n\n\n\nOn Tue, Jun 21, 2011 at 5:02 AM, Lars O. Grobe <grobe at gmx.net> wrote:\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20110621/09ce3d54/attachment.html>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Use Python to execute Radiance command", "tags": [], "sender": "Ji Zhang", "datetime": "Tue, 21 Jun 2011 23:39:41 +0800"}