{"body": "\nOn Wednesday, September 24, 2003, at 09:55 AM, Alex Summerfield wrote:\n\nI am sure the folks here in Berkeley with me right now are all grinning\nin bemused enlightenment.  The -ad parameter has taken on a very clear\nmeaning to us now, following some excellent discussion and\npresentations by John Mardaljavec.  I'll have to look at those settings\nagain when I get home; maybe the -ad was pretty low.  However, I must\nsay, mkillum is a great tool and I believe that it should be used when\nappropriate, and this is certainly a good use for it (I'm actually\nusing far less light sources now, because of this technique; I'm\ngetting excellent results in far less time!)  I will certainly have a\nlook at the -ad in my earlier explorations of this scene regardless,\nI'm very curious to see if I can affect some positive change on the\nnon-illum version of the scene.\n\n\nLet's put it this way: I use rad to get started, but I tweak from\nthere.  The more I learn about the -d* and -a* settings of rpict, the\nmore I will  rely on manual tweaking. To be clear, I am not simply\nsetting rad and hoping for the best (well, actually that's true, and\nthen when the best does not happen, I start adding render= lines!).\nrad, like mkillum, are both excellent tools that work too well to be\nignored, at least for this novice user.  I agree, the \"under the hood\"\naspects of rtrace need to be understood, but I still like to use rad to\nat least steer me to a ballpark setting.  This art gallery exploration\nhas been useful for me to learn both mkillum and the -a* parameters.\nThe more of these that happen, I'm sure the more I will understand, and\nthus, the less I will rely on rad.  But I honestly don't think I will\never totally abandon it, at least for general stuff.\n\nThe fact that you have taken the time to follow-up with me is\nindicative of the extremely generous nature of the majority of this\nlist membership, and all week here at the Workshop that same spirit --\nthat same bubbling enthusiasm -- has been flowing through buildings 90\nand 70A at LBNL.  I wish you could be here!\n\nRob Guglielmetti\nrpg@rumblestrip.org\nwww.rumblestrip.org\n\n\n", "replyTo": "Subject: [Radiance-general] Poser to Radiance", "sender": "Rob Guglielmetti", "isquestion": false, "tags": [], "id": "<2D65FD8A-EF1F-11D7-8877-000393824274@rumblestrip.org>", "refs": [], "datetime": "Wed, 24 Sep 2003 23:12:01 -0700", "email": "radiance-general@radiance-online.org", "subject": "[Radiance-general] Poser to Radiance"}