{"body": "\nHi again,\n\nI'm still thinking about the data provide by ICC files. Somehow I think\nit should be possible to calculate the top of the luminance range for\nthe target output device (-u option of normtiff), given a set of\nphotometric measurements which I believe an ICC profile provides. I\ntried to figure out _what_ precisely is measured in the \"SpectroScan\"\nsection of the ICC file (attached), but even the support team of Epson\ncould not answer that question. Maybe one of you does?\n\nAlso I wonder how to calculate the 'dynamic range for the target output\ndevice ' (-d option of normtiff) This is said to be 32 for CRT monitors\nin the manpage. I have no clue how to obatin this value for other output\ndevices.\n\nThe only option I know for sure in normtiff is the gamma option, which\nit adjustable for Epson printers (1.5, 1.8, 2.0, 2.2 ).\n\nToday I spent some time reading High Dynamic Range Imaging. Although\nmost of the math is just magic for me, I understand the issue. I wonder\nhowever how much this issue is known by photo-labs and printing\nservices. I wonder also how much of this knowledge is implemented in\ncontemporary printing-technology. I don't know, if one of you does,\nplease tell me. The funny thing is that operators say \"O wow,\n32bit/channel images, great, no problem!\" But in fact they convert the\nfile to the printer's actual output, which  is 8 bit/channel. This is a\nkind of a communication problem, which I believe has to be solved at my\nside. I really like to be able to provide the photo-lab 'just' a\nstandard  8bit/channel image. I understand such an image can not look as\nperfect in print as it does in RGB monitor color space. But can we come\nclose to 'perfect' using proper calculations?\n\n-Iebele\n\niebele schreef:\n\n\n\n", "replyTo": "Subject: [Radiance-general] ICC profiles", "sender": "iebele", "isquestion": false, "tags": [], "id": "<483F0661.9000609@iebele.nl>", "refs": ["<K1H253$A4824B574161CF4732646C7EE63E394D@libero.it>\t<C291F5E8-D316-4476-90E8-4EB2ED8C88DA@lmi.net>", "<483DDC95.9040707@iebele.nl>"], "datetime": "Thu May 29 12:39:21 2008", "email": "info at iebele.nl", "subject": "[Radiance-general] ICC profiles"}