{"body": "\nI don't know what was Lars looking for, but what I was looking for was something like ximage do, but controlled by a script. I mean, as ximage is able to comunicate a value starting from mouse position and then by x,y coordinates, is it possible to do the same thing giving a numeric input instead of a mouse one (and getting a numeric output as well?\n\n\nAt the time I 'needed' it I skipped the problem with rtrace as suggested, but I am still curious to know if there was a simpler solution (as the one described above)\n\nThank you for interesting replies anyway.\n\n\nLucio\n\n\n.Just adding my two cents to this...\n.\n.The pfilt option (1) Jack suggests is a good one, and may be combined\n.with the others as well.  The pcompos option (2) is a little more\n.risky, as this program ignores/removes whatever exposure changes were\n.made to the picture, so if it isn't straight out of rpict, you may\n.get different values than you expect.  The scripting option (3) is\n.very well-done, but I don't think you need to include the rayinit.cal\n.file on the command line, as Jack has transcribed and modified the\n.relevant functions into the -e arguments.\n.\n.One other comment is if you only want a few pixels out of an image,\n.vwrays connected to rtrace is much simpler and faster.  Rather than\n.generating a whole picture, just use:\n.\n.vwrays -i -vf view.vf -x ${xres} -y ${yres} | rtrace [options] octree\n.\n.Then, on the input to vwrays, type (or redirect) the desired x and y\n.pixel coordinates; vwrays will produce the corresponding ray sample,\n.which rtrace will compute for you.\n.\n.Finally, no one mentioned that ximage (and Photosphere and others)\n.can query individual values interactively.  I don't know if this will\n.work in your application.\n.\n.Cheers,\n.-Greg\n.\n.> From: Jack de Valpine <jedev@visarc.com>\n.> Date: May 29, 2008 7:25:58 AM PDT\n.>\n.> Hi Lars and Lucio,\n.>\n.> I can think of three possible ways to do this.\n.>\n.> 1) pfilt\n.> You can use pfilt to reduce the size of the image to something more\n.> manageable. I am not sure (this means see what others weigh in on\n.> this) but I think for some applications this may actually result in\n.> better overall values in the image as surrounding pixels are being\n.> averaged together by the reduction.\n.> 2) pcompos\n.> You can use pcompos to crop out an area of interest. You will have\n.> to read the man page carefully to figure this out but it is\n.> certainly doable.\n.> 3) script\n.> You can either write a script (perl for example) that will read the\n.> stdout from pvalue and only write values within a given XY pixel\n.> range or you can use radiance arcana as such:\n.> pvalue -h -H  +d <name_of_image.pic> | rcalc -f <path_to_lib/\n.> rayinit.cal> -e 'boundp(a, x, b) = if(a-x, 0, if(x-b, 0, 1));\n.> xyboundp(xa, x, xb, ya, y, yb) = and(boundp(xa, x, xb), boundp(ya,\n.> y, yb)); cond  = xyboundp( <xstart>, $1, <xend>, <ystart>, $2,\n.> <yend>); $1 = $1; $2 = $2; $3 = $3; $4 = $4; $5 = $5;'\n.>\n.> This should work presuming I transcribed into my mail client\n.> correctly....\n.>\n.> where you need to input:\n.> <name_of_image.pic>\n.> <path_to_lib/rayinit.cal>\n.> <xstart>\n.> <xend>\n.> <ystart>\n.> <yend>\n.> I hope this helps.\n.>\n.> Best,\n.>\n.> -Jack de Valpine\n.>\n.> Lars O. Grobe wrote:\n.>>\n.>> Hi list, I wonder if noone else came to this problem, or if I just\n.>> do not see the answer to a rather simple problem. Radiance comes\n.>> with pvalue to extract pixel values of images. This is fine, as\n.>> long as images are small - just redirect to a file, and the values\n.>> can be read according to the coordinates written at the beginning\n.>> of the lines. Now, for large images, this becomes a pain. E.g. if\n.>> I want to get the values of 64pixels, with known coordinates, I\n.>> cannot read out these with pvalue, but first must transform the\n.>> complete image to a pvalue formatted text file. These files can\n.>> become hundreds of MB in size with higher resolutions. Is there an\n.>> easier and more efficient way to go? E.g. cropping the image first\n.>> to the pixels wanted? I guess the only way to do so is pcomb,\n.>> right? Lars.\n.\n._______________________________________________\n.Radiance-general mailing list\n.Radiance-general@radiance-online.org\n.http://www.radiance-online.org/mailman/listinfo/radiance-general\n.\n\n.. Caminante no hay\ncamino, solo se hace\ncamino al andar ..\n\n\n---   o\nmeglio   ---\n\n.. Caminante el\ndestino no es al\nfinal de el viaje,\npero en todo el\nandar ..\n\n\n", "replyTo": "", "sender": "loscotec@libero.it", "isquestion": true, "tags": [], "id": "<K1MXV1$A8EF7FB1ED64552468FE8A6118DC0F07@libero.it>", "refs": [], "datetime": "Thu May 29 08:04:21 2008", "email": "loscotec at libero.it", "subject": "[Radiance-general] getting pixel value at x,y"}