{"refs": ["<4EA0D174.7030308@gmail.com> <4EA13229.40309@gmx.net>", "<4EA42F5B.9050400@gmail.com>"], "id": "<28285BAEA8C0814DBF1B199C876EC5B04E217F243F@AMXEXC01.global.arup.com>", "subject": "[Radiance-general] accounting for irradiance due to ultraviolin rtrace", "email": "Christopher.Rush at arup.com", "body": "\nAn example might be to use a typical sky definition (e.g. using gensky or gendaylit commands), and perform all of your calculations as if you were doing standard lighting calcs. You would get output in values related to lumens (in other words, human-response-corrected visible Watts of spectral radiation). And looking into the units, lux is synonymous with lumens/m2. If you calculate 100 lumens per meter square (lux) at a point using the standard methods, and you know your light source (for example daylight under those particular sky conditions) emits X Watts in the 120-400nm range for every lumen, then your UV component would be 100X Watts of UV.\n\nYou would not multiply your material definition by 4, but typically material reflectance is given for the visible or full solar range. You would have to know (or assume) the properties for UV. For example, a piece of glass with a PVB interlayer might have a 50% transmission in the visible range, but less than 1% transmission in the UV range. Not all materials might have that much variation between visible and UV properties, but you have to be sure that the material properties you use apply to the UV spectrum.\n\nAlso consider subtleties of the light source. Different levels of cloud cover probably affect the proportion of UV in the resulting radiation at the earth's surface. Electric light sources might be easier to deal with by converting units.\n\n@Chris: do you mean I should scale my source and material definition by 4?\n\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20111024/9d8d48b8/attachment.html>\n\n", "isquestion": false, "replyTo": "<4EA42F5B.9050400@gmail.com>", "tags": [], "sender": "Christopher Rush", "datetime": "Mon, 24 Oct 2011 10:17:32 -0400"}