{"refs": ["<92FF15F8-64E4-4F4A-A5CB-A15598FE6963@dmu.ac.uk>"], "id": "<CAAd_PgQ6Cz8jQR-C=Ggjo=RGOh=xKFPop6UEoZr=5SLPVBGcwg@mail.gmail.com>", "subject": "[Radiance-general] Daylighting metric for outdoor spaces", "email": "sadeghipour at gmail.com", "body": "\nHi John, Michael, et al.\n\nMichael,\n\nSorry if it wasn't clear enough. I think you get the concept. Yes! I wonder\nif there is a number to determine the outdoor illuminance to provide enough\nilluminance level inside. What you are saying is true and the effective\nparameters are much more than only VLT and ceiling reflectance but if I\nwant to consider all of them I should modify the geometry and run the\nlighting simulation.\n\nThe way I did the ray-tracing in my mind was the simplest possible backward\nray-tracing. I started from the sensor inside, then traced only one ray\nupward and bounced it from the ceiling to the glazing. So illuminance level\ninside the space is equal to illuminance level outside the glazing (on the\nenvelope of the building that I can simulate) multiply by VLT of the\nglazing multiply by the reflectance of the ceiling. In this way I can make\na target for the illuminance level on the envelopes rather than indoor.\n\nThe question could be more general though and thinking about the relation\nbetween outdoor illuminance level and then the external envelopes.\n\nJohn,\n\nThank you for the great link! This is exactly what I'm talking about. I\nactually ran the accumulative annual study. That's true that cumulative\nresult shows you get less illuminace in more dense areas but what are the\ncutting levels? Do we have the concept of over-daylit for outdoors?\n\nFor example if I calculate the availability of useful daylight illuminance\nbased on 100 lux and 2500 lux for working hours and calculate the result\nbased on the percentage of hours a large portion of the well-daylit outdoor\nspaces will be considered as over-daylit because they receive more than\n2500 lux, and then the more dark outdoor spaces located in Seattle or\nLondon (hi Rob!) will be assumed as well-daylit since they will be in the\nrange. We already knew this is not true and the spaces next to an outdoor\nspace with 150 lux horizontal illuminance level cannot be well-daylit.\n\nMaybe we can say there should be no upper-limit for outdoor illuminace\nlevel since we can always mitigate the light level by building envelope\ndesign, but what is the lower limit then?\n\nBest,\nMostapha\n\nPS.1: I liked the concept of \"warm shade\" so much. So interesting to think\nabout.... Can you send me a link to the paper or any other resources?\n\n\nOn Wed, Nov 30, 2011 at 10:26 AM, John Mardaljevic <jm at dmu.ac.uk> wrote:\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20111130/923cce73/attachment.html>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Daylighting metric for outdoor spaces", "tags": [], "sender": "Mostapha Sadeghipour", "datetime": "Wed, 30 Nov 2011 11:31:42 -0600"}