{"refs": ["<92FF15F8-64E4-4F4A-A5CB-A15598FE6963@dmu.ac.uk>", "<CAAd_PgQ6Cz8jQR-C=Ggjo=RGOh=xKFPop6UEoZr=5SLPVBGcwg@mail.gmail.com>"], "id": "<1C4D1763-AA73-4FEC-B985-4309B0C6407B@lbl.gov>", "subject": "[Radiance-general] Daylighting metric for outdoor spaces", "email": "amcneil at lbl.gov", "body": "\nHi Mostapha,\n\nBRE has a metric - Vertical Skylight Component - for what you describe.  It is intended as a planning tool to insure that housing blocks are not located to close together.  It is also used in rights to light litigation in the UK.  It's independent of climate though, it's mainly to ensure that an appropriate percentage of daylight is made available at the window (i.e. not too many tall buildings nearby).  I'm not saying it's a great metric, but it's commonly used for what you want to do.\n\nVSC is commonly coupled with the hours of sunshine in a courtyard metric you mentioned in an earlier email.  I just want to point out that this is not a daylight metric but a planning tool to ensure that courtyards are not more damp and dank than an open park in the same climate.  For example, if you have a week of damp overcast weather both your open space and your courtyard will be damp, but then when you have a day of sunshine your park will dry up, but your courtyard may not if there isn't sufficient sun penetration.  A courtyard that stays damp gets even worse in the next week of wet weather.  The metric is intended to prevent mold, mildew and perpetually damp courtyards.  So in reality this metric is more applicable to climates like London and Seattle than Phoenix or Dubai.\n\nAndy\n\n\n\nOn Nov 30, 2011, at 9:31 AM, Mostapha Sadeghipour wrote:\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20111130/f88d608f/attachment-0001.html>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Daylighting metric for outdoor spaces", "tags": [], "sender": "Andy McNeil", "datetime": "Wed, 30 Nov 2011 10:18:54 -0800"}