{"refs": ["<CAAZQWqiyEhg5zqj3v-7GJJwOKRHbVxMYeO+DPSWFMof8S_CLSw@mail.gmail.com>"], "id": "<CAAZQWqivN9cx+nLmXGNAX47BWvQAdF9boYfKtB+3BzMhpSDpGQ@mail.gmail.com>", "subject": "[Radiance-general] mkillum -ab 0 question", "email": "aricanis at gmail.com", "body": "\nHi,\n\n\nI'm running some daylight calculations and experimenting with mkillum.\nI'm interested which light components does mkillum takes into account as\ninput.\n\nI've found in RWR book on page 380 nice diagrams, but no info what is taken\ninto account when -ab 0 is used.\n\nWhat I've understood by now:\nmkillum -ab any_value:\nl- option in geometry file - direct light from light sources (eg. sun) is\nskipped from mkillum calculation and used later in rtrace/rpict directly.\nOutput geometry is made of 'illum' material\nl+ option in geometry file - direct light from light sources is taken as\ninput and included in output light distribution. Output geometry is made of\n'light' material\n\nmkillum -ab 0:\n*-which sky/sun/reflected components are taken as input for mkillum?*\n\nmkillum -ab 1:\n-direct light from sky is included\n-indirect solar component (once reflected from ground or some other object)\n\nmkillum -av 0 0 0:\n-what does this give us (I know that -av should be 'ground ambient level'\nfrom gensky?\n\n####\nTo explain why do I need such strange mkillum parameters\n\nMy idea is to get light patch, coming from the sun and reflected from\nspecular deflector surface into the room, but to exclude all other\ninfluences  - direct light coming from sky or sun, or reflected light from\noutside/inside surfaces.\nI modeled deflector as mirror with alternative metal material with\nappropriate reflectance/specularity.\n\n*I want to get completely black image with reflected light patch only, so I\ncan sum images from various time moments during day/year and show light\npatch moving for some period of time.*\n\nTo get image with specularly reflected light only:\n1. I defined sky with sun only (no diffuse sky or ground sources)\n2. Calculated mkillum -ab 0 -av 0 0 0 (l+ option) for my deflector surface\n3. Used mkillum output in new octree as only light source (removed sun\ndefinition)\n4. Calculated image with rpict -ab 0 -av 0 0 0\nProblem is that beside direct light patch inside  the test room, I still\nget some light on surfaces above/below my deflector surface.\n\nEven when I repeat calculation for sun behind my surface (so no direct\nlight on surface), my output from mkillum has some small radiance, and I\nget some luminance on surfaces below/above deflector.\n\nAny ideas are welcome?\n\nI hope I managed to explain what I want, and which method I try to use to\nget results (unsuccessfully for now :( )\n\nThanks in advance,\nMarija\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20111214/068b13d8/attachment.html>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] mkillum -ab 0 questi", "tags": [], "sender": "Marija Velickovic", "datetime": "Wed, 14 Dec 2011 14:39:31 +0100"}