{"refs": [], "id": "<9B624A5B54E1F848B4177AECC079C858379E1B@SG-EXCHMB1.smithgroup.com>", "subject": "[Radiance-general] calculating number of daylight hours", "email": "Chris.Coulter at smithgroupjjr.com", "body": "\nHappy holidays list!\n\nI am trying to calculate the number of daylight-hours falling on a surface from a series of images in a batch file. I have an image created using -ab 0 and want to convert it into an image that shows a value of 1 for areas receiving direct sun or value of 0 for areas that do not.\nI feel like pvalue is what I need to do this. I am following this thread with limited success (http://www.radiance-online.org/pipermail/radiance-general/2009-January/005723.html). When I try to modify for my task, I am having trouble getting the desired result.\n\npvalue -d -h -H input.pic | rcalc -e '$1=if(179*$1-100,1,0)'  gives an expected result of either a 0 or 1 depending on if the value is above or below the desired threshold.\nIf I then pipe the result back into pvalue I get a \"pvalue: read error\" and no image:\npvalue -d -h -H input.pic | rcalc -e '$1=if(179*$1-100,1,0)'  | pvalue -r -H -h -d -y 693 +x 1200 > output.pic\nDo I need to format the input values differently?\n\nI was also able to somewhat successfully use pcomb to strip the original image into a black and white image using the same \"if\" condition on lo=, but there was no value associated with the pixels.\nUltimately, I would like to take a series of images and pcomb them in order to make a falsecolor display of sunlight hours in a space/on a surface. I realize it may be easier to calculate with rtrace and then display my results that way, but this was my first thought.\n\nThanks in advance for any assistance. I'm open to any suggestions you might have.\n\nChris\nChris M. Coulter, LC, IES, LEED AP BD+C\nAssociate\nLighting Designer\n.........................................................................................................\nSmithGroupJJR\n500 Griswold, Suite 1700\nDetroit, MI 48226\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20111228/e69d5146/attachment.html>\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Chris Coulter", "datetime": "Wed, 28 Dec 2011 12:35:24 -0500"}