{"refs": [], "id": "<3CBF1439-B896-11D8-A48D-000A95BB392A@lmi.net>", "subject": "[Radiance-general] Radiance workshop call for participation", "email": "gward at lmi.net", "body": "\nCALL FOR PARTICIPATION -- THIRD ANNUAL RADIANCE WORKSHOP\n\nWhat: Scientific Applications Using RADIANCE\n\nWhere: University of Applied Sciences of Fribourg, Switzerland\n(www.eif.ch)\n\nWhen: October 11th & 12th (Monday & Tuesday) 2004\n\nOrganizers: Raphael Compagnon and Greg Ward\n\nRegistration:\tCHF 205 for speakers (approx. 1.5 CHF per Euro)\nCHF 270 for attendees\nCHF 105 for students\n\nFee includes: Coffee breaks, lunch both days, a dinner on Monday\nevening, and a workshop CD-ROM\n\nHotel:\tRooms of various categories have been pre-booked for\nparticipants at rates specified on the hotel registration form\n\nDownload registration forms from the workshop's web page:\nhttp://www.eif.ch/~compag/rw2004/\n\nDeadline for registration:\tAugust 31, 2004\nAs early registrations greatly help us in organising the workshop, we\nrecommend\nthat participants send their registration forms as soon as possible.\nDuring the workshop\nwe will make a prize drawing for 2 participants among those who have\nregistered before\nJuly 15. The 2 winners will get a 50% cash refund on their registration\nfee!\n\nPurpose:\nTo provide researchers with an opportunity to present their work with\nRadiance, and to share ideas and solutions with other attendees.\nParticipants are invited to give a talk, which will be limited to 30\nminutes (~20 minute for the talk followed by ~10 minutes of open\ndiscussion).\nNo printed proceedings will be produced, but a CD-ROM will be\ndistributed to attendees that will include electronic materials\nsubmitted by the speakers and edited by the organizers.\n\nAt this workshop, we will introduce a special Problem Solving session\non the second day, where users may present their difficulties and seek\nadvice and suggestions, possibly working through solutions in a\ncollaborative \"brain-storming\" with Greg, Raphael, and other attendant\nexperts.  In addition, Georg Mischler and Andreas Lahme have been\ninvited to give a half-day tutorial on Rayfront, and will demonstrate\ntheir new Radiance web rendering service.  Depending on the number of\ntalks we end up scheduling, we may or may not conduct the problem\nsolving session and Rayfront tutorial in parallel. Either way, everyone\nshould get a chance to ask questions, and ample opportunities to help\nothers with their problems as well.\n\nA list of planned speakers and preliminary titles is given below. The\nlist will be regularly updated on the workshop's web page.\n\no Using image based lighting to assess glare under different conditions\nby capturing the whole dynamic range of daylight, by Santiago L. Torres\no Comparison and Analysis of quantitative and qualitative data on\nluminous ambiances in interior spaces using Radiance, by Ljubica Mudri\no Calculation of luminaires using Radiance, by Krzysztof Wandachowicz\no Using Radiance to verify and inform some interesting simplified\ndaylighting and solar radiation models, by Darren Robinson\no Comparison of daylighting results obtained under the Belgian\nartificial sky and with several daylighting software, by Magali Bodart\no Some experiments with irradiation modelling using cumulative skies,\nby Darren Robinson\no Using Radiance for Right-To-Light and Solar Access Studies, by Andrew\nMarsh\no 3D Lighting: Integrated software modelling and simulation package\nusing 3Dsolar and Rayfront with Radiance, by Andreas Lahme\no Material measurement & modelling, by Peter Apian-Bennewitz\no Blender based Radiance GUI, by Francesco Anselmo\no iPPF: a Radiance based online tool for solar and daylight access\nstudies in urban areas, by Raphael Compagnon\no Rayfront Tutorial, taught by Georg Mischler & Andreas Lahme\no Radiance problem-solving session, moderated by Greg Ward\n\nThe names and titles above are not final, and we may get new speakers\nand lose some people before we can provide a proper workshop agenda in\nSeptember.\n\nBy August 31 2004, we will also need the final titles and abstracts for\nall the talks, along with any materials the speakers wish to include on\nthe workshop CD-ROM. At minimum, we would like to get a copy of each\nspeaker's presentation in PowerPoint, PDF, or HTML (preferred) format,\nand a short bio with contact information. If the speaker also has test\nscenes, images, and/or software they would like to share, these would\nbe most welcome. We need to get all of these materials in order to have\nsufficient time to assemble them into a usable CD-ROM, so we cannot\npromise to include anything submitted after the August 31 deadline.\n\nWe look forward to meeting you at the workshop!\n\nGreg Ward and Raphael Compagnon\n\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Greg Ward", "datetime": "Mon Jun  7 17:21:08 2004"}