{"body": "\nHello Greg and Rob,\n&nbsp;\nThank you both for a quick response.\n&nbsp;\nRob Hitchcock's claims 10% error in his paper&nbsp;about DELight2 (DELIGHT2 DAYLIGHTING ANALYSIS IN ENERGY PLUS: INTEGRATION AND PRELIMINARY USER RESULTS).\n&nbsp;\nHitchcock stated that:\n\"Delight participated in validation exercise specifically focused on the ability to simulate\nCFS performance, as characterized by measured BTDFs (Maamari, et al., 2005). The comparisons were based on measurements and corresponding simulations in a simple-geometry test box for combinations of CFS BTDFs and measured skies. The DElight2 results for a particular combination of a CIE overcast sky and a measured BTDF representing Serraglaze were shown.\"\n&nbsp;\nThis is all they mentioned about a sky model and the error. We used TMY 3 weather file downloaded from the Energy Plus website and did not add anything specifically related to the sky model in our input.\n&nbsp;\nI wonder if this information from Hitchcock's paper&nbsp;warranties accuracy of the results.\n&nbsp;\nWe have not done experimental testing of our system and can rely only on the computer simulations at this moment....so we want to make sure we are on the right track when selecting a software for lighting simulations.\n&nbsp;\nThank you very much.\n&nbsp;\nSvetlana\n&nbsp;\n\n--- On Thu, 6/5/08, Greg Ward &lt;gregoryjward@gmail.com&gt; wrote:\n\n\nHello Svetlana,\n\nNaturally, asking on the Radiance mailing list, you're going to hear\npeople say Radiance is the most accurate.  In your case, I would say\nthe 10% error is going to be overshadowed (no pun intended) by the\nvariability of daylight.  Specifically, it is very important to\nconsider the weather data used as your basis in determining exterior\ndaylight conditions.  Even getting within 10% of measured\nilluminances requires the use of measured sky distributions, which\nare almost never available.  So, I'd say this accuracy is based on\nthe assumption that your sky matches the standard CIE model, which of\ncourse it won't if it's a real sky.  Radiance would fare no better.\n\nAnnual simulation requires quick calculations, which is not really\nRadiance's strength.  I know that Rob Hitchcock (the author of\nDElight) has put a lot of energy into his fenestration calculations,\nso if you aren't getting the output you expect, I'd take a closer\nlook at the input as a first step.\n\nCheers,\n-Greg\n\n&gt; From: Svetlana Olbina &lt;svetlanaolbina@yahoo.com&gt;\n&gt; Date: June 5, 2008 10:34:35 AM PDT\n&gt; Hello, All,\n&gt;\n&gt; We are doing research on blinds that we call ?split controlled\n&gt; blinds?.\n&gt;\n&gt; Basically, we divided a window in three sections in a vertical\n&gt; direction.\n&gt;\n&gt; In each window section we use the same type of the blinds but the\n&gt; slats have different tilt angles in each section (for example, 0\n&gt; degrees in the upper part (completely open) , 15 degrees in the\n&gt; middle part and then 90 degrees in the lower part (completely closed).\n&gt;\n&gt; We plan to do both energy and lighting simulations for these\n&gt; blinds. For the energy simulations we use Energy Plus.\n&gt;\n&gt; Energy Plus also performs lighting simulations.  I wanted to ask\n&gt; for your opinion about accuracy/validation of Energy Plus when it\n&gt; comes to lighting simulation.\n&gt;\n&gt; I have read that Energy Plus has integrated DElight software\n&gt; (radiosity based lighting simulation software) and that\n&gt; measurements are within 10% error? Is this margin of error acceptable?\n&gt;\n&gt; Our building is very simple (10?x15? in the plan), and it has a\n&gt; 6'X6' window on a 10' X 11' wall. We expected sufficient\n&gt; levels of illuminance  for this room but we got low illuminance\n&gt; value of 270 lux at the workplane close to the window.\n&gt;\n&gt; I am concerned is that either Energy Plus is not accurate enough or\n&gt; we have some error in our input.\n&gt;\n&gt; How would you compare Radiance and Energy Plus (or DElight) when it\n&gt; comes to simulation of blinds?\n&gt;\n&gt; We are new to Radiance and work already in Energy Plus, so we want\n&gt; to see if we can use Energy Plus for lighting simulation instead of\n&gt; Radiance.\n&gt;\n&gt; Or Radiance is still the most accurate tool for lighting simulations?\n&gt;\n&gt; Thank you.\n&gt;\n&gt; Svetlana\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20080605/0bb6a35d/attachment.html\n", "replyTo": "<42B24A5B-4F2E-4349-8DEE-0D666CF5B8B0@lmi.net>", "sender": "Greg Ward &lt;gregoryjward@gmail.com&gt", "isquestion": false, "tags": [], "id": "<790788.49708.qm@web35106.mail.mud.yahoo.com>", "refs": [], "datetime": "Thursday, June 5, 2008, 2:11 PM", "email": "Greg Ward &lt;gregoryjward@gmail.com&gt;", "subject": "Re: [Radiance-general] lighting simulation of blinds in Energy Plus vs. RadianceTo: svetlanaolbina@yahoo.com, \"Radiance general discussion\" &lt;radiance-general@radiance-online.org&gt;"}