{"refs": [], "id": "<DC0CAEEA090E984C911D3B85B16C3F90FAF5C6@l-gnts05>", "subject": "Re: [Radiance-general] Fwd: errors from hdrgen", "email": "adiance-general-bounces@radiance-online.org", "body": "\njust a quick extra question about HDR and light sources:\n\nsupposing that with a camera we have got some images,\n\n1 we calculate the HDR image\n2 we measure on the mac screen the luminance with ximage\n3 we measure the luminance in the real scene.\n4 we compare the numbers and find a factor ( k=lum(hdr):lum(real) ).\n\n\nis this factor independent from the spectrum of the light source once that\nthe camera is 'calibrated' or it is related to it?\nlike in the case of: sun, low pressure sodium, MH, mercury lamps, theatre\nblue filtered light....\nis the correction factor (k) constant for these different conditions?\nif not is there a best calibration environment (D65 or something else)?\n\nmany thanks,\ngiulio\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org]On Behalf Of Axel\nJacobs\nSent: 10 June 2004 15:26\nTo: Radiance general discussion\n\nMartin Matusiak wrote:\n\nIgnore this one, this is a debug message and only means that things are\nnot running as smoothly as they could.\n\nThat is more of a problem. Essentially, the dynamic range of the images\nhas gaps between them or is clipped on either side of the range. Try:\n\n- Taking images at smaller f-stop intervals\n- remove images that are too bright or too dark\n- include darker or lighter images.\n\nWe keep having this problem with webhdr, but here doesn't seem to be a\nrule of thumb for getting it right. If the worst comes to the worst, you\ncan disable hdrgen's built-in auto exposure routine and do a hand-jobby,\nbut this is more difficult.\nhttps://luminance.londonmet.ac.uk/webhdr/\n\nYou should also save the coefficients from a run that doesn't create any\nerrors/warning and re-use them when you do get them. Please note that\nthe response curve is/can be different even between two cameras of the\nsame model/make, so don't mix-n-match them.\n\nAxel\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n___________________________________________________________________\nElectronic mail messages entering and leaving Arup business\nsystems are scanned for acceptability of content and viruses.\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "adiance-general-bounces@radiance-online.or", "datetime": "Thu Jun 10 16:42:32 2004"}