{"refs": [], "id": "<DC0CAEEA090E984C911D3B85B16C3F90FAF5C7@l-gnts05>", "subject": "Re: [Radiance-general] Fwd: errors from hdrgen", "email": "adiance-general-bounces@radiance-online.org", "body": "\nMy question arises from some experiments measuring the same paper surface\nunder different light conditions:\n\nUnfortunately it appears that if the source has a really narrow spectrum\nthis affects the results within a 40% with my camera (which I cannot give\nthe name... 001DNOKIN ;-) ).\n\nI am stressing the methodology to see if it is reliable enough to substitute\nluminance readings for a wide range of conditions with consumer digital\ncameras (street lighting - interior lighting - day lighting ).\nI really underline the concept of 'wide use' (wide = cheap ;-) ).\n\nWith this sort of equipment I would like to achieve an error within +-10%\nand therefore a correction factor quite constant (within +-10%); is it\nfeasible?\n\n\nI found a very interesting product where the question is somehow explained:\nhttp://www.technoteam.de/pdf/lmkrollei_e.pdf\n\n\n\"\nMeasuring variations1\nhalogen, D65,...<5%\nfluorescent lamp, MHN-T,...<10%\n1 Due to spectral distributions deviating from CIE standard illuminant A\nwithin the scene.\n\"\n\nand also\n\n\"\nUnder certain circumstances, spectral distributions\ndeviating from the CIE standard illuminant A may\ncause bad measuring errors.The value displayed can be corrected by applying\nan additional factor (Colour Correction Factor, ccf) during recalibration\nin the software. The calculation of the ccf value requires to know the\nspectral distributions within the measuring scene or also to use a mean\ncorrection factor...\n\n...In addition, the user will also be provided with the relative spectral\nsensitivity\nof the single colour channels and the resulting relative spectral\nsensitivity of standard matrix formation. Thus, he\nwill be able to calculate other ccf values or also other weighting factors.\n\"\n\nThis suggest to me, I am guessing, that calibration is really important,\nthat must be performed under very strict and controlled conditions and that\nall the measurement should be within a reasonable range of conditions\nsimilar to the calibration environment( if I calibrate with D65 I cannot\nexpect to measure accurately LPS or HPS, isn't it?).\n\nDo you have any field experience about this?\n\nthanks a lot,\ngiulio\n\nPS - sorry for this long and labyrinth style email!\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org]On Behalf Of Greg\nWard\nSent: 10 June 2004 16:23\nTo: Radiance general discussion\n\nHi Martin,\n\nTo get a reasonable fit to a particular camera, Photosphere (or hdrgen)\nneeds more than just a few exposures.  I find that it likes at least 7\nexposures, better 9,  of a wide dynamic-range scene.  Each exposure\nshould be separated by an f-stop or so by varying the shutter speed\nonly.  This is explained in the Photosphere quickstart_pf.txt file,\nwhich I have quoted on this list recently.  (See my response to Barbara\nMatusiak on May 28 under the subject \"conversion of digital pictures to\nRadiance?\")  Once you have established the response function for a\nparticular camera, you can then reuse it for a shorter exposure\nsequence, or even a single image (though you should not expect a high\ndynamic-range result in that case).  This storage and reuse is\naccomplished with hdrgen's -r option, or via the preferences file in\nPhotosphere.\n\nIf the algorithm cannot arrive at a reasonable response function for\nyour camera, Photosphere offers the option of applying a generic\nresponse function, instead.  Although I don't recommend this if your\ngoal is accuracy, the following response file will permit hdrgen a\nsimilar fall-back using the -r option:\n\n2 1 0 0\n2 1 0 0\n2 1 0 0\n\nThis simply assigns each channel the polynomial f(x) = x^2, which\nroughly corresponds to a standard gamma curve.  It's really a crude\napproximation, but since you are taking overlapping exposures, the\nglobal errors in the mid-exposure region are reasonably small.\n\nBy the way, I managed to convert both your sequences without complaints\nin Photosphere, though the three-image sequence is a bit blurry.\nObviously, the alignment algorithm didn't quite work on this one.\nUnfortunately, it doesn't know when it's failed, so no errors or\nwarnings are issued in most cases.\n\n-Greg\n\nP.S.  In response to Pillo's inquiry, the luminance reported by ximage\nshould correspond roughly to the luminance you would measure with a\nphotometer, accounting for the photopic response of the probe's filter.\nHowever, you are definitely better off measuring something as close to\nwhite as possible, and preferably not a light source -- something more\nin the middle of the exposure range, like a grey card.  The latest\nversion of Photosphere even includes a calibration option to make this\nwork easier.\n\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n___________________________________________________________________\nElectronic mail messages entering and leaving Arup business\nsystems are scanned for acceptability of content and viruses.\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "adiance-general-bounces@radiance-online.or", "datetime": "Thu Jun 10 18:06:19 2004"}