{"refs": ["<200406101420.10983.alex@juventuz.net>", "<1DC88052-BAF2-11D8-89E2-000A95BB392A@lmi.net>"], "id": "<200406111113.43395.alex@juventuz.net>", "subject": "[Radiance-general] Fwd: errors from hdrgen", "email": "alex at juventuz.net", "body": "\nAh yes, I had been meaning to try the camera calibration technique but I\nhadn't come around to it. It turns out to be very useful. But I still have\nsome issues. I took in all 13 pictures of an indoor scene looking out the\nwindow for the calibration. I then had to remove the darkest and the lightest\nof them to get a hdr image. That leaves about 8 images and I get a hdr image\nbut there are errors in the conversion process.\n\nThe resulting hdr does not look very good, first of all the alignment\nalgorithm always distorts it like crazy. The images were taken with a tripod\nso they should be reasonably well aligned but the algorithm moves them all\nover the place. So I disable that. I tried setting -g to kill the ghosts but\nthat totally messed up the color balance of the image.\n\nIf I only turn off the alignment algorithm, the image still looks very\ngreen/brown however. I take it this isn't supposed to happen? I toggle the\nexposure adjustment but it makes no difference.\n\nPardon my ignorance, but is the hdr image supposed to look a lot like the\noriginal? Is it a bad sign when the color balance is all wrong?\n\nThe images I took are enclosed. They were taken sequentially from lowest to\nhighest exposure, -2 to 2 in 1/3 steps. White balance was set to \"overcast\"\nand should be the same for all, taken within 1 minute of each other.\n\nurl: http://www.juventuz.com/_temp/for_calibration.tar.bz2\n\nIf you have more luck with them, I'd love to know what options were used in\nthe conversion process.\n\n\nMartin\n\n\n\nOn Thursday 10 June 2004 17:23, Greg Ward wrote:\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Fwd: errors from hdrg", "tags": [], "sender": "Martin Matusiak", "datetime": "Fri Jun 11 11:14:12 2004"}