{"refs": [], "id": "<1B23446CBF250648A2FC775DE3FE7E8009E92F@OC11expo28.exchange.mit.edu>", "subject": "[Radiance-general] DIVA 2.0", "email": "tito_ at mit.edu", "body": "\nDear colleagues,\n\nIt is our pleasure to announce the release of DIVA-for-Rhino 2.0, a daylighting and energy modeling plug-in for Rhinoceros based on Radiance/Daysim and EnergyPlus.  We began working on the tool about 2 years ago while we were at Harvard's Graduate School of Design. Following our departure/graduation from Harvard we formed a company called Solemma with exclusive rights from Harvard to distribute and further develop DIVA.  DIVA 2.0 is the commercial version of DIVA and includes key new features such as: annual glare maps, dynamic shading and electric lighting modules, a thermal load calculation module based on EnergyPlus version 7.0.0 and graphical simulation reports, as well as LEED and CHPS simulations. We have further updated our DIVA-for-Grasshopper components, which can now launch parametric daylighting simulations without having to be 'primed' by the toolbar. Details of the new features follow below. We hope that some of you will enjoy using DIVA, and that you will join us in exchanging ideas, projects and thoughts on our new website: www.diva4rhino.com<http://www.diva4rhino.com>.\n\nHappy Simulations,\n\nChristoph Reinhart, Alstan Jakubiec, Jeff Niemasz, Jonnie Sargent and Kera Lagios\n\n\nAnnual glare maps\nThis feature uses the gen_dgp_profile program written by Jan Wienold that comes with Daysim. It generates an annual glare map that predicts for all view points in a scene the hours in the year when glare is disturbing or intolerable. The results are displayed as an html report with embedded images. Please note, if annual dgp profiles have been calculated, they are used in the climate based metric calculations if a dynamic shading system has been specified. more>><http://diva4rhino.com/user-guide/simulation-types/annual-glare>\n\nDynamic Shading Module\nThe module allows users to specify up to two independently controlled dynamic shading systems. A shading system may be mechanical (venetian blinds) or switchable (electrochromics). Various manual or automated control options are available. When a dynamic shading system has been specified, it is considered during an annual climate based metric calculation and the status of the shading system over the year is displayed in an html report with embedded images. more>><http://diva4rhino.com/user-guide/rhino/advanced-shading>\n\nElectric Lighting Module\nThe module allows uses to specify up to ten electric lighting zones in a scene. Any lighting zone may be manually or automatically controlled. The electric lighting calculation is fully integrated with the shading calculation and resulting hourly load profiles for electric lighting can be linked to EnergyPlus or other thermal simulation programs. more>><http://diva4rhino.com/user-guide/rhino/lighting-controls>\n\nThermal Load Calculation\nThe thermal load calculation allow users to set up a single thermal zone in Rhino and specify some basic thermal construction properties and usage patterns. The occupancy, lighting and shading schedules are taken from the daylighting module. Simulation results  are displayed in an html report with embedded images. more>><http://diva4rhino.com/user-guide/simulation-types/thermal-analysis>\n\nGrasshopper Improvements\nThe daylighting analysis component has been overhauled to give users parametric control over project location and simulation type and settings.  This means you don't need to 'prime' the components with a toolbar run every time you want to initiate or change your analysis. The thermal components have also been updated with several bug fixes since the last release.\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20120420/1fbbe7d2/attachment.html>\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Christoph Reinhart", "datetime": "Fri, 20 Apr 2012 18:29:14 +0000"}