{"refs": [], "id": "<1B23446CBF250648A2FC775DE3FE7E800A3DDD@OC11expo28.exchange.mit.edu>", "subject": "[Radiance-general] July 20-22: 3 days of Daylighting Training", "email": "tito_ at mit.edu", "body": "\nDear Radiance aficionados,\n\nSome of you and/or your associates might be interested in a three day program on 'Daylighting Buildings' that we will once again be offering on June 20-22, 2012 through Harvard's Executive Education Program. Course participants will acquire a range of daylighting design analysis techniques ranging from rules of thumb to state-of-the-art computer simulations and high dynamic range photography for glare analysis. The main simulation programs used will be Rhino combined with our DIVA 2.0 plug-in<http://diva4rhino.com/> that exports Rhino scenes into Radiance, Daysim, Evalglare and EnergyPlus. Simulation outputs include:\n\n\n-          Daylight factor and indoor illuminance distributions for LEED IEQ Credit 8.1 Compliance (Radiance) more>><http://diva4rhino.com/user-guide/simulation-types/LEED-IEQ>\n\n-          Annual radiation maps for urban studies (Radiance/GenCumulativeSky) more>><diva4rhino.com/user-guide/simulation-types/radiation-maps>\n\n-          Climate-based metrics including daylight autonomy and useful daylight illuminance (Radiance/Daysim) more>><http://diva4rhino.com/user-guide/simulation-types/climate-based>\n\n-          Physically based scene visualizations (Radiance) more>><http://diva4rhino.com/user-guide/simulation-types/visualizations>\n\n-          Point in time glare analysis under selected sky conditions (Radiance/Evalglare) more>><http://diva4rhino.com/user-guide/simulation-types/point-in-time-glare>\n\n-          Annual glare maps (Daysim/Evalglare) more>><http://diva4rhino.com/user-guide/simulation-types/annual-glare>\n\n-          Thermal loads calculations (EnergyPlus and Radiance/Daysim) more>><http://diva4rhino.com/user-guide/simulation-types/thermal-analysis>\n\n-          Electric lighting  load profiles for manual and automatic control systems (Daysim) more>><http://diva4rhino.com/user-guide/rhino/lighting-controls>\n\n-          Dynamics shading system analysis for venetian blinds and electrochromics systems (Daysim) more>><http://diva4rhino.com/user-guide/rhino/advanced-shading>\n\n\nThe physical assumptions underlying these simulation programs and performance metrics will be discussed in detail. The first two days will consist of formal instructions, in-class discussions, hands-on software tutorials, and exercises. Day two will start with a lecture on circadian effects of light by Professor Stephen Lockley form the Harvard Medical School. Participants will be given the opportunity to calibrate their personal digital cameras to take HDR images and learn several ways of how to quantitatively evaluate these images. During the last day, participants will be given the opportunity to apply the newly acquired analysis techniques to ongoing projects of their own and to go over specific problems or simulation challenges with the instructor.\n\nYou can sign up for the program at http://execed.gsd.harvard.edu/programs/daylighting-buildings-0. Please direct any content-related questions to me. Administrational/logistics questions can be answered by Ms. Margaret Moore De Chicojay (margaret_moore_dechicojay at harvard.edu<mailto:margaret_moore_dechicojay at harvard.edu>).\n\nWe are looking forward to welcoming some of you to Cambridge this July.\n\nBest,\n\nChristoph and Alstan\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20120425/72af1b6f/attachment.html>\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Christoph Reinhart", "datetime": "Wed, 25 Apr 2012 15:38:41 +0000"}