{"refs": [], "id": "<CAD83LVK3XBki1DBfsyCBwgRqQ_UcsytqPC9BFPULBWjxwFQtxQ@mail.gmail.com>", "subject": "[Radiance-general] visualize position index", "email": "hope.zh at gmail.com", "body": "\nDear Radiance experts,\n\nLearning glare related analysis, I write a .cal file to define the position\nindex for every point on the sky in relation to a given view vector based\non the position index formula. I also prepared a batch file to visualize it.\n\nHowever, the image I got is not a circular fisheye one and the upper half\nof the pattern doesn't seem to resemble what appeared on page 753 in Dr\nWienold and Dr Christoffersen's paper:\nWienold, J., & Christoffersen, J. (2006). Evaluation methods and\ndevelopment of a new glare prediction model for daylight environments with\nthe use of CCD cameras. Energy and Buildings, 38(7), 743-757.\n\nImages are shown here:\nhttp://episode-hopezh.blogspot.com/2012/04/viz-position-index.html\n\nThe .cal and batch files can be downloaded from:\nhttps://sites.google.com/site/episodehopezh/files/viz_sg.rar?attredirects=0&d=1\n\nTwo folders are included, one for visualizing the position index and the\nother one for visualizing the inverted position index.\n\nThe view is a horizontal one towards due south. The image extracted from Dr\nWienold and Dr Christoffersen's paper is also included as a reference.\n\nCan you kindly take a look of the .cal and batch file and advise me on:\n1) why I can't get a circular fisheye image (I assume there's simple rookie\nerror in the script...)?\n2) whether the position index pattern as visualized is correct?\n3) how to convert the image into one using position index value as color\nlegend?\n\n\nWould greatly appreciate if Dr Wienold can kindly provide some suggestions!\n\nThank you very much in advance!\n\n- Ji\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20120430/7ef59e30/attachment.html>\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Ji Zhang", "datetime": "Mon, 30 Apr 2012 02:15:49 +0800"}