{"body": "\nDear Thomas and Harshada,\nwe currently have also figured out a light leakage problem that occurs only when working with quite huge models. We did some analysis on that problem and found out the following:\n\nIf we measure the daylight factors in a simple box generated with genbox without any openings than rtrace gives us zero values for all measurement points as expected.\n\nIf we than add an additional surface that is much bigger than the simple box and do the simulation again (without changing anything else), we receive light in the the completely closed box. We think, we are using appropriate values for -aa and -ar. The result of:  biggest_model_length * aa / ar is much smaller than the distance between the measurement points.\n\nMaybe the solution for this problem is using mkillum instead of common windows. We keep on testing...\n\nRegard, Kai.\n\n\n-----Urspr?ngliche Nachricht-----\nVon: radiance-general-bounces@radiance-online.org [mailto:radiance-general-bounces@radiance-online.org] Im Auftrag von EncaseIndia\nGesendet: Donnerstag, 24. Juli 2008 15:25\nAn: Radiance general discussion\nBetreff: Re: [Radiance-general] light leakage problem\n\n\nHi Thomas,\n\nThanks for the feedback.\nI was actually checking my model in radiance without any windows,wherein it showed me light leakage.Its just one corner of the building at which i can see some light ,which is around 250 lux, quite huge amount.\nI deleted all my windows in ecotect and then exported the model in radiance, after so much analysis i could just find the corner from where the light is leaking.\nI have attached the pictures here.\n\nand I hope you find my english proper. :)\n\nHarshada\n\n----- Original Message -----\nTo: Radiance general discussion <mailto:radiance-general@radiance-online.org>\nSent: Tuesday, July 22, 2008 11:42 PM\n\nOn 22 Jul 2008, at 05:57, EncaseIndia wrote:\n\n\nhii everyone,\n\nIt seems i have light leakage problem in my model,, can ne1 tel m ..hw can I fix it..?\n\n\nThe first thing to do is to identify the source of the problem. Why do you\nsuspect 'light leakage'? To high values for daylight factor?\n\nFirst check your material definitions. If you have windows and your glass\nmaterial is incorrect too much light might enter the room through the\nwindow panes.\n\nIf you think that the geometry is the problem try a few fisheye views of the\ninside. Bright pools at the edges of walls/ceilings/etc. indicate a problem.\nIf the inside doesn't show anything, place a light source inside and render\nviews from the outside without sky.\n\n\nIs thr ne odr option except reconstructing model..? I have done my Model in ecotect....\n\n\nThere is no point in recreating a model if you don't know what was wrong\nwith the first one.\n\nPlease also post your questions in proper English and provide as much\ninformation as you can. If you want us to take the time for meaningful\nreplies you should take the time to type an understandable question.\n\nRegards,\nThomas\n\n\n\n_____\n\n\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20080724/3f215de7/attachment.htm\n", "replyTo": "", "sender": "tbleicher@arcor.de", "isquestion": true, "tags": [], "id": "<FE872D9C4591BF44AAFD986BF73368FF01C1414D@webmail.transsolar.com>", "refs": [], "datetime": "Thu Jul 24 06:53:40 2008", "email": "Thomas Bleicher", "subject": "Re: [Radiance-general] light leakage problem"}