{"refs": ["<6F5225D6E15F954BB4E58EC25F6736C308CFD9BF@corp3005.CORPORATE.FOSTER.NETWORK>", "<98F5AA52-AA9E-494E-BE4B-9286EA02FF09@lmi.net>"], "id": "<4FBDB8F2.3010205@curtin.edu.au>", "subject": "[Radiance-general] running radiance on multiple cores", "email": "t.mcminn at curtin.edu.au", "body": "\nI can verify that missing sections of images happens on both Linux and\nMAC computers when an ambient file is used though not consistantly.\n\nOften I have suspected/verified that the number of -N specified is\ngreater than the actual number of cores available. For example a i7\nMacbook that a student had in my office 10 minutes ago shows only 4\ncores hence -N 4 would seem appropriate. Some images would complete\nwhile others left black patches. All I did was to delete the offending\nhdr image and re-issue the rad command exactly to have the image rebuilt\n- much faster as the ambient file has already been populated.\n\nI suspect that the -N number should generally be kept to at least 1\nbelow the max cores available.\n\nQuestions for the Development List :\n1) Can multi-core processing be added to trad  (-n for rvu and -N rad)?\nWhile it is possible to add a -n 4 in the trad options line for rvu, you\ncannot use a -N in the option line for rad.\n2) Can the image size resolution for single core processing be the same\nas multi-core to allow further processing with falsecolor. When rad -N\nprocessing uses rpiece the image size can be modified/rationalised. This\ndoes not happen in single core processing, hence falsecolor would fail\nwhen mixing images due to image size mismatch.\n\nTerrance Mc Minn\nLecturer\nSchool of Built Environment\nCurtin University of Technology\n**\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20120524/25c62021/attachment.html>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] running radiance on multiple cores", "tags": [], "sender": "Terrance Mc Minn", "datetime": "Thu, 24 May 2012 12:28:34 +0800"}