{"refs": ["<E9AD575374574E439EA4C93EC054103A014B23FBE881@vesuvius2.rumseyengineers.com>,", "<8E6BAE1BECA2854BB78706B1506FC7AC02E20D93@ex-be01.burohappold.com>"], "id": "<FFF56A6D37A3A54F91A03601AC22DA3224CCFED90E@MAILBOX2.nrel.gov>", "subject": "[Radiance-general] Running Radiance on Windows", "email": "Alex Krickx", "body": "\nThe Radiance offerings at NREL's OpenSutdio website are merely an attempt to provide folks with an easy path to using Radiance. Since OpenStudio now leverages Radiance, we (NREL) felt it was critical to provide a relatively simple way to get Radiance running on anyone's system. Windows support has historically been a missing tooth in the Radiance community, so this is why we embarked on this mission. Personally, the lack of Windows support forced me to love UNIX, and eventually MacOS. But we recognize that the vast majority will not have the opportunity or desire to look beyond Microsoft when they choose an operating system, and so we felt that this was necessary. Kudos to Greg Ward for supporting the effort, and again, I hope to post updated installers and HOWTOs soon.\n\n- Rob\n________________________________________\nSent: Monday, June 11, 2012 5:10 PM\nTo: Radiance general discussion\nAt home, I?ve used virtualization software (VirtualBox, VMWare, etc) to create a fully operable Linux guest to run Radiance from a Windows 7 host. While this may not be entirely efficient use of available resources (Windows is still running), it is convenient enough to run Radiance with access to multiple cores and the ability to recompile from source as updates are made. Nice to be able to flip back and forth between Linux and Windows programs for an efficient (enough) workflow, without requiring rebooting.\n\nI haven?t tested Rob?s OpenStudio, but it certainly seems promising based on the talks from the 2011 Radiance Workshop. Compiling in Linux can be difficult if you?re not entirely sure what packages/dependencies are needed for your build. You can also download OpenStudio precompiled versions of Radiance if that suits your needs better.\n\nChris\n\nChris Coulter\nSenior Lighting Designer\nBuro Happold Consulting Engineers\n100 Broadway, 23rd Floor\nNew York, NY 10005\nTel: 212.334.2025\nDirect: 212.616.0254\nEmail: chris.coulter at burohappold.com<soid.diaz at burohappold.com>\nWebsite: www.burohappold.com\n\nSent: Monday, June 11, 2012 1:42 PM\nTo: radiance-general at radiance-online.org\nHello,\n\nI?m wondering how Windows users access Radiance. It?s been a few years since I?ve used the software, and as I recall previously it was done through a CygWin interface. Right now we are building geometry in DesignBuilder which installs Radiance on the machine, but I?m wanting to edit my rad files, materials, and create new views that DesignBuilder doesn?t allow.\n\nWhat are people on Windows machines using? What problems have been encountered? Any upcoming releases that I should be aware of when choosing a software path? Including links to specific builds would also be much appreciated.\n\nApologies if this has been asked and answered ? I had a look through the archives and didn?t find a clear answer. Thanks in advance ? I?m looking forward to hearing thoughts/comments.\n\nKind regards,\nAlex Krickx\n\nAlex Krickx, LEED AP\nProject Engineer\n________________________________\nI N T E G R A L\nGROUP\n\n427 13th Street, Oakland CA 94612\n510 663 2070 x 247\nakrickx at integralgroup.com<mailto:akrickx at integralgroup.com>\nwww.integralgroup.com<http://www.integralgroup.com/>\n\nDEEP GREEN Engineering.\n_______________________________\n\n[cid:image001.png at 01CD4804.7761A750] <http://www.linkedin.com/groups?about=&gid=3830399>  [cid:image002.png at 01CD4804.7761A750] <http://www.facebook.com/#!/pages/Integral-Group-Inc/213422145352140>  [cid:image003.png at 01CD4804.7761A750] <http://twitter.com/#!/IntegralGroupCA>  [cid:image004.png at 01CD4804.7761A750] <http://www.youtube.com/user/IntegralGroupOakland>  [cid:image005.jpg at 01CD4804.7761A750] <http://www.integralgroup.com/>\n\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Running Radiance on Windows", "tags": [], "sender": "akrickx at integralgroup.com", "datetime": "Tue, 12 Jun 2012 09:48:33 -0600"}