{"body": "\nDear Uta,\n\nYou may be a newbie or \"noob,\" but your question is fairly advanced.\nNot many people have used the plasdata type, and you have gotten most\nof the specification correct.  Well done.  My additional comments are\ninline, below:\n\n\nThis is correct, but I recommend using Acos() rather than cos()\nbecause it avoids problems when the dot product is epsilon greater\nthan 1.0.\nAre you sure about this one?  You seem to be computing the angle\nbetween incoming and outgoing vectors (in radians), rather than the\nazimuthal angle between projected vectors that most radially\nsymmetric BRDFs require.  I think you want an atan2() expression.\nA shortcut for this is:\n\ntheta(x,y,z) = 180/PI * Acos(Rdot);\n\nPutting the 180/PI out front (and/or enclosing it in parens) saves\nevaluation, since constant subexpressions are replaced by their values.\nThe difference between plasdata and metdata is that metdata uses the\nfirst three real arguments for the RGB color of the specular\nhighlight as well as the diffuse component, whereas plasdata only\nuses it for the diffuse.  Note that the diffuse component is the\nfraction of the BRDF that is constant in all directions.  If you have\nnot subtracted this constant (Lambertian) reflection from your BRDF,\nthen you need to give the specularity as 1, and your surface will in\nfact be white, no matter what you have for the first three arguments.\n\nPlease note that none of the BRDF types in Radiance offers a complete\nsolution to the global illumination equation.  Only highlights from\nlight sources will use this data properly.  Interreflections will\nconsider the entire BRDF to be \"diffuse\" rather than directional.\nThis is a limitation of the software.\n\nBest,\n-Greg\n\n", "replyTo": "Subject: [Radiance-general] Re: usage of plasdata material", "sender": "Greg Ward", "isquestion": false, "tags": [], "id": "<5317961E-F2ED-48D8-A8E1-27FC7AC1B097@lmi.net>", "refs": ["<000a01c8fcb1$673274b0$0200a8c0@MOBILUta>"], "datetime": "Sat Aug 16 23:03:43 2008", "email": "gregoryjward at gmail.com", "subject": "[Radiance-general] Re: usage of plasdata material"}