{"body": "\nDear list,\n\nI know this keeps coming up every now and then, but I just wanted to\ncheck the latest state-of-the-art when it comes to simulating light\npipes. Here is what I gathered from various pieces of documentation,\nposts, and the back of my head:\n\na) a forward raytracer such pmap seems to be the optimal solution, but\npmap has not been merged into Radiance Classic yet and only works with\nRadiance 3.7\n\nb) Radzilla, which also supported (some of the) pmap functionality\nseems to be unmaintained.\n\nc) the mirror material can only be used on planar objects, hence it's\nno good inside a tube (inverted cylinder). How good would a metal tube\nin combination with ridiculously high number of bounces be?\n\nd) Guilio made some suggestions in this thread:\nhttp://luminance.londonmet.ac.uk/radiance_mailinglists/general/2005-May/002708.html\nabout using some approximations in combination with a glow material\n\ne) then there's the new rtcontrib program\n(http://luminance.londonmet.ac.uk/radiance_mailinglists/general/2005-May/002710.html):\n\"Rtcontrib can also be used by the more adventurous among you to\ncompute input/output relations for devices such as light pipes and\nshading systems, although I have yet to test such an approach,\nmyself.\" --Greg\nThere is a directory ray/src/rtcontutor, but the example explains\nrtcontrib's use for daylight coefficients, not light pipes. I\npersonally can't quite work out how it would possibly replace a\nforward raytracer, so has anybody been adventurous yet used it for\nthis?\n\nf) How about gathering the external environment with a mkillum across\nthe pipe's entrance, then spreading the light in the interior using a\nsecond mkillum at the pipe's exit?\n\nMany thanks for sharing your thoughts\n\nAxel\n\n", "replyTo": "", "sender": "Axel Jacobs", "isquestion": true, "tags": [], "id": "<100441490808220734q53ac87e0r6b27873563684df7@mail.gmail.com>", "refs": [], "datetime": "Fri Aug 22 07:35:01 2008", "email": "jacobs.axel at gmail.com", "subject": "[Radiance-general] Lightpipes and rtcontrib"}