{"refs": [], "id": "", "subject": "[Radiance-general] Python scrip", "email": "Robert.Guglielmetti at nrel.gov", "body": "Message-ID: <CC2C4BC0.1277D%robert.guglielmetti@nrel.gov>\n\nHi Folks?\n\nOn 7/16/12 5:01 AM, \"Thomas Bleicher\" <tbleicher at googlemail.com<mailto:tbleicher at googlemail.com>> wrote:\n\nHi Ryan.\n\nInteresting that Blender is coming back to Radiance. I am following the Python API development but I'm still not sure it has all the bells and whistles to make it worth the effort.\n\nRegarding your Popen problem: Do you have problems with other Perl scripts as well or is it only genskyvec.pl<http://genskyvec.pl>?\n\nThis is happening with our Ruby scripts as well?\n\nI do remember that I had some issues with command lines and Popen on Windows when I was writing falsecolor2. It's mostly the correct quoting of the arguments. I don't recall doing anything specific that solved my problem, though.\n\n?I will look at the quotes.\n\n\nOn Mon, Jul 16, 2012 at 12:14 PM, Ryan Southall <R.Southall at brighton.ac.uk<mailto:R.Southall at brighton.ac.uk>> wrote:\nHi all.\nI am about to release version 0.2 of a set of python scripts that pre/post-process Radiance scenes from a 3D modelling package called Blender. I have implemented Dynamic Daylight Simulations in version 0.2, which is fine on Linux/Mac but it's causing me a problem on windows machines. When python, using Popen, sends out the command piping gendaylit to genskyvec.pl<http://genskyvec.pl> I get a bad sky description error, although if I type the same command into the Windows command prompt it works as expected. Has anyone here got any experience of running this combination on windows with Python. I'm using strawberry Perl to run the genskyvec.pl<http://genskyvec.pl> file, which was part of NREL's latest binary release.\nThanks in advance\n\nRyan, thanks for reporting this. I think we are probably both in the same boat, and it's preventing Windows OpenStudio users to do a full annual simulation with our Radiance implementation scripts too. We are looking into a fix right now.\n\n- Rob\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Python script", "tags": [], "sender": "Guglielmetti, Robert", "datetime": "Wed, 18 Jul 2012 11:20:22 -0600"}