{"body": "\n\nOn 22 Oct 2008, at 10:04, jeando wrote:\n\n\nInteresting approach. I would have used physical mock ups to decide on\nmaterials (diffusers, layout and spacing) and measurements on a number\nof lamps of the same type to check for manufacturing inconsistencies.\n\nWith Radiance you introduce the new complexity of modelling the\nphysical materials _correctly_ in a virtual world and in some cases\nyou have to deal with the optimisation of the algorithms.\n\n\nAt a first look I'd say your spotty images are the result of \"-av 0 0\n0\"  and a rather low\n\"-ab 4\". Note that the trans material will swallow one bounce just to\nlet light pass. That\nleaves you 3 bounces to hit a light source which is not a lot.\n\nAs a first step I'd set \"-av\" to something realistic. You should be\nable to calculate a\nreasonably good approximation of the ambient value from your physical\nset up.\n\nNext: Your rendering times might benefit from an 'illum' calculation.\nReplace the\n\"trans\" material ceiling with an \"illum\" to make it a direct light\nsource. This will affect\nthe appearance of the ceiling but not the accuracy of the rendering.\nHowever, this\nmay go against your idea of simulating the physical set up.\n\nIn your last image you're disabling the ambient cache with \"-aa 0\".\nNow every\nray is calculated with your high settings. You can probably reduce \"-\nad\" and \"-as\"\na lot in your uniform environment. I'd also set \"-lr\" back to 8\nagain. There is a\ndifference but it has not such a big visual impact.\n\n\nRegards,\nThomas\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20081022/dce97063/attachment.htm\n", "replyTo": "Subject: [Radiance-general] Modelling an artificial sky : help needed", "sender": "Thomas Bleicher", "isquestion": false, "tags": [], "id": "<190482EF-329D-4A14-8723-4C5135C854D0@arcor.de>", "refs": ["<48FEEC96.2070807@deluminaelab.com>"], "datetime": "Wed Oct 22 03:26:28 2008", "email": "tbleicher at arcor.de", "subject": "[Radiance-general] Modelling an artificial sky : help needed"}