{"refs": ["<0A2D5ADD-7C16-4295-890A-66CFBDFD377D@gmail.com>"], "id": "<FFF56A6D37A3A54F91A03601AC22DA3225FDC07C04@MAILBOX2.nrel.gov>", "subject": "[Radiance-general] Asymmetry in Daylight Factor Results and    modification of UDI", "email": "Amalie Momme", "body": "\nHi Amalie,\n\nDeviations from point to point are to be expected. Radiance uses stochastic sampling, which will result in different \"answers\" from one run to the next. Further, I assume you are using a CIE standard overcast sky for your DF calculations? THat is not \"symmetrical\" either. That sky increases in radiance as you increase the altitude from the horizon to the zenith. It might help to have more details about your model and your results to help diagnose this.\n\nRegarding your UDI question, using the latest version of OpenStudio (v0.9.0), you could perform a DGP-based UDI analysis like you are trying to do. OpenStudio now reports out DA, cDA, and UDI for each space's illuminance map to a .csv file. There is also a glare sensor object now that reports DGP(simplified). You could write a Ruby script that takes the UDI and DGP values and for each timestep makes an evaluation about the UDI, using the DGP value as the trigger for the high end of UDI, instead of 2000 lux.\n\nThe glare sensor also can have one or multiple \"glare views\", as well; the max, min and mean are always reported in the .csv file, allowing you to evaluate DGP for a range of views, a la Jacubiec and Reinhart's \"adaptive zone\" idea.  Let me know if you want help writing a script that does what you want.\n\n- Rob\n\n________________________________________\nSent: Wednesday, October 03, 2012 7:27 AM\nTo: Radiance-general at radiance-online.org\nHello all,\n\nI am new to Radiance / Daysim, so I hope you can help help out with a few questions.\n\nI am using DAYSIM via Ecotect to simulate the daylight conditions for an office, 4 x 5 m, symmetrical geometry, with one window. I noticed that the Daylight Factor results were not completely symmetrical. Deviations are typically around 0.1-0.3 % DF. I tried increasing the number of ambient bounces from 6-8-10 which did not eliminate the asymmetry. I contacted an engineer who has been using Daysim via Ecotect in his ph.d. study, and he wrote that his Daylight Factors were also a bit asymmetrical. Can anyone explain why this is the case? In theory the Daylight Factor should be completely symmetrical, as the CIE Standard Sky is symmetrical. Does this have anything to do with Daysim using the Daylight Coefficient Method?\n\nAnother thing is that I would like to modify the UDI to make it case dependent. So instead of using 2000 as the upper limit for useful daylight, I would like to insert a sensor point, calculate the DGP (Daylight Glare Probability), and use this as the upper limit. Does anyone know if it is possible to extract the results for each hour, for each sensor point, to count the hours of useful daylight based on this?\n\nThank you in advance,\nAmalie Momme\n\n\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n", "isquestion": false, "replyTo": "<0A2D5ADD-7C16-4295-890A-66CFBDFD377D@gmail.com>", "tags": [], "sender": "amaliemomme at gmail.com", "datetime": "Wed, 3 Oct 2012 09:28:10 -0600"}