{"refs": ["<0A2D5ADD-7C16-4295-890A-66CFBDFD377D@gmail.com>", "<FFF56A6D37A3A54F91A03601AC22DA3225FDC07C04@MAILBOX2.nrel.gov>", "<CAOG+NiyrXtF7nqRuJQh3+1Y3e7UgBjm8S2Zpy806U92n2SYTJA@mail.gmail.com>"], "id": "<CAOs1TpZb2MpAvirWR_tzTaWTtqjKWBswMC3pKvj1wDCZi5xS+w@mail.gmail.com>", "subject": "[Radiance-general] Asymmetry in Daylight Factor Results andmodification of UDI", "email": "amaliemomme at gmail.com", "body": "\nHi Rob and Andy,\nThank you very much for your quick answers!\n@Rob: My model is a square office (A box), room depth 5 m, facade length 4\nm and height 3 m. It has a window with height 1.8 m, length 2.8 m placed in\nthe center of the facade, with the bottom 0.9 m above the floor. The\nanalysis grid is placed 0.9 m above the floor parallel to the xy plane. The\nlocation is Copenhagen, Denmark. So far, there are no exterior obstructions\nin the model, but there will be in the final model as the office is in an\nurban environment. When I noticed the asymmetrical DF results I thought I\nmight have done something wrong when building up the model, and I wanted to\nfix this before creating a more complex one. The asymmetry is along the\ncenter axis of the room, but if you say this is to be expected due to the\nstochastic sampling, then I will accept the deviations and try to decrease\nthem by playing with the other simulation parameters Andy suggested. Thank\nyou for your offer regarding help with the script for OpenStudio, that is\nvery kind of you! However, I think I will stick to Ecotect/Daysim, and skip\nthe modification of the UDI for now as my experience with OpenStudio is\nvery limited and I have a deadline. I might return to this later for\nfun though.\n\n@Andy: Thank you very much, I will try playing with the other\nparameters. (And post future Daysim questions on the Daysim mailing list\n:-))\n\nAmalie\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20121004/87357cff/attachment.html>\n\n", "isquestion": false, "replyTo": "<CAOG+NiyrXtF7nqRuJQh3+1Y3e7UgBjm8S2Zpy806U92n2SYTJA@mail.gmail.com>", "tags": [], "sender": "Amalie Momme", "datetime": "Thu, 4 Oct 2012 16:48:29 +0200"}