{"refs": ["<CAAzVHq2=j=eLM-0r1wb+GSNDxYKApeyi1tHmhLz2Ejj6=Bb+6w@mail.gmail.com>", "<91355210-820E-408D-ADB4-C3DEDDE0EEA1@create.aau.dk>"], "id": "<CAAzVHq3yNs=DCg0K2i6Y7_cJ5sScXPRxtBVXcKSiuZJsoZVrSQ@mail.gmail.com>", "subject": "[Radiance-general] Attempt to illuminate Paul Debevec'srnl_scene.rad with a hemispherical HDR image of the sky", "email": "kskonis at gmail.com", "body": "\nHello Claus,\n\nThanks for the response, both on the HDRI list and here. I've never\ngot into custom .cal files, but looks like the place to start to get\nexactly what i want.\n\nI quickly read through some of the HDRshop tutorials on: http://www.hdrshop.com/\n\nThere are many interesting and useful tools (including scripting) ....\nAnd perhaps the \"Panoramic Image Conversion\" tool is what you are\nreferring to?\n\n....At the conceptual level, the step i am confused with is\nidentifying the appropriate virtual object in Radiance to map my HDR\nenvironment to.\n\nPaul uses an inward-pointing box, as in:\n\n###############################################################\n# specify a large inward-pointing box to be mapped with the HDR environment\n\n!genbox env_glow boxenv 500 500 500 -i | xform -t -250 -18 -250\n###############################################################\n\nAll surfaces of the box contribute light.\n\nBecause i only have captured light data from the horizon up, and dont\ncare (at this stage) about the group plane, it would seem that i\nshould start with a box that encompasses a hemisphere that is\npositioned on the xy plane.\n\nAssuming this step is correct, i would then aim to map the non-zero\npixels in my hemispherical image to the surfaces of that box\n(effectively stretching the circle into a rectangle).\n\nAlternatively, i could also try to map to a hemisphere, but then there\nis the issue of what to do with the \"black\" pixels which make up the\ncorners of the HDR image.\n\nbest,\n\n-Kyle\n\n\n\n\nOn Sun, Oct 14, 2012 at 12:23 PM, Claus Br?ndgaard Madsen\n<cbm at create.aau.dk> wrote:\n\n\n", "isquestion": false, "replyTo": "<91355210-820E-408D-ADB4-C3DEDDE0EEA1@create.aau.dk>", "tags": [], "sender": "kyle konis", "datetime": "Mon, 15 Oct 2012 10:30:08 -0700"}