{"body": "\n\nI am 100% in agreement with idea of using  photospectrometer validated readings of 'standard' color charts. Let me add that perhaps paint manufacturers may already have this data ready or be keen on the approach. I've been waiting for such an effort for a while and often have had to rely on Axel's color chart by default and that other construction material chart from the folks at design lab :http://www.designlaboratory.com/computing/tools/radiance/radmatlib.htmlregardssteve> Date: Fri, 7 Nov 2008 09:57:24 +0100> From: info@iebele.nl> Subject: Re: [Radiance-general] Color reflectance values and materials..> To: radiance-general@radiance-online.org> > Hi Dave,> > As Mark already said, these values seem very bright to me also.> > Once I did some measurements on a Kodak grayscale chart (from the good > old Q-14 color separation guide) using a photospectrometer from Kodak, > which results were all below 1.0 for each Radiance RGB triplet (see the > attachment, which contain the conversions of the measured xyz-values to > radiance rgb ). Since then my idea has been that rgb triplet values for > diffuse reflectances above 1.0 are invalid. Reading your mail I get > confused a bit.> > Another point I don't understand is why you suggest to use gamma > correction within a material description. I always think of gamma to be > applied after the simulation has been done. In other words, I think of > gamma to correct an image for a certain output device. So, why should we > correct reflection values with a gamma _before_ a simulation?> > The idea of a public database for materials, paints etc. dedicated to > Radiance would be very usefull. Imho such a database would be very > valuable as a part of the Radiance distribution also. This instead of > pointing to websites, which might confuse users. Measured samples from > commercial color charts (like RAL, Pantone and other paints and > materials) would extend the direct useability of Radiance a lot. It > might be an idea to plan measurements using a photospectrometer on such > standard commercial color charts, and discuss the conversion of the > results within this group. Or has this already be done in such an > extensive way?> > -Iebele> > > > David Smith wrote:> >>Mark,>>>>That's where gamma values come in. Let's say the RGB values of a paint>>sample from EasyRGB are (125,150,175), a blue gray. Take each channel,>>divide by 256, take the result to the power of 2.2 (monitor gamma) and>>then multiply by 256.>>>>R = (125/256)^2.2 * 256 = 52.9>>G = (150/256)^2.2 * 256 = 79.0>>B = (175/256)^2.2 * 256 = 110.9>>>>If you put the resulting values (52.9,79.0,110.9) in as the R G and B>>material colors, you should get the correct paint color in your>>simulation that matches the physical paint color.>>>>--Dave>>>>_______________________________________________>>Radiance-general mailing list>>Radiance-general@radiance-online.org>>http://www.radiance-online.org/mailman/listinfo/radiance-general>>>>  >>>\n_________________________________________________________________\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20081107/20b44034/attachment.htm\n", "replyTo": "Subject: [Radiance-general] Color reflectance values and materials..", "sender": "steve michel", "isquestion": false, "tags": [], "id": "<BAY143-W9E36BA7FE3385B42C2051E0190@phx.gbl>", "refs": ["<694e132c0811061457h201ee2d2m6b81d9393cd71f5@mail.gmail.com>", "<491402F4.8000109@iebele.nl>"], "datetime": "Fri Nov  7 01:17:20 2008", "email": "smichel_designer at hotmail.com", "subject": "[Radiance-general] Color reflectance values and materials.."}