{"refs": ["<CAMxTbri9-2+CYCjBe0O80GN9NDWvhnsWT=TTheAKi96faYM-uA@mail.gmail.com>", "<50825B2F.7040505@gmx.net>", "<CAD83LVKQ97JZoyCnB=jvPqJUyENxdhtUhxV7UWSbv6yjCrkJww@mail.gmail.com>"], "id": "<508407FC.8040408@gmx.net>", "subject": "[Radiance-general] sky visibility", "email": "grobe at gmx.net", "body": "\nHi!\nI'd suggest to any Radiance user to thoroughly read the rtrace manpage.\nEspecially the part about output (-o...). rtrace is NOT only returning\nradiance, irradiance or contribution coefficients. It can output\ninformation about the first ray intersection, as well as intersection of\ndaughter rays, with geometry in your scene. This may be coordinates,\ndirections, lengths, surface identifiers, materials and modifiers, ...\nAnd the output is not a file but a stream of data, which, piped into\nother tools such as rcalc, grep, sed, ... can be processed further.\nMaybe even into input for the next rtrace process.\n\nGiulio was proposing something similar, but relying on an image format.\nYou could, again, use my rcalc line with his approach to get both the\nnumber of rays intersecting with geometry and the total number of rays:\n\n$1=if($1,1,0) sets all pixels (rays) to one if they are above 0 (meaning\nthey hit some geometry, as you have no light source but only\nself-glowing geometry).\n\n$2=1 sets the second value to 1 for any pixels (rays) regardless they\nhit geometry or not.\n\nSo rcalc -e ?$1=if($1,1,0); $2=1? | total would result in two values,\nfirst the number of pixels (rays) hitting geometry, second the total\nnumber of pixels sent. The fraction is what you need. The input for this\nrcalc command can be from vwrays | racalc, rpict or anything else\nshooting rays into a hemisphere...\n\nThe more interesting question may be whether it is enough to trace from\nonly one point on your window. Maybe you want several random sampling\npositions on the window pane.\n\nCheers, Lars.\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] sky visibilit", "tags": [], "sender": "Lars O. Grobe", "datetime": "Sun, 21 Oct 2012 16:34:36 +0200"}