{"refs": ["<CABzgtwpW5PoM5-QNh0SE-2MhT5__cs5X3BCrPivKvyzU7mQXiQ@mail.gmail.com>", "<CAOG+Nix_+A_ZU3GzRp8fSzeLyVmWSmTgTivpR=7z3we2oLRVpg@mail.gmail.com>"], "id": "<CABzgtwqbLAX2FzNHGsQPkaHDF=LH+ibLcdCFLBYfc9eAoTHHhA@mail.gmail.com>", "subject": "[Radiance-general] possible inconsistency of bin numbersbetween BSDF and kelms_int.cal", "email": "hujia06 at gmail.com", "body": "\nHi Andy:\n\n\"the patch numbers will be different for incident and exiting hemispheres.\none side uses left handed numbering the other uses right handed numbering.\"\n------\nYes, from this figure  https://dl.dropbox.com/u/15562376/coordinate.jpg, Z\nhemisphere coordinate uses right handed and Zr uses left handed, but for\nforward rays (both incoming and outgoing rays whose direction is from\ninside room to outside), these rays will only use Z hemisphere, Zr\nhemisphere does not exist for those forward rays, and thus no left handed\ncoordinate in this sense. Thus outgoing rays still uses Z hemisphere patch\nnumber.\n\nTo make it clear, you may read this report\nhttp://windows.lbl.gov/software/window/6/Venetian%20Technical%20Document.pdf ,\n*Page 6, 7, 10 and 47 -50*, the report shows that both incoming and exiting\nrays' patch numbers are based on only one Hemisphere, either Z or Zr\nhemisphere but not both, that is why, *if you see the page 49 in the report\n*( or https://dl.dropbox.com/u/15562376/PDF_page_49.jpg*)*, the incoming\npatch number is 31 and the outgoing patch is still 31 because they are\nusing the same hemisphere. In the outgoing side, there is no hemisphere and\noutgoing ray still uses the hemisphere in the incoming ray side to\ndetermine the patch number. That is why they have the same patch numbers if\ntheir directions are the same.\n\nI think you figure is correct if you stand inside the room and look at the\nwindow. Klems_int.cal uses Z hemisphere to determine the patch number.\n\nMy concern is that Radiance loads \"Transmission Back\" data which uses Zr\nhemisphere but VewMatrix and DaylightMatrix uses Z hemisphere. In other\nwords, when Radiance loads \"Transmission Back\" data, it assumes all the\npatch number is determined based on Zr hemisphere (both incoming and\noutgoing rays patch number is based on this Zr hemisphere). But V and D,\nthe patch numbers of both incoming and outgoing rays  determine patch\nnumbers based on Z hemisphere (right hemisphere in the figure).\n\nThanks,\n\nJia\n\nOn Mon, Oct 22, 2012 at 12:45 PM, Andrew McNeil <amcneil at lbl.gov> wrote:\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20121022/0f618c30/attachment.html>\n\n", "isquestion": false, "replyTo": "<CAOG+Nix_+A_ZU3GzRp8fSzeLyVmWSmTgTivpR=7z3we2oLRVpg@mail.gmail.com>", "tags": [], "sender": "Jia Hu", "datetime": "Mon, 22 Oct 2012 13:23:07 -0400"}