{"body": "\nWhen you say that you are rendering using only ambient light, do you\nmean that there are no sources in your scene (no sky definition, no\nsurfaces with materials such as light, glow, source) and only the\ncontribution due to -av 0.02317? If so, your directionality might be due\nto the ambient bounce, which is not uniformly distributing light because\nof the one open side of the box. Try again with -ab 0 instead of -ab 1\nand see if that gives what you had wanted. It seems you are only trying\nto render a purely theoretical scene?\n\n...\n\nI am trying to render an image using only ambient light.  I noticed that\nthe reflected light appears to be non-uniform across the objects in the\nscene.  The scene is a open box with the open part facing the viewer and\nonly surfaces inside the box are lit (outside of the box is dark).  It\nappears that the light has some directionality to it.  I'm guessing that\nthere is a setting value that I have not appropriately set or something.\nI wondered if anyone had an idea what might be problem. The rpict\nparameters are listed as the following:\n\nrpict -t 12 -vf view_files/rightview.vf -x 1600 -y 1600 -ps 3 -pt .08\n-dp 512 -ar 48 -ms 0.71 -ds .2 -dj .5 -dt .1 -dc .5 -dr 1 -sj .7 -st .1\n-ab 1 -aa .15 -ad 800 -as 128 -av 0.5 0.5 0.5 -lr 8 -lw .002 -dj 0.6 -dt\n0.01 -dr 3 -ds 0.1 -sj 0.7 -st 0.15 -dc 0.5 -lr 1 -aw 0 -av 0.02317\n0.02317 0.02317\n\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n\n\n", "replyTo": "Subject: [Radiance-general] ambient light", "sender": "Christopher Rush", "isquestion": false, "tags": [], "id": "<EB124710ADB8554C930FADF760BB2BE70434FA5A@n-yexc01.global.arup.com>", "refs": ["<a38244780811250849k7b84340bmb16e37abd24984b4@mail.gmail.com>"], "datetime": "Tue Nov 25 09:14:53 2008", "email": "Christopher.Rush at arup.com", "subject": "[Radiance-general] ambient light"}