{"body": "\nHello Everyone,\n\nI am involved in the simulations of interior Venetian blinds in a\n10' wide, 18' long and 10' high\noffice room with one 6 ' by 6 ' window placed on the south\noriented wall. The window sill height is 3'.\n\nI am observing that the illuminance levels inside the room (at the\nsensor point close to the window) are higher with the interior\nVenetian blinds placed in the model (4500 lux) as compared to the\nmodel without the blinds (3000 lux).\nAlso even though the illuminance levels are much higher (at the\nlevel of 4500 lux close to the window) there is no glare index\nobserved (that is value of Daylight glare index DGI is equal to\nzero).\n\nI am attaching all the  files related to he modeling along with\nthe input files and the octree files. I might sound very naive to\nyou, please excuse me for any ignorance on my part, I am very new\nto the Radiance as well as UNIX. I have used the PICO text editor\nas vi text editor was having some problems in my system. There is\na file named command, in the folder attached, it has all the\ncommands that I have used in compiling and generating different\ncomponents of the model. finalmultiplesim1.csh is the shell script\nused and January.out is the output file.\n\nI would appreciate some suggestions as to where I might be going\nwrong with the simulations.\n\nThank you.\n\n\n\nG V DEEPAK\nGraduate student and Research Assistant\nM.E. Rinker, Sr. School of Building Construction.\nUniversity Of Florida.\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: room.rad\nType: application/octet-stream\nSize: 1987 bytes\nDesc: not available\nUrl : http://radiance-online.org/pipermail/radiance-general/attachments/20081127/08e66e64/room.obj\n", "replyTo": "", "sender": "G V DEEPAK", "isquestion": true, "tags": [], "id": "<921345904.202821227762054288.JavaMail.osg@osgjas02.cns.ufl.edu>", "refs": [], "datetime": "Wed Nov 26 21:00:57 2008", "email": "deepak.gv at ufl.edu", "subject": "[Radiance-general] Venetian blinds Simulation"}