{"body": "\n\nOn 30 Nov 2008, at 10:38, Per Haugaard wrote:\n\n\nYou can just run gendaylit from the command line to\ntest if it's working. See the man page or the make file\nyou are using for some invocations. That does not tell\nyou whether the output is garbage, though. Perhaps\nthe makefile tests that, too?\n\nAnyway, your error points to a problem with the environment:\nthe makefile can not find oconv in your path. Can you\nrun the command 'oconv' from the command line in the\nsame directory where the makefile is?\n\n\nNow that means you are not allowed to create a file\nin the directory where you are. Do you have write permissions\nin this directory? If you are in the '/opt' branch you will\nhave to use sudo to run these commands. It's better to\ncopy the test files into your home directory and run\nthe tests there.\n\n\n\n'dash' is just another POSIX shell. There should only be\na problem if one of the scripts uses 'bash' syntax and does\nnot ask for bash explicitly in the first line. I don't know much\nabout it (especially the startup procedure) so I can't tell if\nyour $PATH settings are actually read in when you start\na terminal window.\n\nTo test your settings just type 'env' and search for\nthe PATH and RAYPATH settings. If they are incomplete\nor not there at all your .profile is not read when you start\na terminal session. There are some ways to solve this\nbut I'd need to know more about your system for that.\nSo see first if that is (part of) your problem.\n\n\nYou can always install other shells next to the system\nshell. In particular 'csh' (or 'tcsh') is required by some\nRadiance scripts but not installed by default. Just adding\nanother one does not damage your system.\nThe system scripts on Ubuntu should run on 'bash' just as\nwell btw, only somewhat slower.\n\nRegards,\nThomas\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20081130/f0843c83/attachment.html\n", "replyTo": "Subject: [Radiance-general] Gendaylit", "sender": "Thomas Bleicher", "isquestion": false, "tags": [], "id": "<FCA96C8E-1E7E-443A-97AB-C626B5112340@arcor.de>", "refs": ["<242207.16532.qm@web26608.mail.ukl.yahoo.com>"], "datetime": "Sun Nov 30 05:09:05 2008", "email": "tbleicher at arcor.de", "subject": "[Radiance-general] Gendaylit"}