{"refs": ["<CAF-iH4+ZRgssd_L7sTJH=mvoVmV-DNrFHJ7UA-Fdc2A1kvt-fg@mail.gmail.com>", "<CCDBB569.172B9%robert.guglielmetti@nrel.gov>,", "<CAF-iH4KAZ73-YewSszaABR2qnT4k03SkJD1oBiXGwuy=zjxnqw@mail.gmail.com>"], "id": "<FFF56A6D37A3A54F91A03601AC22DA3225FDC07EAC@MAILBOX2.nrel.gov>", "subject": "Re: [Radiance-general] Radiance's optics", "email": "Germ?n Molina Larrain", "body": "\nHi Germ?n,\n\nWhen the software is left to its own devices, it is considering beyond the visible range. You can get radiance and irradiance, and this is the default output. Radiance (the software) is often used for estimating solar resource for PV; applying V-lambda is always a second step that is available, in order to weight the radiometric values to photometric values (luminance or illuminance). I don't do much with radiometric values, but we would like to do more of that in OpenStudio.\n\nPerhaps some others can weigh on with their experience looking beyond visual range.\n\n- Rob\n\n________________________________________\nSent: Wednesday, November 28, 2012 1:26 PM\nTo: Radiance general discussion\nThanks for the quick response Bob!\n\nIt is a little bit clearer now, But. the radiance considered by the software is, then, only the visible part of  the sun's radiance? If I wanted to compute the total solar radiation (including IR and UV). Should I compute (,265*R+.67*...)/vf ; where \"vf\" is the visible fraction of the solar spectrum?\n\n\nThanks Very much!\n\n\n\n2012/11/28 Guglielmetti, Robert <Robert.Guglielmetti at nrel.gov<mailto:Robert.Guglielmetti at nrel.gov>>\nHi Germ?n,\n\nRadiance (the software) does indeed work in radiometric values at its core, and the 179*(blah blah blah) is a valid conversion to illuminance. If you have very saturated colors in your model, I suppose they could throw off the calculation, but I think it'd take a lot to affect the accuracy. That said, this is why I do all of my modeling in greyscale, and use the \"white\" light source color for all electric lights.\n\nThere are a bunch of posts in the archives about this topic, and doing a higher resolution spectral rendering, and the validity of the 179 multiplier (which is somewhat arbitrary, but as long as you use that same multiplier going in each direction, you should be good to go.\n\nRob Guglielmetti\nNational Renewable Energy Laboratory (NREL)\nCommercial Buildings Research Group\n15013 Denver West Parkway MS:RSF202\nGolden, CO 80401\n303.275.4319<tel:303.275.4319>\nrobert.guglielmetti at nrel.gov<mailto:robert.guglielmetti at nrel.gov>\n\n\n\nOn 11/28/12 12:26 PM, \"Germ?n Molina Larrain\" <gmolina1 at uc.cl<mailto:gmolina1 at uc.cl><mailto:gmolina1 at uc.cl<mailto:gmolina1 at uc.cl>>> wrote:\n\nHello Radiancers,\n\nI am a new Radiance user/developer, and I am working on the calculation of Solar Heat Gain through complex fenestration systems. I started learning Radiance some time ago, and just an hour ago, a pretty obvious doubt came to my mind:\n\nIf RADIANCE uses the RGB optical properties (that is, visible spectrum, I suppose); how comes that it calculates the Radiance instead of Illuminance? If the materials change the spectrum of the radiation in every bounce, how is it possible to just use the classic \"179*(0,265*R+0,67*G+0,065*B)\" to compute the illuminance?\n\nTHANKS VERY MUCH\n\nGerm?n Molina\n\nPS: Sorry to bother with rookie questions, but I am the only person in my University using RADIANCE.\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Radiance's optics", "tags": [], "sender": "gmolina1 at uc.cl", "datetime": "Wed, 28 Nov 2012 21:54:52 -0700"}