{"refs": [], "id": "", "subject": "[Radiance-general] Leveraging the Python language in BuildingPerformance Simulation", "email": "info at pythonpoweredbuilding.com", "body": "Message-ID: <CA+9aNUWkTu8uKZ_eABsFj=PJ_wrQLDARvqAcZfpwA2FLbYq23A@mail.gmail.com>\n\nDear simulation community,\n\nThe Python programming language is well known as a powerful tool in\nautomation, scripting, and high performance scientific computing. In our\nexperience, countless hours have been saved in automating building\nsimulation tasks, allowing us to focus more on creating quality building\nmodels and accurate performance results.\n\nWe believe that Python is positioned to make a big difference in the\nbuilding simulation community. To get started, we have the following offer:\nSend us your scripting problems, and we will solve them for you!\n\nIn this phase, we are interested most in small well defined tasks. Example\nproblems would be;\n\n\"In my research, I need to parametrize 100 EnergyPlus files with different\nU-Values\"\n\"We need to convert 1000 files from format *.yyy to format *.qqq\"\n\"Our company produces a report for each project, we use Excel to calculate\nthe average Lux levels from radiance, it's easy but boring after 100\nprojects\"\nOr anything else where you think - \"I wish I had an intern do this for\nme...\" (Maybe you are this intern...)\n\nHelp us by defining your problem with steps taken and the desired result.\nSend them to:\nprojects at pythonpoweredbuilding.com\n\nFor all problems received, we will recommend ideas, methods, and modules.\nWe will furthermore select 3 projects to solve and feature in our Workshop\nduring the Building Simulation 2013 conference in France next August\nhttp://www.bs2013.fr/. We will also feature these problems on our website;\nhttp://www.pythonpoweredbuilding.com.\n\nProblems must therefore be free of any intellectual property and will be\nopen to all. For more information and more about us, please visit\nhttp://www.pythonpoweredbuilding.com. If you are already a convert and want\nto get involved, contact us at\ninfo at pythonpoweredbuilding.com.<info at pythonpoweredbuilding.com>\n\nPlease excuse cross posting, we will direct further updates primarily to\nBLDG-SIM.\n\nHappy simulating,\n\nMarcus Jones, Clayton Miller, and Alan Jackson - Python evangelists\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20121203/19aec106/attachment.html>\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "info info", "datetime": "Mon, 3 Dec 2012 12:57:02 +0100"}