{"refs": [], "id": "", "subject": "[Radiance-general] Leveraging the Python language in BuildingPerformance Simulation", "email": "Robert.Guglielmetti at nrel.gov", "body": "Message-ID: <CCE510C9.178D4%robert.guglielmetti@nrel.gov>\n\nHi Michael,\n\nOne thing I should point out is that OpenStudio has a companion piece,\ncalled the building component library (BCL), which is currently under\ndevelopment. This is a database of \"building model components\" --\neverything from a weather file, to discrete code for describing a piece of\nmechanical equipment, what-have-you. Another element we will have in the\nBCL is \"measures\", which are parametric snippets of code that can step\nthrough a model and modify or perturb different elements of the model,\nconsistently. This speaks to your desire for a consistent database and\ninterface to the various tools, and will also help folks like yourself get\nup and running with scripting a little bit better.\n\nThis issue is no different from the zillions of AutoLISP routines out\nthere for AutoCAD users -- no portal exists to all of these little\nprograms (some of which got subsumed by AutoCAD itself).\n\nI absolutely agree with your first paragraph. We believe the Chicago\npolitics adage \"vote early, and vote often\" can be applied in our field:\n\"model early and often\". Too many energy models are created simply to\ndocument the energy savings for a LEED submittal. OpenStudio is all about\nlightweight models, run rigorously.\n\nAnyway that's my buck and a half on the topic. We should also probably\nmove this thread to the dev list, should it continue (which I hope it\ndoes)...\n\n\nRob Guglielmetti\nNational Renewable Energy Laboratory (NREL)\nCommercial Buildings Research Group\n15013 Denver West Parkway MS:RSF202\nGolden, CO 80401\n303.275.4319\nrobert.guglielmetti at nrel.gov\n\n\n\n\n\n\nOn 12/4/12 11:31 AM, \"Michael Donn\" <Michael.Donn at vuw.ac.nz> wrote:\n\n\n\n\n", "isquestion": false, "replyTo": "<9052C9D8-C9F5-44CE-912E-E894F9921159@vuw.ac.nz>", "tags": [], "sender": "Guglielmetti, Robert", "datetime": "Wed, 5 Dec 2012 15:07:35 -0700"}