{"refs": ["<9052C9D8-C9F5-44CE-912E-E894F9921159@vuw.ac.nz>", "<CCE510C9.178D4%robert.guglielmetti@nrel.gov>"], "id": "<CA+9aNUX=84s2azzqdzvyk63FAfhWiKt7wqDc4hHVv=nRAKDCiQ@mail.gmail.com>", "subject": "[Radiance-general] Leveraging the Python language in BuildingPerformance Simulation", "email": "info at pythonpoweredbuilding.com", "body": "\nHi Radiance list,\n\nI posted also to TRNSYS, BLDG-SIM, E+, ESPR, but so far Radiance listers\nare in the lead for discussion!\n\nWe believe that Python is the best language for \"the community\". Therefore,\nwe are trying to take the first steps in introducing Python to the\ncommunity.\n\nI am digesting a lot of feedback and can see some next steps.\n\nFirst: There are several Large projects out there which are very exciting,\nand I will try to summarize them on our website, and maybe we can assist\nwith some of them in the future. So I can see that one aspect of this\ninitiative will be simply a website which lists these potential ideas and\nmore developed projects and promotes contributions to them, alongside some\n\"getting started\" examples, and how-to-install-python guides.\n\nSo far from Radiance;\nhttp://code.google.com/p/pyrat/\nhttps://sites.google.com/site/tbleicher/radiance/python-radiance\nwww.bozzograo.net/radiance/index.php?module=Downloads&func=view&cid=2&start=0\n\nSecond: We will work on getting some simple example python \"scripts\" using\nRadiance, maybe something from the above sites, just 100 lines, well\ncommented, as getting started examples. (Anyone want to help? I can give\nyou authorship access to the site!)\n\nThird: I believe that Python scripting can benefit any of the users of the\naforementioned lists, a cross community initiative, this is a big\nadvantage. However, I can see, after re-subscribing to 6 lists and sifting\nthrough messages, that the community is rather fragmented. So I will need\nto think about how to build a better network.\n\nOk, that's my thinking-out-loud for now. I'm now also subscribed to the\ndev- list if this discussion is moved.\n\nThanks!\n\n-Marcus\n\n\n\n\n\nOn Wed, Dec 5, 2012 at 11:07 PM, Guglielmetti, Robert <\nRobert.Guglielmetti at nrel.gov> wrote:\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20121207/05f8c301/attachment-0001.html>\n\n", "isquestion": false, "replyTo": "<CCE510C9.178D4%robert.guglielmetti@nrel.gov>", "tags": [], "sender": "Python Projects", "datetime": "Fri, 7 Dec 2012 14:34:30 +0100"}