{"refs": [], "id": "", "subject": "Re: [Radiance-general] colorpict and materialsTo: Radiance general discussion <radiance-general@radiance-online.org>", "email": "Jack de Valpine", "body": "Message-ID: <OJEGILOIGGNAEAODNHIIEEHBCDAA.anthony.farrell@dit.ie>\n\nI am currently carrying out basic validation techniques of the Radiance\nsoftware using a black box and standard 60Watt bulb therein.\n\nI cannot locate a standard incandescent 60W bulb (just bare hung from\nceiling, no lamp shade) on the desktop radiance program.\n\nCan anyone help me by way of an add on file for a standard light bulb (even\nif not 60W!) or refer me to a suitable IESNA file?\n\nKind regards\n\nAnthony\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org]On Behalf Of\nradiance-general-request@radiance-online.org\nSent: 30 June 2004 10:59\nTo: radiance-general@radiance-online.org\n\nSend Radiance-general mailing list submissions to\nradiance-general@radiance-online.org\n\nTo subscribe or unsubscribe via the World Wide Web, visit\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\nor, via email, send a message with subject or body 'help' to\nradiance-general-request@radiance-online.org\n\nYou can reach the person managing the list at\nradiance-general-owner@radiance-online.org\n\nWhen replying, please edit your Subject line so it is more specific\nthan \"Re: Contents of Radiance-general digest...\"\n\n\nToday's Topics:\n\n1. Re: Illuminance calculation on a virtual surface? (gward@lmi.net)\n2. Re: colorpict and materials (Lars O. Grobe)\n3. Re: colorpict and materials (Jack de Valpine)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nTo: rpg@rumblestrip.org,\tRadiance general discussion\n<radiance-general@radiance-online.org>\nMessage-ID: <1088507928.40e1501822b7c@webmail.lmi.net>\nContent-Type: text/plain; charset=ISO-8859-1\n\nOK, Rob -- you got me.  Your little trick would work.  I don't think he\nreally needs it, though, since he already has a method for generating\nthe grid points for rtrace.  He can simply increase the resolution of\nthe grid he already has (as Raphael suggested) and/or upsample the\nresult using pfilt.  Or your method.  All will work.\n\n-Greg\n\nQuoting Rob Guglielmetti <rpg@rumblestrip.org>:\n\n\n\n\n------------------------------\n\nMessage: 2\nMessage-ID: <38C05080-C9C0-11D8-ACAF-000A959DDB22@gmx.net>\nContent-Type: text/plain; charset=US-ASCII; format=flowed\n\nHi,\n\nsorry, so again, I try to be clear in asking this time ;-) By the way,\nhave nice holidays (I hope that's the reason for your travel ;-)!\n\nAll is about the question how to map pictures onto a surface without\ncorrupting its material properties. I understand that colorpict\nmultiplies the material color components with those of the picture.\n\nIf I have a grayscale image processed by normpat (which means that the\naverage gray value is 1.0) and apply it to a material, the overall\ncolor and brightness will remain the same. So I get the \"pattern\" from\nthe image, but the surface still has the correct material properties\n(color, brightness etc). I used this so far.\n\nNow I want to use a colored picture for mapping. I also apply normpat\nto it, so, as far as I understand, the average of all R, G and B must\nbe 1.0, right? For example, I use a normpat'ed picture of green marble.\nI than apply this using colorpict to a surface, which has a \"marble\"\nmaterial. Will the overall color and brightness still be that of the\ndefined material, as the picture map has the average of 1.0?\n\nThe background: I try to use exact data for material definitions, but\nthe image maps can't all be color corrected. So I want the overall\ncolor and brightness from defined materials, e.g. from the plastic\nmaterial, and use the map only for what I would call \"local color\nvariation\". The reason is that I have e.g. red marble, got its color,\nbrightness and all that defined as plastic marble. But the marble has\nblue particles which won't appear if I use a grayscale imagemap. So I\nwant to use a normpat'ed (NOT colorcorrected e.g. by macbethcal!) to\nbring these blue parts onto the surface. The whole surface however must\nstill have the average color of my plastic marble material.\n\nIf I understand the man-page of normpat, that's just what it was\ninvented for. However, I am a bit unsure, as all Radiance documentation\nuses colorpict with a bright white material.\n\nTIA+CU, Lars.\n--\nLars O. Grobe\ngrobe@gmx.net\n\n\n\n\n------------------------------\n\nMessage: 3\nMessage-ID: <40E170F3.9040504@visarc.com>\nContent-Type: text/plain; charset=\"us-ascii\"\n\nHi Lars,\n\nI believe that what you need to do is take your colorpict modifier and\napply it to a material such as a plastic that uses the reflectance of\nyour material sample as the rgb parameters. I believe that you DO want\nto use macbethcal to callibrate the color values of the image and\ndetermine an estimated reflectance. Then using normpat on the image will\nmove the values in image so the average is 1.0.\n\nSo steps as follows:\n\n1. acquire sample material image by photography, scan....\n2. callibrate sample image with macbethcal\n3. use callibrated sample image to estimate average color\n4. calculate reflectance based on average color values, grey(r,g,b)\n5. normpat the callibrated image\n\nThen create material as follows:\n\nvoid colorpict color.image.pattern\n7 red green blue <normpat picture>.pic picture.cal Px Py\n0\n1 <aspect>\n\ncolor.image.pattern plastic color.image.material\n0\n0\n5 <grey(r,g,b)> <grey(r,g,b)> <grey(r,g,b)> <s> <r>\n\nSince the colorpict is normalized to an average value of one, it will\nmodify the plastic around the reflectance of the plastic. For example,\nif colorpict returns 1.1 for red then the red of the plastic will be 10%\nbrighter.\n\nIn short I think that there are two main ways to use colorpict\n\n1. final reflectance set by colorpict image - colorpict is used to\nset final reflectance of material, that is use callibrated image\ncolorpict modifier and material with reflectance of  1.0\n2. final reflectance set by base material - colorpict is used to\nmodify reflectance set by material, that is normpat image\ncolorpict modifier is used to modify reflectance set by material\n\nI hope this is helpful.\n\nRegards,\n\n-Jack\n\nLars O. Grobe wrote:\n\n\n--\n#\tJohn E. de Valpine\n#\tpresident\n#\n#\tvisarc incorporated\n#\thttp://www.visarc.com\n#\n#\tchanneling technology for superior design and construction\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL:\nhttp://radiance-online.org/pipermail/radiance-general/attachments/20040629/d\nb72607e/attachment.html\n\n------------------------------\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\nEnd of Radiance-general Digest, Vol 4, Issue 25\n***********************************************\n\n--\nThis message has been scanned for content and\nviruses by the DIT Information Services MailScanner\nService, and is believed to be clean.\nhttp://www.dit.ie\n\n\n--\nThis message has been scanned for content and\nviruses by the DIT Information Services MailScanner\nService, and is believed to be clean.\nhttp://www.dit.ie\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] RE: 60Watt bulb luminaries data", "tags": [], "sender": "jedev@visarc.com", "datetime": "Tue, 29 Jun 2004 09:38:59 -0400"}