{"refs": [], "id": "<E1BffCB-0007OY-00@saturn.dmu.ac.uk>", "subject": "[Radiance-general] RE: 60Watt bulb luminaries data", "email": "jm at dmu.ac.uk", "body": "\nAnthony,\n\nWait a moment whilst the spots before my eyes subside.  Ah, that's better.\n\n\nThe results you get are likely to depend on the size of the box\nand the type of lamp, not to mention a few other factors.\n\nYou could model the bulb as a luminous sphere.  But you'd have to know\nwhat the luminance of the bulb was.  Also, a sphere light source is not\nsubdivided, i.e. it is sampled by a single ray (p511 RwR).  Which may\ncause problems if the box is small compared to the bulb.  A 'frosted'\nor pearl bulb may have a largely isotropic luminous output, provided you\ndon't see too much of the (luminous) shank where it connects to the\nsocket.  Any measured output distribution (say, IENSA) would, I guess,\nbe sensitive to the type of lamp.  And it would assume a 'point source'\ndistribution, even though you would model it as, say, a disc or polygon.\n\nSquinting at my desk lamp through a pinched-finger aperture (hence the\nspots) revealed that the uniform luminance of the pearl bulb was an\nillusion - much of the output of the bulb is from around the filament.\n\nIn sort, I suspect that any comparison between measurement and predictions\nfor your bulb & box will say much about the precision of the photometry,\nmaybe a little bit about the limitations of single ray light source sampling,\nand not much at all about the intrinsic accuracy of Radiance for realistic\narchitectural scenarios (electric or daylighting).  The direct light source\ncalculation for small angular light sources (e.g. 'spherical' bulb from\nseveral feet away with no occlusion) is pretty much a 'no brainer' and\nRadiance will give a result that is near as dammit to the exact solution.\nWhen you get close up to a non-ideal bulb however, then it's a matter of\ngetting the photometry right.\n\n-John\n\n-----------------------------------------------\nDr. John Mardaljevic\nSenior Research Fellow\nInstitute of Energy and Sustainable Development\nDe Montfort University\nThe Gateway\nLeicester\nLE1 9BH, UK\n+44 (0) 116 257 7972\n+44 (0) 116 257 7981 (fax)\n\njm@dmu.ac.uk\nhttp://www.iesd.dmu.ac.uk/~jm\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "John Mardaljevic", "datetime": "Wed Jun 30 15:32:28 2004"}