{"refs": [], "id": "", "subject": "[Radiance-general] colorpict and materialsReferences: <E5788A0C-CAB7-11D8-9111-000A959DDB22@gmx.net>", "email": "cbauer- at t-online.de", "body": "<40E32EF5.2040600@visarc.com>\nMessage-ID: <40E35356.6020902@t-online.de>\n\nHi Jack, Lars\n\n\nOk, lets jump into the ring :-)\nHmm, maybe Lars want three things at once:\n1) get the physics right\n2) preserve the average color appearance of the material base\n3) add the additional color variation from the map without disturbing\n1+2 in the average..\n\nMaybe this is too much?? Jacks version sounds very solid from a\nscientific point of view, photopic brightness is preserved, and the\noutput is understandable, because of the neutral grey base the colors\ncome out like in the color map in a predictable way.  But the original\ncolor appearance of the base material is lost completely.\n\nOn the other hand, multiplying a color pattern onto a colored base will\nhardly ever produce anything which one expects at first glance, an\nextreme example: if you have a red base with r/g/b = 0.2 / 0.02 / 0.0\nyou can multiply in maps like mad and will never get something blue into\nthe picture.\n\nI think that Lars wants some sprinkles and streaks and dots of blue\nadded to the base here and there, but so little in covered surface, that\nthe average color and thus the brightness of the base does not suffer\nmuch.\n\nWhat about the following: (yeah, again one of my weird ideas:-) edit the\npicture (resp. the red parts of it) with some color tool in an image\nmanipulation program like Gimp such that the average rgb values for the\ndominating parts of the pic are those of the plastic description, then\nit could be used as colorpict to a new plastic with rgb=1/1/1. This new\ncombination will more or less have the same color (in the spatial\naverage) as the original base material, but still look like the pattern.\n\n-cb\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Carsten Bauer", "datetime": "Thu Jul  1 01:06:10 2004"}