{"refs": [], "id": "<19AF752127F1A6488F5F1DA963B237C138EF28@SYDEXC01.global.arup.com>", "subject": "Re: [Radiance-general] colorpict and materialsTo: Radiance general discussion <radiance-general@radiance-online.org>", "email": "Lars O. Grobe", "body": "\nHi Anthony,\n\nA few references re validation of Radiance under daylight conditions:\n\nMardaljevic, J. (1995), Validation of a lighting simulation program under real sky conditions, Lighting Res Technol, 27 (4), 181-188.\nMardaljevic, J. (2000), Daylight simulation: validation, sky models and daylight coefficients, PhD thesis, De Montfort University, Leicester.\nJarvis, D. and Donn, M. (1997), Comparison of computer and model simulations of a daylit interior with reality, Building Performance and Simulation Assoc Conf., Prague.\nFontoynont, M., Laforgue, P., Mitanchey, R., Aizlewood, M.E., Butt, J., Carroll, W., Hitchcock, R., Erhorn, H., De Boer, J., Michel, L., Scartezzini, J.-L., Bodart, M., and Roy, G.G. (1999), Validation of daylighting simulation programs, IEA SHC Task 21, Vaulx-en-Velin.\n\nHopefully you can find some of these.\nCheers,\nPhil.\n\n-----Original Message-----\nSent: Thursday, 1 July 2004 4:47 AM\nTo: radiance-general@radiance-online.org\nJohn\n\nThanks for the useful info.\n\nI had to construct a small black box (0.5 cube) for calibrating electronic sensors I am currently using to monitor a full scale light pipe installation, which in turn will be compared with a Radiance model thereof.\n\nFurthermore, Recent research (Maamari et al. 2003) shows that a cube dark box with an opening central to one of the walls is most appropriate for simulation modelling comparison because reflectance values are minimal and easily measured, and modelling complexities and associated anomalies are minimised. Conventional modelling architectural black/white card display board. The reflectance value for black mounting board was measured by Cannon-Brookes (1996) and is quoted at 8.5%. A standard 60W incandescent light bulb was also fitted to the dark box to fit into the recessed aperture, and was made removable for daylight monitoring whereby the recessed aperture acted as a window or sky light (without glass). I take your points though, that scale will influence the final results, and in absence of good data for the GE 60W standard light bulb I am using, its not good scientific comparison.\n\nAnyway, I am more interested in the accuracy of the program with respect to\n*daylight* rather than electric lighting. To date, I can only locate your own work to the accuracy of the Radiance accuracy with daylight (as in the RwR manual)...\n\nJust on this point....does anyone know of any other references that have compared daylight measurements with Radiance? would be great to include them in my literature review.\n\nIt would be nice to model this simple box I have constructed in two positions = recessed roof light, and recessed side window, facing each orientation on overcast and sunny days. I could then create the model of the box to scale (1=1) in Radiance and compare results with monitored values on the roof of the campus building here in Dublin. What do you think about this? or can you suggest some ways of enhancing the tests?\n\nKind Regards,\n\n\nAnthony\nDublin Institute of Technology\n\n\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org]On Behalf Of radiance-general-request@radiance-online.org\nSent: 30 June 2004 18:05\nTo: radiance-general@radiance-online.org\n\nSend Radiance-general mailing list submissions to\nradiance-general@radiance-online.org\n\nTo subscribe or unsubscribe via the World Wide Web, visit\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\nor, via email, send a message with subject or body 'help' to\nradiance-general-request@radiance-online.org\n\nYou can reach the person managing the list at\nradiance-general-owner@radiance-online.org\n\nWhen replying, please edit your Subject line so it is more specific than \"Re: Contents of Radiance-general digest...\"\n\n\nToday's Topics:\n\n1. RE: 60Watt bulb luminaries data (Anthony J. Farrell)\n2. RE: 60Watt bulb luminaries data (John Mardaljevic)\n3. RE: 60Watt bulb luminaries data (Martin Moeck)\n4. Re: colorpict and materials (Lars O. Grobe)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nMessage-ID: <OJEGILOIGGNAEAODNHIIEEHBCDAA.anthony.farrell@dit.ie>\nContent-Type: text/plain; charset=us-ascii\n\nI am currently carrying out basic validation techniques of the Radiance software using a black box and standard 60Watt bulb therein.\n\nI cannot locate a standard incandescent 60W bulb (just bare hung from ceiling, no lamp shade) on the desktop radiance program.\n\nCan anyone help me by way of an add on file for a standard light bulb (even if not 60W!) or refer me to a suitable IESNA file?\n\nKind regards\n\nAnthony\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org]On Behalf Of radiance-general-request@radiance-online.org\nSent: 30 June 2004 10:59\nTo: radiance-general@radiance-online.org\n\nSend Radiance-general mailing list submissions to\nradiance-general@radiance-online.org\n\nTo subscribe or unsubscribe via the World Wide Web, visit\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\nor, via email, send a message with subject or body 'help' to\nradiance-general-request@radiance-online.org\n\nYou can reach the person managing the list at\nradiance-general-owner@radiance-online.org\n\nWhen replying, please edit your Subject line so it is more specific than \"Re: Contents of Radiance-general digest...\"\n\n\nToday's Topics:\n\n1. Re: Illuminance calculation on a virtual surface? (gward@lmi.net)\n2. Re: colorpict and materials (Lars O. Grobe)\n3. Re: colorpict and materials (Jack de Valpine)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nTo: rpg@rumblestrip.org,\tRadiance general discussion\n<radiance-general@radiance-online.org>\nMessage-ID: <1088507928.40e1501822b7c@webmail.lmi.net>\nContent-Type: text/plain; charset=ISO-8859-1\n\nOK, Rob -- you got me.  Your little trick would work.  I don't think he really needs it, though, since he already has a method for generating the grid points for rtrace.  He can simply increase the resolution of the grid he already has (as Raphael suggested) and/or upsample the result using pfilt.  Or your method.  All will work.\n\n-Greg\n\nQuoting Rob Guglielmetti <rpg@rumblestrip.org>:\n\n\n\n\n------------------------------\n\nMessage: 2\nMessage-ID: <38C05080-C9C0-11D8-ACAF-000A959DDB22@gmx.net>\nContent-Type: text/plain; charset=US-ASCII; format=flowed\n\nHi,\n\nsorry, so again, I try to be clear in asking this time ;-) By the way, have nice holidays (I hope that's the reason for your travel ;-)!\n\nAll is about the question how to map pictures onto a surface without corrupting its material properties. I understand that colorpict multiplies the material color components with those of the picture.\n\nIf I have a grayscale image processed by normpat (which means that the average gray value is 1.0) and apply it to a material, the overall color and brightness will remain the same. So I get the \"pattern\" from the image, but the surface still has the correct material properties (color, brightness etc). I used this so far.\n\nNow I want to use a colored picture for mapping. I also apply normpat to it, so, as far as I understand, the average of all R, G and B must be 1.0, right? For example, I use a normpat'ed picture of green marble.\nI than apply this using colorpict to a surface, which has a \"marble\"\nmaterial. Will the overall color and brightness still be that of the defined material, as the picture map has the average of 1.0?\n\nThe background: I try to use exact data for material definitions, but the image maps can't all be color corrected. So I want the overall color and brightness from defined materials, e.g. from the plastic material, and use the map only for what I would call \"local color variation\". The reason is that I have e.g. red marble, got its color, brightness and all that defined as plastic marble. But the marble has blue particles which won't appear if I use a grayscale imagemap. So I want to use a normpat'ed (NOT colorcorrected e.g. by macbethcal!) to bring these blue parts onto the surface. The whole surface however must still have the average color of my plastic marble material.\n\nIf I understand the man-page of normpat, that's just what it was invented for. However, I am a bit unsure, as all Radiance documentation uses colorpict with a bright white material.\n\nTIA, Lars.\n--\nLars O. Grobe\ngrobe@gmx.net\n\n\n\n\n------------------------------\n\nMessage: 3\nMessage-ID: <40E170F3.9040504@visarc.com>\nContent-Type: text/plain; charset=\"us-ascii\"\n\nHi Lars,\n\nI believe that what you need to do is take your colorpict modifier and apply it to a material such as a plastic that uses the reflectance of your material sample as the rgb parameters. I believe that you DO want to use macbethcal to callibrate the color values of the image and determine an estimated reflectance. Then using normpat on the image will move the values in image so the average is 1.0.\n\nSo steps as follows:\n\n1. acquire sample material image by photography, scan....\n2. callibrate sample image with macbethcal\n3. use callibrated sample image to estimate average color\n4. calculate reflectance based on average color values, grey(r,g,b)\n5. normpat the callibrated image\n\nThen create material as follows:\n\nvoid colorpict color.image.pattern\n7 red green blue <normpat picture>.pic picture.cal Px Py 0\n1 <aspect>\n\ncolor.image.pattern plastic color.image.material 0 0\n5 <grey(r,g,b)> <grey(r,g,b)> <grey(r,g,b)> <s> <r>\n\nSince the colorpict is normalized to an average value of one, it will modify the plastic around the reflectance of the plastic. For example, if colorpict returns 1.1 for red then the red of the plastic will be 10% brighter.\n\nIn short I think that there are two main ways to use colorpict\n\n1. final reflectance set by colorpict image - colorpict is used to\nset final reflectance of material, that is use callibrated image\ncolorpict modifier and material with reflectance of  1.0\n2. final reflectance set by base material - colorpict is used to\nmodify reflectance set by material, that is normpat image\ncolorpict modifier is used to modify reflectance set by material\n\nI hope this is helpful.\n\nRegards,\n\n-Jack\n\nLars O. Grobe wrote:\n\n\n--\n#\tJohn E. de Valpine\n#\tpresident\n#\n#\tvisarc incorporated\n#\thttp://www.visarc.com\n#\n#\tchanneling technology for superior design and construction\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL:\nhttp://radiance-online.org/pipermail/radiance-general/attachments/20040629/d\nb72607e/attachment.html\n\n------------------------------\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\nEnd of Radiance-general Digest, Vol 4, Issue 25\n***********************************************\n\n--\nThis message has been scanned for content and viruses by the DIT Information Services MailScanner Service, and is believed to be clean.\nhttp://www.dit.ie\n\n\n--\nThis message has been scanned for content and viruses by the DIT Information Services MailScanner Service, and is believed to be clean.\nhttp://www.dit.ie\n\n\n\n\n------------------------------\n\nMessage: 2\nMessage-ID: <E1BffCB-0007OY-00@saturn.dmu.ac.uk>\nContent-Type: TEXT/plain; charset=us-ascii\n\nAnthony,\n\nWait a moment whilst the spots before my eyes subside.  Ah, that's better.\n\n(even\n\nThe results you get are likely to depend on the size of the box and the type of lamp, not to mention a few other factors.\n\nYou could model the bulb as a luminous sphere.  But you'd have to know what the luminance of the bulb was.  Also, a sphere light source is not subdivided, i.e. it is sampled by a single ray (p511 RwR).  Which may cause problems if the box is small compared to the bulb.  A 'frosted'\nor pearl bulb may have a largely isotropic luminous output, provided you don't see too much of the (luminous) shank where it connects to the socket.  Any measured output distribution (say, IENSA) would, I guess, be sensitive to the type of lamp.  And it would assume a 'point source'\ndistribution, even though you would model it as, say, a disc or polygon.\n\nSquinting at my desk lamp through a pinched-finger aperture (hence the\nspots) revealed that the uniform luminance of the pearl bulb was an illusion - much of the output of the bulb is from around the filament.\n\nIn sort, I suspect that any comparison between measurement and predictions for your bulb & box will say much about the precision of the photometry, maybe a little bit about the limitations of single ray light source sampling, and not much at all about the intrinsic accuracy of Radiance for realistic architectural scenarios (electric or daylighting).  The direct light source calculation for small angular light sources (e.g. 'spherical' bulb from several feet away with no occlusion) is pretty much a 'no brainer' and Radiance will give a result that is near as dammit to the exact solution.\nWhen you get close up to a non-ideal bulb however, then it's a matter of getting the photometry right.\n\n-John\n\n-----------------------------------------------\nDr. John Mardaljevic\nSenior Research Fellow\nInstitute of Energy and Sustainable Development De Montfort University The Gateway Leicester\nLE1 9BH, UK\n(0) 116 257 7972\n(0) 116 257 7981 (fax)\n\njm@dmu.ac.uk\nhttp://www.iesd.dmu.ac.uk/~jm\n\n\n\n\n------------------------------\n\nMessage: 3\n<radiance-general@radiance-online.org>\nMessage-ID:\n<84F05BA9118BBD4A8FC6409808CE266C113AE1@ENGRMAIL2.engr.psu.edu>\nContent-Type: text/plain; charset=\"utf-8\"\n\nAnthony,\n\nYou can download an IES photometric file for a PAR 60W incandescent narrow flood from Osram Sylvania at\n\nwww.personal.psu.edu/mum13/60PAR30.CAP.NFL25.ies\n<http://www.personal.psu.edu/mum13/60PAR30.CAP.NFL25.ies>\n\nUse  \"ies2rad 60PAR30.CAP.NFL25.ies\"\n\nThis will create the file \"60PAR30.CAP.NFL25.rad\" in metric units (meters).\n\nI never saw photometric files for simple incandescent lamps.\n\nI am currently running a fairly accurate simulation in AGI32 V1.7, which will complete in 3 hours for a simple empty box 3X3X3 meters and one PAR lamp.\n\nMartin Moeck, Penn State\n\n\n\n-----Original Message-----\nSent: Wed 6/30/2004 7:42 AM\nTo: radiance-general@radiance-online.org\nCc:\n\n\nI am currently carrying out basic validation techniques of the Radiance\nsoftware using a black box and standard 60Watt bulb therein.\n\nI cannot locate a standard incandescent 60W bulb (just bare hung from\nceiling, no lamp shade) on the desktop radiance program.\n\nCan anyone help me by way of an add on file for a standard light bulb (even\nif not 60W!) or refer me to a suitable IESNA file?\n\nKind regards\n\nAnthony\n\n\n\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: not available\nType: application/ms-tnef\nSize: 5190 bytes\nDesc: not available\nUrl :\nhttp://radiance-online.org/pipermail/radiance-general/attachments/20040630/0\n51f97e3/attachment-0001.bin\n\n------------------------------\n\nMessage: 4\nMessage-ID: <E5788A0C-CAB7-11D8-9111-000A959DDB22@gmx.net>\nContent-Type: text/plain; charset=US-ASCII; format=flowed\n\nHi Jack,\n\nthank You for the reply.\n\n\nI want to do this, I have the material values, the colorpict is just to add some visual credibility ;-) But I also want to have the final overall (that means the average over the whole surface, like selecting an area in ximage vs. a point) color from the base material.\n\n\nSo, if I already have the rgb for the base material (which is plastic), do I really have to calibrate (macbethcal) the picture map?\n\nMaybe I show you an example:\n--\n# porphyry red 1: values from ximage and macbethcal'ed pic void plastic porphyry_red_1 0 0\n5 .09 .06 .05 .02 0\n\n# non-calibrated normpat'ed pic\nvoid colorpict sophia_porphyry_red_1_pattern\n13 noop noop noop sophia_porphyry_red_1.pic picture.cal tile_u tile_v -s .2 -rx 90 -rz 90 0 0\n\n# give alias the modifier as output from dxf2rad sophia_porphyry_red_1_pattern alias l_porphyry_red_1 porphyry_red_1\n--\nWill this be correct?\n\nTIA, CU Lars.\n--\nLars O. Grobe\ngrobe@gmx.net\n\n\n\n\n------------------------------\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\nEnd of Radiance-general Digest, Vol 4, Issue 26\n***********************************************\n\n--\nThis message has been scanned for content and viruses by the DIT Information Services MailScanner Service, and is believed to be clean.\nhttp://www.dit.ie\n\n\n--\nThis message has been scanned for content and viruses by the DIT Information Services MailScanner Service, and is believed to be clean.\nhttp://www.dit.ie\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "grobe@gmx.net", "datetime": "Wed, 30 Jun 2004 20:06:58 ?"}