{"body": "\nShortly after PMAP was released I messed about with it to try and\nunderstand what the numbers all meant and to see what you had to do to\nget accurate results.  I have cut down a presentation I created to\nprovide 4 slides of the process I went through to get appropriate images\nand numbers.  Not very scientific to be honest but perhaps a starting\npoint for further study.\n\nI will go and have another look at the same model with alternative\nsuggestions for the three variables if you have any.  Although I may\nalready have the results as only some of them are included here.\n\nRegards\n\nAndrew\n__________________________\nAndrew Bissell\nB.Eng(Hons) C.Eng MSLL MCIBSE MIET\nAssociate Lighting Designer\nCundall Light4\nDirect: 0161 200 1235\nMobile: 07899 907 978\nOffice: 0161 244 5660\nP Please consider the environment before printing this e-mail\n-----Original Message-----\n[mailto:radiance-general-bounces at radiance-online.org] On Behalf Of Lars\nO. Grobe\nSent: 04 December 2008 08:01\nTo: radiance-general at radiance-online.org\nHi list!\n\nWhile I am trying this on Radzilla now (as there is no photon-mapping\navailable in Radiance-3.9 at the time of this writing), I am pretty sure\nthat the effects I get are not related to Radzilla but on the way I use\nthe pmap-System.\n\nI am trying to model a simple, highly specular horizontal light duct,\nwith a rectangular cross-section (yes I know that in THIS case I could\nuse the mirror material and Radiance, but I will go for non-planar\nsurfaces later).\n\nNow either I get very splotchy luminance images in the inside, or,\nincreasing the `bandwith` to rather high values, have a blurry result\nwith - and this is the problem - light leaving the geometry even though\nit is closed (the duct has a 45 degree mirror at its end that should\nactually close it, but the sides extend besides the mirror and appear\nilluminated even behind it).\n\nI am working with an initial photon count for both global and caustic\nphotons of 2.000.000 and a bandwith value of 2000 at the moment.\n\nIs it possible to get such systems rendered in a way that I have both a\nsmooth luminance and no light escaping the geometry?\n\nIs there any source for a starting point in what way rtcontrib could be\nused for modeling such systems? I know the qt-movie from the workshop,\nbut I did not get it - and it seams that I know noone except Greg who\ngot it so far ;-)\n\nThank You & CU, Lars.\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: 20071204_apb_LightpipeStudy_Part_rev04.pdf\nType: application/octet-stream\nSize: 337904 bytes\nDesc: 20071204_apb_LightpipeStudy_Part_rev04.pdf\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20081204/8e492a18/attachment-0001.obj>\n\n", "replyTo": "Subject: [Radiance-general] experiences with the photon map", "sender": "radiance-general-bounces at radiance-online.or", "isquestion": false, "tags": [], "id": "<9C59B39CBDAE8A42AC6F2500AB54504E0105EE26@cjpnemail.cjp.co.uk>", "refs": ["<49378E3A.8050803@gmx.net>"], "datetime": "Thu, 04 Dec 2008 10:13:25 -0000", "email": "radiance-general-bounces at radiance-online.org", "subject": "[Radiance-general] experiences with the photon map"}