{"refs": ["<4DEF4B1B.60406@st-andrews.ac.uk>"], "id": "<51079815.3030207@st-andrews.ac.uk>", "subject": "[Radiance-general] Rendering for off-centre presentation in a VR la", "email": "p.g.lovell at st-andrews.ac.uk", "body": "\nHi Everyone,\n\nI'm attempting to use Radiance to generate images for presentation in a\nlarge VR space - the system currently uses a game-engine but I'm not\nhappy with the quality of the rendering as I'm interested in the visual\nperception of shadows and shading.\n\nThe space* is approximately a 6x6x2metre volume with a stereo\n(polarized) screen at one end, the screen is roughly 6x2 metres.\n\n\nI want to present a rendered scene as if it lies behind the screen, i.e.\nthe screen is a window through which we view a rendered object. The\nviewer can then walk through the space and I can present updated views\nrelative to the current viewing location (I have 6 DOF head tracking).\nObviously this requires a lot of offline rendering and a relatively\nnarrow movement range - just to cut the rendering overhead.\n\nIt's easy enough to see how I might render images for presentation when\nviewer and the viewing target are positioned centrally within the world,\ni.e. looking straight forward towards the middle of the screen. What I\ndon't understand is how I render scenes for when the viewer has move\noff-centre to left or right. Firstly, perspective is going to make one\nside of the screen smaller than the other, I'd need to correct this so\nthat the screen image fits on the actual screen.\n\nI think I could build-in some markers that denote the corners of the\nlarge VR screen, then stretch the image so that these markers lie on the\ncorners of the screen - this seems a little clumsy.\n\nIs there a better way?\n\nGeorge\n\n\n*<http://www.abertay.ac.uk/about/news/pickoftheweek/2010/name,5454,en.html>\n\n\n\n--\nDr P. George Lovell,\n\nLecturer in Psychology\nUniversity of Abertay Dundee\nDundee\nDD1 1HG\n\nTel 01382-308581\nFax 01382-308749\n\nResearcher/Co-investigator,\nSchool of Psychology, University of St Andrews\n\nRM 2.01 (The Tower Room).\nPhone      (01334) 462085\n\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Rendering for off-centre presentation in a VR lab", "tags": [], "sender": "P George Lovell", "datetime": "Tue, 29 Jan 2013 09:36:21 +0000"}