{"refs": [], "id": "", "subject": "[Radiance-general] Randance and different sky descriptions", "email": "Robert.Guglielmetti at nrel.gov", "body": "Message-ID: <CD551C1A.1AE8E%robert.guglielmetti@nrel.gov>\n\nWow, thanks for this investigation, Zack! Replies below.\n\nOn 2/28/13 1:58 PM, \"Zack Rogers\" <zrogers at daylightinginnovations.com<mailto:zrogers at daylightinginnovations.com>> wrote:\n\nHere are the numbers I get for a Boulder, CO equinox clear and sunny sky at noon from TMY2 weather data, IES_gensky, and gensky\nWeather data = 7,893fc\nIES_gensky (5,000elev) = 9,416fc\nIES_gensky (0) = 8212fc\ngensky = 5823fc\n\nWow, that's quite a spread. Might be interesting to throw in an \"ideally clear\" day using the Perez model and see where that ends up on this continuum -- and then go from there, because clearly this should be discussed further.\n\nYou should be able to find an ideally clear direct normal/diffuse horizontal pair of values hovering around the Equinox for Boulder in the TMY/EPW set. When you see something like a 10:1 ratio between the direct normal and the diffuse horizontal irradiance, you can bet you're looking at a cloudless sky ? certainly an unobscured sun, and vice-versa for a Portland/Seattle (er, overcast) sky.  See this link for example:\n\nhttps://www.dropbox.com/s/ri505ka29rr6knq/perez_skies.pdf\n\nThis is for Summer Solstice, but you get the idea. Somewhere near the Equinox there should be a day where this 10:1 ratio is evident, and you could use that day and value pair with gensky, IES_gensky, and gendaylit and see what you get. Since gensky can also take these values as input (and presumably so can IES_gensky but I'm not certain), this might give us more of an \"apples to apples\" comparison. Also when using direct input of irradiance, you obviously don't want to use the cool elevation correction in IES_gensky, since the actual elevation of the instrumentation handles this for you. =)\n\n- Rob\n\n\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Randance and different sky descriptions", "tags": [], "sender": "Guglielmetti, Robert", "datetime": "Thu, 28 Feb 2013 15:13:17 -0700"}