{"refs": [], "id": "<AE2C06A5D4A79244AA0AB930A5BFD04B147FDCC6@ITSMBX-3.lunet.lboro.ac.uk>", "subject": "[Radiance-general] Randance and different sky descriptions", "email": "J.Mardaljevic at lboro.ac.uk", "body": "\nHi Zack,\n\nI was completely bemused by the original LEED 2.2 'clear sky' option when I first read it.  Whatever may have been intended, since no supplementary data were given, prospective users have had to guess what the formulators of the option had in mind.  I believe that one or more commercial software packages do indeed predict for a clear sky without sun when the 'clear sky' option is selected.  To my mind, the ASHRAE option, which allows the user to select either clear or overcast skies, makes matters worse rather than better.  The draft LEED v4.0 is definitely a step in the right direction -- or, at least, the part where the evaluation is founded on a full year.  However, you are right to flag that simulating blind control is a big (think: really HUGE) issue since so much of the outcome depends on the initial assumptions.  The accurate evaluation of blinds is doubly confounded: once by the uncertainty regarding when users lower blinds and by how much; and, secondly by the huge sensitivity of blind photometric properties (BSDF) to relatively subtle (and largely unpredictable) users tweaks of, say, the slat-tilt.\n\nI believe we also share the concern that the draft formulation might do little, if anything, to encourage the selection of an effective static shading design over a floor-to-ceiling glass box with blinds.\n\nRadiance-general might no be the most appropriate place to have these issues aired/debated, but I'm not aware that it's happening anywhere else.  Also, Radiance, or rather gensky, seems to be being replied upon to perform a task for which it was never designed, i.e. generating 'snap-shot' sky conditions for compliance purposes.\n\nCheerio\nJohn\n\nJohn Mardaljevic PhD FSLL\nProfessor of Building Daylight Modelling\nSchool of Civil & Building Engineering\nLoughborough University\nLoughborough\nLeicestershire\nLE11 3TU, UK\n\nTel: +44 1509 222630 (Direct)\nTel: +44 1509 228529 (Pam Allen, secretary)\n\nj.mardaljevic at lboro.ac.uk<mailto:j.mardaljevic at lboro.ac.uk>\nhttp://www.lboro.ac.uk/departments/cv/staff/profile/367.html<http://www.lboro.ac.uk/departments/cv/>\n\nPersonal daylighting website:\nhttp://climate-based-daylighting.com<http://climate-based-daylighting.com/>\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20130228/6831959a/attachment.html>\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "John Mardaljevic", "datetime": "Thu, 28 Feb 2013 22:40:19 +0000"}