{"body": "\nThanks Jack.\n\nAll seems clear and I've got some results that I'm pretty happy with.  One thing I'm still a little unclear about is how you would apply a low-e film to a non-clear glass (i.e. tinted green, blue, etc) if the script requires one surface to be \"clear\" for each pane.\n\nFor example:\nVE2-2M (http://www.viracon.com/makeupsheet.php?id=3840) has the VE-2M coating applied to Evergreen glass on the #2 surface.  As it is now, I would input:\nSurface 1 - Clear\nSurface 2 - VE2-2M on evergreen (from optics 5 data)\nSurface 3 - Clear\nSurface 4 - Clear\n\nIs there an easy hack to make Surface 1 evergreen instead of clear?\n\nThanks,\nGalen\n\n\n-----Original Message-----\nTo: Galen Burrell <Galen.Burrell@arup.com.au>\nCc: Radiance general discussion <radiance-general@radiance-online.org>\nContent-Type: text/plain; charset=\"iso-8859-1\"\n\nHi Galen,\n\nNo problem.\n\nRegarding the header\n\n* Rc<r,g,b> - these are the rgb components for the reflectance on\nthe \"coated\" side of the monolithic glass\n* Rg<r,g,b> - these are the rgb components for the reflectance on\nthe non-coated side of the monolithic glass\n* T<r,g,b> - these are the rgb components for the transmittance for\nthe monolithic glass\n* Part - this is a boolean value\no 0 means this is a regular glass\no 1 means this is a frit - if this is the case the \"coated\"\nside reflectance needs to represent the reflectance of the\nfrit at 100% coverage which should be possible to extract\nfrom the glazing manufacturer\n\nThe RGB values are extracted from the file generated for a \"radiance\"\nexport from Optics. This should be for a single pane monolithic glass\ndescription (not a multi-layer make-up). The file will have three\nRadiance material definitions, the two BRDTfunc definitions are the ones\nto pay attention to. The makeup is something like the following:\n\nvoid BRTDfunc some.glass.front\n10\n\nRfr Rfg Rfb\nTr Tg Tb\n0   0   0\n.\n\n9 0 0 0 0 0 0 0 0 0\n\nvoid BRTDfunc some.glass.back\n10\n\nRbr Rbg Rbb\nTr Tg Tb\n0   0   0\n.\n\n9 0 0 0 0 0 0 0 0 0\n\nSo you need to take the two rgb triples for reflectance and one for\ntransmittance. So an entry in the data file could look like this (you\nwill need to figure which represents the coated side if needed):\n\nSurface Tr      Tg      Tb      Rcr     Rcg     Rcb     Rgr     Rgg     Rgb     Part\n<name>  Tr  Tg      Tb      Rfr     Rfg     Rfb     Rbr     Rbg     Rbb     0\n\n\n\nA file for a double pane insulating unit might look like the following:\n\nSurface Tr      Tg      Tb      Rcr     Rcg     Rcb     Rgr     Rgg     Rgb     Part\ngreen-lowe  Tr      Tg      Tb      Rfr     Rfg     Rfb     Rbr     Rbg     Rbb     0\n\n\nThe glaze script contains a default \"clear\" glass. I seem to recall that\nthis is required for the script to output a material description (eg it\nmust have a \"clear\" glass description\"). If this is not suitable the\nscript requires some modification, which I think I can offer some\nguidance on so that you can include your own \"clear\" glass description.\n\nI would suggest before you do anything else you should test out the\nscript as is with the built in values. This will let you see how it\nworks. You will assign different materials to different layers to build\nup the composite unit.\n\nTry it out and let me know if you have more questions.\n\n-Jack\n\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n\n\n", "replyTo": "Subject: [Radiance-general] Re: Glazing transparency/reflectivity study", "sender": "jedev@visarc.com", "isquestion": false, "tags": [], "id": "<496FEBCA.70906@visarc.com>", "refs": ["<SYDEXC02D7Fjm0fwYdk000035c5@sydexc02.global.arup.com>"], "datetime": "Thu, 15 Jan 2009 21:07:06 -0500", "email": "Jack de Valpine", "subject": "[Radiance-general] Re: Radiance-general Digest, Vol 59, Issue8"}