{"refs": [], "id": "", "subject": "[Radiance-general] RE: Radiance accuracy: comparison with AGI32 V1.7", "email": "Giulio.Antonutto at arup.com", "body": "Message-ID: <DC0CAEEA090E984C911D3B85B16C3F90FAF680@l-gnts05>\n\nMartin,\n\nI still think that you speak about differences and not error (even if you\nquote the relative error formula): you are comparing Radiance with AGI, not\nRadiance with Reality.\nIn this sense what about translucent fabrics or arbitrary BDTRFs, in future\nyou should consider also these materials in your comparison to be exhaustive\n(**)...\nIf you think about that, what does it means \"accuracy\" when you are not able\nto model the majority of the real life instances and you are forced to\nassume a huge amount of restriction (purely lambertian, omidirectional....)?\nYou may argue that the differences aren't so big...    but as there are\ndifferences the results are still subject to accuracy.\nDo you need  a program that is less precise but more general or a program\nthat is really precise but very specialized?\n\nAbout the comparison itself:\nI still think that it would be worthy to try others radiance settings, may\nbe quicker even if not as accurate as yours (you use a very high value of\n-ar, while you use the default -aa, not necessarily wrong or bad, just a\nlittle unusual to me).\nThere is a formula to estimate the -ar value you need depending on the scene\ncomplexity (see RWR), although I am pretty sure that you know it already.\nIf you do not want to spend a huge amount of time, you can always do the\ncalcs with rtrace without picture (there is an example in RWR).\nThese of course are only suggestions, this is your research.\n\nI agree with you (**) that an easy start consists in checking a program with\nsimple scenarios in order to find main limitations and bugs, I just believe\nRadiance has gone further than that and it's time to define what does it\nmean to validate a program;\nOf course this is true only if we want to move to the next step.\n\nthanks for your quick reply,\nregards,\ngiulio\n\n\n\n___________________________________________________________________\nElectronic mail messages entering and leaving Arup business\nsystems are scanned for acceptability of content and viruses.\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20040707/81a8ad84/attachment.html\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Giulio Antonutto", "datetime": "Wed Jul  7 18:47:21 2004"}