{"refs": ["<DE46D9B5CE328142B74007B522D5E6FA1CB8A458@XSERVER22B.campus.tue.nl>"], "id": "<5154EB42.9090102@gmx.net>", "subject": "[Radiance-general] Could RTRACE produce two outputs (picturand values)?", "email": "grobe at gmx.net", "body": "\nHi Mirjam,\n\npixel values in a hdr file are nothing but binary-coded triplets of\nirradiance data in three channels (RGB) if you render your irradiance\nhdr image. If you have an image file containing these illuminance\nvalues, you can extract the data to e.g. ASCII columns using pvalue -o\nOutcome.hdr. pvalue does not interpret the data and thus does not care\nabout it being irradiance or radiance, it just converts between codings.\nThe -o makes sure to use the original pixel values in case any exposure\ncorrection had been appiled (uncommon with irradiance maps).\n\nThe advantage in using a sensor grid, not an image, to calculate\nilluminance is that you would typically use a rather coarse grid, with\nless sensor locations to be calculated. This saves time per sensor,\nallowing higher accuracy at each location. So you may prefer very high\nambient settings for a 10 x 10 sensor grid over a 1024x1024 pixel image,\nwhich may force you to reduce the accuracy. This assumes that you do not\nloose relevant information from the reduced resolution (e.g. a sensor\nmay happen to be shadowed by a thin frame, which would lead to\nunderestimates if interpolation between sensor values is applied).\n\nYou can also use pvalue -r to create a hdr image from your ASCII columns\nof irradiance / radiance values. In that case, some information on the\nx/y dimensions must be given.\n\nOf course, recoding pixel values does not allow you to translate\nirradiance into radiance or vice versa...\n\nCheers, Lars.\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20130329/5d111b23/attachment.html>\n\n", "isquestion": false, "replyTo": "<DE46D9B5CE328142B74007B522D5E6FA1CB8A458@XSERVER22B.campus.tue.nl>", "tags": [], "sender": "Lars O. Grobe", "datetime": "Fri, 29 Mar 2013 02:15:46 +0100"}