{"refs": ["<84F05BA9118BBD4A8FC6409808CE266C113B14@ENGRMAIL2.engr.psu.edu>"], "id": "<003401c46450$5ef60800$0101a8c0@eclipse>", "subject": "[Radiance-general] RE: Radiance accuracy: comparison with AGI32V1.7", "email": "\"Martin Moeck\"", "body": "\nHi Martin,\n\nthis is  interesting topic for me..\n\nId like to make identical scenes in Lightscape and 3ds max (using both\nradiosity and mental ray) for the sake of comparisons.\n\nIs it possible for you to send me (privately if you want) the IES file of\nthe lamp used in your tests?  I am curious to see how theses  products\nperform with the same data.\n\nRegards,\n\nPierre-Felix Breton\nLighting consultant\n\n(and Discreet 3d R&D designer)\n----- Original Message -----\nTo: \"Radiance general discussion\" <radiance-general@radiance-online.org>\nSent: Wednesday, July 07, 2004 1:20 PM\n\n\nAGI32 V1.7\nquote the relative error formula): you are comparing Radiance with AGI, not\nRadiance with Reality.\none modeled here, is \"correct\", if you are happy with a dense surface mesh.\nInsofar, AGI32 is correct, since it solves the radiosity matrix (almost),\nwhereas software using Monte Carlo techniques such as Radiance are\nestimation tools for complex problems. Therefore, Radiance is an excellent\ntool to help lighting folks estimate the lighting distribution in complex\nenvironments, not calculate it.\none diffuse source for verification purposes. You can't do it unless you use\nan integrating sphere for the source. Try to make a surface black. Again,\nyou can't do it unless you use caves or holes lined with black material. The\neffort is tremendous.\nfuture you should consider also these materials in your comparison to be\nexhaustive (**)...\nable to model the majority of the real life instances and you are forced to\nassume a huge amount of restriction (purely lambertian, omidirectional....)?\nestimated, whereas simple models have characteristics that are mostly known.\nThat makes accurate calculation of real life instances not possible.\nOtherwise, we could predict the future.\ndifferences the results are still subject to accuracy.\nthat is really precise but very specialized?\nbe quicker even if not as accurate as yours (you use a very high value\nof -ar, while you use the default -aa, not necessarily wrong or bad, just a\nlittle unusual to me).\nscene complexity (see RWR), although I am pretty sure that you know it\nalready.\ncalcs with rtrace without picture (there is an example in RWR).\nmost important parameters for interreflection estimation are the number of\nambient bounces, and the ambient density -ad.\nwith simple scenarios in order to find main limitations and bugs, I just\nbelieve Radiance has gone further than that and it's time to define what\ndoes it mean to validate a program;\ndoes not really matter if they are complex or simple scenarios. However, we\ncannot validate very complex scenarios since we don't have enough accurate\nsensors and data.\n\n\n----------------------------------------------------------------------------\n----\n\n\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "MMoeck@engr.psu.edu", "datetime": "Wed Jul  7 20:29:52 2004"}