{"body": "\nHi,\n\nI am running into problems due to the lack of csg in radiance. I need to\naccurately model a tube with a very specular material, which is bent.\nThe real tube is produced by cutting a cylinder under 22.5 degree and\nassembling it, leading to a nice 45degree angle with one ellyptical\nedge. As I am not able to cut a cylinder geometry in radiance, I have\nmodeled it as a mesh, but the specularity leads to visible edges.\n\nI have been sonsidering several solutions so far:\n\n1) Using antimatter to cut away parts of the cylinder would probably not\nwork, as the second cylinder, which also has to be cut, would lead to\ntwo overlapping antimatter volumes.\n\n2) Refining the mesh would result in huge geometry, as the segments\nwould become thinner while keeping their length, this would lead to a\nreal worst case for oconv. Also to make the edges disappear, I would\nhave to get into dimensions where one facet should not take much more\nthen one pixel in the final rendering.\n\n3) Using \"smooth\" surface normals would lead to an visual improvement.\nBut I have my doubts if these would be considered for photon mapping and\nespecially caustics? In my setup, the pipe ends with a diffusor\n(currently modeled as a box modified by a rather generic trans\nmaterial). I would expect caustic effects to become visible caused by a\nround tube geometry with very high specularity.\n\n4) The last option I see is using a cylinder object with a mixfunc\nmodifier and a simple cal file containing just the line\n\ncondition=if(Pz-Px,1,0);\n\nto cut my geometry in 45 degrees, using void to get parts of the\ngeometry invisible. Would that work with overlapping geometries (which\nwould still exist, even if invisible), and would it be relieable with\nthe pmap extension? The main disadvantage here is that I would have to\nmaintain an extra set of geometry for radiance, while I could use\nconverters to import from other programs so far.\n\nCU Lars.\n\n", "replyTo": "", "sender": "Lars O. Grobe", "isquestion": true, "tags": [], "id": "<498BE4F6.70600@nus.edu.sg>", "refs": [], "datetime": "Thu Feb  5 23:21:29 2009", "email": "akilog at nus.edu.sg", "subject": "[Radiance-general] Cutting a cylinder,or modeling smooth geometry..."}