{"refs": ["<FFF56A6D37A3A54F91A03601AC22DA3226112314A0@MAILBOX2.nrel.gov>", "<CAF-iH4LVzSrQcAhVCUnRZo_NqROpQqMjqFAdOCKnJPGaPhtJqA@mail.gmail.com>"], "id": "<FFF56A6D37A3A54F91A03601AC22DA3226111C7CB2@MAILBOX2.nrel.gov>", "subject": "[Radiance-general] Modeling the real world for lighting analysis.Dear List,", "email": "Germ?n Molina Larrain", "body": "\nWell, it's a good start, and it keeps things simpler, anyway.\n\n- Rob\n\nSent: Monday, April 29, 2013 2:28 PM\nTo: Radiance general discussion\nhaha, I know things are not free.\n\nSo, basically using grey diffusing materials with relatively correct reflectivity would be great for achieving good numbers?\n\nTHANKS FOR THE ANSWER\n\nGerman\n\n2013/4/29 Guglielmetti, Robert <Robert.Guglielmetti at nrel.gov<mailto:Robert.Guglielmetti at nrel.gov>>\nHi German,\n\nYeah, modeling materials can be tricky, particularly if you want accuracy. Life is not always fair, you get what you pay for, and there's also no such thing as a free lunch, either. =)\n\nFor me, doing relative studies of architectural scenes, it's always made sense to keep things simple which does mean keeping color out of the equation (both for materials and light sources), and using generally diffuse materials (which is really the majority of architectural materials that cover broad expanses of interior spaces). When specularity is a critical component of a surface, such as in light redirecting materials, I resort to BSDFs or other means of describing the light scattering (photometric distribution file resulting from light forwards ray tracing exercise, usually).\n\nSome amazing things can be done with textures and patterns to enhance the realism of a rendering, but I'm generally more interested in numbers so I have not played with those too much. I can tell you that you are automatically introducing more variables to the physical definition of the surface to which you are applying those textures and patterns, so tread carefully.\n\nMaterial definition has been discussed at length on this list, so I'd search the archives. Also check out Carsten Bauer's amazing textures and patterns from his Workshop talk in 2002 (linked on the Radiance-online.org website) for inspiration as to what's possible with textures, patterns, and the Radiance functional language -- sick stuff!\n\n-Rob\n\n\n\nRob Guglielmetti\nNREL Commercial Buildings Research Group\nGolden, CO 80401\nrobert.guglielmetti at nrel.gov<mailto:robert.guglielmetti at nrel.gov>\n\n\n-----Original Message-----\nSent: Friday, April 26, 2013 09:46 AM Mountain Standard Time\nTo: Radiance general discussion\n\nI am a starter on the use of Radiance, and I have some doubts about the modeling (of the real world, as it always is, in engineering at least). I have heard that material reflectivity is a very important parameter that. How important are:\n\n- Color (I am pretty sure I read something in this list about grey-world simulations... I think it was Rob).\n- Textures\n- Specularities\n- Patterns\netc.\n\nMy concern is that defining materials is actually not a very easy task, so I just wanted to know what are the most important things here.\n\nTHANKS VERY MUCH!\n\nGerman\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20130429/9fb7bee1/attachment.html>\n\n", "isquestion": false, "replyTo": "<CAF-iH4LVzSrQcAhVCUnRZo_NqROpQqMjqFAdOCKnJPGaPhtJqA@mail.gmail.com>", "tags": [], "sender": "gmolina1 at uc.cl>", "datetime": "Mon, 29 Apr 2013 14:51:03 -0600"}