{"body": "\nYou can download and view an information sheet describing the\ncharacteristics of a specifically engineered dichroic film at:\nhttp://www.mmm.com/about3M/technologies/lightmgmt/pdf/dfa-50-88.pdf\n\nBasically, the film is spectrally selective, and only transmits light\nat very specific wavelengths, and reflects all other wavelengths as if\nit were a mirror.  Depending on the incident angle of light in\nrelationship to the surface, a different wavelength (within the band\nthat the film transmits) is transmitted.  For instance, imagine a white\npiece of paper directly below a light source, and you were holding a\ndichroic film between the light and the paper.  As you incline and\ndecline the film, the color transmitted through the film changes (in\nthe specific example at the url above, from purple to blue to purple).\nNow imagine that you are looking through the film out a window, holding\nthe film perpendicular to the direction of view.  As you rotate the\nfilm about either the z-axis or the y-axis, the scene shifts from\npurple to blue to purple, AND the greater the angle of rotation, the\nmore reflective the material appears, until at a certain angle, the\nfilm behaves almost like a perfect mirror.\n\nThus, I was hoping that in Radiance (since it is a ray-tracing\nprogram), information regarding the direction and angle of the light,\nand direction and angle of view is probably already calculated.  If we\ncould use this information to determine if-then switches, then a\nmaterial such as dichroic films which exhibit different behavior under\ndifferent conditions could be modeled.\n\nI hope I've been clear.  Any insight into if this would be possible\nusing BRTDfunc or mixfunc or any other func would truly be appreciated.\n\n\nThanks.\n\n\nJohn\n\nps. Dichroic films are not yet a commonplace architectural material.\nHowever, the premise behind trying to model this material is to\nspeculate and experiment with how such a material could be used\n(whether for aesthetic and/or energy purposes) in an architectural\ncontext without the expense and cost (time and money) of a full-scale\nmock-up.  Basically, behavior this material exhibits in a scaled\nphysical model is not indicative of how it will behave in a real\nenvironment, and thus Radiance seems to be the perfect tool to explore\nthis material.\n\n\n\n\n\n", "replyTo": "<200403011101.i21B1AUc005769@mac.com>", "sender": "John An", "isquestion": false, "tags": [], "id": "<CCFB8B12-6BB7-11D8-B023-000A95871DF2@mac.com>", "refs": ["<200403011101.i21B1AUc005769@mac.com>"], "datetime": "Mon Mar  1 20:36:21 2004", "email": "whollycow at mac.com", "subject": "[Radiance-general] Re: BRTDfunc for dichroic film? (was mixfunc fordichroic film?)"}