{"refs": [], "id": "", "subject": "[Radiance-general] Fwd: Radiance - validation challengReferences: <00b101ce4aaf$ca763600$5f62a200$@helios32.com>", "email": "gregoryjward at gmail.com", "body": "Message-ID: <AFF6EE75-0F7F-47A6-97E5-A2E6B3101142@gmail.com>\n\nMy friend and fellow lighting software author, Ian Ashdown, gave me the following message for the Radiance community.\n\nIan is responsible for the creation and development of the AGi32 simulation engine, which is widely regarded in the lighting design community (for good reason).  He has suggested that it would be a good idea for one or more persons to undertake a validation of Radiance based on CIE 171:2006, a suite of sample lighting scenes with known numerical solutions.  I believe Radiance has been partially validated against this dataset.  In particular, Mike Donn posted a request for more information with a couple of references to others' work along these lines in 2011:\n\nhttp://www.radiance-online.org/pipermail/radiance-general/2011-September/008173.html\n\n(Corrected links from post: <http://www.radiance-online.org/community/workshops/2008-fribourg/Content/Geisler-Moroder/RW2008_DGM_AD.pdf> and <http://www.ibpsa.org/proceedings/BS2011/P_1146.pdf>)\n\nI don't know of anyone who has gone through the entire CIE 171 test set, but this is what Ian proposes.  Note that there are some tests to watch out for, and whoever works on this will probably be talking to me at multiple points.  I look forward to learning something new in the conversation.\n\nOne way to approach this would be to set up a wiki or plone site where individuals could upload their validation tests and open them up for comments.  This would require some public documentation of the CIE 171 tests, and this is where it all gets a bit fuzzy.  I don't have this document and if we were to purchase it, I am uncertain as to the legality of sharing (portions of) it.\n\nIdeas and further suggestions are welcome.\n\nCheers,\n-Greg\n\nBegin forwarded message:\n\nThis is an academic  challenge for the Radiance community.\n\nValidation of lighting design and analysis software has been an issue within\nthe architectural lighting design community since the first commercial\nprograms were released in the 1980s. Several studies were performed for\nphysical spaces, the most notable being:\n\nDiLaura, D. L., D. P. Igoe, P. G. Samara, and A. M. Smith. 1988.\n?Verifying the Applicability of Computer Generated Pictures to Lighting\nDesign,? Journal of the Illuminating Engineering Society 17(1):36?61.\n\nwhere the authors constructed and measured the proverbial empty rectangular\nroom while carefully monitoring and controlling photometer calibration,\nambient temperature, luminaire voltage, ballast-lamp photometric factors,\nlamp burn-in and other light loss factors, surface reflectances, accurate\nphotometric data reports, and other issues.\n\nSuch studies are useful for interior lighting designs, but considerably less\nso for daylight studies where it is nearly impossible to measure, let alone\ncontrol, the sky conditions.\n\nThey are also mostly pointless for complex spaces with occlusions and\nnon-diffuse reflective surfaces. Regardless of how carefully the room\nparameters might be modeled and controlled, the results only apply to that\nparticular space.\n\nThe alternative is to develop a series of test cases with known analytic\nsolutions based on radiative flux transfer theory. This became the premise\nfor:\n\nMaamari, F., M. Fontoynont, and N. Adra. 2006. ?Application of the CIE\nTest Cases to Assess the Accuracy of Lighting Computer Programs,? Energy and\nBuildings 38:869-877.\n\nand:\n\nCIE 171:2006, ?Test Cases to Assess the Accuracy of Lighting Computer\nPrograms.? Wein, Austria: Commission International de l?Eclairage.\n\nAt least lighting software companies,  DIAL (www.dial.de) and Lighting\nAnalysts (www.agi32.com), validated their software products with respect to\nCIE 171:2006. It does not appear however that anyone has done this for\nRadiance.\n\nAs a Radiance community member, you may rightly ask, \"Is this even\nnecessary?\" Numerous studies have demonstrated the accuracy and reliability\nof Radiance, which may rightly claim the title of being the gold standard\nfor lighting simulation software. (I am saying this as the Senior Research\nScientist for Lighting Analysts, by the way.)\n\nMy answer is yes, but not for the reasons you might think.\n\nLighting Analysts engaged an independent third party called Dau Design &\nConsulting (www.dau.ca/ddci ) to perform the CIE 171 validation tests using\nAGi32 in 2007. The full report is available here:\n\nwww.agi32.com/Downloads/TechnicalDocs/Report%20on%20AGI%2032%20validation%20of%20CIE%20171_Compiled_070620.pdf.\n\nWhat was interesting about the tests was that AGi32 failed a number of them\non the first pass. As simple as they are, the results were dependent on such\nthings as the surface meshing parameters and convergence limits (for\nradiosity calculations). Roughly equivalent parameters for ray tracing would\nbe the number of rays and the number of reflections.\n\nIt was easy enough to optimize the parameters obtain the best results, which\nis what an experienced user would likely do anyhow for complex environments.\n\nNote that I said \"experienced user\"; that is, someone who has learned by\ntrial and error what works best for a given software product. CIE 171:2006\nhas the potential (so far unrealized) of providing beginning users with a\ncookbook of sorts to document and choose the best rendering parameters for\nvarious situations. This alone would be valuable, but it becomes even more\nuseful when the user needs to work with two or more lighting simulation\nprograms and hopefully obtain similar results.\n\nValidating AGi32 against CIE 171:2006 also led to a few puzzles where no\namount of parameter tweaking produced acceptable results. Further in-depth\nanalysis proved that the tests themselves were incorrect, being based in\ninvalid assumptions. These are documented in the report, but sadly CIE\nDivision 3 has not seen the need to issue an amendment to CIE 171. There are\nat least also two other tests (5.13 and 5.14) that have been called into\nquestion.\n\nThese issues notwithstanding, CIE 171:2006 is a useful document, which leads\nto the academic challenge ...\n\nValidation of Radiance against CIE 171:2006 involves more than just setting\nup a few simple models and running the tests. There will undoubtedly be test\ncases where the calculated results do not even begin to agree with the\npublished results. Optimizing the program parameters will demand an in-depth\nunderstanding of what they actually mean and do, and so offer a valuable\nlearning experience for students doing for example a class project.\n\nDigging deeper, there will likely be other issues with the test cases where\ninvalid assumptions lead to incorrect published results, subtle or\notherwise. Just because CIE 171:2006 was derived from a PhD thesis does not\nmean that it is entirely correct. This, combined with proposals for more\nrigorous and comprehensive tests, could form the basis for an interesting\nMSc thesis. (The tests are mostly derived from radiative flux transfer\ntheory and as such are aimed at radiosity-based methods. If these are not\nsuitable for ray tracing methods, what would be reasonable equivalent\ntests?)\n\nFinally, it would alleviate a lot of angst regarding lighting software\nvalidation in the architectural lighting design community if the major\ncommercial and open source products were validated against CIE 171:2006\n(with acknowledgement that there are no overall pass/fail results). Ideally,\neach company or software developer would conduct the tests in-house because\nthey know their products best. The catch here is that they would then be\nexpected to publicly post both the results and their test models so that\nanyone could use their products to confirm the test results. This would\nensure that the test results remain valid as the products undergo continual\nimprovement.\n\nIn terms of Radiance, it could be a community effort, with various people\ncontributing test models and proposing best parameter settings. In addition\nto providing a useful \"best practices\" guide for Radiance, this would likely\nresult in Radiance validating CIE 171:2006. It would also be welcomed as a\nvaluable contribution by the architectural lighting design community.\n\nIan Ashdown, P. Eng., FIES\nPresident\nbyHeart Consultants Limited\nhttp://www.helios32.com\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Gregory J. Ward", "datetime": "Wed, 8 May 2013 15:08:18 -0400"}