{"body": "\nI would like to thank everyone for their advice. It looks like the problem\nhas been resolved and that it was not related to the fact that the rview.exe\napplication does not come with the version of Radiance I am using (MinGW\nRadiance Installer for Windows (HEAD snapshot 2008-04-17) available for\ndownload at http://www.radiance-online.org/).\n\nI had to reset my Radiance directory within the 'image viewer' program in\norder to be able to apply any of the overlays. Below is an excerpt from an\nNRC document explaining how to get started with Ecotect-Radiance-DAYSIM\n(available at http://irc.nrc-cnrc.gc.ca/ie/lighting/daylight/daysim_e.html),\nin which specific reference is made to the issue I experienced:\n\nPlease note: The first time you are trying to generate a falsecolor image\nyou might get an error message stating \"RGBE read error\". If this is the\ncase, you have to reset your Radiance directory within the 'image viewer'\nprogram above under OPTIONS >> SETTINGS (see also Step 30.a).\n\nThe NRC document describes how to import/export files from\nEcotect/Radiance/DAYSIM. It is very helpful, although parts of it may be\nslightly outdated.  For example, I think that the link provided for the\nRadiance download (\nhttp://www.arch.mcgill.ca/prof/reinhart/software/Radiance3P7forWindows.zip)\nmay refer to an older version of Radiance.\n\nI am keeping my fingers crossed things will run smoothly from now on!\n\n\nOn Sun, Feb 15, 2009 at 8:13 AM, R Fritz <rfritz@u.washington.edu> wrote:\nold, but if it is still available, it will resolve these issues.  Their\ninstructions--I hope they still work--are here: <\nhttp://squ1.org/wiki/Installing_Radiance_Tutorial>.  If you want to use a\nmore current Radiance, try copying \"rvu\" to \"rview\"; it is unlikely that you\nhave \"vi\" on your Windows system to create a name conflict.\non my computer (Windows OS). I have been informed that this is the latest\nversion of Radiance for Windows OS. Unfortunately I now have trouble reading\nimages exported from Ecotect.\nto see a rendered view of the space in the image viewer, but I cannot run\nany of the options for the information overlay (e.g. contour lines, false\ncolor, daylight factors etc.) and get the message \"RGBE read error\"\nwhether Radiance is functional, the exporter returned a message saying that\nthe application \"rview\" is missing from the directory. Could this be the\nproblem? If so, what are alternative ways for evaluating the radiance image?\nforum:\nhttp://discussion.autodesk.com/forums/message.jspa?messageID=6124907#6124907\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20090215/4e236c59/attachment.htm\n", "replyTo": "Subject: [Radiance-general] Exporting file from Ecotect to Radiance", "sender": "Krystyna Zelenay", "isquestion": false, "tags": [], "id": "<54062c4e0902151319q3d710eaen8233e1e197c88ba2@mail.gmail.com>", "refs": ["<54062c4e0902131757w2ed9dd34od297860c2ed0ea7d@mail.gmail.com>", "<B44D8FA2-8BAC-47CB-B8B0-A9DA59EA919D@u.washington.edu>"], "datetime": "Sun Feb 15 13:19:59 2009", "email": "kzelenay at berkeley.edu", "subject": "[Radiance-general] Exporting file from Ecotect to Radiance"}