{"refs": ["<CAAZQWqjGFjDxnUEGA0itjt-f78E_cPBSKfVPobdsjSutX4=pSg@mail.gmail.com>", "<17813300-F0C3-41D4-976B-0F5B06C3AED3@lmi.net>"], "id": "<51C5CCAD.7090205@ise.fraunhofer.de>", "subject": "[Radiance-general] Luminance contrast calculation", "email": "jan.wienold at ise.fraunhofer.de", "body": "\nHi Marija,\n\nthere are two issues:\n1. metric\n2. how to calculate technically\n\nregarding metrics, the whole thing is not as easy. Definitely the DGP\ndoesn't catch contrast related glare, when the \"contrast\" is located\ndirectly besides the task. For example, if you are investigating a\ncomputer workplace in an open plan office and just above your computer\nscreen is located in the far a window. In this case users might\nexperience glare, even for very low luminances, which are also no\nproblem regarding reflectances on the computer screen. In that case, a\nratio 1:3 seems reasonable, but is also not proven by any user\nassessments so far (at least to my knowledge). But what happens, when\nthis contrast is more displaced from viewing position? This is  not\nclear to me how to handle. Of course you could evaluate on the \"safe\nside\", saying in a 30? cone you allow only 1:3, outside that cone 1:10.\nRegarding using max or mean of a surface, I would say it depends. If you\nhave really a peak (lets say a specular reflection of the sun), then you\nshould take it into account as glare source (and weight it with its\nsolid angle). This glare is captured pretty good by the DGP, but I\nwouldn't use the luminance of it for a contrast evaluation. For the\ncontrast I would use the average luminance of the surface of your interest.\n\nhow to calculate contrast for your surfaces: technically you can use\nevalglare for this. I'm currently on a plane and can't check the\nweb-site, but as far as I can remember I had a tutorial for that in my\npresentation at the radiance workshop in 2009 in Boston (seminar in\nadvance to the workshop). The trick is using masks. basically you have\nto generate a image only containing your surfaces of interest, having\nthe correct luminances. then run evalglare in a way, that each surface\nwill be one glare source and evaluate them with the -d option. You may\nreduce the search radius (-r option).\nYour mask should contain only the surfaces, which you want to\ninvestigate (=calculate the average luminance of this surface). In the\ncase of HDR images, I used simple photoshop to mark the area of interest\n(-> make them black). In case of simulations, it is easier, since you\ncan just change the reflectance of your surfaces of interest to zero and\ngenerate an masking image. If the surfaces are not touching each other,\nyou can evaluate all the surfaces also at once. The masking command I\nused was pcomb /input.pic/--s -1000 /mask.pic/> /eval.pic./ Using the -d\noption of evalglare (and switching off the peak extraction by -x) you\nget provided all found glare sources, including position in x-y\ncoordinates, solid angle and average luminance. You should check by the\n-c option, if evalglare detects the surfaces properly. Each found glare\nsource should correspond then your surfaces of interest. Don't use any\nof the glare metrics then, just the information of the glare sources.\n\nGood luck!Best,\n\nJan\n\n\nOn 06/21/2013 08:58 PM, Greg Ward wrote:\n\n\n--\nDr.-Ing. Jan Wienold\nHead of Team Passive Systems and Daylighting\nFraunhofer-Institut f?r Solare Energiesysteme\nThermal Systems and Buildings\nHeidenhofstr. 2, 79110 Freiburg, Germany\nPhone: +49(0)761 4588 5133 Fax:+49(0)761 4588 9133\njan.wienold at ise.fraunhofer.de\nhttp://www.ise.fraunhofer.de\n\nIn office:\nMo,Tue: 8:30-18:00\nWe,Thu: 8:30-16:00\nFr:  8:30-15:30\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20130622/088e1b16/attachment-0001.html>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Luminance contrast calculati", "tags": [], "sender": "Jan Wienold", "datetime": "Sat, 22 Jun 2013 18:11:25 +0200"}