{"refs": ["<CAAZQWqjGFjDxnUEGA0itjt-f78E_cPBSKfVPobdsjSutX4=pSg@mail.gmail.com>", "<17813300-F0C3-41D4-976B-0F5B06C3AED3@lmi.net>", "<51C5CCAD.7090205@ise.fraunhofer.de>"], "id": "<CAAZQWqhY6VkcvoybmssNEAA-oxQVoeSfOCjFPe9rvtnKtAkMuA@mail.gmail.com>", "subject": "[Radiance-general] Luminance contrast calculation", "email": "aricanis at gmail.com", "body": "\nHi Greg and Jan,\n\nThanks for input. Although contrast requirements, like 3:1, are often\nmentioned, I haven't found some nice discussion on practical issues and\ncalculation, so it is very useful to hear and learn something useful on\nthis topic.\n\n###\nRelated to Gregs' answer, I agree with you that calculation of surfaces\ncontrast is rather not well defined. I have a request for a project to\ncalculate contrast values, while definition of contrast itself is not very\nprecise.\n\nAs you said we can calculate either average or maximum - but values can\nvary extremely. This is especially visible in daylight offices, with clear\nskiy and sun light coming directly into the space. As Jan said, if sun\nreflection is visible, it will give extremely high light peak - and extreme\ncontrast.\n(Generally I don't think these contrast related things are defined well\nenough)\n\nRelated to Jans' answer about surfaces luminance, I haven't tried the\nmethod you suggest (I'll read your presentation), with evalglare and masked\nimages.\n\nInstead, I use method like this:\n\n- I use rtrace with -ovs or -ovm option turned on (so I detect materials\nor surface for each pixel).\n- Calculate image with rtrace and same parameters and ambient file -to\nhave it faster,\n- From image extract with pcomb/pvalue solid angles for each pixel.\n- After these steps I have for each pixel info about its solid angle,\nradiance and material.\n- I analyse these data with Python numpy library to extract average\nvalues for all surfaces/materials in the scene.\n\nMaybe there is some more automatic way to do this with Radiance commands\nonly (without numpy), but I couldn't find it, and since I'm writing program\nin Python it was not a problem to use numpy library.\n\nThanks again,\nMarija\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20130624/e25e9f21/attachment.html>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Luminance contrast calculati", "tags": [], "sender": "Marija Velickovic", "datetime": "Mon, 24 Jun 2013 10:47:31 +0200"}