{"refs": [], "id": "<s0f3e8bd.024@wmtao.com>", "subject": "[Radiance-general] Electric Lighting Calculations", "email": "MdelaFuente at wmtao.com", "body": "\nHi Group,\n\nWhat is the proper way to handle an electric lighting calc (based on an\nIES file) in terms of color?  Does color even matter?  What I mean is\nmost lighting programs don't take color into account but Radiance\ndoes...  which could lead to problems if one were not aware of how color\nselection affects numerical results.  I have not tested this, but here\nis what I'm thinking (or hoping) that when ies2rad matches the color of\na fluorescent light to that of a cool white lamp or a warm white, or\nwhatever color, that it will do so in a way that does not change the\ncalculation results.  (I guess it would do this by scaling the RGB\nvalues accordingly)  So if I were to run three calculations based on one\nies file (using three different color options.. say warm white, pure\nwhite, and some crazy x & y CIE coordinates), I would get the same\nnumerical results if all other parameters were equal?\n\nAny differences between falsecolor and rtrace results assuming one used\nthe accepted '$1=($1*.265+$2*.67+$3*.065)*179' ?\n\nAs always, any feedback is greatly appreciated.\n\nThanks!\n\nThe novice.\n\n\nPS\n\nSince lamp.tab does not include some of the more recent fluorescent\ncolors, I obtained a copy of the x & y CIE coordinates for some\nPhillip's lamps from my local Phillips rep.  Not sure if there is any\ninterest in updating lamp.tab for future Radiance releases or even if\none manufacturer's data would be enough data to do this (perhaps an\naverage would be more appropriate?), but I would be happy to share the\ninformation for their 800 series lamps (3000K, 3500K, 4100K, & 5000K)\nwhich are the lamps typically specified these days (at least by me\nanyway).\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20040713/2cb2b5d5/attachment.htm\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Mark de la Fuente", "datetime": "Tue Jul 13 20:51:15 2004"}