{"body": "\nDear Greg,\n\nThank you for your advice and I just tried as you said but actually the\nresults were not improved as following link.\n\n*http://iga.iis.u-tokyo.ac.jp/xe/?document_srl=346*\n\nThat might be so because the lamp is actually UV lamp but as you know, there\nis almost no difference between flourescent and UV lamps besides with or\nwithout phosphor coating on the surface of lamp. Nevertheless,\nI thought the absence of phosphor coating could cause some differences on\nthe diffuse of UV including the Fresnel effects. I'm finding some references\non the diffuse of UV lamps.\nThe reflectances were referred to a japanese paper which had done\nexperiements with UV and the UV output of lamp was referred to the\nmanufacturer's specification but the UV intensities at 1 m distance is\nalmost the same.\n\nAdditionally, I'm checking the UV sensor but as it also follows cosine law\nas illuminance sensors do, there might be no problem with UV sensor.\n\nSung\n\nMessage: 4\nTo: Radiance general discussion <radiance-general@radiance-online.org>\nContent-Type: text/plain; charset=US-ASCII; delsp=yes; format=flowed\n\nHi Sung,\n\nTry adding the following parameters to your rtrace command:\n\n-dj .7 -dt 0\n\nHow sure are you of your surface reflectances?  Did you actually\nmeasure the lamp output, or are you assuming the manufacturer's lumen\nspecification is correct?  How far off are your values?\n\nSince you notice the most errors near to the lamp and at low angles,\nit's possible that the Fresnel effects are important.  The emission\nof the fluorescent phosphor may be considered diffuse, but the actual\noutput of the lamp will be a function of angle due to Fresnel\nreflection of the glass bulb.  You can account for this\n(approximately) by applying the \"winxmit.cal\" function included with\nRadiance, like so:\n\nvoid brightfunc Fresnel_effect\n2 winxmit winxmit.cal\n0\n0\n\nFresnel_effect light lamp_light\n0\n0\n3 X X X\n\nlamp_light cylinder fluorescent_tube\n(etc...)\n\nI think you get the idea.\n\n-Greg\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20090402/d1591ede/attachment.htm\n", "replyTo": "", "sender": "gward@lmi.net", "isquestion": true, "tags": [], "id": "<937118BE-1267-44D0-85BF-B84958EEF758@lmi.net>", "refs": [], "datetime": "Wed, 1 Apr 2009 11:35:14 -0700", "email": "Greg Ward", "subject": "Re: [Radiance-general] Comparison of values measured bysensors and     calculated with Radiance"}