{"refs": ["<CAO0Bi3XiEQ7CBF5806AjKfvyD2wB5wfo2cgt0G9xwhZx-7qscg@mail.gmail.com>", "<88079A360FAC7441AE93ECBF619982360163FF@AMXExMb02.global.arup.com>", "<CAO0Bi3X3b5poHtOuObpNM-qQ5qqEr=doUNgBrRckHuVm9fPLrw@mail.gmail.com>"], "id": "<88079A360FAC7441AE93ECBF61998236018DAA@AMXExMb02.global.arup.com>", "subject": "[Radiance-general] pcond, luminance or visible radiation?", "email": "inchaca", "body": "\nI'm not an expert on the pcond code, but it's probably applying different tone mapping depending on what it interprets as lux levels in the scene. If you give it a scene from gendaylit -O 2, pcond doesn't know that the pixel value RGB triplets have already been scaled to luminance, and thinks it's a brighter scene, and applies a brighter tone map. If you gave it a scene illuminated to only 10 lux of electric light, it would probably give you a different tone mapping even if the contrast ratios were identical.\n\nCan anyone else corroborate my guess?\n\nSent: Monday, August 05, 2013 11:56 AM\nTo: Radiance general discussion\n\nHi, and thank you for your reply!!\n\nIf I select the output of gendaylit -O 2 (lm/m^2/sr) then I generate the picture using rpict, convert to human visual response using pcond\n-h and then to bmp using ra_bmp then I get a picture that is visually more brighter than if I select the output of gendaylit -O 0 (default) and then\nmultiply by 179.\n\nI confirm, when I use -O 2 (output lm/m^2/sr) then I don't multiply by 179, only when I select the default output (W/m^2/sr).\n\nI don't have problem with the results of the values, but with the generated picture, using the default of the parameter -O the picture looks less brighter\n(even after *179).\n\nI wonder which of the two pictures is the right one, as it doesn't seem to have anything to do with the results of the values, but with the way how the image\nis created...I guess...\n\n\nI really apprecieate your help!\n\n:)\n\n2013/8/5 Christopher Rush <Christopher.Rush at arup.com<mailto:Christopher.Rush at arup.com>>\nCan you clarify the exact process when you say the picture looks less bright? The picture out of pcond is just visually less bright? If you're looking at values prior to using pcond, your process to get values out of your image is probably based on the assumption that the scene is set up using defaults (visible W/m^2/sr). If you convert to lumens in your scene description from gendaylit, then you have to be careful that you're not again converting to lumens (with a 179 multiplier) after your calculation.\n\nSent: Monday, August 05, 2013 8:13 AM\nTo: radiance-general at radiance-online.org<mailto:radiance-general at radiance-online.org>\nHi all, I'd appreciate your help on the following question:\n\nI'm creating a radiance scene using gendaylit to generate the sky, since I have data of the diffuse horizontal and direct normal irradiance (W/m^2) I'm using the -W option and then -O 2 to obtain the output in lm/m^2/sr (luminance). Then I'm using rpict to generate the picture, and pcond -h to convert it to a human visual response.\n\nBut I realized that if I use the default value of -O in gendaylit (output in radiance of the visible radiation W/m^2/sr) the picture looks less bright.\n\nSo I don't know which one is the right one to use in this case.\n\nI tried to find out if the default input when using pcond would be luminance rather than visible radiation, but couldn't find an answer for that, or maybe there is another command other than pcond, that takes the input in luminance values, then that would be the one I should use.\nOr maybe there is an additional step that I'm missing...\n\nI wonder if somebody can give me a hint about this, and/or where to look..  :)\n\nThanks in advance!!\n\nCh.\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20130807/4b647ab3/attachment.html>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] pcond, luminance or visible radiation?", "tags": [], "sender": "miinchaca at gmail.com>", "datetime": "Wed, 7 Aug 2013 21:04:54 +0000"}