{"refs": [], "id": "<20040716165639.16087.qmail@web80306.mail.yahoo.com>", "subject": "[Radiance-general] Re: Units", "email": "ckehrlich at yahoo.com", "body": "\nA caution regarding gensky, luminous efficacy factors and spectral conversions.\n\nThe physical skydome is strongly blue-colored.  This matters if you are attempting to represent the brightness of objects relative to sources of light with different spectra, and/or relative to room surfaces with different reflectance spectra.\n\nBlue light is more efficacious, i.e., it both has more energy and appears brighter.  The lumens per watt conversion factor of 179 is really only valid for pure white light (I think I've got that right?).  If you look into the source code for gensky, you will see that a different lm/watt factor was used to derive the zenith brightness (203 ??).  But this efficacy is not tied to the color of the skydome as modeled by the user in the input file in the skyfunc \"glow\" entity below:\n\n\nskyfunc glow sky_glow\n\n0 0\n\n4 0.75 0.9 1.2 0\n\n\n\nsky_glow source sky\n\n0 0\n\n4 0 0 1 180\n\n\n\nI do not know your specific application, but if the appearance of the sky is not important for your simulations, you might consider changing the skydome glow color component to be equal R G B factors (1 1 1) so that you do not convolve different efficacy factors and spectral influences on your final result.  Alternatively, you could re-write gensky so that it adjusts the luminance of the skydome (by adjusting the lm/watt factor) in response to the color of the skyglow primitives.\n\nIn a quick study of this effect several years ago, we found errors as much as 20%--which is small potatoes for daylight simulation purposes, but troubling nevertheless because it is (arguably) an internal consistency error, not a modeling error.\n\nThe real problem is that the international unit of luminous flux is defined in terms of a human perceptual factor rather than on a radiometric unit, imho.  This results in skydome brightness measurements in candellas per meter squared (instead of watts/meter squared) whose conversion factor depends upon the color of the light source.\n\n-Chas\n\nradiance-general-request@radiance-online.org wrote:\n\nDo you mean \"gensky?\" If so, the solar radiance is in units of\nwatts/sr/m^2 using the standard 179 value for luminous efficacy.\nUnless you know better, it is recommended to simply use this value, so\nit drops out of the calculation when you return to photometric units\nduring the analysis phase at the end.\n\nI hope this helps.\n-Greg\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20040716/db39b7da/attachment.htm\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Charles Ehrlich", "datetime": "Fri Jul 16 19:03:25 2004"}