{"refs": ["<20040716165639.16087.qmail@web80306.mail.yahoo.com>"], "id": "<E536A67C-D74B-11D8-833F-000A95BB392A@lmi.net>", "subject": "[Radiance-general] Re: Units", "email": "gward at lmi.net", "body": "\nBeware to those who attempt to read the Radiance source code -- it is\nnot meant for human eyes!  I have trouble interpreting it, myself.  The\nbest I can say for it is that it compiles well, most of the time....\n\nThough it's true that gensky uses a different efficacy for the sky\nconversion, it only does this when the zenith brightness is being\ncomputed from turbidity, which is an iffy proposition at best.  If you\nuse either the -b or -B options to enter your own zenith radiance or\nirradiance (from TRY data or on-site measurements), it is YOUR\nresponsibility to convert from whatever was measured to the right units\nfor your simulation.  If you took a luminance measurement on a gray\nsky, then you should divide by 179.  If your sky has some color to it,\nyou should take this into account as Chas recommends.\n\n-Greg\n\nA caution regarding gensky, luminous efficacy factors?and spectral\nconversions.?\n?\nThe physical skydome is strongly blue-colored.? This matters if you are\nattempting to represent the brightness of objects relative to sources\nof light with different spectra, and/or relative to room surfaces with\ndifferent reflectance spectra.?\n?\nBlue light is more efficacious, i.e., it both has more energy and\nappears brighter.? The lumens per watt conversion factor of 179 is\nreally only valid for pure white light (I think I've got that right?).?\nIf you look into the source code for gensky, you will see that a\ndifferent lm/watt factor was used to derive the zenith brightness (203\n??).? But this efficacy is not tied to the color of the skydome as\nmodeled by the user in the input file in the skyfunc?\"glow\" entity\nbelow:\n\nskyfunc glow sky_glow\n0 0\n4 0.75?0.9 1.2 0\n\nsky_glow source sky\n0 0\n4 0 0 1 180\n?\nI do not know your specific application, but if the appearance of the\nsky is not important for your simulations,?you might consider changing\nthe skydome glow?color component to be?equal R G B factors (1 1 1) so\nthat you do not convolve different efficacy factors and spectral\ninfluences on your final result.? Alternatively, you could re-write\ngensky so that it adjusts the luminance of the skydome (by adjusting\nthe lm/watt factor) in response to the color of the skyglow primitives.\n?\nIn a quick study of this effect several years ago, we found errors as\nmuch as 20%--which is small potatoes for daylight simulation purposes,\nbut troubling nevertheless because it is (arguably) an internal\nconsistency error, not a modeling error.\n?\nThe real problem is that the international unit of luminous flux is\ndefined in terms of a human perceptual factor rather than on a\nradiometric unit, imho.? This results in skydome brightness\nmeasurements in candellas per meter squared (instead of watts/meter\nsquared)?whose conversion factor depends upon the color of the\nlight?source.?\n?\n-Chas\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Re: Units", "tags": [], "sender": "Greg Ward", "datetime": "Fri Jul 16 19:24:09 2004"}