{"body": "\n\nHi everybody,\n\nI have two questions about the description of a glass facade with a\ncomplex glass system: one about the geometry and one concerning the\nmaterial.\n\n1-. With the objective in daylight calculations and daylight efficiency\nof materials I try to simulate, so accurate as possible, a doble glazing\nfacade with the next composition:\n\n9mm laminated glass with spectrally selective interlayer -- 16mm air --\n4mm float glass\n\nAll the papers I've read describe the glass geometry as polygon as follows:\n\nmod polygon id\n0\n0\n3n    x1    y1    z1\nx2    y2    z2\n...\nxn    yn    zn\n\nIn my case, with such a glass system, would be this geometry\ndescription of the glass right and accurate? or should I define the\nradiance geometry like the contructed geometry?\n\n\n2-. The second question is about the material description.\nI have measured the transmittance of this doble glazing material sample\nwith a Spectrometer and an accessory for external measurements and\ncomputed its transmissivity.\nThe complete definition of the material that I get is as follows:\n\nmod glass id\n0\n0\n3 rtn gtn btn\n\n\nOn the other hand I have exported in Radiance format from the software\nOptics5 a similar glass, also with sun protection interlayer, and the\nmaterial description is much complexer. It is as follows:\n\nvoid  glass       sunstop-t-silver-20_glass\n0\n0\n3     0,205     0,222     0,239\n\nvoid  BRTDfunc    sunstop-t-silver-20_front\n10\n0,325     0,281     0,197\n0,188     0,203     0,219\n0 0 0\n.\n0\n9 0 0 0 0 0 0 0 0 0\n\nvoid  BRTDfunc    sunstop-t-silver-20_back\n10\n0,259     0,289     0,307\n0,188     0,203     0,219\n0 0 0\n.\n0\n9 0 0 0 0 0 0 0 0 0\n\n\nMy question is if the description I did is complete and will give an\naccurate calculation.\nIn case it is not, how can I get the hole description with the BRTD\ninformation if I just have the glass sample and the Spektrometer to\nstart and this glass is not in the IGDB?\n\nThank you,\n\n\nMarina\n\n--\nDipl. -Ing. (-Arch) Marina Aviles Olmos\nInstitute for Lightweight Structures and Conceptual Design (ILEK)\nUniversity of Stuttgart\nGermany\n\nmarina.aviles@gmail.com (Radiance Mailing List)\nmarina.aviles@ilek.uni-stuttgart.de\n\nwww.uni-stuttgart.de/ilek\n\n\n", "replyTo": "", "sender": "marina aviles olmos", "isquestion": true, "tags": [], "id": "<49F85AE5.5030606@gmail.com>", "refs": [], "datetime": "Wed Apr 29 06:50:08 2009", "email": "marina.aviles at gmail.com", "subject": "[Radiance-general] Description of complex glass systems (geometry +material)"}