{"refs": [], "id": "", "subject": "[Radiance-general] Workshop on Passive Solar Design,Daylighting and Simulations for Green Buildings", "email": "gurneet.singh at gmail.com", "body": "Message-ID: <CANQXRZV=RF_qMpzE+rn-DSRZF56eHmdaa9A5yEw3kmguaktEjg@mail.gmail.com>\n\nDear Radiance Users,\n\nWe are conducting the 6th training program on \"Passive Design, Daylighting\nand Simulation for green Buildings\" in New Delhi, India on 18th and 19th\nOctober 2013. The intent of this program is to make sure that the\nparticipants can do the analysis on their own. More information on past\nworkshops can be found on our Facebook\npage<https://www.facebook.com/Environmental.Design.Solutions/>\n\n*COURSE OVERVIEW:\n\n*The objective of this highly interactive and hands-on training program is\nto equip participants with the practical know-how to undertake shading and\ndaylighting simulations. This course covers fundamentals of solar geometry,\nshading strategies, daylighting design and techniques using graphic\nmethods, quick calculations, rules of thumb and software tools such as\nEcotect/Skecthup and Radiance that will have direct application in practice.\n\nThe unique teaching methodology of this course introduces the concepts in a\nstep-by-step manner from manual exercises to using physical study models\ntransitioning to finally using computer simulations. Participants will work\non many exercises using our custom worksheets, physical models and software\ntools switching between pen-paper media and the computer. This method will\nensure clarity in theory and effective learning of the software tool.\n\nAt the end of this course, participants will be able to conduct a complete\ndaylight assessment for simple geometries\n\nFeel free to get in touch if you have any questions.\n\nRegards\n--\nGurneet Singh\nEnergy Analyst-Architect\nM: 9899-240140\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20130918/71262a24/attachment-0001.html>\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Gurneet", "datetime": "Wed, 18 Sep 2013 18:43:22 +0530"}