{"body": "\nI converted that model to a radiance dome, i usually work with radiance\nwith aesthetical purposes so i'm not sure it's phisically accurate, it\nmisses the atmosferic effects because, as Lars said, i think it's\nnecesary to modify radiance code. I did it as part of a 3dsmax exporter\nto rad i'm working with.\nI got the main sources some time ago from a web page of the University\nof Girona in Spain (sir project), i think they created the sources based\non some code related to the paper, i've returned to search for the\nproject again but i haven't found it on the internet.\n\nIt's a windows .exe file, the program creates three data files with\nradiance colordata and outputs a radfile with the definitions of the sun\nand the sky and a white box to avoid radiance no objects error, it uses\na calc file ssky.cal to map the data to the dome, the parameters are\n\nlat Latitude (0-360)\nlong Longitude (-90,90) south to north\nsm  Standard Meridian\njd  Julian Day (1-365)\ntod Time Of Day (0.0,23.99) 14.25 = 2:15PM\nturb  Turbidity (1.0,30+) 2-6 are most useful for clear\ndays.\n\ngesky3 lat long sm jd tod turb (gesky 43 3 3 180 10 6 >ssky.rad)\n\nyou can download: www.aisarquitectura.com/archivos/ssky.zip\n\nWhen i got it there were some code missing and i could not compile it as\nit was so i modified it, but not to distribute because i don't know the\nprotocols to add new code (comments, licenses ...), so i can send the\nsource code to anyone who is interested in cleanning it or somebody\ncould try to help me in make it better\n\nIgnacio Munarriz\n\n\n\nReinhart, Christoph escribi?:\n\n\n", "replyTo": "Subject: [Radiance-general] sky models and color gradients", "sender": "Ignacio Munarriz", "isquestion": false, "tags": [], "id": "<49EC56CE.7080604@aisarquitectura.com>", "refs": ["<49E6F07D.9080903@nus.edu.sg>", "<49E6FA0B.8090401@nus.edu.sg>\t<Pine.LNX.4.64.0904160911090.7941@zaxxon.gpcc.itd.umich.edu>", "<C5E1527F129BF545A250B5AD0B0C26EF036CD809@ENTWEXMB0000000.university.harvard.edu>"], "datetime": "Mon Apr 20 04:04:49 2009", "email": "info at aisarquitectura.com", "subject": "[Radiance-general] sky models and color gradients"}