{"refs": ["<DUB122-W274C570DE54DEFD82E9D9DFC140@phx.gbl>", "<CAF-iH4+UiijAZ_QNqp2=wADkjUMs7pNXqNv0VBJaxMOryKqMOw@mail.gmail.com>", "<3B8E8D5A-3BDD-4692-9A22-B14EC0C0BADF@lmi.net>"], "id": "<FFF56A6D37A3A54F91A03601AC22DA32263ABB7C91@MAILBOX2.nrel.gov>", "subject": "Re: [Radiance-general] genBSDF error", "email": "Greg Ward", "body": "\nOne scenario I can think of would be using the 3- or 5-phase method to look at a window with clear glazing and a shade, and wanting to select the appropriate BSDF based on whether the shade is up or down (at runtime). But you're right Greg, of course; given the difficulty of even a high resolution BSDF to represent purely specular transmittance or reflectance, the best way to handle these situations is to do simply calculate the view matrix with the whole model - including the glazing, modeled as glass or trans or whatever  -- and then do another round where you do the VMX to the glass and the DMX to the sky, and just have the one BSDF for the CFS. With gendaymtx, the generation of the matrices is so fast now it makes more sense to just do them both (for this scenario) and then at runtime just select the appropriate result.\n\n- Rob\n\nSent: Monday, September 30, 2013 10:29 AM\nTo: Radiance general discussion\nBeyond that, I should point out that it is neither necessary nor recommended to create an XML file to describe a pane of clear glass.  Even the tensor tree format has difficulty representing perfectly specular systems such as this, and in fact all the default algorithms in WINDOW6 and Radiance work quite well with a more exact description.  Can you explain why you even think you need to do this?\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20130930/a6cbc161/attachment.html>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] genBSDF error", "tags": [], "sender": "gregoryjward at gmail.com", "datetime": "Mon, 30 Sep 2013 12:28:24 -0600"}