{"refs": [], "id": "", "subject": "[Radiance-general] Environmental Design Analyst @ Foster andPartners", "email": "gbetti at fosterandpartners.com", "body": "Message-ID: <9AE3DAF33501B04BA74EFAE9629663183621DA2D@CORP3011.CORPORATE.FOSTER.NETWORK>\n\nDear List,\n\nThere is a chance for a bright, talented young individual to join our London based team as Environmental Design Analyst in the Specialist Modelling Group at Foster+Partners.\nWe are looking for someone with a solid knowledge of lighting and daylighting simulation techniques to be involved in a number of world class projects.\nExceptional design skills are required, together with outstanding communication and presentation capabilities.\n\nYour work will involve assisting the design teams in developing integrated designs, with a strong focus on the assessment and development of lighting and daylighting aspects of a project, balancing the aesthetic and technical requirements.\nYou will be immersed in a very creative and interdisciplinary team, which forms the core of R&D at Foster +Partners and that drives innovation on a number of high profile and unconventional projects. Our work constantly challenges the boundaries between architectural and engineering disciplines, striving for the achievement of tightly integrated, high performance building designs.\nOur work includes projects of all scales from luminaire design to daylight availability assessment at a master planning scale, through lighting and daylighting assessment and design for a number of building typologies.\n\nGeneral Requirements:\nDegree in Architecture or Engineering disciplines\nAbility to understand and formulate design decisions and present them for discussion\nAbility to use a variety of media in the development and documentation of a design project\nGood interpersonal skills and the ability to work well in a team\nAbility to take initiative in response to direction or instruction\nAbility to work well under pressure and meet deadlines efficiently\nA ?exible and open attitude towards new ways of working and commitment to independent, lifelong learning\nFluent English, written and spoken\n\nSoftware Requirements\nAdvanced knowledge of Radiance and/or other lighting simulation tool\nProficiency in Rhinoceros and/or Microstation\nAdobe Creative Suite\nMs Office\nScripting abilities a plus\n\nIf you are interested please send me a C.V. and portfolio of works at gbetti at fosterandpartners.com<mailto:gbetti at fosterandpartners.com>\nFor large portfolios (above 3MB) please send a link from a web based service as they could otherwise be blocked by the mailing system.\n\nBest Regards,\n\nGiovanni Betti\n\n\n////////////////////////////////////////////////\nGiovanni Betti\n\nAssociate Partner ? Specialist Modeling Group\nArchitect\nEnvironmental Design Analyst\n\nFoster + Partners\nRiverside, 22 Hester Road\nLondon SW11 4AN\nT +44 (0)20 7738 0455\nD +44 (0)20 3147 5705\nF +44 (0)20 7738 1107\nE gbetti at fosterandpartners.com\nwww.fosterandpartners.com\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20131015/5e67abed/attachment.html>\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Giovanni Betti", "datetime": "Tue, 15 Oct 2013 09:15:49 +0000"}