{"body": "\nDear colleagues,\n\n\n\nMy apologies for any cross-posting. This email is mainly directed\ntowards those of you located in the larger Boston area.\n\n\n\nIn an effort to reach out to the local design community and to promote\nthe use of daylight in buildings we will be offering a series of free\none hour brown-bag presentations at the Harvard Design School starting\non Monday, April 20, at noon in Stubbins, Gund Hall, 48 Quincy Street in\nCambridge. In this initial presentation I will be discussing the results\nof two very recent studies: A validation of 3ds Max Design compared to\nindoor illuminance measurements as well as a study that investigated\ncommon simulation mistakes that daylight simulation novices make. The\nfocus audience for this presentation are design practitioners interested\nin adding physically based daylight simulations to their design\nportfolio. Following the presentation you are very welcome to stay\naround for a bit and share some of your own simulation activities.\n\n\n\nPlease RVSP Brooke King at bking@gsd.harvard.edu should you intend to\njoin us. There will be no lunch provided but you are welcome to bring\nyour own. The conference room is located next to our cafeteria.\n\n\n\nI look forward to meeting some of you in a few weeks. Best regards,\n\n\n\nChristoph\n\nChristoph Reinhart, Dr. Ing.\n\nAssociate Professor of Architectural Technology\n\nGraduate School of Design - Harvard University\n\nGund Hall 331b, 48 Quincy Street, Cambridge, MA 02138, USA\n\nt: 617 384 7269, f: 617 495 8916, reinhart@gsd.harvard.edu\n<mailto:reinhart@gsd.harvard.edu>\n\n\n\n\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20090402/888088e4/attachment-0001.html\n", "replyTo": "", "sender": "Reinhart, Christoph", "isquestion": true, "tags": [], "id": "<C5E1527F129BF545A250B5AD0B0C26EF034B4042@ENTWEXMB0000000.university.harvard.edu>", "refs": [], "datetime": "Thu Apr  2 11:00:33 2009", "email": "reinhart at gsd.harvard.edu", "subject": "[Radiance-general] Daylight Boston - 'Daylight Simulations: Fromformal validation to common user mistakes'"}