{"refs": [], "id": "<CAO0Bi3XFY5byD6Nq7TOgkZbyEKDRwePN10+TO_2ty1yhYqmXxA@mail.gmail.com>", "subject": "[Radiance-general] 5Phase & proxy geometry", "email": "iinchaca at gmail.com", "body": "\nHi all, I?m coming again with more questions now regarding the 5Phase\nMethod.  I hope someone finds the time to answer.\n\n\n\nAs following:\n\n\n\n1.- I?m not sure of the use of the ?BSDFproxy polygon inside? included in\nthe glazing_bsdf.rad file.\n\n\n\nIf the latter was generated by genBSDF and includes already the dimensions\nof the venetian blind, the model, the glazing, and the thickness is also\nspecified?why do we need to specify the coordinates of the polygon (same of\nthe glow material) in this file?\n\n\n\nI also wonder if we need to use proxy when only if we have a system such as\nvenetian blinds. Is possible to use it also if we have a daylight system as\nthick as a glass pane such as lasercut panel 6mm?\n\n\n\nI guess that I can shorten this question by: what would be exactly the\nfunction of the proxy geometry?\n\n\n\n\n\n2.- Regarding this, in the tutorial you have to rotate the geometry in\norder to generate the two xml files (section 6.2) my\nsilly-silly-super-silly question is:  what would be the orientation of the\nresulting xml file? Are we re-orientating it by the last three values of\nthe orientation vector in the glazing_bsdf.rad ?\n\n\n\n\n\n3.- I have a final question that just came now when trying the 5Phase: What\nwould be the number to use in rcontrib ?bn when creating the\ndirect-sun-coefficient-matrix?\n\nAs I understand, it represents the number of sky patches, and it will\ngenerate the values of the RGB in the output file. But, if I use ?e MF:6 ?f\nreinhart.cal ?b 5186, I obtain a matrix result with 31116 columns, which is\nthe number of sky patches six times? Please tell me where am I wrong.\n\n\n\nI thank you in advance for your time and help!!\n\n\n\nChantal.\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20131101/1751ac9b/attachment.html>\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "minchaca", "datetime": "Fri, 1 Nov 2013 18:26:14 +0100"}