{"body": "\nThank you very much for your answer.\n\nMy intention was not simulating light extinction through the atmosphere but\nonce light reaches a mist object which is on the ground, (I exactly know the\nextinction coefficient within it), analyze the light (direct from sun and\ndiffuse from sky dome) extinction inside this small volume.\n\nSince I need to know the light levels (illuminance) inside the volume at\ndifferent depths, it seems to me that the -av approach will not work.\n\nAny suggestion?\n\nThanks in advance,\nGuedi\n\n\n\n-----Original Message-----\nSent: Friday, April 16, 2004 7:12 PM\nTo: Radiance general discussion\nCc: pillo.pillo@tin.it; arrguedi@techunix.technion.ac.il\nUnfortunately, mist is never going to work with distant sources,\nbecause if your raise any extinction to an infinite power, no matter\nhow close to one it starts out, you get a zero result.  (From RwR Chap.\n14, eq. 14.7, we see that light is absorbed as the power of distance.)\nI just had a similar discussion with another user (Pablo Escanilla\n<pabloe@ivo.cps.unizar.es>), who was simulating fog on a roadway.\n\nReal atmospheres are quite a bit more complex than setting a global\nconstant value for extinction and albedo.  Real atmospheres change with\naltitude, often dramatically, so it doesn't become pitch dark as soon\nas the fog rolls in.  Simulating large scale atmospherics in Radiance\nmeans creating enormous \"slabs\" of mist with different extinctions at\ndifferent altitudes.  It can be done, but it's a bit of a pain and, as\nfar as I know, no one has yet made the attempt.\n\nAs to sampling the sky dome, this is never going to work.  You are much\nbetter off setting a sensible value for -av, which gets figured into\nthe mist calculation as an appropriate multiplier on albedo.  This was\nmy advice to Pablo.\n\n-Greg\n\nHi,\n\nI am trying to simulate the extinction of light inside a MIST volume,\nfor different sky conditions.\n\nThe simulations seems to work well using \"sun\" as the light source, but\nI have problems when using an overcast sky or a sunny sky with no sun\n(-s option).\n\nThe light sources for the MIST volume are \"sun\" and \"sky\" which is\ndefined using glow.\n\nDid MIST work for glow type light sources? If not, what do you\nrecommend to use to simulate this case, with diffuse light coming from\nthe sky?\n\nThank you in advance,\n\nGuedi\n\n\n\n", "replyTo": "Subject: [Radiance-general] RE: Using MIST for  overcast sky", "sender": "gward@lmi.net", "isquestion": false, "tags": [], "id": "<20040418150546.37133365D@techunix.technion.ac.il>", "refs": [], "datetime": "Sun Apr 18 17:06:10 2004", "email": "Greg Ward", "subject": "Re: Using MIST for overcast sky"}