{"refs": [], "id": "<OFD68B3607.7D9D2680-ON80257C23.0068898E-80257C23.00688998@LocalDomain>", "subject": "[Radiance-general] Translucent material modeling with Radian", "email": "T.Charles at maxfordham.com", "body": "\nDear Radiance users and experts,\n\nAs an engineer in a the building industry, I use Radiance to model different facades options in terms of daylighting. I also use Daysim for annual calculations to estimate annual illuminance exposure and other metrics (DA, etc.).\n\nI'm currently working on a translucent glazing option and below is my understanding of the several possibilities I have to model it with Radiance.\nPlease feel free to correct me.\n\nThe easiest way is to use trans but I understand that this does not allow one to model an angle-dependant transmittance and reflectance.\nTo overcome this limitation, I could use transfunc or transdata but the angle-dependant transmittance/reflectance only applies to the specular components and not the diffuse ones.\nI understand that BRTDfunc suffers from the same limitations even if it allows the user specifying more distribution functions (mirror, reflectance, transmittance lobes).\n\nMoreover, on the use of transdata/transfunc, I understand from the Radiance documentation that the only modified value is the transmitted specular component so the last one called tspec. Is that correct ?\nI've carried out some calculation with a trans and transdata material following the process described in Reinhart's paper (Development and validation of a Radiance model for a translucent panel).\n\ntrans:\nvoid trans south_panel?\n0\n0?\n7 0.40446 0.40446 0.40446 0.08 0 0.435635 0?\n\ntransdata\nvoid transdata?south_panel?\n4 noop refl.dat rang.cal rang?\n0\n6 0.40446 0.40446 0.40446 0.08 0.435635 1\n\nReading the paper, I though that the values contained into the refl.dat file where multipliers of the transmitted specular fraction (tspec) set to 1 (last parameter of the transdata). Then I ran a simulation with a sunny sky with sun (simple square box with a window).?\nIn the case of the trans material, with no transmitted specular component, I was expecting to see a perfect diffuser which was the case.\nIn the transdata case,?I expected to see a patch of light on the floor as the transmitted specular fraction was not zero (from my understanding at least). Instead, the transdata material seemed to behave as a trans material with no transmitted specular component.\nAm I missing something ?\nThese results really confuse me.\n\nThank you all for your support.\n\nRegards,\n\nThibault\n\n\n\n42-43 Gloucester Crescent\nLondon\nNW1 7PE\nT?+44 (0) 20 7267 5161\nF?+44 (0) 20 7482 0329\nmaxfordham.com\n\nMax Fordham LLP is a Limited Liability Partnership. Registered in England and Wales Number OC300026\nRegistered office 42-43 Gloucester Crescent, London, NW1 7PE\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20131114/9060c55e/attachment-0001.html>\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: Image.1384455709335.jpg\nType: image/jpeg\nSize: 25055 bytes\nDesc: not available\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20131114/9060c55e/attachment-0001.jpg>\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "T.Charles at maxfordham.com", "datetime": "Thu, 14 Nov 2013 19:01:49 +0000"}