{"body": "\nWhile other can remark on pcond and how it represents\nscotopic/photopic adaptation, I would like to comment on the lighting\ndesign issue. The close-up of the manuscript indicates a dominant\ngrazing highlight from the right and less contribution from the left. I\nalso note the shadows cast by the candle configuration.. front candles\nblocking rear candles... at least that is my guess.  Consider\nreorganizing the candles so that each has a full \"sightline\" to the\nmanuscript. Additionally increase the luminance of the page by moving\nthe candles closer and by reducing the cosine effect by repositioning.\nTo reduce the masking shadow cast by a reader, consider elevating the\nlight sources.\nRadiance provides fairly accurate representations of\nlighting choices. Though there have been a few occasions where I gasped\nwith disbelief at a rendering of a lighting scheme I was testing, I must\nacknowledge that Radiance typically illustrates the flaws and strengths\nof the design choices.\n\n-Rob Shakespeare\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of John\nSutherland\nSent: Sunday, April 18, 2004 7:42 AM\nTo: Radiance-general@radiance-online.org\nAfter setting up some candles in my reconstruction using georg's advice\nwith the candle RGB values. I used spheres with radius 0.0075 which\nworked out RGB values of\n\nR=16.575\nG=5.240\nB=0\n\nFor the flames light material.( The base weightings of rgb for tallow\ncandle flame were R 0.759 G 0.240 B 0)\n\nFor a tallow candle, emitting 1 candela of light. When using these\nvalues my night renders look like this:\n\nhttp://homepage.ntlworld.com/mark.sutherland/internaltallow-h.jpg\n\nWhich is not quite what I was expecting using pcond... I get the\nimpression my lighting values are too low? But the results aren't too\nbad, so I thought I'd try to illuminating of a manuscript.\n\nIn this next render I moved the candle right up close to the manuscript\n(its just off the bottom), but the illumination is not really enough to\nshift the book out of scotopic levels.\n\nhttp://homepage.ntlworld.com/mark.sutherland/outputbook22hrtallow-h.jpg\n\nA false colour image shows they levels barely get above 1.5 lux\n\nhttp://homepage.ntlworld.com/mark.sutherland/outputbook22hrtallow-hfalse\ncolor.jpg\n\nI thought id try a home experiment, I lit a candle in a pitch black room\nand moved a book varing distances away from the candle, and there was\nvery little scotopic vision even at a distance of about a metre away.\nWhen I do a render without the candles at night the falsecolour images\nshow very little increase in lux. Is lux a very sensitive scale? A small\ntiny increase in lux real life increases the visability a lot? But pcond\n's filter is not sensitive enough, and also the limitation of the\nmonitors contrast and lighting abilities not enough to show any\ndifference? So many questions!\n\nThe problem is that using the RGB lighting values suggested, they don't\nappear to be able to illuminate the manuscript to a reasonable looking\nlevel, even though in real life a candle could. Wheres my problem?\n\nJohn\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20040418/352b9601/attachment-0001.htm\n", "replyTo": "", "sender": "radiance-general-bounces@radiance-online.or", "isquestion": true, "tags": [], "id": "<C4DB975B8FB42B44AB8CD12824D239F201430009@iu-mssg-mbx07.exchange.iu.edu>", "refs": [], "datetime": "Mon Apr 19 03:15:44 2004", "email": "radiance-general-bounces@radiance-online.org", "subject": "[Radiance-general] low lighting? is this normal?"}