{"body": "\nDear:\n\nI am using Daysim to calculate who much energy consumption for lighting to\ncompensate the daylight.\n\n1, I found The total annual hours of occupancy at the work place and the\ntotal annual hours of electric lighting are wrong. I calculated it by hands\naccording to the rules and methods from Tutorial. I found it is different\nfrom the result of Daysim.\n\n2, User Behaviour,   \"Active\" means \"A user who operates the electric\nlighting in relation to ambient daylight conditions\"  I donot understand\nwhat does \"the ambient daylight conditions\" mean here?  For blinds, If there\nis no blinds or other shading devices in my building, how can i set this for\nblinds?\n\n3, Lighting and Shading control system.  For blinds control, I really donot\nknow what is the difference between set in \"User Behaviour - blinds use\" and\n\"Lighting and Shading control system - blinds control\" ?  Likewise, if there\nis no blinds how can i set it?  For lighting control, i tried the frist\nthree types, which are \"Manual on/off switch near the door\",  \" Switch off\noccupancy sensor\", and \"switch on/off occupancy sensor\"  i didnot find any\ndifference of the results between the three.\n\n4 in my building the electric lighting is only used when the daylight does\nnot meet the 300 lux requirement. so who can i select the lighting control\ntype?  is the \" Photosensor controlled dimming system? apropriate for my\nsituation?\n\n5 what is the function of \"work plan sensor\"\n\ni am new to Daysim so i have many questions  Hope you can help!  Thank you\nvery much!\n\nBest Regards!\n\nvictor\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20090521/26789dc0/attachment.html\n", "replyTo": "", "sender": "Victor Li", "isquestion": true, "tags": [], "id": "<be3956780905210213y23fb7b7fm9b2f1420267eb27b@mail.gmail.com>", "refs": [], "datetime": "Thu May 21 02:13:08 2009", "email": "victorpermanent at gmail.com", "subject": "[Radiance-general] Daysim Electirc Lighting energy calculation"}