{"body": "\nChien,\n\nIES's Virtual Environment is a software suite for MEP / Building Services\nengineers. It offers things like energy modeling, thermal load analysis,\nCFD, and analysis tools of that sort. One of the modules is called\nRadianceIES, which translates the model in VE to Radiance geometry and calls\nDesktop Radiance.\n\nYou can set most of the switches, pick sky types, apply materials, set\npatterns on the materials, set camera views, and add luminaires.\n\nMore information is here:\nhttp://www.radiance-online.org/radiance-workshop5/2006_Radiance_Workshop/Presentations/DonStearn.pdf\n\nHonestly, if you know what you're doing, there aren't many things you can't\ndo with it that you would be able to do interfacing with Radiance directly,\nbut I'll try to hit a few:\n\nVE is set up as a walled garden, performing the tasks for you in the\nbackground. This can be troublesome if something goes wrong, and you're\ntrying to retrace where the problem is. Also along these lines, they don't\nallow for scripting within VE, nor an API to script from the outside, so you\ncan't do fancier things like multiple iterations of geometry, data\nmanipulation, or things of that nature. Another thing is that the models are\ncatered toward the thermal modeling, so they are mostly massing geometry.\nFor more complex geometry, you either have to have generated it separately\n(an external RAD file) or brought the model through something like Sketchup,\nin which case I'd recommend su2rad instead. As I recall, sensor points are\nlimited to one per room, so you cannot generate a grid of values.\n\nPersonally, I'm not a fan of the intensely hierarchical nature of VE, there\nare some settings which are 5, 6, 7 windows deep, but I gather you're used\nto this through the thermal/energy modeling bits of the software. All that\nsaid, version 6 is being released in a month or so, maybe there will be a\ndifferent song to be sung then.\n\n--Dave\n\n\n------------------------------\n\n*From:* radiance-general-bounces@radiance-online.org [mailto:\nradiance-general-bounces@radiance-online.org] *On Behalf Of *Chien Si\nHarriman\n*Sent:* Monday, May 18, 2009 6:02 PM\n*To:* radiance-general@radiance-online.org\n*Subject:* [Radiance-general] questions from newbie\n\n\n\nHi all-\n\n\n\nI?m being asked increasingly to perform more daylighting and artificial\ndaylight studies.  I typically use IES Virtual Environment as the interface\nfor Radiance, and I find I like it a fair amount, in terms of ease-of-use.\nSince this is where I started using Radiance, I?m wondering if anyone has\nany insights into what IES Virtual Environment can/cannot do when compared\nto scripting from scratch.  Anyone offering insight here would be greatly\nappreciated.\n\n\n\n\n\n\n\n\n\n*Chien Si Harriman, LEED AP*\n\n*Senior Building Performance Engineer*\n\n* *\n\n*G U T T M A N N *&* B L A E V O E T *|* * *C o n s u l t i n g  E n g i n e\ne r s*\n\n2351 Powell Street | San Francisco, CA 94133\n\nCommitted to the 2030 Challenge <http://architecture2030.org/>\n\n\n\nDirect  415.655.4005 | Main  415.655.4000 | Fax  415.655.4001\nEmail charriman@gb-eng.com | www.gb-eng.com\n\n\nSan Francisco* *|  Sacramento* *|  Santa Rosa\nCertified Green Business, San Francisco, Sacramento, and Santa Rosa | 2007\nSacramento Sustainable Business of the Year Award Recipient\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20090527/1a31f467/attachment.htm\n", "replyTo": "", "sender": "David Smith", "isquestion": true, "tags": [], "id": "<694e132c0905270954y166fa931v45a79c8d75d0ce2e@mail.gmail.com>", "refs": [], "datetime": "Wed May 27 09:54:08 2009", "email": "dbs176 at gmail.com", "subject": "[Radiance-general] questions from newbie"}