{"body": "\nGreat follow-ups Jack. A couple of points within...\n\nOn Thu, May 28, 2009 7:50 am, Jack de Valpine wrote:\n\n\nCool, all these years I never noticed that option to xform. The cool thing\nabout Radiance is you never will know everything about it.\n\nWhat we really need is some kind of program to re-orient normals based on\nsome point. I thought I had an old AutoLISP routine that did that, but\nman, that is long since gone from my backups (both the DVD kind and the\ngrey matter kind)!\n\n\nIt's hard to tell from your description if you are or not. Think of it\nthis way: let's say you are drawing a polygon that represents the face\n(screen)  of the computer monitor you are now staring at. If you draw the\npoints in a clockwise fashion, the surface normal will be pointing away\nfrom you (out the back of the monitor). If you define it with points in a\nCOUNTER-clockwise fashion, the polygon's surface normal will be pointing\nat you. IOW, in the first example, with a glow applied, the monitor face\nwould render black. In the latter example, the monitor face would glow.\n\nThis can be reinforced by a permutation of the so-called \"right hand\nrule\". Take your right hand and point at your face with your thumb, and\nthen curve your fingers around the axis defined by your thumb; if you\nimagine your fingers pointing in the direction of rotation (and direction\nof point creation), your thumb describes the surface normal (vector).\n\n===================\nRob Guglielmetti\nwww.rumblestrip.org\n\n\n", "replyTo": "<4A1E9688.4060409@visarc.com>", "sender": "Rob Guglielmetti", "isquestion": false, "tags": [], "id": "<1f95e166c77e5dd4ca53bed705828491.squirrel@mail.rumblestrip.org>", "refs": ["<896A338E-3E8D-471B-A874-38D99E4E9C2A@dmu.ac.uk>", "<63252a3e0905190235t68890498y4587c14a30f72504@mail.gmail.com>", "<4A129189.7090801@gmx.net>", "<63252a3e0905191909u67cdf21dj6ec4db9981fcdb7a@mail.gmail.com>", "<E0623274-AE12-46E0-8B65-486D93BAA7A0@rumblestrip.org>", "<63252a3e0905261907n771521c8ued989f23ec20dac9@mail.gmail.com>", "<453B05AD-DD6F-476F-877C-F465701C0224@rumblestrip.org>", "<63252a3e0905272041i775cf0aek3890e6f258f74c60@mail.gmail.com>", "<4A1E9688.4060409@visarc.com>"], "datetime": "Thu May 28 08:33:41 2009", "email": "rpg at rumblestrip.org", "subject": "[Radiance-general] Rendering large space with small detail(small picture now attached!)"}