{"body": "\nHi Lars, Rob\n\nIt looks like I have managed to get the mkillum surface to work for the\nskylight. The render times are reduced and the images displayed look\ndifferent too.\n\nHowever, I have been testing the use of the mkillum without the artificial\nlighting turned on in my model. When I do turn them on and run them with the\nparameters set to high accuracy levels, the simulation takes a very long\ntime. I think that any time gained by the mkillum surface is negated by the\nnumber of lights it has to simulate.\n\nIs there a way of simplifying the artificial lighting of the tenants either\nside of the mall space? The goal of the artificial lighting in the tenancies\nis not to be highly accurate but rather to give the daylight in the mall\nspace some context and to make it look more realistic as I?m only concerned\nabout the daylight in the mall. Ideally I would like to put a mkillum\nsurface in the position of the array of lights but I feel that this wouldn?t\nhelp reduce the complexity of the simulation as the same number of\ncalculations still need to be carried out, am I right?\n\nIs there a way in Radiance to make a planer object emit a certain amount of\nuniform light?\n\nLook forward to hearing from you,\n\nPaul\n\nOn Wed, May 20, 2009 at 2:09 PM, Rob Guglielmetti <rpg@rumblestrip.org>wrote:\n\n\n\n\n--\nPaul Chilton\n\nRenewable Energy Engineer\n\n[m] 0400 306 791 | [e] p.chilton@gmail.com\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20090527/ed1aa9d4/attachment.htm\n", "replyTo": "<E0623274-AE12-46E0-8B65-486D93BAA7A0@rumblestrip.org>", "sender": "Paul Chilton", "isquestion": false, "tags": [], "id": "<63252a3e0905261907n771521c8ued989f23ec20dac9@mail.gmail.com>", "refs": ["<896A338E-3E8D-471B-A874-38D99E4E9C2A@dmu.ac.uk>", "<63252a3e0905190235t68890498y4587c14a30f72504@mail.gmail.com>", "<4A129189.7090801@gmx.net>", "<63252a3e0905191909u67cdf21dj6ec4db9981fcdb7a@mail.gmail.com>", "<E0623274-AE12-46E0-8B65-486D93BAA7A0@rumblestrip.org>"], "datetime": "Tue May 26 19:07:47 2009", "email": "p.chilton at gmail.com", "subject": "[Radiance-general] Rendering large space with small detail (smallpicture now attached!)"}