{"refs": ["<CAAzVHq0AMYoHV5oE9L4vV7ePkBH6tA7-UfBLVuD1Gfq4VoYDRA@mail.gmail.com>"], "id": "<FFF56A6D37A3A54F91A03601AC22DA32263AFB195D@MAILBOX2.nrel.gov>", "subject": "[Radiance-general] Device suggestions for measuring surface color and reflectance in the field", "email": "Kyle Konis", "body": "\nI ASSume you are happy with simple spectral info (RGB) for your Radiance model? If so you could do this on the cheap and easy with a MacBeth color chart and the macbethcal utility in Radiance. Just sayin'.\n\n- Rob\n\nP.S. I know we're all lighting peeps, but recent research suggests the way to avoid Alzheimer's is cholesterol. Brain by bacon!\nP.P.S. I may have oversimplified the current research, a tad.\n\nSent: Wednesday, January 29, 2014 11:54 AM\nTo: Radiance general discussion\nDear list,\nI plan to build several radiance models of Alzheimer care facilities in preparation for a field study examining daylight exposures and cognitive / health outcomes in partnership with a colleague in health sciences.\nThe radiance work is intended to supplement the data collected from physical sensors to provide greater insight into 24-hour patters of light / dark.\n\nI would like to measure the surface optical properties (color,  reflectance) of the walls / ceilings and floors etc.\n\nI am aware of two devices that have been used to do this.\n\n1) The first is the X-rite Colormunki (actual name of product) that Michael Donn was using while visiting LBNL.\nThe second is the Minolta CM-2002 Spectrophotometer used by Mehlika Inanici.\nhttp://faculty.washington.edu/inanici/Publications/mi-luekos2010.pdf\nIf anyone has experience with this task who can provide some comments on their approach it would be appreciated. (Michael and Mehlika, i will likely contact you directly!).\nBest,\n-Kyle\n-----------------------------------------------\nKyle Konis, AIA, Ph.D\nAssistant Professor\nSchool of Architecture, WAH 204\nUniversity of Southern California\nLos Angeles, CA 90089-0291\nhttp://arch.usc.edu/faculty/kkonis\n-----------------------------------------------\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140129/a30a31df/attachment.html>\n\n", "isquestion": false, "replyTo": "<CAAzVHq0AMYoHV5oE9L4vV7ePkBH6tA7-UfBLVuD1Gfq4VoYDRA@mail.gmail.com>", "tags": [], "sender": "kskonis at gmail.com", "datetime": "Wed, 29 Jan 2014 12:08:03 -0700"}