{"refs": ["<CAFVgASULHpVBjEvOMkZ_BUBe=b78byxdHtBfSUJSO9Lm6Aym-A@mail.gmail.com>", "<FFF56A6D37A3A54F91A03601AC22DA32263AFB1BE2@MAILBOX2.nrel.gov>", "<CAFVgASUWNOGV9-m+p4LQjDEyiHdfFMn-0GPhAvn-xedFhzcLHw@mail.gmail.com>"], "id": "<FFF56A6D37A3A54F91A03601AC22DA32263AFB1BFB@MAILBOX2.nrel.gov>", "subject": "[Radiance-general] 3- or 5-phase method in simulation programs", "email": "Tim Perry", "body": "\nTim, a space must be a part of a single thermal zone. You can have multiple spaces in single thermal zone and \"share\" light among them with the air-wall construction, but OpenStudio does not currently \"roll up\" multiple spaces' loads and schedules into a single load schedule for the zone. A major limitation, I know.\n\nSent: Monday, February 03, 2014 10:50 AM\nTo: Radiance general discussion\nRob,\n\nThanks for the update. Can a space be part of two thermal zones? If not, can you have \"air-walls\" between adjacent spaces?\n\nThanks,\nTim\n\n\nOn Mon, Feb 3, 2014 at 9:14 AM, Guglielmetti, Robert <Robert.Guglielmetti at nrel.gov<mailto:Robert.Guglielmetti at nrel.gov>> wrote:\nHey Tim,\n\nJust to clarify the OpenStudio piece, OpenStudio can use Radiance and the 3-Phase method for annual daylight simulation (or the one phase (Greg insists this is a two phase) method). The OpenStudio app then generates lighting schedules based on the daylight availability and lighting control setpoints which are then pushed to an EnergyPlus input file (idf) for inclusion in an EnergyPlus whole building energy simulation. There is no limit to the number of thermal zones you look at simultaneously, but you are currently limited to one space per thermal zone.\n\nWe are currently adding the ability to specify shading controls from within the OpenStudio app and SketchUp plugin; when this is done, the user will be able to select from the standard EnergyPLus shading control modes, and the effect of the shades will be calculated automatically both in Radiance for the visual and in Energyplus for the thermal. Effects of \"borrowed light\" from one zone to another will also be calculated correctly.\n\nNo plans as of yet to implement the 5-phase in OpenStudio, but we'd hope that there would be an easy path from an OpenStudio model to a Daysim/DIVA/SPOT/whatever space-based model, with better control simulation, where the spatial resolution of the five phase method would pay dividends.\n\n- Rob\n\nSent: Saturday, February 01, 2014 12:47 PM\nTo: Radiance general discussion\nDoes anybody have a list of simulation programs using the three-phase or five-phase method?\n\nMy list is short:\n- DaySim / EcoTect\n- OpenStudio / EnergyPlus\n\nAre there others?\n\nTim Perry\n(916) 505-3634<tel:%28916%29%20505-3634>\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140203/4f18171c/attachment-0001.html>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] 3- or 5-phase method in simulation programs", "tags": [], "sender": "tim.v2.0 at gmail.com>", "datetime": "Mon, 3 Feb 2014 11:08:54 -0700"}