{"refs": ["<CAFVgASULHpVBjEvOMkZ_BUBe=b78byxdHtBfSUJSO9Lm6Aym-A@mail.gmail.com>", "<FFF56A6D37A3A54F91A03601AC22DA32263AFB1BE2@MAILBOX2.nrel.gov>", "<E950968C-D87A-49DB-8425-F51E44FC846F@lmi.net>"], "id": "<FFF56A6D37A3A54F91A03601AC22DA32263AFB1C00@MAILBOX2.nrel.gov>", "subject": "Re: [Radiance-general] 3- or 5-phase method in simulation programs", "email": "Tim Perry", "body": "\nYeah yeah, I know Greg. I think I associate \"phases\" with \"matrices\", is the problem.\n\nOnce upon a time we had rtcontrib, and people traced rays from the point or pixel to the sky. There was always an extra step required, to multiply the coefficients by patch radiances to get results. The process didn't have a name, because there was just the one Way To Do It[TM]. Then along came three phase (and eventually rcontrib), and there were three matrices to compute, plus the final matrix multiplication. So when that came out and it was called the three phase method, I equated \"phase\" with the creation of a matrix.\n\nSo you know, really, it's like two-, or four-, or SIX-phase!\n\nAndy, you need to update your marketing materials. =8-)\n\n\nSent: Monday, February 03, 2014 10:44 AM\nTo: Radiance general discussion\nHi Rob,\n\nI only call the daylight coefficient method a two-phase approach because it has two phases.  You can of course call it a 1-phase or 0-phase method if you prefer(!)\n\nI'm hoping Christoph Reinhart and Rick Mistrick will also say something about what they've been working on, to the extent that it differs from OpenStudio.\n\nCheers,\n-Greg\n\n\n\n\n\n\nHey Tim,\n\nJust to clarify the OpenStudio piece, OpenStudio can use Radiance and the 3-Phase method for annual daylight simulation (or the one phase (Greg insists this is a two phase) method). The OpenStudio app then generates lighting schedules based on the daylight availability and lighting control setpoints which are then pushed to an EnergyPlus input file (idf) for inclusion in an EnergyPlus whole building energy simulation. There is no limit to the number of thermal zones you look at simultaneously, but you are currently limited to one space per thermal zone.\n\nWe are currently adding the ability to specify shading controls from within the OpenStudio app and SketchUp plugin; when this is done, the user will be able to select from the standard EnergyPLus shading control modes, and the effect of the shades will be calculated automatically both in Radiance for the visual and in Energyplus for the thermal. Effects of \"borrowed light\" from one zone to another will also be calculated correctly.\n\nNo plans as of yet to implement the 5-phase in OpenStudio, but we'd hope that there would be an easy path from an OpenStudio model to a Daysim/DIVA/SPOT/whatever space-based model, with better control simulation, where the spatial resolution of the five phase method would pay dividends.\n\n- Rob\n\nSent: Saturday, February 01, 2014 12:47 PM\nDoes anybody have a list of simulation programs using the three-phase or five-phase method?\n\nMy list is short:\n- DaySim / EcoTect\n- OpenStudio / EnergyPlus\n\nAre there others?\n\nTim Perry\n(916) 505-3634\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140203/c10e1d82/attachment.html>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] 3- or 5-phase method in simulation programs", "tags": [], "sender": "tim.v2.0 at gmail.com", "datetime": "February 3, 2014 9:14:23 AM PST"}