{"body": "\nHi Rob,\n\nThanks for your help.\n\nI'll try to explain better what is happening in the image. As you look at\nthe image you are looking down the spine of a supermarket mall. Right in\nfront of the camera position is a void in the floor to the ground floor\nbelow. On the immediate left (I assume this is the 'cove' you talk about) is\nanother space perpendicular to the mall which is a food court. To the right\nand left are glazed shop fronts with the first shop front on the left\nshowing a reflection of the scene behind the camera position. The cubic\nlooking geometry are 1m high kiosks in the centre of the mall space. The\nbaffles hanging from the ceiling are internal shading devices which are\nhiding a horizontal skylight above which stretches the length of the mall.\nThe left top strip of baffles are external shading devices covering the\nvertical clerestory windows which again run the length of the mall.\n\nThe electric lighting you can see inside the shops fronts are very generic\nand are simply there so that the shops don't look like dungeons for the\npurpose of the image. The primary focus and motivation for the image is the\nday light conditions in the mall space and so the mall space has no electric\nlighting - just the shops.\n\nThe outside ambient conditions are a uniform sky.\n\nYou say;\n\n'the easiest way to avoid splotchy artifacts is to bring the direct light\ncontributions closer and closer to the surfaces visible in the image'\n\nI'm unsure exactly what you mean here as the direct light contributions are\nthe external sky and therefore how would you bring this closer to the\nsurfaces to create better resolution?\n\nThanks for your reccomendations on the variables, I'll try doubling the\nvariables you said were too low and seeing if that has a better effect.\n\nCheers,\n\nPaul.\n\n\n\n\n\nOn Tue, May 19, 2009 at 3:03 PM, Rob Guglielmetti <rpg@rumblestrip.org>wrote:\n\n\n\n--\nPaul Chilton\n\nRenewable Energy Engineer\n\n[m] 0400 306 791 | [e] p.chilton@gmail.com\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20090519/886b504f/attachment-0001.html\n", "replyTo": "<D4244713-2A43-4268-9C7A-CAEC0CEE1C44@rumblestrip.org>", "sender": "Paul Chilton", "isquestion": false, "tags": [], "id": "<63252a3e0905182239u74d44d93hd9bbe63cafc7e7aa@mail.gmail.com>", "refs": ["<63252a3e0905181732m3ddc2e50xd6a6d83e02979aff@mail.gmail.com>", "<D4244713-2A43-4268-9C7A-CAEC0CEE1C44@rumblestrip.org>"], "datetime": "Mon May 18 22:39:06 2009", "email": "p.chilton at gmail.com", "subject": "[Radiance-general] Rendering large space with small detail (smallpicture now attached!)"}