{"refs": ["<52F1C62C.9050902@umn.edu> <52F1F440.7050007@gmail.com>", "<52F22ECD.70704@umn.edu> <52F26CBC.6060602@umn.edu>"], "id": "<FFF56A6D37A3A54F91A03601AC22DA32263AFB1D73@MAILBOX2.nrel.gov>", "subject": "[Radiance-general] Radiance wiki proposal", "email": "Chris Kallie", "body": "\nHi Chris,\n\nI was about to respond to your earlier emails when this proposal came in. Thanks for your generous offer, first of all. Here's the thing: this has been tried and done before. Search the archives for radiance-general (which has stood the test of time and the ebb and flow of federal funding, BTW) and you will find initiatives started up, going all the way back to the very first Radiance Workshop in 2002. Collaborative efforts never got off the ground, and it's not for lack of someone offering to register a domain name and host the thing. People move, change jobs (careers, even), funding comes and goes, people get funny about ownership and distribution, and here's the big one: Radiance itself changes. The fact that Radiance continues to evolve and remain a high quality, well-documented bit of software is friggin' amazing to me, particularly in light of the fact that it's largely the product of one dude. But evolve it has (and does), and as it does the rules change. In response, the Radiance community takes up the new stuff (and new folks take up the old stuff), and we all document our successes and failures in various ways. There are papers, web pages, tutorials, resurrected out-of-print textbooks (thanks Fritz), all over the web, most of which are linked in some form or fashion from the radiance-general archives. And, as ever, there are the release notes, manpages, and the source code.\n\nEfforts are underway to make some energy modeling wikis, and some of these efforts are budgeted thousands of dollars, and they still suck, to be honest with you. I think the Radiance community does a great job on a largely volunteer basis producing what it does. The effort of maintaining a wiki, while noble, seems like just more administrative work for not a lot of benefit. The stuff is out there, and when things disappear, its usually for a good reason and when it's just someone pulled the plug on their website or whatever, these things can be found by coming to this listserv.\n\nI'm probably sounding like a dick right now, but all I'm trying to say is that your time would be better spent creating your own list of links and HOWTOs and adding it to the constellation of other stuff that's already out there. Again, I for one appreciate your enthusiasm and generosity. I just think that the Radiance wiki has been tried before. In fact, you might want to ping Andy McNeil because he was in the process of trying to add such a beast to the radiance-online.org site. Maybe it's an idea whose time has come, and I AM just a dick. Who knows?\n\n- Googs\n\n-----Original Message-----\nSent: Wednesday, February 05, 2014 9:54 AM\nTo: Radiance general discussion\nFellow Renderers,\n\nThis is my offer and proposal for a Radiance wiki:\n\nWith your collective approval, and if enough Radiance users pledge to contribute to a Radiance wiki (i.e., coauthor, manage, and/or otherwise create, edit, and maintain pages and entries), I will offer my services to register a domain name, pay for the hosting, and setup the wiki server.\n\n(Also, I would be content if someone or everyone would prefer to appoint someone other than myself for such an initiative.)\n\nSincerely,\nChris\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Radiance wiki proposa", "tags": [], "sender": "kallie at umn.edu", "datetime": "Wed, 5 Feb 2014 10:26:48 -0700"}