{"refs": ["<52F1C62C.9050902@umn.edu> <52F1F440.7050007@gmail.com>", "<52F22ECD.70704@umn.edu> <52F26CBC.6060602@umn.edu>", "<FFF56A6D37A3A54F91A03601AC22DA32263AFB1D73@MAILBOX2.nrel.gov>", "<CAOG+Niwg-DahBuzTzOjQOepjMtvOKtZZ-BAbXoHhc_dXLpYuFg@mail.gmail.com>", "<3EFFA2B9-A638-427B-B18A-1ADCA8059F42@lmi.net>", "<52F29CC8.5090804@umn.edu>"], "id": "<CAOG+NiygTuCEUPJ6auQRnk_oCnDyzcEh+RGoOArR-+2WYnVLeg@mail.gmail.com>", "subject": "[Radiance-general] Radiance wiki proposal", "email": "amcneil at lbl.gov", "body": "\nChris,\n\nSorry if some of us appear to be cynical, but I thinly you're off the mark\ndismissing those with less enthusiasm as naysayers who \"fundamentally\nmisunderstand or loathe the concept\" of wikis.  I think I can speak for\neveryone when I say that we would love for there to be the level of\ndocumentation you propose. Unfortunately funding for documentation isn't\navailable, so it is generally a personal time activity.\n\nAs Rob pointed out (who, by the way, has been instrumental in making\nRadiance available to Windows users and deserves all of our gratitude)\nsetting up and hosting a wiki isn't much of a hurdle, so a pledge to do\nthat isn't all that meaningful. Instead, a pledge to spend 200 hours this\nyear creating content for a wiki is substantially more meaningful, and\nwould likely be met with more enthusiasm.\n\nAs Axel pointed out in his 2006 presentation, most of the work of wiki\ndocumentation is done by 1% of the users. It's nice to think if you build\nit they will come, but unfortunately that has been demonstrated false (at\nleast for this community) and we'll need to do more than just \"hope that\nthe community makes an effort to upload content.\"\n\nUltimately, the challenge you'll face in starting a successful wiki is\ngetting buy-in from a broad base of users and motivating 1% of the Radiance\ncommunity to contribute substantial time adding content. Unfortunately, I\nthink you'll have to rely heavily on the people you deem naysayers, because\nthey are the ones who have been in the community the longest. Your appeal\nto the students in the community to do the heavy lifting seems misguided,\nwe spend significant time helping some students with their problems only to\nnever hear from them again after their dissertation is completed, so I\ndon't think they share your motivation.\n\nHere's my 2 cents on what will make your efforts a success:\n1 - Make a more meaningful pledge towards creating a wiki rich with content\n2 - Proactively seek buy-in and support from everyone within the Radiance\ncommunity (not dismiss  people with less enthusiasm as naysayers).\n3 - Work tirelessly to deliver content. Unfortunately you'll probably be\nworking alone at first.\n\nIf you decide to proceed by pledging a substantial amount of your time to\nadd content, I will pledge 40 hours of my personal time this summer to add\ncontent.\n\nGood luck and godspeed my friend,\nAndy\n\n\n\nOn Wed, Feb 5, 2014 at 12:19 PM, Chris Kallie <kallie at umn.edu> wrote:\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140205/18be9c51/attachment.html>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Radiance wiki proposa", "tags": [], "sender": "Andrew McNeil", "datetime": "Wed, 5 Feb 2014 14:51:08 -0800"}