{"refs": ["<CA+dqh61o4Jpaz4XX=SiATVj+bsHakbeMHgLxMzaNCx027XKbHg@mail.gmail.com>", "<CAAP856wot_U-+6-aRsTbn_fVk+-UCF_tA9G5u96OBt=gn9ND1A@mail.gmail.com>", "<52F3FA7D.3080805@gmail.com>", "<CAAP856wB5suZcDMGqQ2pHBBiYAqsbvLEC78Ob88105mXLc-H3w@mail.gmail.com>"], "id": "<1C83F395-2525-46F9-8211-423629503056@lmi.net>", "subject": "[Radiance-general] 2.5-phase method and gendaymtx", "email": "gregoryjward at gmail.com", "body": "\nI can't pretend to understand the inner workings of DaySim, either, but I know there are some differences with rcontrib.  These differences will lead one to prefer one or the other depending on simulation needs:\n\no\trcontrib uses a form of pure Monte Carlo to break illumination contributions into any desired number of components.  This flexibility allows it to be applied in a wide variety of circumstances, such as the 3-phase and 5-phase method.\n\no\tDaySim computes 145 components throughout a more standard application of the Radiance rendering & calculation tools, allowing it to take full advantage of irradiance caching at the expense of some generality.\n\no\trcontrib is a \"dumb\" but highly programmable tool, and by itself doesn't do anything useful.  It currently needs conjoined with a script, cal file or program to make it useful, and a number of these have been written such as genBSDF, genklemsamp, klems_int.cal, etc.\n\no\tDaySim includes a complete simulation of daylight control in a single interior space and is much easier to apply in typical situations, but may be harder to adapt to unusual conditions.\n\nI hope this helps.  Maybe Christophe can chime in with his thoughts.\n\n-Greg\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140206/20a96882/attachment.html>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] 2.5-phase method and gendaymtx", "tags": [], "sender": "Greg Ward", "datetime": "Thu, 6 Feb 2014 15:08:22 -0800"}