{"body": "\nJust a quick one guys....\n\nWe are doing some radiance analysis on a  new building design. The\nbuilding is to be located in Auckland, New Zealand (Southern Hemisphere,\nfull of orcs and hobbits and elves). The design is a museum building that\nspecifies a maximum of 350lux on a boat that is on display. We have to\nensure that daylight (sunlight + skylight) does not give levels greater\nthan this. We have designed the building to completely shade the boat\nsurface from direct sunlight throughout the year.\n\nSo, I have set up a numerical grid for analysis and ran the model under an\novercast sky and then used local meterological outside illuminance data.\nThis data gives a maximum diffuse illuminance of 50,000lux.\n\nUsing this overcast sky model the design works. However, would this be the\n'worst case scenario'? I understand that a clear sky gives a greater\nluminance distribution around the horizon that an overcast sky.\n\nFollowing a shading analysis we have found that the most exposure to the\nsky and direct sunlight will be at 12pm during the winter solstice (June\n21) to the north facade. At this point the sun will be at an altitude of\n30 degrees.\n\nIn order to calculate absolute illuminace levels on the boat can I just\nuse the CIE Clear sky model set up for this time period using the default\nvalues for horizontal diffuse irradiance and horizontal direct irradiance?\nOr do I have to specify the maximum values?\n\n\nThanks for your help\nBen\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20040506/cc28322e/attachment.html\n", "replyTo": "", "sender": "Ben Masters", "isquestion": true, "tags": [], "id": "<OF9B6C7E9A.DA0C4D03-ONCC256E8B.00825A9B-CC256E8B.0082D557@conwag.com>", "refs": [], "datetime": "Thu May  6 01:51:23 2004", "email": "mastersb at conwag.com", "subject": "[Radiance-general] Calculating maximum illuminance levels fromdaylight"}