{"body": "\nOn Thu, Jun 18, 2009 at 6:32 PM, Chris Yates <Chris@zed-uk.com> wrote:\n\n\nPlease be prepared to defend your procedures if someone comes along\nand has some doubts about the result. If you use a package that has the\nofficial blessings (like IES) you can just push a button and point to the\ncertificate to make your results credible.\n\nIf you roll your own you have to know what's going on and how to validate\nyour results.\n\n\n\nIf I were to export a 3rd party CAD model (via, say su2rad) consisting of N\nnumber of rooms, are there alternatives to the simple IES approach?\n\nSince you asked:\n\nIn su2rad you would\n\n1) check that your model is suitable for daylight simulations and\npatch the geometry where necessary\n\n2) define polygons where you want your working planes. If you want\nmore than one you also have to define groups to keep them apart.\n\n3) Export - this will create files with calc points suitable for rtrace\ninput\n\n4a) manually feed rtrace with these files and pipe it through rcalc to get\nlux or df\n4b) I might have already bundled a script to do it for you ...\n\n5) use any form of spreadsheet, data visualizer or simple command\nline tool to calculate your averages or plots.\n\nIn the future it may be possible to create an image from the polygons\nvia John M.s stencil method and visualise rtrace results in su2rad.\nBut we're not there yet.\n\nWRT the other points mentioned: You can select an area in ximage\nand print out the average as well as highlight max (and min?) values.\nBut I think you would be better off with defining a mask image and\nuse a composite. It's a precise and repeatable process as oposed\nto manual input of pixel coords.\n\nThe tutorial materials should be on the RwR CD. I can have a look\nwhen I'm back home next week.\n\nCheers,\nThomas\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20090619/cc74356a/attachment.htm\n", "replyTo": "Subject: [Radiance-general] Daylight factors", "sender": "Thomas Bleicher", "isquestion": false, "tags": [], "id": "<89355c0f0906181429y4bfb9e5aj9e976b28a62d8601@mail.gmail.com>", "refs": ["<694e132c0905270954y166fa931v45a79c8d75d0ce2e@mail.gmail.com>", "<4A3A4907.8060609@zed-uk.com>"], "datetime": "Thu Jun 18 14:29:03 2009", "email": "tbleicher at googlemail.com", "subject": "[Radiance-general] Daylight factors"}