{"refs": [], "id": "<CAK+g53BdqddMsKVVrhf6RAgeyrXae=9BuxigFGjKQF09hU4oQA@mail.gmail.com>", "subject": "[Radiance-general] Interpolate BSDFs", "email": "gmolina at hdlao.com", "body": "\nHello Everyone, Happy valentine's day\n\nI am working with shading devices, creating \"easy and understandable\"\ncharts in order to allow people to choose one or the other. My idea is to\nplot light (or solar) transmission, using the concept of BSDF.\n\nI think Klems basis does not have the resolution I am looking for.\nAccordingly, I thought on creating a Klems MF:2, MF:4, etc. basis, but that\nmight take too long.\n\nFinally, I am evaluating on using genBSDF by analyzing only the center of\nthe patches (i.e. sending only parallel rays) and interpolating, in order\nto get a smoother and better representation.\n\nI know Greg worked with this and that it is a really non-straightforward\nproblem, so I wanted to know if there is any program that helps with\nthis... and also I would like to know if I am thinking this correctly.\n\nAS ALWAYS, THANKS IN ADVANCE.\n\nGerm?n Molina\nHunter Douglas Chile S.A\n\n--\n\n\n*Nota de Confidencialidad:* Este mensaje inclu?do los archivos adjuntos son\nconfidenciales y pueden contener informacion privilegiada protegida por\nley. Si Ud. no es el destinatario, deberia abstenerse de copiarlo,\ndistribuirlo, divulgarlo o usar la informacion contenida. Por favor, avise\ninmediatamente al emisor y borre este mensaje de su sistema. Los mensajes\nelectronicos son susceptibles de ser cambiados, infectados o adulterados\nsin autorizacion. No asumimos responsabilidad alguna por ninguna clase de\ncambios o sus consecuencias. Usted debe estar informado que la compania\npuede hacer un seguimiento de sus mensajes electronicos y su contenido,\ngracias.\n\n*Confidentiality Notice:* The information contained in this email message,\nincluding any attachment, is confidential and is intended only for the\nperson or entity to which it is addressed. If you are neither the intended\nrecipient nor the employee or agent responsible for delivering this message\nto the intended recipient, you are hereby notified that you may not review,\nretransmit, convert to hard copy, copy, use or distribute this email\nmessage or any attachments to it. If you have received this email in error,\nplease contact the sender immediately and delete this message from any\ncomputer or other data bank, Thank you.\n\nA informa??o transmitida ? confidencial e para conhecimento exclusivo do\ndestinat?rio. Sua utiliza??o, n?o autorizada, constitui crime pass?vel de\npris?o. Todas as precau??es poss?veis foram tomadas para garantir que este\ne-mail n?o contenha v?rus. Uma vez que nossa empresa n?o pode assumir\nresponsabilidade por nenhuma perda ou dano causado por este e-mail ou de\nseus anexos, recomendamos que o destinat?rio utilize seus procedimentos de\nantiv?rus antes de qualquer uso.\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140214/15c6e782/attachment.html>\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "CHI-German Molina", "datetime": "Fri, 14 Feb 2014 10:23:52 -0300"}