{"body": "\nHi Nalin.\n\nWelcome to the wonderfully complex world of Radiance.\n\nMy answers are below ...\n\nOn Sun, Jul 12, 2009 at 8:33 AM, nalin swaroop<nalinswaroop@gmail.com> wrote:\n\nI'm not very familiar with ESP-r and how it models scenes and converts\nto Radiance. You should check that 20:00h is actually dark for the day\nyou selected. Depending on your location and time of the year the sun\ncan still be visible.\n\nAlso I assume that ESP-r models walls as abstract 'interfaces' with\ncertain properties. These get exported to Radiance as single polygons.\nThe light leaks you see in your image are effects of interpolation, where\nRadiance incorrectly calculates the brighness of the wall based on the\noutside illuminance. To avoid this you can switch interpolation off (big\nimpact on rendering time, option '-aa 0'). More efficient would be to\nbuild the model with 'real' walls, so that your interior 'walls' are boxed\ninside the exterior 'walls'. That needs to be supported by your exporter,\nthough.\n\n\nThe ambient value is necessary to compensate for the loss of\nilluminance that Radiance cuts off when it limits the number of bounces.\nBasically every further bounce would still contribute to the illuminance\nbut if you stop following the ray after N bounces you neglect this\nsmall amount. Setting the '-av' value to the average of the room will\nthen add this amount. You could say, with the right '-av' value you\nget a more accurate result than without.\n\nFinding the right '-av' value is an art in itself. For outside scenes\nyou get a value in the comments of the output of the gensky program.\nRun gensky in a terminal ('command prompt') with your date and time\nand look for the comment line '# Ground ambient level:'.\n\nFor indoor scene (without artificial light) you can use this value and\nmultiply it with a reasonable daylight factor for the room.\n\nIf you add aritificial light you can calculate an approximate '-av'\nfrom your target horizontal illuminance (in Watts/m^2) divided\nby Pi. Say you want 200lux (0.29W/m^2) then your -av would\nbe 0.29/3.14 = 0.092.\n\n\nI think I answerd all the above. I might have missed a point here\nbut that's due to your lack of interpunctuation. Capitalisation is power!\n\n\nThat's another thing where you need experience and you have\nto define how accurate you want your renderings to be. Your\nscene (based on the image) is empty so most light hits the\nfloor and walls directly from the luminaires (assuming there is\nno contribution from the outside). You have to make a guess\nabout the number of significant bounces. In this situation I'd\nsay you are reasonably accurate after 3 or 4 bounces.\n\nTo verify your estimate you can calculate a single point with rtrace\nand increase the number of bounces until your results do not\nvary significantly.\n\nAlso don't expect Radiance to be unrealistically accurate. I always\ngot frustrated by Lighting Designers who believe that Radiance can\ngive you the lux values or daylight factors to the second decimal place.\nEven your average light meter has an error of 3%. They have to learn\nhow to deal with good estimates.\n\n\nCheers,\nThomas\n\n", "replyTo": "<736238ce0907120033m351596fdm7d58abfb31dc2b8c@mail.gmail.com>", "sender": "Thomas Bleicher", "isquestion": false, "tags": [], "id": "<89355c0f0907120137x343c8870kfcdf08ee1ce62122@mail.gmail.com>", "refs": ["<736238ce0907120033m351596fdm7d58abfb31dc2b8c@mail.gmail.com>"], "datetime": "Sun Jul 12 01:37:25 2009", "email": "tbleicher at googlemail.com", "subject": "[Radiance-general] Basic daylighting and artificial lightingtest(ambient value problem)"}