{"body": "\nThomas wrote:\n\"Also I assume that ESP-r models walls as abstract 'interfaces' with certain\nproperties. These get exported to Radiance as single polygons.\nThe light leaks you see in your image are effects of interpolation, where\nRadiance incorrectly calculates the brighness of the wall based on the\noutside illuminance. To avoid this you can switch interpolation off (big\nimpact on rendering time, option '-aa 0'). More efficient would be to build\nthe model with 'real' walls, so that your interior 'walls' are boxed inside\nthe exterior 'walls'. That needs to be supported by your exporter, though.\"\n\nHi Thomas, what if a small diameter radiance \"cylinder\" could be drawn\naround the edges with the light leaks? Like a kind of \"silicone sealant\"! As\nyou know, I'm no coder but I'm guessing it could be python scripted from\nSketchup. There'd be a small increase in rendering time. If the cylinder is\nsmall enough it won't show. Or, if the appropriate size and colour are\nselected you could achieve \"cartoon edges\"!\n\nCheers\n\nChris\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of Thomas\nBleicher\nSent: 12 July 2009 09:37\nTo: Radiance general discussion\n\nHi Nalin.\n\nWelcome to the wonderfully complex world of Radiance.\n\nMy answers are below ...\n\nOn Sun, Jul 12, 2009 at 8:33 AM, nalin swaroop<nalinswaroop@gmail.com>\nwrote:\n\nI'm not very familiar with ESP-r and how it models scenes and converts to\nRadiance. You should check that 20:00h is actually dark for the day you\nselected. Depending on your location and time of the year the sun can still\nbe visible.\n\nAlso I assume that ESP-r models walls as abstract 'interfaces' with certain\nproperties. These get exported to Radiance as single polygons.\nThe light leaks you see in your image are effects of interpolation, where\nRadiance incorrectly calculates the brighness of the wall based on the\noutside illuminance. To avoid this you can switch interpolation off (big\nimpact on rendering time, option '-aa 0'). More efficient would be to build\nthe model with 'real' walls, so that your interior 'walls' are boxed inside\nthe exterior 'walls'. That needs to be supported by your exporter, though.\n\n\nThe ambient value is necessary to compensate for the loss of illuminance\nthat Radiance cuts off when it limits the number of bounces.\nBasically every further bounce would still contribute to the illuminance but\nif you stop following the ray after N bounces you neglect this small amount.\nSetting the '-av' value to the average of the room will then add this\namount. You could say, with the right '-av' value you get a more accurate\nresult than without.\n\nFinding the right '-av' value is an art in itself. For outside scenes you\nget a value in the comments of the output of the gensky program.\nRun gensky in a terminal ('command prompt') with your date and time and look\nfor the comment line '# Ground ambient level:'.\n\nFor indoor scene (without artificial light) you can use this value and\nmultiply it with a reasonable daylight factor for the room.\n\nIf you add aritificial light you can calculate an approximate '-av'\nfrom your target horizontal illuminance (in Watts/m^2) divided by Pi. Say\nyou want 200lux (0.29W/m^2) then your -av would be 0.29/3.14 = 0.092.\n\n\nI think I answerd all the above. I might have missed a point here but that's\ndue to your lack of interpunctuation. Capitalisation is power!\n\n\nThat's another thing where you need experience and you have to define how\naccurate you want your renderings to be. Your scene (based on the image) is\nempty so most light hits the floor and walls directly from the luminaires\n(assuming there is no contribution from the outside). You have to make a\nguess about the number of significant bounces. In this situation I'd say you\nare reasonably accurate after 3 or 4 bounces.\n\nTo verify your estimate you can calculate a single point with rtrace and\nincrease the number of bounces until your results do not vary significantly.\n\nAlso don't expect Radiance to be unrealistically accurate. I always got\nfrustrated by Lighting Designers who believe that Radiance can give you the\nlux values or daylight factors to the second decimal place.\nEven your average light meter has an error of 3%. They have to learn how to\ndeal with good estimates.\n\n\nCheers,\nThomas\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n", "replyTo": "<89355c0f0907120137x343c8870kfcdf08ee1ce62122@mail.gmail.com>", "sender": "radiance-general-bounces@radiance-online.or", "isquestion": false, "tags": [], "id": "<4A8066505EDB43FBBF42A80ABC0C3D84@ZED.local>", "refs": ["<736238ce0907120033m351596fdm7d58abfb31dc2b8c@mail.gmail.com>", "<89355c0f0907120137x343c8870kfcdf08ee1ce62122@mail.gmail.com>"], "datetime": "Tue Jul 14 03:39:09 2009", "email": "radiance-general-bounces@radiance-online.org", "subject": "Re: [Radiance-general] Basic daylighting and artificial lightingtest(ambient value problem)"}