{"refs": ["<CAD83LVLfdmHLOT5PTQB4awAZf-Fm6V9fkiCfWJZMmHAkE-DxHg@mail.gmail.com>", "<CAD83LVLdfVGV=ZoMFjjBAARacAe+rgKpgeZP36Ktb=EkD_F3pQ@mail.gmail.com>"], "id": "<AAE7BA2C-727F-45FA-9B0F-51CEE5207E7D@lmi.net>", "subject": "[Radiance-general] What does \"ray coefficient\" mean?", "email": "gregoryjward at gmail.com", "body": "\nRays you specify on the input are traced by rcontrib until they strike a surface whose modifier matches one of the names you've specified with a -m or -M option. At that point, the fraction of that surface's color that contributes to the final ray value is reported (in RGB coefficients) if operating with the default -V- option.  If -V+ is specified, then the RGB contribution to the final ray color is reported, instead.\n\nIn other words, the difference between -V- and -V+ is that only the latter considers the actual color returned by the surface itself, whether it be a light source, a window, or another material.\n\nThe 3 values reported in your example are the RGB values for each ray that hits the sky_glow material.  Going from the name of the file and nothing else, I'm guessing this is an overcast sky distribution, so you are computing partial sky contributions rather than daylight coefficients in this case.\n\nIf you want to compute daylight coefficients, you would need to divide your sky hemisphere into bins according to the Tregenza or Reinhart sky subdivisions and compute coefficients (-V-) rather than contributions (-V+).\n\nThere are methods and tutorials for doing so elsewhere -- I'm not sure where at this point as I'm bad at tracking such things, but I'm sure there are others who can help you to find them.  Check \"Goog's\" latest posting for starters.\n\nCheers,\n-Greg\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140310/b007ba3e/attachment-0001.html>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] What does \"ray coefficient\" mean?", "tags": [], "sender": "Greg Ward", "datetime": "Mon, 10 Mar 2014 11:01:28 -0700"}