{"refs": [], "id": "<CAO0Bi3UsFNoLwqvMEkjXLK3RqRbu1wi5TCd1GvuDG4ijKK3mVQ@mail.gmail.com>", "subject": "[Radiance-general] Using CFS for thermal analysis_II", "email": "iinchaca at gmail.com", "body": "\nHi Radiance experts\n\nI'm coming with another question regarding the use of CFS (XML files) for\nthermal simulations.\n\nI posted the first part of this question in the 'Open Studio Forum' but\nthis time I'll try here.\n\nI'm trying to use XML files of CFS that were generated by a\ngonio-photometer based in Tregenza angle basis. Thanks to the the help of\nsome of you now I know that I have to transform first such file into the\nKlems angle basis (using bsdf2klems) in order to be able to import it to\nWindow7 to then 'report' it to Energy Plus as idf file.\n\nBut... when I try to import the converted 'tregenza-to-klems' new XML file\ninto Window7 and calculate it, I get the message: XML error: WavelengthData\nnot found. Error: load BSDF layer=1\nFirst we thought that the problem was the format of the new file (since all\nthe values were presented in only one column) but apparently that is not\nthe case.\n\nIf I try to import the file in its original format (tregenza) then i get:\nthe XML file contains data in the NIR wavelenght. Acceptable wavelenghts\nare 'solar' and 'visible'.\nI tried a normal simulation (to test the Klems converted file) and a\nwarning  message appears before generating the rendering: BSDF klems.xml\nfile has 103% transmission.\n\nI wonder if someone here have any advice to solve this.\n\nI'd like to ask also if anybody knows if this would be the same situation\nusing Diva for Rhino (if the programme makes difference between Klems and\nTregenza sky subdivisions).\n\nI'll appreciate your help.\n\nChantal.\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140326/84d7e778/attachment.html>\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "minchaca", "datetime": "Wed, 26 Mar 2014 18:51:25 +0100"}