{"refs": ["<9013E154BAB3F24D97C18A4FEAB61036BF353D19@ad-exchmbx2-2.aau.dk>", "<88079A360FAC7441AE93ECBF61998236113B3055@AMXExMb01.global.arup.com>", "<9013E154BAB3F24D97C18A4FEAB61036BF353F85@ad-exchmbx2-2.aau.dk>,", "<36a8085461cb4d0dbb3d255360065b20@AM3PR02MB209.eurprd02.prod.outlook.com>"], "id": "<7083F714-8211-4CF8-AAD1-B8BC6F851339@create.aau.dk>", "subject": "Re: [Radiance-general] Conversion of RGB irradiance values to a illuminance val", "email": "Claus Br?ndgaard Madsen", "body": "\nGiovanni,\n\nThanks. You're right. My camera is band-limited as yours :-)\n\nBut then again. I don't think the light meter measures into IR nor UV, either.\n\nThe values of my HDR images are true radiance values, but for the three relatively narrow rgb bands respectively.\n\nSo, brightness values you say. But which of the many ways of converting from RGB to brightness do I choose? Which weighting if the color channels?\n\nBest\n\n- an iPhone mail\n\nOn 27/03/2014, at 16.23, \"Giovanni Betti\" <gbetti at FosterandPartners.com<mailto:gbetti at FosterandPartners.com>> wrote:\n\nClaus,\n\nLet me see if I can help here.\nI am not sure what camera set up you have but I see it hard for you to be capturing a radiance map with your HDR images.\nThat would mean that your camera can record from the IR to the UV, well beyond the visible light only.\nIf that?s the case, I want the same camera!\n\nOtherwise, if you have a normal SLR fitted with a Sigma 180 fisheye, you?ll likely be recording luminance maps. Integration of the brightness values (forget about colours) over the hemisphere will give you your illuminace reading at the focal point of the camera, to be compared with the reading from the lux meter.\n\nEvalglare has a handy option to do this integration for you.\n\nHope this helps,\n\nGiovanni\n\n////////////////////////////////////////////////\nGiovanni Betti\nSent: 27 March 2014 15:00\nTo: Radiance general discussion\n\nThanks Christopher,\n\nMy situation is a little different, I think.\n\nI point to SIGMA 180 degree field-of-view lens vertically upwards and make a full hemisphere HDR image (radiance map) from that. I then integrate to get the vertical irradiance in each of the three color channels. These values are calibrated so they are in W/m^2.\n\nSimultaneously, I place a light meter flat (sensor pointing vertically upwards) and take a reading. This reading is a single value in Lux.\n\nSo, how do I convert the three irradiances to a Lux value? Spectral integration, yes, but how exactly?\n\nCheers\n\nSent: 27. marts 2014 15:45\nTo: Radiance general discussion\nIf I understand your situation correctly, I believe you would need to know the reflectance of the material at the point of the irradiance measurement to backtrack to illuminance for calibration. This works when the surface is Lambertian (diffuse), and much more difficult if there?s any glossiness. For calibration purposes, people often include a photographic grey card of known reflectance in their scene and take actual luminance or illuminance meter measurements at the grey card.\n\n\nI use hemi-spherical HDR images to compute a vertical irradiance value (W/m^2) for each color channel.\n\nIf I wish to compare/calibrate these numbers to a reading from a light meter (giving illuminance in Lux) how do I go about converting the three (RGB) irradiances to illuminance?\n\nCheers,\nClaus\n\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140327/d578b942/attachment.html>\n\n", "isquestion": false, "replyTo": "<36a8085461cb4d0dbb3d255360065b20@AM3PR02MB209.eurprd02.prod.outlook.com>", "tags": [], "sender": "cbm at create.aau.dk", "datetime": "Thu, 27 Mar 2014 16:19:26 +0000"}