{"refs": ["<CAD7gt0XsN2Gc5cJykUj0PmOi218pRrMgn0S_okSUcGFocXKzMg@mail.gmail.com>"], "id": "<0136900C-72A1-4D68-83D0-38B0E25E6201@gmx.net>", "subject": "[Radiance-general] Ambient parameters optimization/tweaking", "email": "grobe at gmx.net", "body": "\nHi Vaib,\n\nI highly recommend the well-known \"Rendering with Radiance\" which describes the way the calculations are implemented as well as crucial parameters. For the ambient calculation, all parameters beginning with the letter \"a\" are of importance. Runnning any Radiance command with the option \"-defaults\" will show the default values applied unless you override them with setting command-line parameters.\n\nFor a Nort-facing room on the Northern hemisphere (Vienna), direct sun will never be observed in the inside. The (diffuse) starts to contribute only if you set the number of bounces for the ambient calculation to at least 1 (which will consider the contribution from the sky to interior surfaces with sky visibility). To enable interreflection of the room-surfaces, the -ab setting must be higher. Try -ab 1 to -ab 6 and see at which setting your illuminance readings stabilize.\n\nUnless you follow a very specific rendering strategy, in most cases \"rad\" will find rather well-tuned parameters according to the scene and the settings you configure in a \"rif\"-file. I would start from here, with reasonable values for indirect, detail and quality. If you want to try out the effect of a specific command line parameter, you can specify those in the \"rif\"-file as well using the \"render\" keyword. Please see the manpage and above mentioned book for details.\n\nThe setting for \"-ar\" seam to be low in your examples. \"-ad\" is high at 2048 - by pure guesswork I would have started with -ad 256 -as 128 -aa .1 -ar 64 for a room with simple windows, but this is not a good recommendation without knowing the scene. The settings for \"-aa\", \"-ad\", \"-as\" are interrelated and depend on the detail in the illuminance distribution that would be expected to affect your results. Again, see the book for details.\n\nCheers, Lars.\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Ambient parameters optimization/tweaking", "tags": [], "sender": "Lars O. Grobe", "datetime": "Wed, 2 Apr 2014 15:29:29 +0200"}