{"body": "\nLike so many other aspects of Radiance, the notion of view files has\nevolved to where it is, and changing things at this point would\nprobably mean breaking a lot of scripts.\n\nAs Jack pointed out, rpict takes the LAST (not the first) view in a\nview file as the valid one.  Technically, it takes the accumulation\nof view settings, so if for some reason a person had in their file:\n\nVIEW= -vta -vh 180 -vv 150 -vp 10 5 3 -vd .1 .9 -.1\nVIEW= -vtv -vh 50 -vv 35\n\nThe actual view used would be \"-vtv -vh 50 -vv 35 -vp 10 5 3 -vd .1 .\n9 -.1\"\n\nSince rvu appends to a view file a complete specification, the\nearlier views are generally irrelevant.  The reason rvu appends\nrather than overwrites this file is two-fold:\n\n1) It is often handy to edit the view file to get back to a previous\nview that you realize you liked better than the final view you wrote\nthere.\n\n2) You can use the append feature and the fact that anything\nfollowing the view file in the rvu \"view\" command is added at the end\nof the line makes for a convenient way to store key frames and time\nfrom the previous keyframe, which the spline.cal function can then\nuse to interpolate animated paths -- see footnote at the end of this\nmessage.\n\nHaving rpict ignore all but the last view in a file was the most\nconvenient way to get the behavior I wanted.  If your wish is to have\nrpict render all views in the file instead, you can simply run it as:\n\nrpict [options] -S 1 -o frame%02d.hdr octree < vlist.vf\n\nAnother nice thing about doing it this way is that you can start as\nmany rpict processes as you have processors and you get to run your\nsequence in parallel.  This is what rad does in fact, using also the -\nPP option to share memory as well.\n\nGetting back to your suggested modification to rad's behavior, I\nexpect it would cause some confusion and consternation for users who\ncreate their view files with rvu and overwrite previous views if they\ngot multiple renderings they weren't expecting of views they didn't\nwant.  Also, I'd have to think up yet another naming scheme for the\nmultiple output pictures, which I'm very reluctant to do.\n\n-Greg\n\n-Greg\n\nFootnote:\n=======\nUsing rvu to create key frame positions and interpolating these for a\nwalk-through animation path:\n\n(in rvu): view key.vf -t 1.5\n(in rvu): [some view changes to get to the next key frame position]\n(in rvu): view key.vf -t 2.5\netc.\n\nThe view file can then be converted to something usable with:\n\nrcalc -i key.fmt -e '$1=px;$2=py;$3=pz;$4=dx;$5=dy;$6=dz;$7=vh;$8=vv;\n$9=t' \\\n| tabfunc Px Py Pz Dx Dy Dz Ah Av T > key.cal\n\nWhere \"key.fmt\" contains:\nrvu -vtv -vp ${px} ${py} ${pz} -vd ${dx} ${dy} ${dz} -vu 0 0 1 -vh $\n{vh} -vv ${vv} -vo 0 -va 0 -vs 0 -vl 0 -t ${t}\n\nInterpolating a path of 1000 frames can be done with something like:\n\ncnt 1000 | rcalc -f key.cal -f spline.cal -o view.fmt -e 't=Ttot/999*\n$1' \\\n-s vt=v -e 'vux=0;vuy=0;vuz=1;vo=0;va=0;vs=0;vl=0' \\\n-e 'vpx=s(Px);vpy=s(Py);vpz=s(Pz);vh=s(Ah);vv=s(Av)' \\\n\nBoth \"spline.cal\" and \"view.fmt\" are provided in ray/src/cal/cal/.\nThis path can then be handed to ranimate for a nice walk-through\nsequence.\n\nThis is mostly from memory, so I may have messed up on a detail or\ntwo...\n\n", "replyTo": "<4A671CAD.9010406@visarc.com>", "sender": "Greg Ward", "isquestion": false, "tags": [], "id": "<BBCEECEF-E6A5-484F-8FD1-8097138E2AA4@lmi.net>", "refs": ["<4A66C832.7080809@nus.edu.sg>\t<89355c0f0907220502m19f12a2p3ed66f8b867980f6@mail.gmail.com>", "<4A671593.7070905@gmx.net> <4A671CAD.9010406@visarc.com>"], "datetime": "Wed Jul 22 11:20:50 2009", "email": "gward at lmi.net", "subject": "[Radiance-general] Re: proposed feature: interpreting view names inrad"}