{"refs": ["<CAAzVHq1ZU7wy_iwQAFfCxtM_ekoPvOFHaG9QuHfSVZ+8dDQ2EQ@mail.gmail.com>"], "id": "<1B23446CBF250648A2FC775DE3FE7E80551BB7BE@OC11expo28.exchange.mit.edu>", "subject": "[Radiance-general] Experience implementing gendaylit with physical inputs (-G: direct - horizontal irradiance and diffuse - horizontal irradiance)", "email": "Kyle Konis", "body": "horizontal irradiance)\n\nHi Kyle,\n\nYour approach is valid. Depending on what your plan to do with the data, you can also use just global horizontal irradiance and use the Reindl (or another separation model) to model direct and diffuse components. I have used Reindl extensively in the past with satisfactory results. For validation work using two sensors is of course preferable. You can use the gen_reindl.exe command in Daysim to convert a time series of\nmonth day hour global-irradiance\n\ninto a Daysim weather file.\n\nBest,\n\nChristoph\n\nSent: Wednesday, April 9, 2014 8:08 PM\nTo: Radiance general discussion\nI am curious if anyone has experience to share regarding the generation of skies with gendaylit using physical sensor data as input.\n\nI would like to monitor sky conditions at a building rooftop site and plan to collect direct - horizontal irradiance and diffuse - horizontal irradiance using Licor pyranometers.\nBoth sensors will be oriented horizontally. The first will be unshaded and record global horizontal irradiance.\nThe second will have a shadow band applied and will serve to record diffuse horizontal irradiance.\nI will then subtract the diffuse-horizontal contribution from the global horizontal value to obtain an estimate of direct-horizontal irradiance.\nI wanted to confirm that this is an appropriate approach, as well as to see if anyone has an alternative (better) idea, that does not involve a pyrheliometer.\nBest,\n-Kyle\n-----------------------------------------------\nKyle Konis, AIA, Ph.D\nAssistant Professor\nSchool of Architecture, WAH 204\nUniversity of Southern California\nLos Angeles, CA 90089-0291\nhttp://arch.usc.edu/faculty/kkonis\n-----------------------------------------------\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140410/97211dd6/attachment.html>\n\n", "isquestion": false, "replyTo": "<CAAzVHq1ZU7wy_iwQAFfCxtM_ekoPvOFHaG9QuHfSVZ+8dDQ2EQ@mail.gmail.com>", "tags": [], "sender": "kskonis at gmail.com", "datetime": "Thu, 10 Apr 2014 00:29:01 +0000"}