{"refs": ["<C1D00D3E2C274049B1266DDAC224DFCE0140BDEAA990@vmVbg-EX.cph01.hlt.dk>", "<CADq2N7OsuowxzaZ06jxdPWNPcNiv1W48NfsSmRVEPDr0Ew5S5g@mail.gmail.com>"], "id": "<CBDA7B0F3FC5354F986B71977E204BEC212FF45E@EX-MBX01.burohappold.com>", "subject": "[Radiance-general] Fwd: How to interpret the -vu for genklemsamp ?", "email": "Anne Iversen", "body": "\nAnne,\n\nYes, your situation seems quite complicated (or maybe just confusing). I had enough troubles visualizing without the added roatations you have. It seems as if you understand the basics, the view up vector correctly aligns/rotates your BSDF (about the normal vector) to the geometry in your model.\nIf your vector math is correct for the rotations you?ve noted below, I would have expected a kbin of (-0.09,0.26,1,-0.82,0,0.57). I also would have expected the vu vector to have non-zero components for Y. My understanding of order of operations would be: rotate BSDF 55d on a flat plane, then orient that vu to your real-world geometry. The base BSDF is oriented in XY, with +Y being the vu vector. Andy?s note the other day on rotation got me to full visualize having to orient both view and daylight matrices to the xml file. Think of them as hemispheres (or your cupped hands) about the geometry of the bsdf?\n\nI might suggest a few things:\n\n1)     if you have access to a CAD/modelling software, it is probably worthwhile taking some simple geometry with a line for the normal vector and one for the vu vector as it is aligned to your BSDF (assuming +Z is into room, +Y is ?up?, geometry lives in ?Z space). Then, begin the necessary rotations required to properly orient the geometry to what is in your model. Query the normal and view up vectors and there you have it.\n\n2)     I also find extremely helpful is physically rotating something on your desk w/ some indicating lines on it to better visualize things. I grab a pack of gum, my phone, post-it notes, etc and hold a pen in the vu vector and start spinning it around to understand at least what quadrants the vectors should lie in. While this won?t give you the vector components, this at least helps understand the relative rotations.\n\n3)     If your BSDF is quite complex and you?re not sure how it should behave, you might try to substitute with a simple blind/slat system that obscures a known set of sun positions. This also helped me in verifying that the rotations seemed correct before inserting the more complex BSDF.\n\nGood luck!\n\nChris\n\n\nSent: Tuesday, April 22, 2014 9:38 AM\nTo: radiance-general\nHello list,\nI have a question related to Chris Coulters question about BSDF orientation and implementation earlier this month.\nI have a BSDF, placed in a skylight, with normal vector, vp of: -0.09 0.26 1 (The skylights are oriented counterclockwise 335?N, and with tilt of 15?).\n\nNow I come to the more tricky part ? at least for me ? considering the ?view up?:\nThe clockwise rotation of the BSDF in the plane of the glass is 55?.\nThe default vu is 0 0 1. Doing some right-hand gymnastics, the coordinate system of the BSDF-plane is translated as the (x,z) coordinate system with the ?top? of the default-BSDF in 0 0 1 ?. Since the BSDF I?m about to simulate is oriented 55? clockwise in this coordinate system my ?vu vector will be (-0.82 0 0.57). The kbin for my view matrix then turns into kbin(-0.0936,0,0.2578,-0.82,0,0.57). I have tried to sketch this on a very simple hand drawing located here: https://dl.dropboxusercontent.com/u/9713279/20140422145308628.pdf\n\nMy question is ? is my understanding of the view up right ?\n\n\nMed venlig hilsen/Best regards,\n\nAnne Iversen\n\n____________________________________________\n\n[cid:image001.jpg at 01CF5E33.D7371C90]\n\nAnne Iversen\nPhD, MSc Energy, Sustainability Engineer\n\nDirect tel +45 8233 3049<tel:%2B45%208233%203049>\nMobile +45 6035 2049<tel:%2B45%206035%202049>\n\nHenning Larsen Architects A/S\nVesterbrogade 76\n1620 Copenhagen V\nDenmark\n\nTel +45 8233 3000<tel:%2B45%208233%203000>\nwww.henninglarsen.com<http://www.henninglarsen.com>\n____________________________________________\n\n\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140422/58f5a927/attachment-0001.html>\n-------------- next part --------------\nA non-text attachment was scrubbed...\nName: image001.jpg\nType: image/jpeg\nSize: 21366 bytes\nDesc: image001.jpg\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140422/58f5a927/attachment-0001.jpg>\n\n", "isquestion": false, "replyTo": "<CADq2N7OsuowxzaZ06jxdPWNPcNiv1W48NfsSmRVEPDr0Ew5S5g@mail.gmail.com>", "tags": [], "sender": "iversen.anne at gmail.com", "datetime": "Tue, 22 Apr 2014 18:15:39 +0000"}