{"body": "\nI'm not sure what you mean by the \"radiance scale factor\". Are you trying to compute the cameras' response curves? As for your second question, you won't be able to calculate radiance from a single exposure, even if all the details about that exposure are known. The process you are describing requires a high dynamic range (HDR) image, which is comprised of multiple exposures. The typical minimum is three exposures separated by 2 f-stops each, but ideally the longest exposure should have zero black pixels and the shortest have no white pixels. This ideal is only necessary to capture scenes of extreme dynamic range, however.\n\nRadiance-online.org also hosts an hdr mailing list which is definitely worth subscribing to:\n\nhttp://www.radiance-online.org/mailman/listinfo/hdri\n\nRobert Guglielmetti  IES, LEED AP\nBuilding Energy Efficiency Engineer\nNational Renewable Energy Laboratory (NREL)\n1617 Cole Blvd, MS-5202\nGolden, CO 80401\nrobert.guglielmetti@nrel.gov\n303.275.4319\n\nSent: Wednesday, July 01, 2009 7:55 AM\nTo: radiance-general@radiance-online.org\nHi All,\n\nI have taken images of same scene from two different camera at same time and same day. How to find the radiance scale factor between the two cameras.\n\nI will be grateful if somebody can explain me mathematical relation to compute the radiance of a  point in the scene.\nif the pixel value of the point  and cameras ISO value, F-stop, Shutter Speed are known\n\n\nBest Regards,\nBrajesh Lal\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20090701/dae57007/attachment.html\n", "replyTo": "Subject: [Radiance-general] Radiance", "sender": "radiance-general-bounces@radiance-online.org", "isquestion": false, "tags": [], "id": "<DF4A9C5A0CC2DF438AC1834530C59EE001CB27C3F4@MAILBOX1.nrel.gov>", "refs": ["<546561.45038.qm@web51903.mail.re2.yahoo.com>"], "datetime": "Wed Jul  1 08:11:38 2009", "email": "radiance-general-bounces@radiance-online.org", "subject": "[Radiance-general] Radiance"}