{"refs": ["<CAK21LWnh--XSxVSpNVWr27ERQWFcPzPJ4BeSQLqeeKX5H5pr8g@mail.gmail.com>"], "id": "<CF8E79C8.7494%robert.guglielmetti@nrel.gov>", "subject": "[Radiance-general] rsensor vs. rtra", "email": "Robert.Guglielmetti at nrel.gov", "body": "\nHi Bshara,\n\nThe short answer is that you should use \"rtrace ?I\" (that's a capital 'i') to calculate *horizontal* illuminance for simple workplane calcs, including the basic substantiation calc for LEED. This will give you the cosine-weighted integral of luminous flux incident upon the measurement point, aka illuminance.\n\nRsensor is a more sophisticated application of rtrace, which computes a sensor signal instead of illuminance. The signal is based on the spatial sensitivity of the sensor in question (or cosine, but most commercial photosensors are nowhere near cosine in their response), and the measurement point would be the actual location of the photosensor. This is how tools like SPOT and DAYSIM-PS do their thing. It's a more accurate means of simulating the actual electric lighting savings, since you're moving the simulation a bit further down the line.\n\nHaving said all that, horizontal workplace illuminance (where the \"sensor\" is on the workplace, looking up) is generally what is calculated. This is certainly true of LEED, and even EnergyPlus and in turn OpenStudio (currently0 calculate wprkplane illuminance and ASSume there is an \"ideally commissioned\" photosensor that properly responds to that daylight availability and reduces the lighting load. It's not perfect, but it's easier to implement.\n\nOne thing I'm also confused about with your poster is that you show views looking kinda southeast, and the plan shows this as well. If you are actually calculating *vertical* eye illuminance, you are getting a useful value for glare calculations, but this is not what LEED is looking for for the basis of satisfying basic daylight levels in the space.\n\nAs far as the 30% difference, it's hard to say if that's good agreement or poor, without knowing more about the model, particularly how you re-created the sky conditions for the model.\n\n- Rob\n\nOn 5/6/14, 11:30 AM, \"Bshara Rezik\" <bshara at gmail.com<mailto:bshara at gmail.com>> wrote:\n\nHello everyone,\n\nI have a noob question - What is the difference between rtrace and rsensor? and which should be used when simulating real life illuminance sensors for example for LEED IEQc 8.2 simulations.\n\nI currently used rtrace and recieved results similar to the real life sensor measurements, but with a result smaller by around 30%. Attached are my comparisons - Results to the left (study case measurements) should be multiplied by 10.\n\nThank you in advance.\n\nhttps://drive.google.com/file/d/0B3RBjK2uI5SlaV92MTdLVHMzNUkxZWl6NGhWRHZDU19wY0xr/edit?usp=sharing\n\nBshara Rezik | B.Arch\n\nARCHITECTURE | INTERIOR | SUSTAINABLE | DESIGN\n\nAddress: HaNasi 28A, Apt. 6, Haifa, Israel | Tel: +972-54-6314584<tel:%2B972-54-6314584>\nWebsite: http://www.bshara-arch.com | e-mail: bshara at gmail.com<mailto:bshara at gmail.com> | LinkedIn<http://il.linkedin.com/pub/bshara-rezik/20/726/981>\n\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] rsensor vs. rtrac", "tags": [], "sender": "Guglielmetti, Robert", "datetime": "Tue, 6 May 2014 11:51:10 -0600"}