{"body": "\nOK - thanks for the explanation.  All clearer now!\n\nI'm thinking that this shouldn't really cause you much problems.  You may be right that the sun will block that part of the sky nearest to the solar position, but that part of the sky that is blocked will be really small, and much less bright than the sun, so it should (I think?) make very little, to no, difference.  And because the diffuse sky is only part of the indirect calculation, a small change in directionality should again be almost unnoticeable.\n\nBTW, you could always set the sun direction input for the SSLD definition (A8, A9, A10) equal to that generated by gensky?\n\nCheers!\nPhil.\n\n\n-----Original Message-----\nSent: Wednesday, 12 August 2009 6:53 PM\nTo: Radiance general discussion\nHi Phillip!\n\n\nHm, my concern was maybe a bit academic :-) For a sky with a very steep\ngradient, the sun (light) would cover the brightest spot of the sky\n(glow) - so light replaces glow. But because of the altitude\nmodification gensky does for high altitudes, the sun (light) is 2.5\ndegrees off the brightest spot of the sky glow - leading to light plus\nglow spot. Probably the fact that the solid angle covered by the sun is\nsmall, the difference is not that high, but in cases where my\nilluminance is really only due to a small circumsolar domain of the sky,\nthis may lead to some higher illuminances, right? Would need some test\nmodels to see whether this becomes visible with a skylight. I just\nrealized that I have two different sun positions in my model - the\n'real' one by the ssld background sky, and the manipulated on by gensky.\n\nYes, I am using you cal-file, thank you by the way :-)\n\nCheers\n\nLars.\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n\n\n", "replyTo": "Subject: [Radiance-general] Using SSLD skies with sun", "sender": "radiance-general-bounces@radiance-online.org", "isquestion": false, "tags": [], "id": "<A386248F36A677429B35C46A6A057CA3010D2EF61231@AUEXC01.global.arup.com>", "refs": ["<4A82798E.7030908@gmx.net>", "<A386248F36A677429B35C46A6A057CA3010D2EF61220@AUEXC01.global.arup.com>", "<4A828303.5060701@gmx.net>"], "datetime": "Wed Aug 12 02:12:28 2009", "email": "radiance-general-bounces@radiance-online.org", "subject": "Re: [Radiance-general] Using SSLD skies with sun"}