{"refs": [], "id": "<FFF56A6D37A3A54F91A03601AC22DA32263FE961E9@MAILBOX2.nrel.gov>", "subject": "[Radiance-general] How to verify an IES file ?", "email": "Vaib", "body": "\nI'm late to this party, but I'd add that Axel Jacobs recently added a great Perl script to Radiance called \"ltview.pl\" which is useful for sanity testing your converted ies files in native Radiance. The script is available here:\nhttps://github.com/NREL/Radiance/blob/combined/src/util/ltview.pl/\n\n...and it's based on a thing I wrote a while back, which is documented here:\nhttp://www.rumblestrip.org/2004/05/10/ltview-a-radiance-utility/\n\nThe idea was to look at the actual Radiance light source description that gets created by the ies2rad utility, in actual Radiance, so you are truly seeing what you're gonna get in a Radiance simulation. It's helpful for confirming orientation, distribution, and intensity (by running \"trace\" commands in the rvu window).\n\nAnd of course everyone else who has contributed here is spot on. Photometry files are not magic, they are simply formatted data that can contain errors in assumptions and input. The user must know how to read them and be able to do their own fact checking. Familiarity with luminaire testing methods (and there's a big difference between SSL and non-SSL sources) and the IES-LM-63 specification, as well as the whole light loss factor issue which has been discussed, are critical to getting an electric lighting calculation right.\n\n-rob\n\n\n\nRob Guglielmetti\nNREL Commercial Buildings Research Group\nGolden, CO 80401\nrobert.guglielmetti at nrel.gov\n\n-----Original Message-----\nSent: Thursday, May 22, 2014 01:21 PM Mountain Standard Time\nTo: Radiance general discussion\nVaib\n\nI also used to do a quick parallel simulation in something like Dialux that's specialized in artificial lighting simulations. If you feed it with the same input values for maintenance factor and room reflectance you should get a similar output as with Radiance. You need to be familiar with these tools though because they have some hidden or implicit options that you need to account for. But then, so does ies2rad, I think.\n\nThomas\n\n\nOn Thu, May 22, 2014 at 12:31 PM, Vaib <vaibhavjain.co at gmail.com<mailto:vaibhavjain.co at gmail.com>> wrote:\nHi Thomas, Christopher,\n\nI used a similar luminaire of different make (Zumtobel Claris, Thanks! Christopher), and it gave quite similar results to the initial luminaire. That means that initial IES file was fine (even with Candela Multiplier of 8.6). I then reduced the luminaire's brightness to 50% (as Thomas suggested) by using \"-m 0.5\" in ies2rad. Now the simulated illuminance are quite close to the measured ones.\n\nThough I will calculate Lamp Loss Factor using the standard method to fine tune the results further. Thank you !\n\nBest regards,\nVaib\n\n\n\n\nOn 22 May 2014 19:09, Vaib <vaibhavjain.co at gmail.com<mailto:vaibhavjain.co at gmail.com>> wrote:\nThanks Thomas, Christopher\n\nI have used \"ies2rad -dm -t white -m 0.85 TX4948.ies\". I will now check with similar luminaire of another make, and also calculate a representative Lamp Loss Factor as Thomas suggested.\n\nBest,\nVaib\n\n\nOn 22 May 2014 18:44, Christopher Rush <Christopher.Rush at arup.com<mailto:Christopher.Rush at arup.com>> wrote:\nWhat command line syntax and options do you use with the ies2rad command to create your radiance definition of the light fixture? It could be an error with the particular manufacturer?s IES file, if they?ve somehow made the IES file incorrect in the process of normalizing the IES file and applying the 8.6 multiplier. In other cases IES files are sometimes reported with a candela multiplier of 1.0 (instead of normalizing them first). Can you test with another manufacturer?s IES file of similar distribution, efficiency, and lamp type (maybe Zumtobel Claris).\n\n\nSent: Thursday, May 22, 2014 6:04 AM\nTo: Radiance general discussion\nHello Everyone,\n\nIn the following report, the simulated illuminance (artificial lighting) is un-reasonably high than the measured illuminance. I suspect that the issue may be in the lumen output (or candela multiplier) in the IES file. Please have a look at the report.\n\nArtificial lighting report: http://bit.ly/1qXigtU\n\nMay I request your suggestions on how this issue can be resolved ? How much shall I reduce the Candela multiplier, if that is to be done ?\n\nBest regards,\nVaib\n\n\n\n\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140522/cd2c49bc/attachment-0001.html>\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "vaibhavjain.co at gmail.com>", "datetime": "Thu, 22 May 2014 14:48:07 -0600"}