{"refs": ["<CAK+g53AE_gnou2nUazCZCO8m_FrqdFdX9CMX3N5tOXgU=W2cFw@mail.gmail.com>"], "id": "<268DFF6716487845B5DE11F03099A8EE094AAB99@REXMB.intranet.epfl.ch>", "subject": "[Radiance-general] What to do when no Weather File is available?", "email": "CHI-German Molina", "body": "\nHi German,\n\nin those cases, we usually use \"Meteonorm\" to generate a specific weather data set. It  interpolates from the closest weather stations and they have a huge data basis. For Chile I would guess around 20 (just rough estimation looking at the map).\nBut it is important to know that the hourly irradiation data is generated stochastically from the monthly data (from the weather stations), so Meteonorm does not use hourly measured data as basis.\n\nSo in some kind you get a artificial weather data set, based on the interpolation of real measurements.\nIt includes also temperature and humidity, all you need for thermal simulation, too.\n\nThe output can be chosen in different formats, also epw.\n\ncheers,\n\nJan\n\n\n________________________________\nSent: Friday, June 20, 2014 3:20 PM\nTo: Radiance general discussion\nDear Everyone,\n\nThis question may be slightly out of the scope of this list; however, I guess people here might be able to answer it.\n\nI have been wondering, during the last few months, what do people do when there is no available Weather File for a certain location.\n\nAn example is my country: there are 5 EPW available for Chile and one of them is for Easter Island. For those who do not know, Chile is a very long country, with many climates and latitudes. For what I remember from my undergraduate classes, solar radiation can be obtained from monthly data. Can we do anything for relative humidity and temperature?\n\nIs there any other source of weather files that can be used? How about Stocastic Weather Files generators?\n\n--\nGerm?n Molina L.\nIngeniero Trainee\nHunter Douglas Chile S.A.\nCelular +569 89224445\n\n\nNota de Confidencialidad: Este mensaje inclu?do los archivos adjuntos son confidenciales y pueden contener informacion privilegiada protegida por ley. Si Ud. no es el destinatario, deberia abstenerse de copiarlo, distribuirlo, divulgarlo o usar la informacion contenida. Por favor, avise inmediatamente al emisor y borre este mensaje de su sistema. Los mensajes electronicos son susceptibles de ser cambiados, infectados o adulterados sin autorizacion. No asumimos responsabilidad alguna por ninguna clase de cambios o sus consecuencias. Usted debe estar informado que la compania puede hacer un seguimiento de sus mensajes electronicos y su contenido, gracias.\n\nConfidentiality Notice: The information contained in this email message, including any attachment, is confidential and is intended only for the person or entity to which it is addressed. If you are neither the intended recipient nor the employee or agent responsible for delivering this message to the intended recipient, you are hereby notified that you may not review, retransmit, convert to hard copy, copy, use or distribute this email message or any attachments to it. If you have received this email in error, please contact the sender immediately and delete this message from any computer or other data bank, Thank you.\n\nA informa??o transmitida ? confidencial e para conhecimento exclusivo do destinat?rio. Sua utiliza??o, n?o autorizada, constitui crime pass?vel de pris?o. Todas as precau??es poss?veis foram tomadas para garantir que este e-mail n?o contenha v?rus. Uma vez que nossa empresa n?o pode assumir responsabilidade por nenhuma perda ou dano causado por este e-mail ou de seus anexos, recomendamos que o destinat?rio utilize seus procedimentos de antiv?rus antes de qualquer uso.\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140620/bb13f292/attachment.html>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] What to do when no Weather File is available?", "tags": [], "sender": "gmolina at hdlao.com", "datetime": "Fri, 20 Jun 2014 14:42:48 +0000"}