{"body": "<4AA84615.6060308@gmx.net>\n\nThanks for the insight Lars,\n\nI had originally tried the box approach and moved onto the co-planar\nsurface approach as I felt like I was getting further.\n\nBack to the box approach, I've been testing this out now on just a very\nsimple wall model and am seeing strange behavior.  From all viewing\ndirections, the shadow from my hole in the wall looks correct.  However,\nwhen viewing the wall from one side it seems like I am seeing the inside\nsurfaces of my antimatter box as grey_0.60 but not the front surface.\nAt some view angles from the front side, the side of my antimatter box\ndisappear and I do get a glimpse through the wall.  From the other side\n(shadow side), everything looks as I would expect.\n\nhttp://docs.google.com/Doc?docid=0AcMF73k-1deIZGdkNmhja3BfOTdnejRjbTloaw\n&hl=en\nhttp://docs.google.com/Doc?docid=0AcMF73k-1deIZGdkNmhja3BfOTVjamR4YnZkMw\n&hl=en\nhttp://docs.google.com/Doc?docid=0AcMF73k-1deIZGdkNmhja3BfOTNmOHF6N2docA\n&hl=en\n\nThe box was created with genbox and I double checked that all surface\nnormals are pointing outward.  I also tested other modifiers in my\nantimatter definition and \"void\" and anything other than the wall\nmaterial did not do anything (disregard my earlier statement/question\nabout materials).\n\nSo several of my questions have been answered but there is still the\nobvious artifacts in the rendering and I am still wondering about the\nvalidity of this approach using rtrace.  Will it see random errors?\n\nThe file I am running for this test is:\n\nvoid plastic grey_0.25\n0\n0\n5            0.25          0.25          0.25\n0             0\n\nvoid plastic grey_0.60\n0\n0\n5             0.6           0.6           0.6\n0             0\n\nvoid antimatter opening\n1 grey_0.60\n0\n0\n\ngrey_0.60 polygon Space.10_Wall.38\n0\n0\n12\n0.00    0.00    10.00\n0.00    0.00    0.00\n30.00    0.00    0.00\n30.00    0.00    10.00\n\n!genbox opening hole 10 1 6 | xform -t 10 -.5 2\n\ngrey_0.25 polygon ground\n0\n0\n12    -100    -100    -0.5\n100    -100    -0.5\n100    100    -0.5\n-100    100    -0.5\n\n!gensky 3 20 10.5 -a 42.8326 -o 106.329 -m 105.0 +s | xform -rz 0.0\n\nskyfunc glow skyglow\n0\n0\n4 0.9 0.9 1.0 0\n\nskyglow source sky\n0\n0\n4 0.0 0.0 1.0 180\n\nskyfunc glow groundglow\n0\n0\n4 1.0 0.8 0.5 0\n\ngroundglow source ground\n0\n0\n4 0.0 0.0 -1.0 180\n\n\n________________________________\n\nZACK ROGERS, P.E., LEED AP, IESNA\n\nINTEGRATED DESIGN ASSOCIATES, INC\n437 Main Street\nLongmont, CO 80501\ntel: 303.848.8299, fax: 303.848.8290\nwww.ideasi.com\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of Lars\nO. Grobe\nSent: Wednesday, September 09, 2009 6:20 PM\nTo: Radiance general discussion\nHi Zack,\n\nthe problem you experience appears any time when you have coplanar\nsurfaces with different modifiers. A ray hitting such a surface sees\neither material, and as they are coplanar this results in a random noise\n/ mixture of both.\n\nTo use antimatter, place a box in you wall, so that the front side of it\nis in front of the wall (you would see it from your position) while the\nback one is behind. Make sure that there is no other geometry in the\nvolume of this box.\n\nNow what happens is that a ray hitting the antimatter material with the\nsurface facing it will become blind, go on traveling the same direction\n(or modify it according to what you give in the second line of the\nantimatter modifier's definition), and start seeing geomertry only once\nhe passed thru the back of an antimatter surface again. In other words,\nit is like if the ray jumps between the antimatter surfaces ignoring\neverything in between.\n\nHope this is correct, but that was the result of looking at that part of\nthe code once ;-)\n\nCheers, Lars.\n\n", "replyTo": "", "sender": "radiance-general-bounces@radiance-online.or", "isquestion": true, "tags": [], "id": "<24A618F8B54C4348B54C8684C918963B0104C1BB@BUGS.ideasi.com>", "refs": [], "datetime": "Wed Sep  9 21:29:03 2009", "email": "radiance-general-bounces@radiance-online.org", "subject": "Re: [Radiance-general] Antimatter and windows"}