{"refs": [], "id": "<5A395987-6BFE-4564-BA3C-6D36747E4E76@lboro.ac.uk>", "subject": "[Radiance-general] What to do when no Weather File is available?", "email": "J.Mardaljevic at lboro.ac.uk", "body": "\nHi German,\n\nAnother consideration is the rationale for the evaluation/simulation.  Whilst none of the standardised climate files you have are ideally appropriate for some particular locale, they do provide a common 'yardstick' against which variations in design can be compared.  This has long been the case with dynamic thermal modelling where the comparison of relative outcomes may be just as important (and possibly more reliable) than the absolute outcomes.\n\nFor most of Europe there is an abundance of standardised climate files, and the gradients in climatic diversity are - for the most part - not that steep.  However, Chile, as you point out, covers both a huge span in latitude and 'horizontally' it has very steep gradients in prevailing climatic conditions.  Thus satellite-derived data may be a more suitable basis for evaluation.  Perhaps a comparison in outcomes between using standardised climate data and satellite-derived for those 5 locations you have would be a worthwhile exercise.  One would not expect absolute values to be the same, but if the rank ordering is wildly different then it's a case of exercising some judgement regarding selection.\n\nCheers\nJohn\n\nJohn Mardaljevic PhD FSLL\nProfessor of Building Daylight Modelling\nSchool of Civil & Building Engineering\nLoughborough University\nLoughborough\nLeicestershire\nLE11 3TU, UK\n\nTel: +44 1509 222630 (Direct)\nTel: +44 1509 228529 (Pam Allen, secretary)\n\nj.mardaljevic at lboro.ac.uk<mailto:j.mardaljevic at lboro.ac.uk>\n\nhttp://www.lboro.ac.uk/departments/civil-building/staff/mardaljevicjohn/<http://www.lboro.ac.uk/departments/civil-building/staff/mardaljevicjohn>\n\nPersonal daylighting website:\nhttp://climate-based-daylighting.com<http://climate-based-daylighting.com/>\n\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140623/2b0842cf/attachment.html>\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "John Mardaljevic", "datetime": "Mon, 23 Jun 2014 20:36:21 +0000"}