{"body": "\nHi Genevieve,\n\nI definitely would recommend a more sophisticated method than using the\nmacbethcolor checker card. Yes, it is true that the chromaticities are\nknown for those colours, BUT this is under the assumption of a certain\nillumination source. Will you have that same illumination source?\nProbably not.\n\nIf you are after accuracy (rather than 'good looks')you might want to\nbuy a spectroradiometer and a white reflectance standard, too. After\nall, what you measure with the spectro looking onto your wall is the\ncolour signal, a combination of the surface reflectance and the\nillumination at hand (and some geometry). In order to model the material\nproperties in RADIANCE, you will be interested in the surface\nreflectance and not in the overall colour signal. To retrieve the\nsurface reflectance, you measure the spectrum of the white reflectance\nstandard at the very same position where you measured the colour signal\nfrom the wall, then divide the colour signal (spectrum) by the spectrum\nfrom the white reflectance standard and you have your surface\nreflectance (this assumes a Lambertian surface). The spectrum from the\nwhite reflectance standard can be used to get the colour of the\nillumination source.\nThis approach will yield something with a clear tint, if the\nillumination source wasn't a natural light. If you want to have a\ngood-looks picture then don't bother with the white reflectance standard\nand model the light source as white (as described and recommended in the\nRADIANCE book).\n\nRegards,\nalexa\n\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nDr. Alexa I. Ruppertsberg\nDepartment of Optometry\nUniversity of Bradford\nBradford\nBD7 1DP\nUK\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n\n", "replyTo": "Subject: [Radiance-general] measuring color", "sender": "Alexa I. Ruppertsberg", "isquestion": false, "tags": [], "id": "<40A1FCFE.4030404@bradford.ac.uk>", "refs": [], "datetime": "Wed May 12 12:31:50 2004", "email": "a.i.ruppertsberg at Bradford.ac.uk", "subject": "[Radiance-general] measuring color"}