{"refs": ["<CAOG+NiyM4q-bfcUKAPdCGhbunO_CRw_110D8RC5SrkgW1=7OeA@mail.gmail.com>", "<CAGhWmF7sHniEKq_w35wpgEme-MriJTjXR5WXoU9gc_8HGk-Tcw@mail.gmail.com>", "<CAK+g53CUg2cQ-uPUkm6TXmimD9_a2ma24xawwgG+ABJPsWaqVw@mail.gmail.com>"], "id": "<ACF98A76D0047542A29FEB2F3EB0DAA127D795@E-AEXMBX01.global.arup.com>", "subject": "Re: [Radiance-general] HDR Sky Camera @ LBNL's Flexla", "email": "CHI-German Molina", "body": "\nHi German,\n\nThere is some interesting work on simulation based controls for daylighting from the TU Wien. See here:\nhttp://www.ibpsa.org/proceedings/BS2005/BS05_0693_700.pdf\nhttp://www.ibpsa.org/proceedings/BS2005/BS05_1163_1170.pdf\n\nSantiago\n\n\n\nSent: 2014?6?28? 5:38\nTo: Radiance general discussion\nWow, I have been thinking on doing this for a while... although I have no idea where to start from.\n\nIs it possible to calculate the Daylight Coefficients of the building; and use the HDR image to generate sky vectors and calculate different options for optimizing daylighting?\n\nI am picturing a computer that, every 5 minutes, calculate the sky vector, computes the interior lighting conditions, and simulates the different lighting options performing a whole-building lighting control with no photo sensors. Even more, maybe a whole neighborhood could use the same camera. Nonsense?\n\nThanks for sharing!\n\n2014-06-27 0:59 GMT-04:00 Joe Smith <the.oat.cracker at gmail.com<mailto:the.oat.cracker at gmail.com>>:\nHi, Andy, thanks for sharing LBNL's sky mapping experiment!\n\nCan you kindly advice on resources that elaborate on how to use HDR sky image for daylight simulation? Does it involve specifying the HDR image, rather than a \"skyfunc\", as the material identifier for the sky geometry? How is the pixel value of a given point on the HDR image converted to luminance value of the corresponding position on the sky?\n\nThanks!\n- Joe\n\nAndrew McNeil <amcneil at lbl.gov<mailto:amcneil at lbl.gov>>?2014?6?27???????\n\nHi Everyone,\n\nLBNL has installed an HDR sky camera at our new FLEXLAB site: http://flexskycam.lbl.gov. I've uploaded sample data, including hdr images and csv datafiles, recorded by the camera for three days over the past week( clear, partly cloudy and overcast). We're happy to share more data with other researchers and daylight practitioners (but we don't have much to offer yet).\n\nThe images can be mapped to a Radiance sky for simulation under real sky conditions. I have not used the sky HDR images yet, myself, so if anybody uses them successfully please report back and share what you've done!\n\nQuestions about the camera hardware and capabilities should be directed to Chris Humann at Terrestrial Light.\n\nBest,\nAndy\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n--\nGerm?n Molina L.\nIngeniero Trainee\nHunter Douglas Chile S.A.\nCelular +569 89224445\n\n\nNota de Confidencialidad: Este mensaje inclu?do los archivos adjuntos son confidenciales y pueden contener informacion privilegiada protegida por ley. Si Ud. no es el destinatario, deberia abstenerse de copiarlo, distribuirlo, divulgarlo o usar la informacion contenida. Por favor, avise inmediatamente al emisor y borre este mensaje de su sistema. Los mensajes electronicos son susceptibles de ser cambiados, infectados o adulterados sin autorizacion. No asumimos responsabilidad alguna por ninguna clase de cambios o sus consecuencias. Usted debe estar informado que la compania puede hacer un seguimiento de sus mensajes electronicos y su contenido, gracias.\n\nConfidentiality Notice: The information contained in this email message, including any attachment, is confidential and is intended only for the person or entity to which it is addressed. If you are neither the intended recipient nor the employee or agent responsible for delivering this message to the intended recipient, you are hereby notified that you may not review, retransmit, convert to hard copy, copy, use or distribute this email message or any attachments to it. If you have received this email in error, please contact the sender immediately and delete this message from any computer or other data bank, Thank you.\n\nA informa??o transmitida ? confidencial e para conhecimento exclusivo do destinat?rio. Sua utiliza??o, n?o autorizada, constitui crime pass?vel de pris?o. Todas as precau??es poss?veis foram tomadas para garantir que este e-mail n?o contenha v?rus. Uma vez que nossa empresa n?o pode assumir responsabilidade por nenhuma perda ou dano causado por este e-mail ou de seus anexos, recomendamos que o destinat?rio utilize seus procedimentos de antiv?rus antes de qualquer uso.\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140630/1eb1f3a8/attachment.html>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] HDR Sky Camera @ LBNL's Flexlab", "tags": [], "sender": "gmolina at hdlao.com", "datetime": "Mon, 30 Jun 2014 04:05:54 +0000"}