{"refs": ["<DUB128-W3580E032E37D076999652FCAF70@phx.gbl>"], "id": "<CAK+g53CbdzuXNeWK5GhZWmx8APyEDrqHPkTAGaeNXPTozXD+zw@mail.gmail.com>", "subject": "[Radiance-general] Generate a daylight matrix for a skyligh", "email": "gmolina at hdlao.com", "body": "\nAlejandro,\n\nTwo points to remark here:\n\n1.- The error you are getting comes from the \"genklemsamp\" program, and not\nfrom rcontrib. The \"View Up\" is, by default, \"up\" (0,0,1); but that is also\nyour view direction. You will have to specify a \"view up\" that represents\nthe \"top of your skylight\", i.e., the superior part.\n\n2.- the -m option of rcontrib has to be filled with a material in your\nscene. In your case is \"skymat\". the -e option, in this cases, is what\nchooses the Reinhart subdivition (MF:1, MF:2, MF:3, ...), the higher, more\nsky subdivitions you get. The \"b\" is the number of the sky subdivition\n(bin) and the \"bn\" is the number of sky subdivitions. These values are\nrelated to the function you are using (reinhart.cal); and the only one you\nwould need to change is the MF:X option.\n\nHope it helps.\n\n\n2014-07-16 6:08 GMT-04:00 Alejandro Pacheco Di?guez <paxeco2205 at hotmail.com>\n:\n\n\n\n--\n*Germ?n Molina L.*\nIngeniero Trainee\nHunter Douglas Chile S.A.\nCelular +569 89224445\n\n--\n\n\n*Nota de Confidencialidad:* Este mensaje inclu?do los archivos adjuntos son\nconfidenciales y pueden contener informacion privilegiada protegida por\nley. Si Ud. no es el destinatario, deberia abstenerse de copiarlo,\ndistribuirlo, divulgarlo o usar la informacion contenida. Por favor, avise\ninmediatamente al emisor y borre este mensaje de su sistema. Los mensajes\nelectronicos son susceptibles de ser cambiados, infectados o adulterados\nsin autorizacion. No asumimos responsabilidad alguna por ninguna clase de\ncambios o sus consecuencias. Usted debe estar informado que la compania\npuede hacer un seguimiento de sus mensajes electronicos y su contenido,\ngracias.\n\n*Confidentiality Notice:* The information contained in this email message,\nincluding any attachment, is confidential and is intended only for the\nperson or entity to which it is addressed. If you are neither the intended\nrecipient nor the employee or agent responsible for delivering this message\nto the intended recipient, you are hereby notified that you may not review,\nretransmit, convert to hard copy, copy, use or distribute this email\nmessage or any attachments to it. If you have received this email in error,\nplease contact the sender immediately and delete this message from any\ncomputer or other data bank, Thank you.\n\nA informa??o transmitida ? confidencial e para conhecimento exclusivo do\ndestinat?rio. Sua utiliza??o, n?o autorizada, constitui crime pass?vel de\npris?o. Todas as precau??es poss?veis foram tomadas para garantir que este\ne-mail n?o contenha v?rus. Uma vez que nossa empresa n?o pode assumir\nresponsabilidade por nenhuma perda ou dano causado por este e-mail ou de\nseus anexos, recomendamos que o destinat?rio utilize seus procedimentos de\nantiv?rus antes de qualquer uso.\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20140716/b151ddc4/attachment.html>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Generate a daylight matrix for a skylight", "tags": [], "sender": "CHI-German Molina", "datetime": "Wed, 16 Jul 2014 09:27:45 -0400"}