{"body": "\nHello again,\n\nYes, what the sensor measures is an interesting question, especially since many manufacturers state that their product reads illuminance when it clearly does not. I do not know if this is a big deal for annual energy simulation or commissioning as long as there is a setpoint that allows the photosensor to track workplane illuminance throughout the year. I think it is usually hard to find such a setpoint though, whether it is a cosine response or 'some sort of radiation' signal.\n\nSPOT does allow you to assess the situation (photosensor spatial response, location, etc.) in the design stage by relating signal setpoint (user input) to signal received (rsensor results) and showing the resulting annual workplane illuminance. Illuminance at the sensor, instead of sensor signal, is used to give a commissioning report at the end of a SPOT project. The report assumes a diffuse lighting condition can be created in the space where commissioning will take place.  This is because the ratio of illuminance to signal is taken from rtrace and rsensor calcs with just a CIE overcast sky. Oh, and another photocell characteristic to consider is wavelength sensitivity - SPOT does not do this but could cause a larger impact than the spatial distribution in some cases.\n\nI don't know about making SPOT cross-platform, Zack Rogers might be able to answer that. There are some cross-platform python scripts with the download that you might find useful.\n\nIt seems to me that rsensor uses a step function to determine which sensitivity value to use but maybe Greg can straighten me out on this too or explain more.\n\nAlso, I apologize for the repetitive post earlier. I did not see Greg's until later. Thanks! Jennifer\n\n-----Original Message-----\nSent: Monday, October 12, 2009 5:35 PM\nTo: radiance-general@radiance-online.org\nDear Greg, Jennifer,\n\n\nSo I shouldn't think of it as an 'inverse' IES file, then. I've just run\nsome simple examples with an ideal cosine data file, and the results do\nmatch the one I get from rtrace. Multiplying each value in the matrix\nwith 2.0 gives me twice the illuminance.\n\nI guess that the real question should be 'what do these sensors actually\nmeasure?'. It's not lux, because for this they would have to be cosine\nand v(lamda) corrected, which one could expect from a 500 Pound lux\nmeter, but not from a 5 Pound sensor. I guess it all boils down to the\ncommissioning of the sensors. The only thing we can say with certainty\nis that they measure 'some sort of radiation thing', which is different\nin different directions.\n\nSo is it correct to assume that SPOT only uses the relative response\nfrom the photocells, and not absolute W/m2 or lux values?\n\n\n\nHere is my own cunningly crafted cosine response. Just one column of\nazimuth values at zero degrees wouldn't work:\n\ndegrees\t0\t90\t180\t270\n0\t1.0000\t1.0000\t1.0000\t1.0000\n10\t0.9848\t0.9848\t0.9848\t0.9848\n20\t0.9397\t0.9397\t0.9397\t0.9397\n30\t0.8660\t0.8660\t0.8660\t0.8660\n40\t0.7660\t0.7660\t0.7660\t0.7660\n50\t0.6428\t0.6428\t0.6428\t0.6428\n60\t0.5000\t0.5000\t0.5000\t0.5000\n70\t0.3420\t0.3420\t0.3420\t0.3420\n80\t0.1736\t0.1736\t0.1736\t0.1736\n90\t0.0000\t0.0000\t0.0000\t0.0000\n\nDoes rsensor use a linear interpolation to fill in in-between rows?\n\n\n\nI am still puzzled that the response is not proportional to the volume\nof the shape, or at least the area of the curve. Guess that's just the\nway it is, and there isn't really any strict photometric or radiometric\nreason behind this...\n\n\n\nThis makes perfect sense now.\n\n----------------\n\n\nIt requires Windows and Excel, and while I have access to a Windows\nmachine, I don't have Excel. Do you plan on making it cross-platform and\nOpenOffice compatible?\n\n\nGreg explained this, thanks. I understand it's all relative.\n\nThank you\n\nAxel\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n", "replyTo": "Subject: [Radiance-general] Re: rsensor file format", "sender": "radiance-general-bounces@radiance-online.org", "isquestion": false, "tags": [], "id": "<91E51F7F4028B54D81D0032C591A222235EFD707FF@MAILBOX1.nrel.gov>", "refs": ["<4ad37ce7.180bca0a.779e.171dSMTPIN_ADDED@mx.google.com>", "<4AD3BD15.9070203@gmail.com>"], "datetime": "Mon Oct 12 19:40:01 2009", "email": "radiance-general-bounces@radiance-online.org", "subject": "[Radiance-general] Re: rsensor file format"}