{"refs": ["<CAOn=hKFAzzwhCnEwuj_QYydreiKCMJDwOLoC6FXxj+OCCSAoug@mail.gmail.com>", "<B458128A-0F52-48B4-B041-D9E9ED8996D6@lmi.net>"], "id": "<CFFBD020.E4E1%Robert.Guglielmetti@nrel.gov>", "subject": "[Radiance-general] 3 phase method in Windows O", "email": "Giuseppe De Michele", "body": "\nI've only experience with Windows XP and Windows 7, but this should all work fine if you have Perl installed properly. Get your correct version of Perl from here:\nhttp://www.activestate.com/activeperl/downloads\n?or here:\nhttp://strawberryperl.com/\n?and make sure to add the Perl executable directory to your PATH (the installers will optionally do this for you).\n\nYou also need to ensure your Radiance installation is correct, meaning that the Radiance bin directory is in your PATH, and the Radiance lib directory is in an environment variable called \"RAYPATH\".\n\n\nOn 7/28/14, 9:57 AM, \"Greg Ward\" <gregoryjward at gmail.com<mailto:gregoryjward at gmail.com>> wrote:\n\nThis error must be generated by Perl itself, as it isn't one produced by the genklemsamp.pl script.  I don't know enough about Perl and Windows to say more, but perhaps someone else does.\n\nCheers,\n-Greg\n\n\n\n\n\nDear expert,\n\nI am trying to run the Three Phase Method in Windows 8 but at the moment of the DMX generation I have found out a problem with genklemsamp.\n\nSearching in the web I have understood the problem regards something about some incompatibility of the Pearl language with Windows OS. I have also find a ZIP archives that contains Radiance Perl scripts that were packaged into Windows executable files in the Jolaxa site.\n\nAlthough I have followed the instruction (rather easy since I have only to paste the exe file in the bin directory) something still doesn't work.\n\nThe command crash even if I run a simple case as:\n\ngenklemsamp -c 10 - vd 0 -1 0 > sample.dat\n\nwith the waring : \"genklemsamp has stopped working\".\n\n\n\nAny suggestion?\n\n\nKind regards,\nGiuseppe\n\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] 3 phase method in Windows OS", "tags": [], "sender": "giudm.87 at gmail.com", "datetime": "July 28, 2014 7:39:25 AM PDT"}