{"body": "\nHi Greg,\n\nThanks for your reply.  Unfortunately I?m not going to Boston.  Now I have\nyet another reason to wish I was going.\n\nI?m glad you?ve been able to further develop the 3-phase method.  I see\nincreasing demand for this type of analysis for complex fa?ade shading\nsystems.  This is the fourth time I?ve started down this route ? the other\nthree times stopped abruptly for various reasons.  Twice before with\npanelite products and once with an engineered scattering window film.  The\nemail I sent yesterday was a  partially complete left in my drafts folder\nfrom two months ago - the last time this I was looking into this approach.\n\nI don?t have a hard deadline yet.  The goal for now is to develop a working\nmodel and then focus on accuracy later.  Ideally I?d have something that\nworks in the next 2 weeks.\n\nHopefully Panelite will have measured BTDF data in a few months that we slot\ninto the analysis.  If measured BTDF data doesn't become available then\nwe?ll focus on improving the accuracy of the simulated BTDF.\n\nSo I guess my first step is approximating a BTDF with Radiance.  I was\nthinking I could a uniform sky above the panelite model as input and a\nhemisphere of points below as sensors.  With rtcontrib I could determine the\nlight output in a direction for each input direction.  The input directions\ncould be tregenza sky divisions (?).  The output could be phi/lambda\ndirections (?).  I imagine the key to a decent BTDF is lots of samples for\neach output direction.  Maybe I create a grid of 1000(00?) points in a plane\njust below the panelite and use a script to create a hemisphere of sensor\npoints centered at each grid point.\n\nI know very little about BTDF?s and even less about creating them so I could\nuse any tips, tricks, guidance, watch its, how are you going to account\nfor?s and examples that anyone is willing to offer.\n\nThanks,\nAndy\n\n\n\n\nOn 10/15/09 1:37 PM, \"Greg Ward\" <gregoryjward@gmail.com> wrote:\n\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20091016/4519f832/attachment.htm\n", "replyTo": "Subject: [Radiance-general] Annual simulations + BSDF", "sender": "Andrew McNeil", "isquestion": false, "tags": [], "id": "<C6FDEE95.D870%andrew.mcneil@arup.com>", "refs": [], "datetime": "Fri Oct 16 09:34:41 2009", "email": "andrew.mcneil at arup.com", "subject": "[Radiance-general] Annual simulations + BSDF"}