{"body": "\nDear users,\nfirst of all I would like to thank you all for Radiance workshop in\nCambridge. It was big pleasure to meet you all there and see what is going\non and what is possible to do. It gave me lots of inspiration and big\nmotivation to further work.\n\nMy question is about how to install Radiance on my Mac. Since now I have\nbeen using Radiance on my Windows machine, running on Learnix distibution of\nUbuntu under VirtualBox. I am very inexpedience user in these things . I\nhave tried to search in the threats here at mailing list as well as on\nInternet, but still I was not able to finish an installation successfully. I\nam probably doing some simply mistake, since I guess the installation should\nbe fairly easy.\nWhat I did so far:\nI downloaded main distribution of Radiance from\nhttp://radsite.lbl.gov/radiance/framed.html as well as binaries for Mac,\nthen unpack them and copied the binaries to /usr/local/bin and libraries\nfrom ray/lib to /usr/local/lib/ray. Then I was not sure what to do next so I\ntried to run command \"./makeall install\". But then there were some errors,\nas follows (copied from terminal):\n\n*Making programs...\n/usr/local/lib/ray/src/common /usr/local/lib/ray/src\nIn directory common...\n/usr/local/bin/rmake: line 2: exec: make: not found\n/usr/local/lib/ray/src\n/usr/local/lib/ray/src/rt /usr/local/lib/ray/src\n.\n.\n.\nIn directory cal...\n/usr/local/bin/rmake: line 2: exec: make: not found\n/usr/local/lib/ray/src\nThere were some errors.*\n\nI am quit stack at the moment and don't know what I am doing wrong. Could\nanyone help me with this? I would like to know what I should copy where and\nwhich commands I should run to install Radiance, etc.\nI have already copy some files into usr folder etc.  and I am little bit\nworry to erase any of the files there since it could be very dangerous,\ntherefore I would like to also know if it is now problem that I did what I\nhave described above.\n\nThank you in advance, I will very appreciate any help\n\nDavid\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20091031/133d010c/attachment.html\n", "replyTo": "", "sender": "David Appelfeld", "isquestion": true, "tags": [], "id": "<e3330ba60910310923s272d5798t8f1913da30ffb79@mail.gmail.com>", "refs": [], "datetime": "Sat Oct 31 09:23:07 2009", "email": "d.appelfeld at gmail.com", "subject": "[Radiance-general] Radiance installation on Mac OS X 10.5.6"}