{"refs": [], "id": "<000001c4bc26$9993b5b0$2568a8c0@Nick>", "subject": "Re: [Radiance-general] Rendering exclude optionsTo: Radiance general discussion <radiance-general@radiance-online.org>", "email": "Rob Guglielmetti", "body": "\nGreg,\n\nThanks for the heads up. The logic looks very sound, and I got as far as\nstage 3, when it barfed at -lw as a bad option. This I assume means that\nI don?t have the latest version that includes Rob's option. The\ndifficulty at this stage is that I am running it under Cygwin and am not\nconfident about compiling it.\n\nHowever, will try compliling the latest release on one of the mac's in\nthe office and see how I get on - however for now I have another\ndeadline looming. Many thanks though as I suspect your solution does\nexactly what I wanted. GREAT!!\n\nNick\n\n\n-----Original Message-----\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of\nradiance-general-request@radiance-online.org\nSent: None\nTo: radiance-general@radiance-online.org\n\nSend Radiance-general mailing list submissions to\nradiance-general@radiance-online.org\n\nTo subscribe or unsubscribe via the World Wide Web, visit\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\nor, via email, send a message with subject or body 'help' to\nradiance-general-request@radiance-online.org\n\nYou can reach the person managing the list at\nradiance-general-owner@radiance-online.org\n\nWhen replying, please edit your Subject line so it is more specific than\n\"Re: Contents of Radiance-general digest...\"\n\n\nToday's Topics:\n\n1. python / shell scripting radiance (Jelle Feringa // EZCT / Paris)\n2. Re: python / shell scripting radiance (iebele)\n3. Re: Rendering exclude options (Greg Ward)\n4. Re: Rendering exclude options (Rob Guglielmetti)\n\n\n----------------------------------------------------------------------\n\nMessage: 1\nMessage-ID: <20041026102736.96B3118000AE@mwinf0108.wanadoo.fr>\nContent-Type: text/plain; charset=\"us-ascii\"\n\nSomewhat off-topic, but maybe a relevant curiosity;\n\nI'm just starting to script/extend radiance using python (win32). I'm\ninterested whether other people are using radiance in this way -I\nsuppose so, I'm sure Georg Mischler has extensive experience- Is anyone\naware of python/radiance scripts available online, or could point me in\nthe direction of specific python/radiance content available online\n(perhaps willing to share?). My interest is mostly automating rendering\ntasks. From that I intend to see whether it could be interesting to\ncombine genetic algorithms with radiance to automate architectural\nresearch. I have\n-modest- experience in computing this way, but initial research focused\non GA/FEM simulation. An example of such an experiment would be to\nparameterize a window, the placement of the window, or the material in\nthe room, and to search for a solution -using a GA- where there would be\na constant luminance in the room. In order to conduct these experiments\nI first need to progress in automating rendering tasks.\n\nCheers!\n\nJF\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL:\nhttp://radiance-online.org/pipermail/radiance-general/attachments/200410\n26/8a0a2201/attachment.html\n\n------------------------------\n\nMessage: 2\nMessage-ID: <417E4269.6040005@iebele.nl>\nContent-Type: text/plain; charset=\"us-ascii\"\n\nHe Jelle!,\n\nFirst, what do you mean with  GA/FEM ?\n\nI do not know anything of Phyton, but I have heard of this:\n\nBlender3d works with Python, and also an export to Radiance seems to be\navailable.\nBlender should be able to create booleans too, you will need that if you\n\nintend to create parametric windows.\nIf both is true, you just have to dig in Blender's source to find out\nhow you can benefit.\nThe sourcecode of Blender is free. You can download it from\nwww.blender3d.org\n\nSome blender developpers are Dutch, that also might be easy for you.\n\nIebele\n\n\n\n\n\nJelle Feringa // EZCT / Paris wrote:\n\n\n\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL:\nhttp://radiance-online.org/pipermail/radiance-general/attachments/200410\n26/aab8c1c1/attachment-0001.html\n\n------------------------------\n\nMessage: 3\nMessage-ID: <CF5A89A0-2765-11D9-8218-000A95BB392A@lmi.net>\nContent-Type: text/plain; charset=WINDOWS-1252; format=flowed\n\nHi Nick,\n\nYou should be able to do what you want using pinterp and falsecolor.\nI'll assume that you desire isolux contours on vertical surfaces in my\ninstructions, below.\n\n1) Generate an irradiance image using a parallel view to render the\nvertical surfaces you are interested in with the -i option.  This will\nexclude surfaces perpendicular (horizontal surfaces in particular), but\nmay include surfaces at odd angles.  Hopefully, this is OK.  At the\nsame time, you should use the -z option of rpict to create a z-buffer\nto go with your rendering, and set -pj 0.  Let's call this\n\"irradiance.pic\", and call the z-buffer \"irradiance.zbf\".\n\n2) Generate a standard image of the same size but without the -i or -z\noptions.  (Actually, you may use the -z option with either rendering --\nyou just don't need it for both as it will be the same.)  Again, set\n-pj 0 as before, so your pixels line up.  Let's call this\n\"standard.pic\".  You will probably want to pass this image through\npcomb or pfilt to optimize the exposure for display, but don't alter\nthe resolution or the z-buffer won't be valid.\n\n3) Run these two renderings through falsecolor to generate a contour\nplot, using Rob Guglielmetti's new -lw option to set the label width to\n0.  You must do this in a special way to preserve the view string\nneeded in Step 5:\n\n% getinfo < standard.pic | grep '^VIEW=' > contour.pic\n% falsecolor -cl -lw 0 -i irradiance.pic -p standard.pic [other\noptions] >> contour.pic\n\n4) Generate a standard image from the view you actually want to see,\nwhich I'll assume is either a perspective view or one coming from a\ndifferent angle to include some vertical surfaces.  You must also\ngenerate a z-buffer for this image using rpict's -z option.  Let's call\nthis \"view.pic\", and the z-buffer \"view.zbf\".  You will probably want\nto pass this image through pcomb or pfilt to optimize the exposure for\ndisplay, but follow the same procedure as in Step 2.\n\n5) Use pinterp to combine the two images, giving the contour image\nfirst and using the -q option to avoid averaging:\n\n% pinterp -x 1024 -y 1024 -q -f0 -vf view.pic contour.pic\nirradiance.zbf view.pic view.zbf > combined.pic\n\nThe -x 1024 -y 1024 options are to set the output resolution, which\nshould match the resolutions of the input images.  If you want to\nproduce an anti-aliased result, then go through with resolutions that\nare twice or three times what you desire in the end, then pass\n\"combined.pic\" through pfilt with options to filter down the result.\nAny filtering earlier in the pipeline will break everything.\n\nI hope this works -- let me know how it turns out.  (And you thought it\nwas a simple question!)\n\n-Greg\n\nDear All,\n\nA simple question ? I suspect to the more able (then me) of you out\nthere\n. Is it possible to exclude planes in a certain orientations from\nan rpict calculation. For example, I would like to use radiance to\ncreate a picture showing the vertical sky component on vertical\nsurfaces. Therefore I would like to exclude the horizontal surfaces to\nprevent them from cluttering up the image.\n\nIdeally, I would anticipate being able to overlay a contour image which\nexcludes the horizontal surfaces over a luminance image which includes\nthem. I suppose I could generate this from two separate sets of\ngeometry, but this is a little clunky and may result in some inaccurate\nresults, where the inter-reflections may be important and or\nsignificant. Any thoughts would be gratefully received.\n\nMany thanks\n\nNick\n\n? XCO2 conisbee ?Ltd\n1-5  Offord Street\nLondon N1 1DH\nTel: + 44 (0)20 7700 1000\nFax: + 44 (0)20 7700 4455\nEmail: nickd@xco2.com\nWeb: http://www.xco2.com\n\nengineering sustainability\n\n\n\n\n------------------------------\n\nMessage: 4\nMessage-ID: <417E78E5.1060609@rumblestrip.org>\nContent-Type: text/plain; charset=windows-1252; format=flowed\n\nGreg Ward wrote:\n\nDamn, my head just exploded.\n\nThese recipes you come up with are just too cool, Greg.  And I'm not\njust saying that because I have no head at the moment.  I should collect\n\nthese tips into a little \"cookbook\", for the unix pipeline-challenged,\nlike myself.  Examples like these really illustrate the power and\nenormous flexibility of Radiance!\n\n----\n\nRob Guglielmetti\n\ne. rpg@rumblestrip.org\nw. www.rumblestrip.org\n\n\n\n------------------------------\n\n_______________________________________________\nRadiance-general mailing list Radiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\nEnd of Radiance-general Digest, Vol 8, Issue 13\n***********************************************\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "rpg@rumblestrip.org", "datetime": "Tue, 26 Oct 2004 12:18:45 -0400"}