{"body": "\nDear Greg, Jennifer,\n\n\nSo I shouldn't think of it as an 'inverse' IES file, then. I've just run\nsome simple examples with an ideal cosine data file, and the results do\nmatch the one I get from rtrace. Multiplying each value in the matrix\nwith 2.0 gives me twice the illuminance.\n\nI guess that the real question should be 'what do these sensors actually\nmeasure?'. It's not lux, because for this they would have to be cosine\nand v(lamda) corrected, which one could expect from a 500 Pound lux\nmeter, but not from a 5 Pound sensor. I guess it all boils down to the\ncommissioning of the sensors. The only thing we can say with certainty\nis that they measure 'some sort of radiation thing', which is different\nin different directions.\n\nSo is it correct to assume that SPOT only uses the relative response\nfrom the photocells, and not absolute W/m2 or lux values?\n\n\n\nHere is my own cunningly crafted cosine response. Just one column of\nazimuth values at zero degrees wouldn't work:\n\ndegrees\t0\t90\t180\t270\n0\t1.0000\t1.0000\t1.0000\t1.0000\n10\t0.9848\t0.9848\t0.9848\t0.9848\n20\t0.9397\t0.9397\t0.9397\t0.9397\n30\t0.8660\t0.8660\t0.8660\t0.8660\n40\t0.7660\t0.7660\t0.7660\t0.7660\n50\t0.6428\t0.6428\t0.6428\t0.6428\n60\t0.5000\t0.5000\t0.5000\t0.5000\n70\t0.3420\t0.3420\t0.3420\t0.3420\n80\t0.1736\t0.1736\t0.1736\t0.1736\n90\t0.0000\t0.0000\t0.0000\t0.0000\n\nDoes rsensor use a linear interpolation to fill in in-between rows?\n\n\n\nI am still puzzled that the response is not proportional to the volume\nof the shape, or at least the area of the curve. Guess that's just the\nway it is, and there isn't really any strict photometric or radiometric\nreason behind this...\n\n\n\nThis makes perfect sense now.\n\n----------------\n\n\nIt requires Windows and Excel, and while I have access to a Windows\nmachine, I don't have Excel. Do you plan on making it cross-platform and\nOpenOffice compatible?\n\n\nGreg explained this, thanks. I understand it's all relative.\n\nThank you\n\nAxel\n\n", "replyTo": "Subject: [Radiance-general] Re: rsensor file format", "sender": "Axel Jacobs", "isquestion": false, "tags": [], "id": "<4AD3BD15.9070203@gmail.com>", "refs": ["<4ad37ce7.180bca0a.779e.171dSMTPIN_ADDED@mx.google.com>"], "datetime": "Mon Oct 12 16:28:42 2009", "email": "jacobs.axel at gmail.com", "subject": "[Radiance-general] Re: rsensor file format"}