{"body": "<DD4D9B79-392E-497B-9EE6-8ECE7ABBFE68@lmi.net>\n\nHi Greg,\n\n\n\nI checked in the working directory there was no plots created. The file\nname which was given for illumination plot was present in the directory\nbut its size was 0 bytes no other picture files were present in the\ndirectory. Is there any other way to check dayfact script in my\ncomputer.\n\nI use default shell in ubuntu 8.1 i.e. bash for running the script. I am\ncurrently running binaries radiance V3.9 distributed with ubuntu 8.1.\n\n\n\nRegards\n\nGanesh.\n\n\n\n[mailto:radiance-general-bounces@radiance-online.org] On Behalf Of Greg\nWard\nSent: Friday, October 09, 2009 9:18 PM\nTo: Radiance general discussion\n\n\nHi Ganesh,\n\n\n\nThe key to your problem is written in the last line of the script output\n-- apparently, your version of Unix lacks a \"mail\" command, so you\ndidn't get any notification.  I expect your results are sitting in the\nfile you named in the working directory.  Did you check?  The ximage\ncommand may be used to display it.\n\n\n\nCheers,\n\n-Greg\n\n\n\n\n\n\n\n\n\nDear Radiance Users,\n\nI am beginner in radiance am I am trying to use dayfact script\nto create illuminance plot for a simple room. When I run the dayfact\nscript with the inputs given below  no contour plots were created and no\nerror message was shown. I request to guide me in getting the plots.\n\nInput for dayfact script is below and the room description is\nattached with the mail.\n\nDAYLIGHT FACTOR CALCULATION\n\nThis script calculates daylight factors, illuminance levels,\nand/or\nenergy savings due to daylight on a rectangular workplane and\nproduces\na contour plot from the result.  The input is a Radiance scene\ndescription\n(and octree) and the output is one or more color Radiance\npictures.\n\nHave you already calculated an illuminance picture using\ndayfact?\nEnter illumpic [none]:\nEnter octree [none]: room.oct\nIs the z-axis your zenith direction? y\nWhat is the origin (smallest x y z coordinates) of the\nworkplane?\nEnter wporig [0 0 0]: 0 0 1\nWhat is the x and y size (width and length) of the workplane?\nEnter wpsize [1 1]: 3 3\nWhat calculation options do you want to give to rtrace?\n(It is very important to set the -a* options correctly.)\nEnter rtargs [-ab 1 -ad 256 -as 128 -aa .15 -av .3 .3 .3 -ar\n13]:\nDo you want to save the illuminance picture for later runs?\nEnter illumpic [none]: RoomIlPic.pic\nIn what scene file is the gensky command located?\nEnter genskyf [none]: skies/sky_overcast.mat\n# gensky 11 21 12:00 -a 51 -o 0 -m 0 -c\n# gensky 11 21 12:00 -a 51 -o 0 -m 0 -c\nIlluminance contour picture if you want one\nEnter ilpict [none]: RmIlCont.pic\nDaylight factor contour picture if you want one\nEnter dfpict [none]: RmDF.pic\nEnergy savings contour picture if you want one\nEnter dspict [none]: RmES.pic\nWorkplane design level (lux)\nEnter designlvl [500]:\nTitle for output picture\nEnter title [room 11 21 12]: Rmouptput.pic\n[1] 30406 30411\nYour job is started in the background.\nYou will be notified by mail when it is done.\nmail: Command not found.\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20091010/d71e34b7/attachment.html\n", "replyTo": "", "sender": "rganesh@bluestarindia.com", "isquestion": true, "tags": [], "id": "<80DDCC80211A7A41B4B36F4C6737497F0134EE2C@BANMailSrv.bluestarindia.com>", "refs": [], "datetime": "October 9, 2009 5:51:08 AM PDT", "email": "Ganesh", "subject": "Re: [Radiance-general] Using dayfact Script"}