{"body": "\nThanks Chris,\n\nYou are right-on, the reductions in luminance I was seeing were directly attributable to the lumen depreciation factors used for each light source. The color shifts are not having a net impact on the photometric values. I looked at five different light sources with lampcolor, converted the rgb radiance to luminance values, and the differences all correlated to the lamp lumen depreciation being applied. Phew.\n\nI will continue using white as a default light source color (and remind myself once again that that lumen depreciation is being applied if I do stray from white!).\n\n- Rob\n\n________________________________\nReply-To: Radiance general discussion <radiance-general@radiance-online.org>\nTo: Radiance general discussion <radiance-general@radiance-online.org>\nSomeone please speak up if my understanding is flawed, but ...\n\n\nies2rad\nby\n\nIf you're using IES files via ies2rad, the IES files are measured in\ncandela, and the physically measured values already account for\nefficiency of the source from electrical power in - through to the\nlighting power out. The factor of 179 is just a conversion from W/m2 to\nlumens/m2, as a unit conversion, not an efficiency factor. The source\nefficiency is already incorporated into the physical measurements\ndocumented in the IES file.\n\n\nover\n\nI had understood the factors lamp.tab are mainly intended to account for\nlumen depreciation, and just happen to have some color offset included\nas part of this. In Rob's tests the decreasing values roughly correspond\nto sources with more lumens lost over their life. I think if you test\nagain with metal halide or mercury you'll find those a little lower\nstill.\n\nIf accurate results are the goal, I would typically use the approach of\nspecifying everything as white, with my own -m multiplier calculated\nfrom lamp manufacturer maintained lumen data.\n\nnew\n\nRegarding accuracy of factors in lamp.tab, the values for metal halide\nand high pressure sodium seem higher than real world lumen depreciation,\nand halogen is defined with a factor of 1, but should still have some\ndepreciation over time. Considering that these factors vary so much,\nparticularly between different types of metal halide, this could be\ndifficult to keep accurate as part of the distribution.\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n", "replyTo": "<EB124710ADB8554C930FADF760BB2BE7062C715B@n-yexc01.global.arup.com>", "sender": "Christopher.Rush@arup.com", "isquestion": false, "tags": [], "id": "<C6F3BA96.D80%robert.guglielmetti@nrel.gov>", "refs": [], "datetime": "Thu, 8 Oct 2009 12:33:32 -0600", "email": "Christopher Rush", "subject": "RE: [Radiance-general] getting irradiance from source defined inphotometric units"}