{"refs": [], "id": "<48FEB32B-2954-11D9-A977-000A95BB392A@lmi.net>", "subject": "[Radiance-general] Patch to 3.6 releas", "email": "gward at lmi.net", "body": "\nUnfortunately, shortly after making the official Radiance 3.6 release,\ntwo bugs surfaced that were rather serious, warranting a patch release.\nThe first bug was reported by Mark Stock on this mailing list, and the\nsecond was reported by Veronica Sundstedt to me privately.  Mark's\nreport related to the source occluder cache and mist materials, and\nresulted in a consistency error (followed by an abort).  Not good.\nVeronica's report related to light source edges becoming visible\nthrough solid walls in rpict, which in some ways is even more serious\nsince it affects virtually every rendering.  Both bugs were simple\nenough to fix, but should not have been in an official release.  The\nfirst was the result of inadequate testing of the new occluder cache,\nand the second was the result of a last-minute \"fix\" I made to a\nroutine for illum sources just prior to the 3.6 release.  I fixed the\nreported problem, but created a new one that was 100 times worse.  Most\nembarrassing.\n\nBoth of these bugs have been repaired in the 3.6.1 patch release, which\nis available in source and binary forms from\n<http://radsite.lbl.gov/radiance/>.  I expect Peter Apian-Bennewitz\nwill update radiance-online.org shortly, but please do not download the\noriginal 3.6 release that is on there now.  The new patched release is\nnamed \"rad3R6P1.tar.gz\" and when compiled, \"rpict -version\" should give\nyou:\n\nRADIANCE 3.6.1 patch release 27 Oct 2004 by Greg Ward\n\nIn the process of further compile testing for this patch, I found\nanother, unrelated problem on 64-bit Athlon machines, where int32 was\nsized as 64-bits, which broke the TIFF library as well as several\ncritical Radiance routines.  The new patch also incorporates this fix,\nwhich only affects new compiles on Athalons, but it ended up requiring\na new version of \"rad3R6supp.tar.gz\", which contains the TIFF library.\nIf you are compiling on Athalon's with the HEAD release, you should\nwait a day or two for Peter to update the files on radiance-online\nbefore grabbing the updated version.\n\nApologies to those who downloaded the 3.6 release thinking, \"This\nshould be it for awhile.\"  Hopefully, there will be no embarrassing new\ndiscoveries for a few weeks, at least....\n\n-Greg\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Greg Ward", "datetime": "Fri Oct 29 04:44:37 2004"}