{"refs": ["<36E58ACF2BA61641A0EB4F54EF3D55E5010CAEF136@EX10-LIVE-MBN1.ad.kent.ac.uk>"], "id": "<CAK+g53C6+C128w7ej9Snm-Cd8xQCt5Nv-2NoUcLcD3AEEtadJA@mail.gmail.com>", "subject": "[Radiance-general] Use of Radiance in the infrared", "email": "gmolina at hdlao.com", "body": "\nRichard,\n\nI would say you can. I often use Radiance for assessing the solar\nproperties of shading systems.\n\nHowever, you will have to consider that (I am speaking in VERY general,\nsome of these might not apply):\n\n-   Radiance uses only geometric optics. I have no idea what happens to\ndiffraction when wavelengths get longer... but that effect will not be\nconsidered.\n-   Some materials will be opaque in some wavelengths and transparent in\nothers (i.e. glass), so the material properties might change a lot.\n-   If you get to very long wavelengths, some hot surfaces might even\nbecome emitters. I guess that in order to get to this you will need VERY\nhot surfaces; so for albedo it might not apply.\n-   At least in my cases, I assume the materials to be gray (i.e. have the\nsame optical properties for the whole range). This might not apply for VERY\nlong spectrums. To solve this, you might want to split into some more bands\nthan only IR and Visible. As a start, you can use the basic three channels\nfor three different bands.\n-   Will you need to change the sky and sun's definition, wouldn't you?\n\nI hope it helps!\n\n2014-10-22 10:18 GMT-03:00 Richard Watkins <R.Watkins at kent.ac.uk>:\n\n\n\n--\n*Germ?n Molina L.*\nIngeniero Trainee\nHunter Douglas Chile S.A.\nCelular +569 89224445\n\n--\n\n\n*Nota de Confidencialidad:* Este mensaje inclu?do los archivos adjuntos son\nconfidenciales y pueden contener informacion privilegiada protegida por\nley. Si Ud. no es el destinatario, deberia abstenerse de copiarlo,\ndistribuirlo, divulgarlo o usar la informacion contenida. Por favor, avise\ninmediatamente al emisor y borre este mensaje de su sistema. Los mensajes\nelectronicos son susceptibles de ser cambiados, infectados o adulterados\nsin autorizacion. No asumimos responsabilidad alguna por ninguna clase de\ncambios o sus consecuencias. Usted debe estar informado que la compania\npuede hacer un seguimiento de sus mensajes electronicos y su contenido,\ngracias.\n\n*Confidentiality Notice:* The information contained in this email message,\nincluding any attachment, is confidential and is intended only for the\nperson or entity to which it is addressed. If you are neither the intended\nrecipient nor the employee or agent responsible for delivering this message\nto the intended recipient, you are hereby notified that you may not review,\nretransmit, convert to hard copy, copy, use or distribute this email\nmessage or any attachments to it. If you have received this email in error,\nplease contact the sender immediately and delete this message from any\ncomputer or other data bank, Thank you.\n\nA informa??o transmitida ? confidencial e para conhecimento exclusivo do\ndestinat?rio. Sua utiliza??o, n?o autorizada, constitui crime pass?vel de\npris?o. Todas as precau??es poss?veis foram tomadas para garantir que este\ne-mail n?o contenha v?rus. Uma vez que nossa empresa n?o pode assumir\nresponsabilidade por nenhuma perda ou dano causado por este e-mail ou de\nseus anexos, recomendamos que o destinat?rio utilize seus procedimentos de\nantiv?rus antes de qualquer uso.\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20141022/8467a7ba/attachment.html>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Use of Radiance in the infrared", "tags": [], "sender": "CHI-German Molina", "datetime": "Wed, 22 Oct 2014 10:32:03 -0300"}