{"refs": [], "id": "<s182415d.085@wmtao.com>", "subject": "[Radiance-general] Re: Solar Footprin", "email": "MdelaFuente at wmtao.com", "body": "\nRob, I like the off-color idea.. this is after all just a diagram.  To\ncombine images all you need to do is type pcomb pic1.pic pic2.pic >\nnewpicture.pic.  It just adds all the values together.  This has been a\nvery useful for me in the past.  Keep in mind you are adding light, so\nyou want to try and keep from \"double dipping\" sort of speak.  So you\nwould not have light A and B in one picture and B and C in the other and\nadd them up.  You would have A, B, and, C all in separate pictures.\nThis can be a big time saver if you are trying to develop images for\nvarious \"scenes\".\n\nMark\n\n\nMark de la Fuente wrote:\nin\n\npositions\n\nimage\nDepending\nnot\n\nI've always used animations for that sort of thing, but your idea\nsounds\ncool.  One thing that you may want to do is actually give your ambient\n\nvalue a little boost, so that the other surfaces are slightly\nilluminated.  Otherwise, it's tough to tell what you're looking at. The\n\ndirect sun patch against an all-black background could be tough to\nplace\nin context, depending on what is illuminated by the sun. John M. shared\n\na tip at last year's workshop too, he used a green-tinted ambient value\n\n(-av 0 .5 0) so that it's clear what illumination is \"fake\" and what is\n\ndirect sun.  Giving your model a little \"ambient glow\" with -av will\nmake for a clearer rendering, I think.\n\nI've never merged images together like that and would be interested to\n\nhear how you go about it, and what issues there are to consider, such\nas\nexposure & filtering.  I'd love to see what you come up with.  This\ncould be a useful tool.\n\nP.S.\nSince you're doing -ab 0, the number of calculations shouldn't be a\ncause for alarm, the direct calculation is really fast.\n\n----\n\nRob Guglielmetti\n\ne. rpg@rumblestrip.org\nw. www.rumblestrip.org\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20041029/79834406/attachment.html\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Mark de la Fuente", "datetime": "Fri Oct 29 20:11:08 2004"}