{"refs": ["<001901d0283f$f44ad520$dce07f60$@yahoo.com>", "<ED0FF4B6-14E0-4E0D-BFE1-DE23BE84368B@lmi.net>"], "id": "<002401d02877$3e93d780$bbbb8680$@yahoo.com>", "subject": "[Radiance-general] False color and luminance values", "email": "\"Brian Karr\"", "body": "\nFor the small area, in Photosphere I dragged and dropped a selection box,\nwhich updated the histogram. I wanted to perform a sanity check to see if\nvalues in my Radiance model where matching the real world model. Guess I'm\nused to that type of selection in other programs and it appeared to work.\nmaybe need to check further.\n\nPoint well taken on the strong primary color, its federal paint standard\nInsignia Red, aka Red Safety No 11105, aka Fire Suppression System red\npaint. Its used on all the launch pad sprinkler system pipes. The grey is\nGrey Standard No 16473, which is launch pad grey.\n\nThank you,\n\nBrian\n\n\n\nSent: Sunday, January 04, 2015 3:45 PM\nTo: Radiance general discussion\n\n\nHi Brian,\n\n\n\nHow did you determine the \"small area mean\" of 131 nits using falsecolor?\n\n\n\nThe discrepancy between the two programs has to do with a bug in the\n\"pextrem\" program, which uses the intensity rather than the luminance to\ndetermine the brightest pixel.  In your case, the red shelves have higher\nintensity than the top shelf, despite the fact that the top of the bookcase\nhas a higher luminance value.  Therefore, pextrem (used by falsecolor)\nthinks the brightest point is on a red shelf rather than on top, and both\nthe luminance scale (using \"auto\") and the max value are incorrectly\ndetermined.\n\n\n\nIt is possible to correct this flaw in falsecolor without too much\ndifficulty by replacing some lines of code, at a small expense in\ncomputation time.  This hasn't come up before, to my knowledge, as people\ntend not to use such strong primary colors.\n\n\n\nBest,\n\n-Greg\n\n\n\n\n\n\n\n\n\nHello all,\n\n\n\nA question regarding false color and luminance values. Starting with an\nimage created via rpict, and using the photosphere histogram, the max\nluminance value is 351 nits. Selecting a small area around the top outer\ncorner of the shelf results in a mean around 302 nits. This agrees fairly\nclose to a measurement with a spot meter on the outer corner of a physical\nversion of the scene, so far so good.\n\n\n\nCommand: rpict -vtv -vp 0.75 .75 5.5 -vd 0.3 1.0 -0.6 -vu 0 0 1 -vh 45 -vv\n45 -vo 3 -va 0 -vs 0 -vl 0 -av .1 .1 .1 -x 2000 -y 2000 -ab 2 -aa .1\nshelf.oct > shelf_rpict.hdr\n\n\n\nFile: https://dl.dropboxusercontent.com/u/91366188/shelf_rpict.hdr\n\n\n\nWith a false color version, the histogram max luminance however is 177 nits,\nthe small area mean is 131 nits. Im not sure why the luminance values\nbetween the two versions are different?\n\n\n\nCommand: falsecolor -ip shelf_rpict.hdr -e -s auto -n 16 -lh 1000 -lw 225\n-log 4 -l > shelf_false_log_norm.hdr\n\n\n\nFile: https://dl.dropboxusercontent.com/u/91366188/shelf_false_log_norm.hdr\n\n\n\nThoughts?\n\n\n\nThank you!\n\nBrian\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20150104/ba8b2257/attachment-0001.html>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] False color and luminance values", "tags": [], "sender": "brianakarr at yahoo.com", "datetime": "January 4, 2015 9:00:31 AM PST"}