{"refs": [], "id": "<CBDA7B0F3FC5354F986B71977E204BEC40C3ED94@EX-MBX01.burohappold.com>", "subject": "[Radiance-general] BSDF file for light redirecting film", "email": "Chris.Coulter at BuroHappold.com", "body": "\nHappy New Year Radiance List,\n\nHas anyone had success receiving manufacturer provide BSDF data for light redirecting films (3M/others)?\nI see from Basurto?s 2012 workshop presentation there were some xml files from those studies, but does anyone know if these were modelled or measured BSDFs?\n\nBest,\n\nChris\n\nChris Coulter\nAssociate\nBuroHappold Engineering | Lighting Design\nT: +1 212 334 2025\nM: +1 646 574 2791\nwww.burohappold.com<http://www.burohappold.com/> | @burohappold<http://www.twitter.com/burohappold>\n\n\nThis transmission is confidential and intended solely for the person or organization to whom it is correctly addressed. If you are not the intended recipient of this transmission, you should not take any action in reliance on it. Further, this transmission may contain confidential design and other information owned by Buro Happold LtdConsulting Engineers, P.C. (?Buro Happold?). You should not copy, distribute, use, offer for sale or hire such information or in any way infringe the design and intellectual property rights of Buro Happold Ltd. It is intended that communication by email from Buro Happold .Ltd or its employees is limited to communications connected to the services provided by Buro Happold Ltd. Buro Happold Ltd accepts no liability for any communications not connected to the services it provides. Computer viruses may be transmitted or downloaded onto your computer system via email communication. It is the recipient?s responsibility to take any action necessary to prevent computer viruses being transmitted in this way. Accordingly, Buro Happold Ltd disclaims all responsibility which arises directly or indirectly from such transmission of computer viruses. Buro Happold Consulting Engineers, P.C.Ltd.. Registered in England: 2049511 New York State, USA. Registered Office: 100 Broadway 23rd Floor, New York, NY 10005. If you receive this message in error, please notify the sender by return e-mail immediately and delete this message, any attachments and all copies from your system.\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20150115/d60aed5a/attachment.html>\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Chris Coulter", "datetime": "Thu, 15 Jan 2015 18:08:32 +0000"}