{"body": "\nOn Wed, Dec 16, 2009 at 10:14 AM, Victor Li <victorpermanent@gmail.com> wrote:\n\n\nIt's just how it is. If you want to define the glass material\ncorrectly you have to convert VTL to transittance via formula.\nEnd of existencial uncertainty.\n\n\nObviously the material could have any color. You define the\ncolor of the transmitted and reflected light via the first three\nparameters. The actual transmittance is the sixth parameter\n(second to last). If you'd set this to 0 you would effectively\nget an opaque material of the specified color.\n\nIn your example the color is identical to the transmittance\nbecause you set the transmittance parameter to 1 which\neliminates the complexity of finding the right values for all\n7 parameters. If your transmittance in less than 1 you have\nto calculate the red, green and blue components from their\naverage value and the transmittance. The formula for this is\ngiven in the Rendering with Radiance book.\n\n\n\n[... on difference between glass and trans]\n\n\nWe need to know how much different it is to comment on that.\nCan you please quote the numbers you get from the simulations.\n\nOne obviouse difference is that the glass material will appear\nless translucent at an angle than orthogonal to the surface.\nThe trans material will keep it's 0.325 transmittance at all\nangles.\n\nIf you try to compare the two materials you have to use\na method that is not susceptible to these differences.\n\n\n\nYou can find documentation for Radiance here:\n\nhttp://radsite.lbl.gov/radiance/framer.html\n\nIn particular this guide might be helpful. I think it lists all\nmaterial types and parameters.\n\nhttp://radsite.lbl.gov/radiance/refer/usman1.pdf\n\n\nRegards,\nThomas\n\n", "replyTo": "Subject: [Radiance-general] material trans and glass?", "sender": "Thomas Bleicher", "isquestion": false, "tags": [], "id": "<89355c0f0912160532g5b56eb6dq39d7eef530c52a2a@mail.gmail.com>", "refs": ["<C746ABC7.17B2%robert.guglielmetti@nrel.gov>", "<20091211173544.130480@gmx.net>", "<be3956780912121936g20460bafm62105762f255a1f5@mail.gmail.com>", "<89355c0f0912130551k1adc7bb7xbec31cc9ae3414c4@mail.gmail.com>", "<be3956780912160214t345ef7a8tff16685470c37f@mail.gmail.com>"], "datetime": "Wed Dec 16 05:33:00 2009", "email": "tbleicher at googlemail.com", "subject": "[Radiance-general] material trans and glass?"}