{"refs": ["<CAOn=hKH8k1pgyEdWrvjt1Vuq08dXs-AMk+q7uh85fBWDtVvL_A@mail.gmail.com>"], "id": "<88079A360FAC7441AE93ECBF6199823627365C68@AMXExMb02.global.arup.com>", "subject": "[Radiance-general] Daylighting simulations for different roomdepth", "email": "Giuseppe De Michele", "body": "\nIt could be that you need more -ab bounces, or more -ad rays traced in order to avoid the unexplained divergence you see for the areas farthest from the windows in the 10m deep room. This could also impact your drop from 60% to 40% UDI when increasing room depth to 10m.\n\nIt?s possible that the solutions do perform similarly at more than 4m from the glass, unless your lamella or your light shelf have special specular or prismatic materials or shapes intended to really redirect light farther into the space. By that distance from the window, the light has bounced so many times that the reflectance of the floor and ceiling probably have a bigger impact than either of two relatively comparable window systems. Or, at that distance the illumination could be reliant almost entirely on the view of the sky from each point on the workplane which could be similar for both systems at a distance.\n\n\n\n\n2.    From the 4 meters the two systems seems to be equivalent. Can it be since the systems do not influence the daylight trend from that distance?\n3.    Until the 7 meter, the daylight trend seems to be equal comparing the three scenarios. After, we have the largest differences.\n4.    It is interesting to note as the UDI300-3000 on the 9 m pass from the 60% of the working hours (image 45 - 9m) to almost 40% (image 45 - 10m) going under the UDI>3000 extended the depth from 9 to 10m.\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20150224/2183a6a4/attachment.html>\n\n", "isquestion": false, "replyTo": "<CAOn=hKH8k1pgyEdWrvjt1Vuq08dXs-AMk+q7uh85fBWDtVvL_A@mail.gmail.com>", "tags": [], "sender": "giudm.87 at gmail.com", "datetime": "Tue, 24 Feb 2015 15:00:32 +0000"}