{"refs": ["<41DA8B9A-67CE-4AED-A3BF-444285EA6AA8@lunet.lboro.ac.uk>"], "id": "<140E2C89-A46A-4ED1-8C54-93AD7F95C9BE@lmi.net>", "subject": "[Radiance-general] 3-phase method daylight matrix", "email": "gregoryjward at gmail.com", "body": "\nHi Eleanora,\n\nI'm not sure I'm understanding your question fully, but you can have multiple *receivers* in the same file to generate multiple matrices using rfluxmtx.  However, if you wish to use those receivers (i.e., your window surfaces) as *senders* in a subsequent run (i.e., for the exterior daylight coefficients), then you must have them in separate files for multiple runs of rfluxmtx.\n\nIt is probably poor program design on my part, but currently, rfluxmtx ignores the materials in a sender file, and just puts them all together as a single \"average\" surface.  This gives unintended results if you give it two well-separated windows of different orientations, and this is possibly the source of your errors.\n\nFor optimal efficiency using rfluxmtx for 3-phase, it is better to have separate files for your different elevation windows, with different modifiers in each.  For example, you might have:\n\neast_windows.rad\t(using \"east_window_mat\" to modify all the surfaces)\nwest_windows.rad\t(using \"west_window_mat\")\nsouth_windows.rad\t(using \"south_window_mat\")\n\nThis would allow you to do the necessary 3 separate runs of rfluxmtx to compute the contribution from each elevation's windows for the external daylight coefficients.  Then, you could have a combined \"receivers.rad\" file that contains the following single line:\n\n!xform east_windows.rad west_windows.rad south_windows.rad\n\nYou would give this one-line file to a single run of rfluxmtx to compute the three interior flux transform matrix for your sensors.\n\nDoes this help?\n\nCheers,\n-Greg\n\nP.S.  I will see if I can add a warning message for sender files with multiple modifiers, as this seems such an easy mistake to make!\n\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] 3-phase method daylight matrix", "tags": [], "sender": "Greg Ward", "datetime": "Thu, 12 Mar 2015 11:17:00 -0400"}