{"refs": ["<CABL0Rjc8zzy4F59aPWF+WefC+YQ=wmVuxbTtkKNRYwvoHP=PHA@mail.gmail.com>"], "id": "<CAP0o02K3gqk4JY0GFu+vufOtOjADD+5m0r_p2K4LtLUL9WeMPw@mail.gmail.com>", "subject": "[Radiance-general] AGI 32 vs Radian", "email": "keralagios at gmail.com", "body": "\nHi Shri,\n\nPerhaps you know this already, but the major difference between AGI\nand Radiance is that AGI uses radiosity rather than raytracing to\ncalculate light, and therefore does not calculate specularity or\nspecular light transmission. You can raytrace individual views in AGI,\nbut that applies Ray tracing to the direct component only and it does\nnot affect any calculated point grids. Qualitatively, visualizations\nare less true to life. Ability to control your calculation parameters\nin AGI is also limited.\n\nAnother limitation with AGI is the ability to define complex\nmaterials. In general the parameters are limited to tramsittance or\ntransparency and color. There is an option to add a texture, but I\nthink these are just image maps, although I would have to check. If\nyou are planning on using a complex definition for your materials, AGI\ndoes not support that.\n\nLastly, AGI doesn't support climate-based metrics/annual calculations or DGP.\n\nI have heard that there are several papers and studies out there that\ntry to compare AGI, Radiance, and other softwares, but I don't have\nany specific reference to give you.\n\nNone of this is to say that AGI is not accurate, especially within\nit's given capabilities, and in your case if the translucent material\nyou are using is 100% diffusing, and you do not need to address\nspecularity, daylight autonomy or DGP, you would likely get reasonable\nresults as far as the light transmission through the glazing. But in\nthe end, Radiance has much greater capacity to simulate daylight,\nglare, materials, etc.\n\nI hope that helps,\nKera\n\n\nSent from my iPhone\n\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] AGI 32 vs Radianc", "tags": [], "sender": "Kera Lagios", "datetime": "Fri, 13 Mar 2015 11:19:54 -0400"}