{"refs": ["<AE55A995167B224DBBFA16500E3AB9B3047C1283@NDJSMBX202.ndc.nasa.gov>"], "id": "<88079A360FAC7441AE93ECBF61998236273B1D04@AMXExMb02.global.arup.com>", "subject": "[Radiance-general] Rtrace for Radiance & Irradiance Calc.", "email": "Kolomenski, Andrei", "body": "\nI won't try to answer all of your questions, and my answer is based only on reading documentation rather than close knowledge of the actual code... but I'll try to comment related to the difference between the uppercase and lowercase -I and -i options. When using uppercase -I rtrace will inherently offset your x,y,z meter position slightly in the direction of your measurement vector in case you've given a coordinate that is coplanar with the surface (I forget the distance used but with my clues and a little searching this should be found somewhere in the mailing list archives). When using the lowercase -i rtrace will trace a ray along the given vector, calculate the luminance at the point of intersection with a surface, then determine illuminance by correcting the luminance with factors of pi and reflectance at the intersection point. I've never investigated if non-Lambertian materials actually do impact this value, but if so the -I option would better serve your purpose for non-lambertian materials, but you may have to scale your model or edit the code to have the offset of measurement coordinates become negligible.\nI wouldn't consider myself an authority on the topic, but I want to try to respond with the hope that others will better explain my understanding if it deserves clarification.\n\nSent: Thursday, April 09, 2015 10:38 AM\nTo: Radiance-general at radiance-online.org\nHello Dear Radiance Users,\nI have some questions about the utilization of rtrace to determine radiance & irradiance values within a scene. I greatly appreciate your responses and help. To give some context, I'm working on developing a virtual gonio-photometer in Radiance in order to obtain BRDFs of Radiance primitive materials and then export the BRDF data for analysis with other software. To do this I need a clear understanding of how Radiance measures radiance and irradiance with rtrace. First, I will explain my current methodology and please correct me if I'm wrong at any point.\nA BRDF is a ratio of the reflected radiance of a material over the incident irradiance on the material surface, and this value is evaluated over four spherical angle ranges that define the orientation of the incident light and the orientation of the reflected light as captured by a radiance meter.\nThe units of a BRDF value is (1/steradian), since the units of radiance are (W*m^2/sr.) and the units of irradiance are (W*m^2). Also, radiance is independent of measurement distance unlike irradiance. Due to this the BRDF geometry is constrained to a unit meter hemisphere, with the material sample centered at the origin.\nTo compute the incident irradiance on the material sample I use rtrace with -I argument. I pass the position (0,0,0), the center of the material sample and the direction (x,y,z) that is a unit vector aligned with the optical axis of the light source that points to the center of the light source (ring surface). I'll call this irradiance value L1.\nA second way to compute the incident irradiance is to use rtrace with the -i argument and pass position (x,y,z), the position of the light source, and direction (-x,-y,-z) that points toward the origin, which is the center of the sample. I'll call this irradiance value L2.\nAfter looking at the irradiance values it seems like L2 is the Lambert's cosine corrected irradiance, meaning L2 = L1*cos(theta), where theta is the radial incident angle of the light source. Is this true? If not, can someone please explain the difference between these two irradiance measurements?\nAlso, in the rtrace help page could someone help explain this statement that concerns the -i argument: \"This only affects the final result, substituting a Lambertian surface and multiplying the radiance by pi.\" I understand that a Lambertian surface is one that is purely diffuse and the radiance and luminance is constant in all directions, but I'm unsure of how this applies to irradiance.\nFinally, I need to obtain reflected radiance from the material, and I want to make sure that my radiance measurement doesn't take into account the radiance emanating from the light source itself. To do this, given an arbitrary radiance meter positon along the unit hemisphere (x,y,z). I setup rtrace with no input arguments other than position (x,y,z) and direction (-x,-y,-z), a unit vector that points to the center of the material (0,0,0), from the radiance meter position (x,y,z).\nMy problem arises when I evaluate the BRDF at various locations. I see a radiance value that is about 3x-4x larger than my measured incident irradiance value, at the position of the specular reflection (mirror-like reflection). Of course, I will see the highest reflected radiance at the specular position, however it seems to be unrealistically large, since somehow more energy is reflected than emanating from the single light source itself. Is this type of behavior common for a metal Radiance primitive that follows the Ward BRDF scattering model? With my current observations, the conservation of energy is not maintained. Do I need to correct the radiance value by a steradian value to be able compare the two as apples to apples? Or am I missing something else.\nI apologize for the long message, but I wanted to be as clear as possible with my questions. Thank you in advance for your time and help.\n\nBest Regards,\nAndrei Kolomenski\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20150409/cb1fb00e/attachment-0001.html>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Rtrace for Radiance & Irradiance Calc.", "tags": [], "sender": "JSC-SF311", "datetime": "Thu, 9 Apr 2015 15:04:18 +0000"}