{"refs": ["<D15C23CC.182F4%Robert.Guglielmetti@nrel.gov>"], "id": "<AE55A995167B224DBBFA16500E3AB9B3047C19EA@NDJSMBX202.ndc.nasa.gov>", "subject": "Re: [Radiance-general] OConv & Rpict Runtime Error  Out of Memory", "email": "Guglielmetti, Robert", "body": "=?iso-8859-1?q?=AD_Out_of_Memory?=\n\nHi Robert,\n\nThank you for the response. I was hoping that someone would say that it is possible to build 64 bit Radiance. I will give it a try and report back on the outcome.\n\nRegards,\nAndrei\n\n-----Original Message-----\nSent: Tuesday, April 21, 2015 5:01 PM\nTo: Radiance-general at radiance-online.org\nHi Andrei,\n\nIn theory you should be able to use CMake now with a pre-5.0a vintage (say, https://github.com/NREL/Radiance/tree/4.3.a.2) of the source to try building for 64-bit Windows. I don't know of any publicly-available Win64 Radiance installers. We (NREL) would like to offer them, and that's on the to-do list, but it's a long list.\n\n- Rob\n\nOn 4/21/15, 3:21 PM, \"Kolomenski, Andrei (JSC-SF311)[WYLE INTEG. SCI. & ENG.]\" <andrei.kolomenski at nasa.gov<mailto:andrei.kolomenski at nasa.gov>> wrote:\n\nHello All,\nI'm experiencing a runtime error with oconv when generating an octree file for a model that has about 5 million triangle polygons. This is the error I see:\noconv: system - out of octree space: Not enough space I'm using Radiance 4.3a 32 bit on Windows 7 64 bit OS running on a desktop with an i7 and 16 GB of RAM. I tried this on another desktop with a Xeon X5647 with 48 GB of RAM and same error. So hardware resources shouldn't be the issue. I tried generating the same octree on Linux, and everything worked properly.\nI have a similar problem with rpict when rendering an image of a large geometry scene. My octree is 843 MB and I'm testing the model with no lights and only ambient lighting (using -av 1 1 1). When I run rpict from the command line it either finishes but generates a completely empty image or rpict crashes and I see a \"rpict not responding\" Windows message.\nIs there a 64 bit Windows installer version of Radiance, or can I build it from source code using CMAKE? What is the maximum number of vertices that 32 bit Radiance can handle? Has anybody else experienced problems with oconv or rpict in Windows when working with large models?\n\nKind Regards,\nAndrei Kolomenski\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n", "isquestion": false, "replyTo": "<D15C23CC.182F4%Robert.Guglielmetti@nrel.gov>", "tags": [], "sender": "Robert.Guglielmetti at nrel.gov", "datetime": "Wed, 22 Apr 2015 13:11:30 +0000"}