{"refs": ["<OF2ECE73FC.828AEE5E-ONC1257E34.00434DB2-C1257E34.00434DB4@ise.fhg.de>"], "id": "<1119229847.5091837.1430142984697.JavaMail.yahoo@mail.yahoo.com>", "subject": "[Radiance-general] Antwort: Creating sky files for low solaraltitudes", "email": "ajid_miri at yahoo.com", "body": "\nDear?Wendelin,\n\n?Thank you so much for your answer. I found the skartveit.c in the Daysim source files. I will take a look at it tonight.\n\n\nAnyway, I want to ask one more thing; I create a WEA weather data file based on illuminance values instead of irradiance. Then I use ds_shortterm to create a WEA file with 1 minute intervals. As you see in the following, around sunset on 31st?of July, the illuminance values suddenly (in only minute) dropped from 107 to 0, however it should take much longer in real.\n\n?\n\n7 31 20.158 0 122\n\n7 31 20.175 0 117\n\n7 31 20.192 0 112\n\n7 31 20.208 0 107\n\n7 31 20.225 0 0\n\n7 31 20.242 0 0\n\n7 31 20.258 0 0\n\n?\n\nIs there any way to estimate the length of this period (from 100 lux to 1 lux)? It is probably different with different sky conditions, but if we think about clear sky, is there any studies that mention this period or not?\n\n\nBest,Majid\n\n\n\nOn Monday, April 27, 2015 2:15 PM, \"Wendelin.Sprenger at ise.fraunhofer.de\" <Wendelin.Sprenger at ise.fraunhofer.de> wrote:\n\n\n\nDear Majid,\n\nplease be aware of the -i option in gendaylit.\n\n-i time_interval[min]\n????????????? If gendaylit is used with weather files, the specified instantaneous points of time may? be? incorrect.\n????????????? This? error? occurs due to the fact that measurement results are frequently defined for time intervals,\n????????????? not for specific points of time.? Although gendaylit is working correctly, this may lead to wrong? out-\n????????????? puts? especially? at? low sun altitudes.? The -i option allows to specify the time interval of the mea-\n????????????? surements in minutes, causing the solar position to be corrected for low sun altitudes. A warning? mes-\n????????????? sage is returned if a correction has been performed.\n\nThe method you are looking for is the Skartveit-Olseth method. Unfortunately, I do not have any program code for it.\nHave you already looked in the Daysim code? I think it is implemented there.\n\nBest regards\nWendelin\n\n___________________________________\nDr. Wendelin Sprenger\nDivision Thermal Systems and Buildings\nFraunhofer Institute for Solar Energy Systems ISE\nHeidenhofstr. 2, 79110 Freiburg, Germany\nPhone: +49 (0) 7 61/ 45 88-57 45\nwendelin.sprenger at ise.fraunhofer.de\nhttp://www.ise.fraunhofer.de\n\n-----Majid Miri <majid_miri at yahoo.com> schrieb: -----An: Radiance General Discussion <radiance-general at radiance-online.org>\nVon: Majid Miri <majid_miri at yahoo.com>\nDatum: 27.04.2015 12:30\nBetreff: [Radiance-general] Creating sky files for low solar altitudes\n\nHi all,\nI want to simulate skies during a period very close to sunrise and sunset when the global horizontal skylight is between 100 and 1 lux).I tried to use Daysim and Meteonorm 6.0 to create a weather data file with 1 minute intervals, but both of them are based on watt and their minimum value is 1 watt. When converting from irradiance to illuminance, it gives me around 140 lux as minimum. (I use ?gendaylit.exe 3 21 12.0 -a 59.7 -o -18.0 -m -15.0 -W 0.0 1.0 -O 2? to create a sky with only 1 watt horizontal diffuse irradiance)\nHowever I need to estimate the times that the skylight is less than 100 lux.I use Gensky to produce automatically the sky file for the times that the sun altitude is close to horizon (below and above horizon), but it gives me much higher values than I expected. I checked the IES handbook and it says that to estimate diffuse skylight (the Sky ratio method is not accurate for low solar altitude, and I guess that Gensky use the same method).Therefore, I really appreciate if anyone can help me to produce a series of sky with 1 minute intervals for the time the sun is very close to horizon (below or above horizon)\nBest,Majid\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20150427/5c8d8b68/attachment-0001.html>\n\n", "isquestion": false, "replyTo": "<OF2ECE73FC.828AEE5E-ONC1257E34.00434DB2-C1257E34.00434DB4@ise.fhg.de>", "tags": [], "sender": "Majid Miri", "datetime": "Mon, 27 Apr 2015 13:56:24 +0000 (UTC)"}