{"refs": ["<FF7DBAB281C1A94F80CCEC1896041532BB1285AE@SDCEMB01.unibz.it>", "<8EE3C015-0FF1-470B-9475-F7C583892B10@lmi.net>", "<FF7DBAB281C1A94F80CCEC1896041532BB1286B8@SDCEMB01.unibz.it>", "<1F882748-0A58-49EE-BDED-CE3E2E45F571@lmi.net>"], "id": "<FF7DBAB281C1A94F80CCEC1896041532BB1287AA@SDCEMB01.unibz.it>", "subject": "Re: [Radiance-general] using transdata for roller shade simulation", "email": "Greg Ward", "body": "\nHi Greg,\nI read the description. Thank you for the references.\nI have only a question about the shades description that you sent me with your first email. In all the cases the color coefficients for the directional diffuse, which I suppose should be the beam to diffuse component of the incident light, have been imposed equal to 0.\nIf I wanted modify them according to the incident angle values, I have \"simply\" to insert the specific correlation inside the .cal file?\n\nThank you\n\nAnna\n\nAnna Maria Atzeri\nPh.D. Student in Sustainable Energy and Technologies\nFree University of Bozen-Bolzano\nFaculty of Science and Technology Office K 0.11\nPiazza Universit? 5 I - 39100 Bolzano\nTel. +39 0471 017634 - Cell. +393285616787 - annamaria.atzeri at natec.unibz.it\n\nSent: 08 May 2015 19:58\nTo: Radiance general discussion\nHi Anna,\n\nOther than the source code(!), we just have the Radiance reference manual:\n\nhttp://radsite.lbl.gov/radiance/refer/ray.html#Materials\n\nHere's what it says about BRTDfunc:\n\nBRTDfunc\nThe material BRTDfunc gives the maximum flexibility over surface reflectance and transmittance, providing for spectrally-dependent specular rays and reflectance and transmittance distribution functions.\n\nmod BRTDfunc id\n\n10+  rrefl  grefl  brefl\n\nrtrns  gtrns  btrns\n\nrbrtd  gbrtd  bbrtd\n\nfuncfile  transform\n\n0\n\n9+   rfdif gfdif bfdif\n\nrbdif gbdif bbdif\n\nrtdif gtdif btdif\n\nA10 ..\nThe variables rrefl, grefl and brefl specify the color coefficients for the ideal specular (mirror) reflection of the surface. The variables rtrns, gtrns and btrns specify the color coefficients for the ideal specular transmission. The functions rbrtd, gbrtd and bbrtd take the direction to the incident light (and its solid angle) and compute the color coefficients for the directional diffuse part of reflection and transmission. As a special case, three identical values of '0' may be given in place of these function names to indicate no directional diffuse component.\n\nUnlike most other material types, the surface normal is not altered to face the incoming ray. Thus, functions and variables must pay attention to the orientation of the surface and make adjustments appropriately. However, the special variables for the perturbed dot product and surface normal, RdotP, NxP, NyP and NzP are reoriented as if the ray hit the front surface for convenience.\n\nA diffuse reflection component may be given for the front side with rfdif, gfdif and bfdif for the front side of the surface or rbdif, gbdif and bbdif for the back side. The diffuse transmittance (must be the same for both sides by physical law) is given by rtdif, gtdif and btdif. A pattern will modify these diffuse scattering values, and will be available through the special variables CrP, CgP and CbP.\n\nCare must be taken when using this material type to produce a physically valid reflection model. The reflectance functions should be bidirectional, and under no circumstances should the sum of reflected diffuse, transmitted diffuse, reflected specular, transmitted specular and the integrated directional diffuse component be greater than one.\n\n\n\n\n\n\n\nHi Greg,\nand thank you for your super quick response!\nAt the moment I can't implement in my simulation the BSDF type since I'm using Radiance via DIVA, and the actual Daysim version implemented in DIVA doesn't support BSDF type for the annual calculation.\nThis was the reason for whose I thought to use transdata.\nInstead the BRTDfunc seems to work. I tried to run an annual simulation and it seems like nothing wrong happened.\n\nSo, I've only to understand how BRTDfunc exactly works. Any suggestion will be very appreciate!\n\nThank you,\n\nAnna\n\nSent: 07 May 2015 23:48\nTo: Radiance general discussion\nHi Anna,\n\nThe transdata (and transfunc) materials do not fully model material behavior as well as the newer BSDF type (or even BRTDfunc).\n\nI have a few models of roller shades, which you might be able to modify to your purpose.  I do not (currently) have any measurements to offer.\n\nBest,\n-Greg\n\n-------\n\n# Shade material s99745 by Mechoshade, white facing front (inside)\n# Measurements by Mehlika Inanici & Judy Lai 9/20/2004\n# Diffuse measurements by Mike Rubin 10/7/2004\nvoid BRTDfunc Mechoshade99745\n10\n0 0 0\n.02*tspec .02*tspec .02*tspec\n0 0 0\nshade.cal\n0\n11\n.628     .628     .628\n.377     .377     .377\n.0225   .0225   .0225\n56        68\n\n-------------\n\n# Shade material #1 by Mechoshade\n# Measurements from Steve Hebeisen <steveh at mechoshade.com<mailto:steveh at mechoshade.com>>\nvoid BRTDfunc Mechoshade6020\n10\n0 0 0\ntspec tspec tspec\n0 0 0\nmechoshade.cal\n0\n9\n.37       .37       .37\n.56       .56       .56\n.03       .03       .03\n\n--------------\n\n# Shade material #2 by Hexcelshade\n# Measured from sample 11/3/2003\nvoid BRTDfunc HexcelshadeS065\n10\n0 0 0\ntspec tspec tspec\n0 0 0\nhexcelshade.cal\n0\n9\n.26       .28       .30\n.59       .61       .60\n.02       .02       .02\n\n-----------\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20150511/f4e13aa0/attachment-0001.html>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] using transdata for roller shade simulati", "tags": [], "sender": "gregoryjward at gmail.com", "datetime": "May 8, 2015 8:24:08 AM PDT"}