{"refs": [], "id": "<D697763F9F216044A99BC674C0056196135259E211@EXCHANGE1.ad.nottingham.ac.uk>", "subject": "[Radiance-general] Rendering using Radiance_As Beginners", "email": "ezxia at nottingham.ac.uk", "body": "\nHi all,\n\nI just started using Radiance and it seems to me difficult so I need your advices please.\n\n\n1.       As Radiance Desktop is no more recommended for CFS daylighting, what is the alternative if one wants to study illuminance distribution (points values) inside an office that has CFS (with both diffuse and specular materials)?\n\n2.       Is there any user-friendly-interface program that can do the task without the need to work with command-line procedure (that I am not good with at all)?\n\n3.       If it's compulsory to use command-line tools, how can we construct/import CAD geometry and assign its materials?\n\n4.       And, is there a step-by-step tutorials on how to run Radiance (in case of command-line)?\n\nYour help/advice is really so appreciated.\n\nMany thanks in Advance :)\n\nIkrima Amaireh\nUniversity of Nottingham, UK\n\n\n\n\nThis message and any attachment are intended solely for the addressee\nand may contain confidential information. If you have received this\nmessage in error, please send it back to me, and immediately delete it.\n\nPlease do not use, copy or disclose the information contained in this\nmessage or in any attachment.  Any views or opinions expressed by the\nauthor of this email do not necessarily reflect the views of the\nUniversity of Nottingham.\n\nThis message has been checked for viruses but the contents of an\nattachment may still contain software viruses which could damage your\ncomputer system, you are advised to perform your own checks. Email\ncommunications with the University of Nottingham may be monitored as\npermitted by UK legislation.\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20150512/0bd68b3b/attachment.html>\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Ikrima Amaireh", "datetime": "Tue, 12 May 2015 15:40:54 +0100"}