{"refs": ["<mailman.294.1431539143.6952.radiance-general@radiance-online.org>", "<D697763F9F216044A99BC674C00561961352D7F888@EXCHANGE1.ad.nottingham.ac.uk>"], "id": "<CAAP856z2gKj7YrnS3Roq6hgBFPyKpX0YX1RPf_udg=EYHhYGww@mail.gmail.com>", "subject": "[Radiance-general] Radiance-general Digest, Vol 135, Issue 18", "email": "zrogers at daylightinginnovations.com", "body": "\nHi Ikrima,\n\nNot really knowing your exact needs, I'll try to answer:\n\n\nThe Daylight Coefficient or a Design Day interpolation annual simulation\napproaches do not have to be unique to Ray-tracing engines, like Radiance.\nRadiosity engines can make use of the same concepts for annual simulation.\nRadiosity can often run a single point in time quicker, with other\nlimitations, and so can calculate more coefficients or design days.  I am\nnot sure, but I believe Ecotect is providing an interface to Radiance for\nsimulation and maybe has its own sun path and solar shading design tools.\n\n\nI believe good representative BSDF data, or just a good model of the\nfenestration system itself, would still be very important to get a good\ncalculation of daylight coefficients (which is as challenging of a\ncalculation as illuminance).  Using Radiance based tools is not necessary\nas there are other Ray-tracing and Radiosity based tools that can do\nsimilar calculations.  One convenient thing is that the Radiance based\ntools use this standard XML BSDF definition now which aligns with the\nWindows 7 software giving greater access to these definitions.\n\nRegards,\nZack\n\n--\nZack Rogers, P.E., LEED AP BD+C\nDaylighting Innovations, LLC\n808 S. Public Road, Suite 200\nLafayette, CO 80026\n(303)946-2310\n\n\nwww.daylightinginnovations.com\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20150513/69ed4755/attachment.html>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Radiance-general Digest, Vol 135, Issue 18", "tags": [], "sender": "Zack Rogers", "datetime": "Wed, 13 May 2015 22:38:56 -0600"}