{"refs": [], "id": "", "subject": "[Radiance-general] Alternative shells for Windows (WAS: Rrcontrib for rendering - missing required modifier argument)", "email": "Robert.Guglielmetti at nrel.gov", "body": "Message-ID: <D17B9F63.191CF%Robert.Guglielmetti@nrel.gov>\n\nHi Chris,\n\nThe main advantages I see in using Git's Bash shell for Windows are\nsmaller footprint, easier installation, and tighter integration. I haven't\ndone extensive testing, but it seems like the Git Bash shell gives Windows\nusers a more similar and compatible experience to that of the Unix user,\npotentially allowing folks to use things like Andy McNeil's tutorials,\nas-written.\n\nThe installer is 17MB and just *works*, adding a shortcut to a \"Git Bash\"\ncommand prompt. Once fired up, you have access to your existing file\nsystem, and all the basic CLI tools a Unix user us used to (e.g. ls) are\nthere and just work, along with things like wildcards. =) There's no other\nsystem tuning to do. I haven't used or set up Cygwin in a long time but\nthis Git shell is a lot easier than the Cygwin I've used. I still haven't\ntested any of the more esoteric Radiance command pipelines (such as what's\nused to get view parameters passed to rcontrib), but ASSuming they work,\ncoupled with a Windows Python or Ruby interpreter I'd bet you can get\npretty close to the Unix experience on Windows with little brain damage\nnow.\n\nHaving said all that, there are still things that the Windows user gives\nup in RadianceLand. The built-in multithreading (in rcontrib, rtrace,\nrpict, et al.) doesn't work; there are a few remaining Radiance commands\nthat are written in csh so those (probably (might?)) won't work; native\nmanpage support is lacking; and Roland had to use some sub-optimal\nfunctions to get all the photon map stuff to build on Windows. Still, I\nthink we've come a long way?\n\n- Rob\n\n\nOn 5/15/15, 11:40 AM, \"Christopher Rush\" <Christopher.Rush at arup.com> wrote:\n\n\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Guglielmetti, Robert", "datetime": "Fri, 15 May 2015 19:24:08 +0000"}