{"refs": ["<88079A360FAC7441AE93ECBF61998236273F780F@AMXExMb02.global.arup.com>", "<1425822542.4989905.1433230715615.JavaMail.yahoo@mail.yahoo.com>"], "id": "<D1931C38.19E17%Robert.Guglielmetti@nrel.gov>", "subject": "[Radiance-general] Simulation ecotect_radiance_daysim", "email": "Robert.Guglielmetti at nrel.gov", "body": "\nSounds like you've got a plan for which spaces you will model. As for the \"how can I proceed\" question below, I thin Chris already answered that, and it's copied in your post below...\n\nOn 6/2/15, 1:38 AM, \"slama im?ne\" <arch_imen2004 at yahoo.fr<mailto:arch_imen2004 at yahoo.fr>> wrote:\n\nHi Christopher and Robert,\nthank you for your answer.\ni think that i will to do  three scenarios daylighting simulation:\n- the first is to simulate the quatity and the quality of daylighting given in offices by external windows according their WWR, the orientation of building  glazing transmittance of window and climate characteristics (Tunisian climate)\n-The second is to simulate the quatity and the quality of daylighting providing by atria in adjacent offices and in different floors\n-The third is to simulate the quantity of daylighting given by glazing exterior office building to office adjacent atria when we have glazed wall in corridor\nhow can-I proceed for each scenario knowing that I'm going to do modeling geometry in Ecotect to analyze it in radiance software?\nIm?ne\n\n\n\n\nLe Lundi 1 juin 2015 15h35, Christopher Rush <Christopher.Rush at arup.com<mailto:Christopher.Rush at arup.com>> a ?crit :\n\n\nIm?ne,\nCan you be more specific with your question? Is your difficulty in choosing CAD modeling software (plenty of previous posts on this if you search the archives)? Ecotect interface specifics? Setting up calculation grid points within or outside of Ecotect? Scientific/design methodology for your purposes (if so please clarify the intent of your study)? Other difficulties? If your questions are specific to using Ecotect to export you might try searching the radiance-online archives for the word Ecotect to get started, as there have been many similar questions before and only a portion of Ecotect users in this mailing list.\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Simulation ecotect_radiance_daysim", "tags": [], "sender": "Guglielmetti, Robert", "datetime": "Tue, 2 Jun 2015 14:41:35 +0000"}