{"refs": [], "id": "<D697763F9F216044A99BC674C0056196135483A784@EXCHANGE1.ad.nottingham.ac.uk>", "subject": "[Radiance-general] Radian", "email": "ezxia at nottingham.ac.uk", "body": "\nHi all,\n\nI am really sorry for writing on the same point again but really in-need for clear and complete answer, if possible.\nHere, in my institution, people are in doubt if simple daylight calculation tools like Ecotect (both standalone Ecotect as well as Ecotect using Radiance engine methods) are efficient/enough for characterising different complex fenestration systems (CFS) and most importantly differentiate them for purpose of classification and rating?\nMany are saying there's no need to go through Radiance to get almost the same thing that can be achieved using other simple tools (like Ecotect). For me, as a beginner with some readings and research, I found that Ecotect is still not efficient tool to differentiate different CFS (especially if they are very close in geometry, etc.) so we need something that's more robust like Radiance to do the Job; does that sound right?\n\nYour reply is highly appreciated.\n\nRegards\nIkrima\n\n\n\n\n\n\nThis message and any attachment are intended solely for the addressee\nand may contain confidential information. If you have received this\nmessage in error, please send it back to me, and immediately delete it.\n\nPlease do not use, copy or disclose the information contained in this\nmessage or in any attachment.  Any views or opinions expressed by the\nauthor of this email do not necessarily reflect the views of the\nUniversity of Nottingham.\n\nThis message has been checked for viruses but the contents of an\nattachment may still contain software viruses which could damage your\ncomputer system, you are advised to perform your own checks. Email\ncommunications with the University of Nottingham may be monitored as\npermitted by UK legislation.\n\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Ikrima Amaireh", "datetime": "Thu, 18 Jun 2015 14:50:13 +0100"}