{"refs": [], "id": "<D1C19E17.1AC61%Robert.Guglielmetti@nrel.gov>", "subject": "[Radiance-general] Radiance \"Official\" Releas", "email": "Robert.Guglielmetti at nrel.gov", "body": "\nHi Andrei,\n\nMy $0.02, as an outsider:\n\nThe NREL GitHub site is simply a place where we (NREL) post our installers. Perhaps unfortunately, GitHub expects the \"official\" and \"pre-release\" tags on all the releases hosted there. I follow the convention laid out by Greg Ward as far as what is the official release and what is pre-release code, and we name our installers based on this convention (where \".a\" is alpha code, \".b\" is beta, and the absence of a letter denotes \"official\" releases. To be clear, the NREL Radiance GitHub site is simply a mirror of the main Radiance code repository which is managed with CVS, is hosted by LBNL, and this is the official release page:\n\nhttp://www.radiance-online.org/download-install/installation-information\n\nAs far as testing, there is no standard test protocol for builds or releases. I started some tests that can be run in the CMake framework, here:\n\nhttps://github.com/NREL/Radiance/tree/combined/cmake_tests\n\nA (long) while ago, (I believe it was) Georg Mischler (who) started an Scons-based test framework, that got about as far as mine did:\n\nhttps://github.com/NREL/Radiance/tree/combined/test\n\nMy tests are stupid and fallible. Georg's tests are very old and test a lot of seldom-used stuff (and none of the new stuff like rcontrib or photon map). They are both in the source for what they're worth; people could build on either of these.  I believe CMake's test framework (CTest) is awesome and could be used to build a very robust set of tests, and we would love to add these to the Radiance source and incorporate them into a dashboard, but this is unfortunately way down there, on a long TODO list.\n\n- Rob\n\nOn 7/7/15, 2:34 PM, \"Kolomenski, Andrei (JSC-SF311)[WYLE INTEG. SCI. & ENG.]\" <andrei.kolomenski at nasa.gov<mailto:andrei.kolomenski at nasa.gov>> wrote:\n\nDear Radiance Community,\n\nWhat makes a Radiance release \"official\"?\n\nLooking at the Radiance Github site (https://github.com/NREL/Radiance/releases), I see that version 4.2.2 is the latest \"official\" release, whereas 5.0.a.1, 5.0.a.2 and 5.0.a.3 are pre-release versions.\n\nWhat makes a Radiance release \"official\"? Is there a validation procedure carried out? If so, who is in charge of this and what are some of the test cases used for validation?\n\nThank you in advance,\nAndrei Kolomenski\n\n\n\n\n\n\n\n\n\n", "isquestion": true, "replyTo": "", "tags": [], "sender": "Guglielmetti, Robert", "datetime": "Tue, 7 Jul 2015 21:38:18 +0000"}