{"refs": ["<D1C19E17.1AC61%Robert.Guglielmetti@nrel.gov>", "<14BF4EC4-2C37-4216-89FF-2E1CAFEDCF4A@lmi.net>"], "id": "<AE55A995167B224DBBFA16500E3AB9B3047F0BC4@NDJSMBX202.ndc.nasa.gov>", "subject": "Re: [Radiance-general] Radiance \"Official\" Releas", "email": "Greg Ward", "body": "\nHello Rob & Greg,\n\nThank you for the responses and clarification.\n\nAs I understand, community testing/debugging is the main way of validating a Radiance release. It certainly would be nice to have a standard validation procedure (maybe using CMake/CTest) for each Radiance release.\n\nKind Regards,\nAndrei Kolomenski\n\n-----Original Message-----\nSent: Tuesday, July 07, 2015 6:05 PM\nTo: Radiance general discussion\nHi Andrei,\n\nRob is right that there is no big difference between an \"official\" release and any other update.  The main reason to have official releases is so individuals or institutions that distrust the development process can have a known quantity.\n\nI typically create an official release every year or two when I feel: (a) there are enough new features to make a release sensible, and (b) the code is at a relatively stable point where nothing drastically new and untested has just been added.  Nevertheless, most official releases are followed in the subsequent weeks with patch releases to fix bugs that we or others have identified in the code.  It is really the patched official releases that end up being the most stable point, though it must be said at this time that the last official release is rather seriously behind in the features department.\n\nOur goal is to make a new official release around the time of the upcoming Radiance workshop in August.\n\nCheers,\n-Greg\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] Radiance \"Official\" Releas", "tags": [], "sender": "gregoryjward at gmail.com", "datetime": "Wed, 8 Jul 2015 20:21:30 +0000"}