{"refs": ["<55C1D34B.3090502@epfl.ch>", "<5E1BB715-191A-4661-9E12-4F38E7811800@lmi.net>"], "id": "<55C24AD6.2060908@epfl.ch>", "subject": "[Radiance-general] diffuse transmission of BRTDfun", "email": "jan.wienold at epfl.ch", "body": "\nHi Greg,\n\nhmm, I have to admit I'm still not clear...\n\nIn general I think a pattern does not work in my case, since I want to\napply a different behavior of the direct-direct and the direct-diffuse\ntransmission, both depending on the angle of incidence of the incoming\nray(from the light source). E.g. I want to decrease the direct-direct\ntransmission for a more flat angle of incidence whereas I want to\nincrease at the same time the direct-diffuse transmission. In other\nwords: I want to  control the direct and the diffuse transmission\nseparately  via a function file depended of the light incidence (if\npossible).\nI thought to control the direct-diffuse transmission is possible by\nusing functions for \"rbrtd gbrtd bbrtd\" and/or \"rtdif gtdif btdif \" .\n\nAlso, honestly, the difference between those two parameters are not\ncompletely clear to me:\n\"The functions rbrtd, gbrtd and bbrtd take the direction to the incident\nlight (and its solid angle) and compute the color coefficients for the\ndirectional diffuse part of reflection and transmission.\"\nand \" The diffuse transmittance (must be the same for both sides by\nphysical law) is given by rtdif, gtdif and btdif. \"\n\nWhich one of them I have to use if I wanna change the diffuse behavior?\nAnd how? Any function name I used to replace rtdif or rbrtd seem to be\nimpossible, regardless if this function is in the cal-file or even a\nstandard function or name.\n\nSo to reduce it to two simple questions:\n-In case I have defined a function for the direct-diffuse transmission\nin a functionfile, how can I apply it in BRTDfunc?\n-How can I access in that function file (called by BRTDfunc) to the\ndirection to the incident light? According to rayinit.cal, Dx,Dy,Dz is\nonly available for the prism materials, or?\n\nThank you very  much!\n\nbest,\n\nJan\n\n\n\n\nAm 8/5/15 um 6:47 PM schrieb Greg Ward:\n\n--\nDr.-Ing.  Jan Wienold\nEcole Polytechnique F?d?rale de Lausanne (EPFL)\nEPFL ENAC IA LIPID\n\nhttp://people.epfl.ch/jan.wienold\nLE 1 111 (Office)\nPhone    +41 21 69 30849\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: <http://www.radiance-online.org/pipermail/radiance-general/attachments/20150805/110d83e9/attachment.html>\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] diffuse transmission of BRTDfunc", "tags": [], "sender": "Jan Wienold", "datetime": "Wed, 5 Aug 2015 19:41:42 +0200"}