{"body": "\nGreg,\n\nI installed your Mac Radiance 4.0 binaries and all is well except when I try to use rvu with X11.\nrad foo.rif works fine and produces an hdr image\n\nrad -o x11 foo.rif produced this error\ndyld: Library not loaded: usr/X11/lib/libX11.6.dylib\nReferenced from: /usr/local/bin/rvu\nReason: image not found\n\nAt first, I did not have a /usr/X11 directory, but I do have usr/X11R6\nSo I copied the contents of X11R6 into a new folder at same level called X11 (don't cringe!) and got this error\ndyld: Library not loaded: usr/X11/lib/libX11.6.dylib\nReferenced from: /usr/local/bin/rvu\nReason: Incompatible library version: rvu requires version 9.0.0 or later, but libX11.6.dylib provides version 6.2.0\n\nWhen I copied back all the Radiance 3.9 binaries, I can view in X11 again.\nDo I need to update X11 or something?\nI'm on a Intel Core2 Duo Mac OS 10.4.11\n\nThanks\nRob Fitzsimmons\n\n\n-----Original Message-----\nSent: Mon 3/15/2010 10:42 PM\nTo: Radiance general discussion\nI just uploaded the official 4.0 release of Radiance, long overdue, to\nthe main LBNL website:\n\nhttp://radsite.lbl.gov/radiance/framed.html\n\nI haven't had time to compile binaries for anything but Mac OS X (10.4\nand above), so help with compiles under Linux, Solaris, etc. would be\nwelcome.  (Be sure to use static linking if possible.)\n\nThe major changes in this version are listed below, with a complete\nlist to be found at:\n\nhttp://radsite.lbl.gov/radiance/refer/Notes/ReleaseNotes.html\n\nI will get around to updating the official release on www.radiance-online.org\na little later.  As always, the HEAD release with the most recent\nchanges and bug fixes will post there.\n\nEnjoy!\n-Greg\n\n================\nMajor updates in 4.0\n----------------------------\n\nAdded -n option to rvu to provide parallel rendering.\n\n****** COMPATIBILITY CHANGE ********\nChanged \".pic\" extension to \".hdr\" in all sources and documentation\nto improve interoperability with other software, since this has become\nthe de facto extension for Radiance RGBE and XYZE pictures.\n\nAdded -N option to objview to support multiprocessing.\n\nImproved sampling of circular sources (source, sphere, ring types) with\nquite a bit of help from David Geisler-Moroder.\n\nAdded \"rpict\" and \"rvu\" variables to rad, and made these as well as\nthe \"oconv\", \"mkillum\" and \"pfilt\" variables accept an alternate\ncommand path in each case.  Change suggested by Lars Grobe based\non similar Radzilla (radz) facility by Carsten Bauer.\n\nAdded gendaylit to distribution (finally).\n\nCreated genklemsamp(1) utility to generate samples suitable for\nBSDF-based annual calculations.  This is the first Perl script to\nbe added to Radiance.  Hopefully, others will follow.\n\nAdded klems_int.cal file to compute Klems bins for windows.\n\nCreated genskyvec  utility to sample a particular sky and\nevaluate average radiance over the standard Tregenza sky patches.\n\nCreated dctimestep program to compute a set of sensor values or\na combined image for a particular time using the daylight\ncoefficient method.\n\nAdded -n option to rtrace for executing on multiple cores.\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20100317/b6f2e7af/attachment.html\n", "replyTo": "", "sender": "radiance-general-bounces@radiance-online.org on behalf of Gregory J. War", "isquestion": true, "tags": [], "id": "<B564F6CD0114A44E816C0D68AE8C6E69062A25B6@MKEXCHVS2.Mail.Fiserv.net>", "refs": [], "datetime": "Wed Mar 17 15:36:50 2010", "email": "radiance-general-bounces@radiance-online.org on behalf of Gregory J. Ward", "subject": "[Radiance-general] Radiance 4.0 release"}