{"body": "\nI have been experiencing errors when attempting to use ranimate across\nmultple host computers. Specifically if the remote host does not have\nthe same user name accounts.\n\nextracted from the .ran file:\nhost= localhost 1 /export/ranimate/current muser\nhost= remote1 1 /export/ranimate/current\nhost= remote2 1 /export/ranimate/current ruser\n\nwhere muser is the user account name where the ranimate command is\nissued and ruser is the user name on the remote2 computer.\n\nThe ranimate man page states:\n\n*host*\nA host to use for command execution. This variable may be assigned a\nhost name, followed by an optional number of parallel processes,\nfollowed by an optional directory (relative to the user's home\ndirectory on that machine), followed by an alternate user name.\nMultiple /host/ assignments may appear. It is not advisable to\nspecify more than one process on a single-CPU host, as this just\ntends to slow things down. The default value is \"localhost\", which\nstarts a single process in the current directory of the local machine.\n\nclearly it seems that the intended operation is to work from the users\naccount\n\nHowever when the fourth parameter is used eg remote user name, ranimate\nonly users this in the ssh command and reverts to the master user name\nin the cd commands (The user name on the master computer that initiated\nthe ranimate process). This can be seen in the dump from remote 2 using\nthe ps x command:\n\nruser    4403  1.0  0.1   4712  1700 ?        Ss   15:58   0:00 bash -c\ncd ~muser ; cd /export/ranimate/current ; pfilt -1 -e -2 -x 1854 -y 822\n-pa 1 animat\nruser    4404  3.0  0.0   2052   788 ?        D    15:58   0:00 pfilt -1\n-e -2 -x 1854 -y 822 -pa 1 animation_process_network/frame022.unf\n\n\nIs this behaviour the intended process or a missing issue in the man pages.\n\nIt should also be noted that as soon as a dummy account is made on the\nremote2 computer under the name of muser, everything continues as\nexpected (without any changes to the ran file - that is still using the\nruser parameter)!\n\n--\n\nRegards\n\nTerrance Mc Minn\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20100314/41a496fe/attachment.htm\n", "replyTo": "", "sender": "Terrance Mc Minn", "isquestion": true, "tags": [], "id": "<4B9CA17D.3020300@curtin.edu.au>", "refs": [], "datetime": "Sun Mar 14 00:42:40 2010", "email": "t.mcminn at curtin.edu.au", "subject": "[Radiance-general] ranimate Host directive"}