{"refs": ["<41AE0026.1070407@visarc.com> <15651.1101932589@www23.gmx.net>"], "id": "<Pine.SOL.4.58.0412011529240.17389@tetris.gpcc.itd.umich.edu>", "subject": "[Radiance-general] printing floating point images", "email": "stock at umich.edu", "body": "\n\n\nOn Wed, 1 Dec 2004, Lars Grobe wrote:\n\n\nThis is where the Lightjet family of printers is different. They\nupsample the image to ~4000dpi and expose photographic paper with\nlasers. I suppose they use red, green, and blue lasers, but I\nhave no documented proof. I have been very happy with the output.\nIf you managed to make it to SIGGRAPH in the last 3 years, you\nmay have seen these samples of Radiance-rendered work, in\nlarge-format, hanging in the Art Gallery.\n\n\nI find that when I call a professional photo/printing business\nand start talking technical, I get forwarded to the specialist,\nwho takes something of an interest once I mention that I have no\nICC profiles, and my work isn't from a Mac or a PC.  I've learned\nthat (if I set my monitor's gamma to ~2.2) what I see on my\nmonitor looks very much like what gets printed when I dictate\n\"assign no profile\" or \"assign sRGB.\" Maybe the sRGB one looks a\nlittle more \"correct,\" or a little less saturated. I have a hard\ntime telling the difference.\n\n\nAnother bit of advice: learn about the printer that you're using,\nand send it the best possible pixels that you can. Insist that\nthey print at that resolution. Most printers are used to folks\nprinting enlargements of bad photos. It helps to talk to the\nperson who will actually run the machine and explain that there\nis minute detail that is important. For the Lightjet 5000, I\nalways send a 300 dpi file, and I always antialias by pfilt'ing\nmy final rendering down at least 3:1 (sometimes more).\n\nI hope my experiences have helped. It has taken me quite a few\nyears to learn how to \"talk the talk\" and get a good image\nprinted.\n\nMark\n\n", "isquestion": false, "replyTo": "Subject: [Radiance-general] printing floating point images", "tags": [], "sender": "Mark Stock", "datetime": "Wed Dec  1 21:39:47 2004"}