{"body": "\nHi Dan,\n\nI just got back in and see that I missed this so perhaps my reply is too\nlate to be of use. In any event here are a few thoughts.\n\nIf you want to create \"high quality\" renderings then the best thing to\ndo is to obtain some good photographs of these materials. I know that\nthis can be a challenge as it means that you have to be much more\ndemanding with the client in terms of the information that they need to\nprovide, such as access to decent samples, but it can definitely be\nworth it. In my experience the best thing to do is to shoot your own\nphotos of good samples and calibrate with the Macbeth Color Checker (or\nsome other mechanism for calibrating reflectance and color). That way\nyou have control over everything. On the other hand if you could perhaps\nget representative photos from the stone supplier then you could perhaps\nuse these to develop image patterns that can be adjusted to the\nestimated reflectance information that you do have. Note though if you\nwant the rough surface of the materials to cast shadows depending on how\nthe light is hitting the surface (time of day perhaps), then you will\nhave to use actual geometry, which is going to be a lot more complicated.\n\nAgain depending on your rendering/visualization goals and if it just is\nnot possible to get good photos, another approach is to consider what is\nimportant to demonstrate given the possible view(s) that you will be\nshowing. For stone masonry materials the first thing that I always\nconsider is how much variation is there from stone to stone. My guess is\nthe sandstone is supposed to have relatively low variation, whereas the\nbrick seems to have quite a high degree of variation. This kind of\nvariation can be accounted for procedurally with a tiling function that\nvaries the brightness and/or color of the tile (stone unit). Another\nitem to consider at this macro level is the relative reflectance of any\nmortar or joint condition, this again can be treated as part of a\nprocedural tiling function. With these two items accounted for the next\nthing to try to approximate to some level is variation within a given\nstone unit. This is where things get a bit more challenging with the\nmaterials you are looking at. The sandstone can probably be approximated\nwith some variation of noise functions. The brick though demonstrates\nsome pretty sharp cutoffs in variation and color which I am not sure\noffhand how I would treat. Just to get the variation it might be worth\nsearching for imagery online and seeing if there is something that you\ncould use to get the variation.\n\nHope this helps.\n\nRegards,\n\n-Jack de Valpine\n\n--\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n\n\n\nDan Glaser wrote:\n\n", "replyTo": "Subject: [Radiance-general] advice for material modeling", "sender": "Jack de Valpine", "isquestion": false, "tags": [], "id": "<4BD5B9AE.108@visarc.com>", "refs": ["<4BCDF70F.8060506@lightfoundryllc.com>"], "datetime": "Mon Apr 26 09:05:55 2010", "email": "jedev at visarc.com", "subject": "[Radiance-general] advice for material modeling"}