{"body": "\nHi Nick,\n\nSo if I understand correctly, you have blind geometry modeled at different rotations where you then turn on only the rotation that you want to render. If your blinds only run in one direction then you should be able to apply a rotation to the perforated material. If not then Thomas' suggestion of modifying perforate.cal to use UV coordinates is probably the way to go.\n\nFrom an accuracy point of view I am not sure that using perforate.cal to model the holes and spacing is actually going to be accurate from the standpoint of evaluating illuminance as the holes are rather small and will be dependent on image resolution. Thus my suggestion to consider trans or BRTDfunc where measured transmittance can be applied. Perhaps others can jump in and let me know if I am missing something on this.\n\nFrom the standpoint of a luminance simulation, ie a rendering, then if in your views you might actually be close enough to see the holes then using perforate.cal might be nice. But you might want to examine some photos or check out an installation to understand how much of the perforation you actually perceive.\n\n-Jack\n\nSent from my Verizon Wireless Phone\n\n----- Reply message -----\n\nJack,\n\nThank you for the suggestions. The series of blind rotations are modeled separately (so that I can easily add and subtract them for the scene) and I have also modeled a little less than half of the blind to be ready for the perforation material.\n\n\n\nWe would like to match the blinds physically without using a trans material. The project we are working on requires us to match a photo of a space that uses these blinds. We not only want to match the space aesthetically but also have accurate illumination plots and luminance rendering data.\n\nThe perorate.cal looks good when the blinds are in the horizontal (open) position, it is when we render the other angles that the perforations become stretched. I have had success in the past altering the axis that these .cal files use, but when I have the blinds angled between straight up/down and horizontal then I run into the problem.\n\nNick\n\n\n\nSent: Wednesday, April 21, 2010 5:33 PM\nTo: Nick Hubof; 'Radiance general discussion'\n\n\nHi Nick,\n\nIf you are interested in material performance of these blinds, I am not really sure that perforate.cal is what you want use. How are you transforming the geometry of the blinds to get the rotation?\n\nAnother way to do this would be to split your blind geometry in half with an opaque half that use the blind mixfunc and a translucent half built either use some combination of trans and mixfunc definitions or perhaps using a simple form of BRTDfunc to account for front and backside reflectance and material transmittance. If I recall correctly the manufacturer provides some transmittance information...\n\n-Jack\n\nSent from my Verizon Wireless Phone\n\n----- Reply message -----\n\nThank you for the replys. I ended up trying the mixfunc route and that worked well.\n\nSo since you fixed that issue, I have one more issue that I don?t know can be resolved easily.\n\n\n\nThese blinds also have 1/32?  perforated holes spaced about 1/32? apart.\n\nPicture: http://i23.photobucket.com/albums/b354/mrhubof/General/DSC_0103.jpg\n\n\n\nI have tried  the perforate.cal mixfunc, to create this effect, but as I rotate the blinds to simulated them shut or half shut the function doesn?t work, because the blind rotates along the z axis. So what results are elongated holes when the blinds are closed.\n\nvoid mixfunc Perforation_Chrome\n\n6 Chrome void z_hole perforate.cal -s 0.00079375\n\n0\n\n1 0.4\n\nIf any of you have suggestions to get around this issue it would be much appreciated.\n\nThank you again for the help on the previous issue!\n\nNick\n\n\n\n\n\nSent: Wednesday, April 21, 2010 3:35 PM\nTo: Radiance general discussion\n\n\nHi All,\n\nI meant for this to go to the group...\n\n-Jack\n\nSent from my Verizon Wireless Phone\n\n----- Forwarded message -----\n\nHi,\n\nThe following assumes geometry with uniform normal orientation.\n\nvoid plastic concave\n0\n0\n5 .5 .5 .5 0 0\n\nvoid metal convex\n0\n0\n5 .8 .8 .8 .8 0\n\nvoid mixfunc blind\n4 concave convex if(Rdot,1,0) .\n0\n0\n\nThen apply the blind material to your geometry. You will need to correctly define the convex and concave materials for your needs. You will also need to check that's the materials are showing up on the correct sides. One way to do this is to first define the convex and concave materials as red and blue for an easy visual check. If you need to reverse the materials then simply swap the names in the blind material definition.\n\nHope this helps.\n\n-Jack de Valpine\n\nSent from my Verizon Wireless Phone\n\n----- Reply message -----\n\nI am modeling a large amount of physical blinds in an office scene. I am\nreplicating a Warema blind that has an opaque surface (grey) on the convex\nside and a chrome surface (93% reflective) on the concave side. To minimize\nthe amount of geometry I was hoping there is an easy way to apply two\nmaterials to the curved plane instead of adding a thickness and more than\ndouble the geometry.\n\nI have searched the knowledge database and could not find what I was looking\nfor. I hope there is an easy way to do this.\n\nFor instance the surface normal is the chrome material and the opposite side\nis the opaque material.\n\nThank you in advance.\n\nNick\n\n\n\n\n\n\n\n\n\n\n\n-------------- next part --------------\nAn HTML attachment was scrubbed...\nURL: http://radiance-online.org/pipermail/radiance-general/attachments/20100422/77039bf3/attachment.htm\n", "replyTo": "", "sender": "nhubof@gmail.com", "isquestion": true, "tags": [], "id": "<0M093M-1NHYTe0IIe-00uuOS@mrelay.perfora.net>", "refs": [], "datetime": "Wed, Apr 21, 2010 12:23 PM", "email": "\"Nick Hubof\"", "subject": "[Radiance-general] two sided surfaceTo: <radiance-general@radiance-online.org>"}