{"body": "\nHi Everyone,\nI am trying to model reddish \"sandstone\" as well as a brick called\n\"Navajo Gold.\"  The red sandstone has uneven, broken \"layers\" with\nlittle bumps on its surface.  The Navajo Gold brick varies in color, has\ntiny holes pocketing its surface, and also may not be flat.\nHere is a link to an image of the sandstone:\n\nhttp://www.lightfoundryllc.com/materials/sandstone.jpg\n\nAnd a few links to images of the Navajo gold:\n\nhttp://www.lightfoundryllc.com/materials/ng0.jpg\nhttp://www.lightfoundryllc.com/materials/ng1.jpg\nhttp://www.lightfoundryllc.com/materials/ng2.jpg\nhttp://www.lightfoundryllc.com/materials/ng3.jpg\nhttp://www.lightfoundryllc.com/materials/ngside.jpg\n\nUnfortunately I do not have direct access to the materials, but\nsomeone has measured their general reflectance values.\nI would like to create a high quality rendering of an interior curved\nwall made with red sandstone.  We are designing skylights for accenting\nthis wall for people outside to see (they would look through a glass\ncurtain wall to see it).  Ideally we would like to see little shadows on\nthe surface of the red sandstone due to its uneven layering and some\nother effects due to its texture.\nIt would also be nice to have a good rendering of the Navajo Gold\nbrick walls, but this is less of a priority.\nCan anyone give any advice for how to model the pattern/textures/etc.\nfor this or have pointers to success stories for these types of materials?\nThanks!\n\n- Dan\n\n\n--\nLF logo \tDaniel C. Glaser, PhD, LEED AP\nPrincipal\nLight Foundry, LLC\nT: 510.387.8890 | F: 315.410.2617\nwww.lightfoundryllc.com <http://www.lightfoundryllc.com>\n\n-------------- next part --------------\nSkipped content of type multipart/related\n", "replyTo": "", "sender": "Dan Glaser", "isquestion": true, "tags": [], "id": "<4BCDF70F.8060506@lightfoundryllc.com>", "refs": [], "datetime": "Tue Apr 20 11:48:39 2010", "email": "daniel at lightfoundryllc.com", "subject": "[Radiance-general] advice for material modeling"}