{"body": "Hi Iebele,\n\n\nJust so this answer doesn't get lost like Francesco's, I'm taking us back online to discuss this.  Thanks for sharing your model and results.\n\n\nThe problem occurs because of a hack I introduced into the glass material type, about which I had completely forgotten.  It was my answer to the question, \"Should a texture applied to an infinitely thin layer of glass perturb transmitted rays?\"  I decided it should, because in most cases, a texture is applied to introduce some effect to the surface.  \n\n\nThe problem here is that the texture is being applied to correct the effects of triangulation, thus smoothing rather than roughening the surface.  Without a texture, the transmitted component would be unaffected, but the reflected component would show your model's tessellation.  There are three possible solutions.\n\n\nThe first possible solution is to give your car windows real thickness and use a dielectric material rather than glass.  You would need to be careful that your surface normals were directed outwards for the outer layer and inwards for the inner layer.\n\n\nThe second possible solution is to turn off surface normal smooth just for the window layer.  This will as I said show up the tessellation of your reflections, but it would fix the transmission.\n\n\nThe third possible solution is to re-hack the source file rt/glass.c.  At line 114, simplify:\n\n\n\t\t\tif (!(r->crtype & SHADOW) && hastexture) {\n\t\t\t\tVSUM(p.rdir, r->rdir, r->pert, 2.*(1.-rindex));\n\t\t\t\tif (normalize(p.rdir) == 0.0) {\n\t\t\t\t\tobjerror(m, WARNING, \"bad perturbation\");\n\t\t\t\t\tVCOPY(p.rdir, r->rdir);\n\t\t\t\t}\n\t\t\t} else {\n\t\t\t\tVCOPY(p.rdir, r->rdir);\n\t\t\t\ttranstest = 2;\n\t\t\t}\n\n\nto read:\n\n\n\t\t\tVCOPY(p.rdir, r->rdir);\n\t\t\ttranstest = 2;\n\n\nThis should fix the problem without having to change your model.  Of course, the problem will come back the next time you update Radiance, unless folks convince me that my hack was ill-conceived to begin with.  I'm open to the possibility.\n\n\nCheers,\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2012-February/008339.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "February 02, 2012 at 07:34PM", "created_by": "Greg_Ward", "parent_id": "radiance-general_008337", "id": "radiance-general_008339"}