{"body": "On Wed, Dec 16, 2009 at 9:57 AM, Victor Li <victorpermanent at gmail.com> wrote:\n> Actually i just export the model from ECOTECT to RADIANCE, and i chang some\n> parameters and run the simulation manually like Marija has shown above.\n>\n> The first time i calculated the daylgith factor in a grid\n> I run it by define: gensky 12 21 12.00 -c -a 31.400 -o -121.400 -m -120.000\n> -B 0.558659,\n> -B 0.558659 means the diffuse horizontal illuminance is 100lux outside then\n> the internal illuminance is the dylight factor.\n\n\nIn principle that is correct. But other options in your rtrace command\nintroduce a rather high inaccuracy and some additional light which\nwill have a bigger effect on the results if you use an illuminance of\nonly 100 lux. If you use 10000 lux and devide by 100 you reduce\nsome of these effects.\n\n\n> The second time i just calculated the internal illuminance in a grid under\n> overcast sky in the same time as the first time. I defined the sky : gensky\n> 12 21 12.00 -c -a 31.400 -o -121.400 -m -120.000\n>\n> In the grid, i can calculate the external diffuse horizontal illuminance at\n> that time under overcast sky in the same point by  the external diffuse\n> horizontal illuminance = the internal illuminance/ daylight factor.\n> However, i calculated the the external diffuse horizontal illuminance by\n> different points the results are different. Actually the results should be\n> the same because it the external diffuse horizontal illuminance. So why is\n> it different?\n\n\nRadiance has some built-in randomisation. Therefore the result of\ntwo identical calculations will be slightly different. Learning to choose\nthe correct options to minimise this difference is one of the challanges\nof Radiance.\n\n\nIn your example I assume that the first set of daylight factors is rather\ninaccurate. You now multiply this error by your internal illuminances\n(which might be inaccurate, too). If your daylight factor is off by 1%\nthis can easily result in a difference of a few hundret lux.\n\n\nIt would realy help us if you could mention the actual results\nof your calculations in your emails. Then we could see if the\nerrors are within the expected margin of your settings.\n\n\nYou should try your calculations with modified parameters\nas suggested and with an increased sky illuminance to see\nif your errors are still the same.\n\n\nRegards,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-December/006413.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "December 16, 2009 at 05:09AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_006381", "id": "radiance-general_006413"}