{"body": "On Aug 7, 2006, at 2:58 PM, Kirk Thibault wrote:\n\n\n> How was it?\n>\n> -------------\n\n\nHi Kirk,\n\n\nI personally thought it was huge, fun, interesting and exhausting all  \na the same time. Pretty much par for the course at SIGGRAPH...\n\n\nThe full-day HDRI session on Sunday was really packed (despite being 8 \n+ hours) and had some interesting presentations of opinions, research  \nand (games) industry uses, and the birds-of-a-feather was also well  \nattended. I never got my press-pass for the conference (they've upped  \nthe requirements for what is \"press\"), so I was prevented from taking  \nphotos during the sessions and at the show floor... I did get some  \nHDR shots around Boston, and I can post a link to those soon.\n\n\nSome of the highlights of the conference (for me, a non-researcher)  \nwere:\n\n\n- Finally got to meet Greg Ward in person, but he was always too  \nswamped with groupies to have a real conversation with. ;-)\n\n\n- Streaming HDR video (using the new MPEG-HDR codec) shown on the  \nBrightside monitors!\n\n\n- Well, actually seeing any HDR image on the Brightside monitors was  \njust too cool for words. Helge thinks something similar will be mass- \nmarket available in just 2 years thanks to display industry trends!\n\n\n- Erum Khan's presentation on Image-based Material Editing (on HDR  \nimages):\nhttp://graphics.cs.ucf.edu/ekhan/project_ibme.htm\n\n\n- I had a great opportunity to talk to Erik Reinhard about (among  \nother things) what passes for \"HDR\" and tonemapping on Flickr (and  \nthat NYTimes article highlights this as well).\n\n\n- The realization that lots of interested and talented people have  \n\"heard of\" HDRI, but there really isn't a central gathering/ rallying  \npoint for people bridging the gap between research and commercial  \nimplementations.\n\n\n- To this end, I talked to 5 vendors of photographic hardware and  \nsoftware to actively encourage them to add HDR capture/ input support  \nto their imaging products. (Again, they've heard of it, but didn't  \nknow all of the immediately marketable uses and sales angles.)\n\n\n\n\nNaturally, this is only what one guy saw while wandering from Sunday  \nto Wednesday. I never did meet up with Jack or Mark from this list,  \nbut I'm sure they were at some of the same sessions.\n\n\n-Mark\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2006-August/000118.html).</sup>", "attachments": [], "created_by_name": "Mark Banas", "created_at": "August 07, 2006 at 10:23PM", "created_by": "Mark_Banas", "parent_id": "hdri_000110", "id": "hdri_000118"}