{"body": "Hi Stephen,\n\n\nThe simplest method is to use rsensor to generate a set of uniformly distributed rays over the hemisphere, which you can re-use as often as you like.  The sensor file below specifies a uniform distribution out to 90°, and even samples a few rays below the horizon  Let's call it \"uniform.dat\":\n\n\ndegrees\t0\t90\t180\t270\n0\t1\t1\t1\t1\n5\t1\t1\t1\t1\n85\t1\t1\t1\t1\n90\t1\t1\t1\t1\n95\t0\t0\t0\t0\n\n\nYou can run rsensor on the above file and either use it to call rtrace, or since you seem to want to call rtrace yourself, create instead a set of sample rays:\n\n\n\trsensor -h -rd 100000 -vp 0 0 0 -vd 0 0 1 -vu 0 1 0 uniform.dat > uniform_znorm_samp.txt\n\n\nYou can then give this as input to rtrace with whatever model you like:\n\n\n\trtrace -h [options] octree < uniform_znorm_samp.txt | total -m\n\n\nI've passed the output to total with the -m option, assuming you just want the average result.  If you're willing to call rsensor in place of rtrace, you can shorten the calculation time with:\n\n\n\trsensor -rd 100000 -vp 0 0 0 -vd 0 0 1 -vu 0 1 0 uniform.dat [rtrace options] octree\n\n\nThis has the added advantage of sampling light sources directly (unless you set -dn 0), and it even supports the -n multiprocessing option on Unix.  You will need to divide the result by the hemispherical solid angle (2π), or else change all your sensor file values by 1/(2π) to get a uniform average.\n\n\nI did spent quite a bit of time writing and debugging rsensor for just this sort of thing, so you may as well use it.  (Thanks to Zack Rogers for specifying the problem and funding the initial work, and to David Geisler-Moroder for doggedly testing the code & helping me sort out its many issues.)\n\n\nCheers,\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2017-June/012155.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "June 29, 2017 at 07:20PM", "created_by": "Greg_Ward", "parent_id": "radiance-general_012154", "id": "radiance-general_012155"}