{"body": "Hi Jack,\n\n\nI have not (yet) embarked on the use of a digital camera for calibration \npurposes, but I imagine that you also have to figure out the sensitivity \nof your sensors in the camera, as they will determine your 'signal', \ni.e. picture,  let alone that exposure etc. will also affect it. \nActually, it sounds quite complicated in contrast to using a spectro.\n\n\nI agree that as long as you measure a macbethcolour checker card and \nyour data sample under the same illumination, you could go ahead.The \nroutine described in the book relies heavily on macbethcal (about \nneither you nor me have an idea how it works) and also points out its \nlimitation (the word 'approximation' is used). Also, nobody could \nexplain to me what magic things 'pcond' does, so I rather do not use it \n(the word 'mimick' appears rather often in the man pages). Human visual \nperception cannot be accounted for by a magic RADIANCE function. If it \nwould, then why are several hundred scientists world-wide still studying \nit? I agree, that the results of RADIANCE are visually appealing and \nthat the physics are simulated quite well, but only if you input \naccurate data your results will be accurate.\n\n\nCheers,\nAlexa\n\n\n\n\nJack de Valpine wrote:\n\n\n> Hi Alexa,\n> \n> Just a minor comment here. I have no doubt that the using a more \n> sophisticated measuring device will yield more accurate results. \n> However, I believe the method of using the machbethcolor checker card as \n> described in Rendering with Radiance is designed to calibrate to the \n> current lighting conditions, that is, assuming the use of a digital \n> camera, if we want to sample a particular material in a give lighting \n> condition, then we also sample the color checker chart under the same \n> conditions with the same sampling device (digital camera) and then \n> perform the calibration with macbethcal and pcomb. I do not know the \n> underlying method that Greg put together to do the calibration, so I am \n> not sure how he has accounted for varying light conditions vis a vis the \n> internal dataset that Radiance uses as part of the calibration mechanism.\n> \n> -Jack de Valpine\n> \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nDr. Alexa I. Ruppertsberg\nDepartment of Optometry\nUniversity of Bradford\nBradford\nBD7 1DP\nUK\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-May/001685.html).</sup>", "attachments": [], "created_by_name": "Alexa I. Ruppertsberg", "created_at": "May 12, 2004 at 03:55PM", "created_by": "Alexa_I._Ruppertsberg", "parent_id": "radiance-general_001679", "id": "radiance-general_001685"}