{"body": "On Wednesday, September 24, 2003, at 09:55 AM, Alex Summerfield wrote:\n> btw Rob, (after a long break away) back to that earlier problem of the \n> art gallery: I know this is contrary to most of the advise - but you \n> know i still think it worthwhile in principle to render it using brute \n> force -  ie without illums on the coffering (i think that was Martin's \n> original suggestion). The coffering detail doesn't look complicated \n> enough to have really caused Radiance probs - and there are enough \n> apertures in the space that it seems like they should have been picked \n> up by a reasonable setting for -ad & -as and provide a well behaved \n> indirect lighting distribution.\n\n\nI am sure the folks here in Berkeley with me right now are all grinning \nin bemused enlightenment.  The -ad parameter has taken on a very clear \nmeaning to us now, following some excellent discussion and \npresentations by John Mardaljavec.  I'll have to look at those settings \nagain when I get home; maybe the -ad was pretty low.  However, I must \nsay, mkillum is a great tool and I believe that it should be used when \nappropriate, and this is certainly a good use for it (I'm actually \nusing far less light sources now, because of this technique; I'm \ngetting excellent results in far less time!)  I will certainly have a \nlook at the -ad in my earlier explorations of this scene regardless, \nI'm very curious to see if I can affect some positive change on the \nnon-illum version of the scene.\n\n\n> And i'd agree with Martin again in that it's good to move away from \n> relying on RAD - far better to get to grips directly with specifying \n> rpict parameters. I find that once settled on generally appropriate \n> params for buildings (accounting for model size in -ar and -aa) - \n> usually switching between high/low quality, slow/fast rendering can be \n> controlled enough just via -ab and image size and then -ad -as.\n\n\nLet's put it this way: I use rad to get started, but I tweak from \nthere.  The more I learn about the -d* and -a* settings of rpict, the \nmore I will  rely on manual tweaking. To be clear, I am not simply \nsetting rad and hoping for the best (well, actually that's true, and \nthen when the best does not happen, I start adding render= lines!).  \nrad, like mkillum, are both excellent tools that work too well to be \nignored, at least for this novice user.  I agree, the \"under the hood\" \naspects of rtrace need to be understood, but I still like to use rad to \nat least steer me to a ballpark setting.  This art gallery exploration \nhas been useful for me to learn both mkillum and the -a* parameters.  \nThe more of these that happen, I'm sure the more I will understand, and \nthus, the less I will rely on rad.  But I honestly don't think I will \never totally abandon it, at least for general stuff.\n\n\nThe fact that you have taken the time to follow-up with me is \nindicative of the extremely generous nature of the majority of this \nlist membership, and all week here at the Workshop that same spirit -- \nthat same bubbling enthusiasm -- has been flowing through buildings 90 \nand 70A at LBNL.  I wish you could be here!\n\n\nRob Guglielmetti\nrpg@rumblestrip.org\nwww.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-September/000993.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "September 24, 2003 at 11:12PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_000988", "id": "radiance-general_000993"}