{"body": "Jeffrey McGrew wrote:\n\n\n> I have done this for installing Radiance on Cygwin under Windows 2K\n> & for Mandrake Linux. More because I wanted to remember how I got\n> them working, so once I did, I wrote out a little how-to.\n\n\nIs this accessible online someplace?\n\n\n> And I don't know about OS X; but will be jumping ship to it within\n> next year (gonna buy my friend's used G4 when he gets his G5). \n\n\nYou will like it.  Your friend will like his G5 even more, it seems.\n\n\nBut\n> one thing that's a pain when installing Radiance, and a major point\n> of my confusion when I first started using it, is that the command\n> 'rview' is already used on some systems to call upon the VI editor,\n> rather than the Radiance command. \n\n\nAck!  you're right, and I had meant to post something about that months \nago when I (re)discovered that.  I originally came across that problem \nway back in 1996, when I first installed & compiled Radiance on an old \nPII/266.  I thought - get this - that something went wrong during the \ncompile, and that was why vi was loading instead of rview, that somehow \nthe compile process grabbed bits of vi's source when compiling Radiance. \n  What the hell did (do) I know?  It was but one of many false starts in \nmy Radiance explorations.\n\n\n> This was true in both the full install of Cygwin & Mandrake. So\n> since 10.3 also uses the Bash shell, it could be possible that\n> it's the same for 10.3 as well. Just a word of warning.\n\n\nIt's got nothing to do with the shell, the problem is that if you blow \noff the default location and install the Radiance binaries someplace \nother than /usr/local/bin, even if you place your new location on the \nRAYPATH & PATH, it's likely to be lower in priority than the location of \nthe symbolic link to vim that seems to be present on a LOT of the \ncurrent Linux distros.\n\n\nKudos for pointing that out to the list, Jeffrey.  I guess most people \njust accept the default location for the Radiance binaries so they never \nsee this problem.  Do a \"locate rview\" on your systems though; lots of \nyou will probably see a link in /bin, linking rview to vi...\n\n\nGreg, maybe a little warning could be added to the install script?\n\n\n\n\n\n\n      Rob Guglielmetti\n\n\ne. rpg@rumblestrip.org\nw. www.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-November/001233.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "November 24, 2003 at 01:03PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_001227", "id": "radiance-general_001233"}