{"body": "In the immediate transition from bright sunlight to an inside location\nI can agree it initially looks way dark.\n\n\nBut pupils dilate.\n\n\nShouldn't there be a hack on the final brightness to simulate the stable\npost-transition *apparent* brightness of the inside room?\n\n\nI mean, am I alone in initially thinking a 60 watt reading light is dim\nbut inside 5 minutes, its way bright?\n\n\nSure, some radiance users want to know what a light meter tells them. But\nother radiance people want to know what a person will SEE.\n\n\ncheers\n\t-George\n\n\n> judy lai wrote:\n> \n> > hi,\n> >\n> > I hope this isn't a stupid question..\n> > I have a room with transluscent skylights.\n> > When I simulated the room with clear sunny sky, the illuminance values\n> > inside the room were reasonable and expected, around 400 Lux.\n> > When I simulated a cloudy sky or a intermediate sky without a sun, the\n> > illuminance values inside the room were way too low, <30 Lux.\n> > Why is this?  I usually use sunny sky and so never came across this\n> > problem before.\n> >\n> > Thus far I have changed the skylight material around several times to mak\ne\n> > sure that I didn't create a really bad example of a trans, I am running\n> > mkillum and surface normals are correct, and I have also increased the\n> > rendering quality (to see if more light can be found) but nothing is work\ning.\n> \n> Hi Judy,\n> \n> are those skylights the only windows in the room? Did the sun\n> actually hit the trans surfaces? In that case, what you're seeing\n> might be the expected result, even if you didn't expect it... ;)\n> \n> The typical irradiance caused by direct solar impact is\n> approximately ten times that of the completely unobstructed\n> diffuse sky, under most conditions during the day. If you have\n> any area of the sky obstructed by other building parts from the\n> view of the skylights, that do not also obstruct the sun, then a\n> relation of 400 to 30 sounds perfectly reasonable. Or do you have\n> any more specific reasons to assume that the results for the\n> cloudy sky should be higher?\n> \n> \n> -schorsch\n> \n> -- \n> Georg Mischler  --  simulations developer  --  schorsch at schorsch.com\n> +schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n> \n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general@radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n> \n\n\nGeorge Michaelson       |  APNIC\nEmail: ggm@apnic.net    |  PO Box 2131 Milton QLD 4064\nPhone: +61 7 3367 0490  |  Australia\n  Fax: +61 7 3367 0482  |  http://www.apnic.net\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2001-December/000079.html).</sup>", "attachments": [], "created_by_name": "George Michaelson", "created_at": "December 11, 2001 at 05:28PM", "created_by": "George_Michaelson", "parent_id": "radiance-general_000077", "id": "radiance-general_000079"}