{"body": "On Mon, 28 Aug 2017 05:10:19 +0200, Randolph M. Fritz <rmfritz3 at gmail.com>  \nwrote:\n\n\n> Glassner’s *Principles of Digital Image Synthesis*. (2 vols. San\n> Francisco, CA: Morgann Kaufmann Publishers, Inc., 1995) is the\n> reference I used, back when; anyone know if there has been a\n> subsequent book which covers the same ground? The physics, I would\n> say, is basically simple, *but* presents computational problems which\n> remain difficult, even with modern computing hardware.\n\n\nI second the recommendation for Glassner's comprehensive 2-volume  \nreference, and I consider most of it still relevant, though it of course  \ndoesn't cover the newer sampling algorithms like Vertex Connection &  \nMerging and Markov Chain Monte Carlo (Metropolis and derivatives), but  \nthese are absent in RADIANCE anyway.\n\n\nI'd also like to point out Philip Dutré's excellent Global Illumination  \nCompendium (https://people.cs.kuleuven.be/~philip.dutre/GI/). This is a  \nhighly condensed formulaic summary of a lot of what goes in RADIANCE (and  \nother GI software). It does assume a strong background in mathematics,  \nhowever. It's an absolute must-have for developers, and was always on my  \ndesk when I developed the initial photon mapping release. If you ever  \nwondered how radiance handles hemispherical geometry in its sampling  \nroutines, for instance, this document will explain it in probably more  \ndetail than you care to know. ;^)\n\n\nThe \"Advanced Global Illumination\" book referred to in the above link is  \nworth a look too; it's a more general overview of GI techniques and more  \nrecent than Glassner's reference, though I personally find it lacking in  \ndetail compared to the latter. As an overview, it does the job, tho.\n\n\n\"Physically Based Rendering\" by Pharr, Jakob, and Humphreys  \n(http://www.pbrt.org/) is the most up-to-date of these references, and  \ndescribes advanced raytracing algorithms as implemented in PBRT, an  \nopen-source raytracer with functionality similar to RADIANCE, albeit for  \nmore general rendering using newer algorithms. This is a hands-on book  \nthat places less emphasis on the maths and more on the implementation.\n\n\nHope this helps; best regards,\n\n\n--Roland\n\n\n\n\n\n\nLucerne University of Applied Sciences and Arts\nSchool of Engineering and Architecture\n\n\nInstitute of Civil Engineering\nCC Building Envelopes\nDr. Roland Schregle\nSenior Research Associate\n\n\nT direct: +41 41 349 36 26\nroland.schregle at hslu.ch\n\n\nTechnikumstrasse 21, CH-6048 Horw\nT +41 41 349 33 11, F +41 41 349 39 60\nwww.hslu.ch/ccease\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2017-August/012245.html).</sup>", "attachments": [], "created_by_name": "Roland Schregle", "created_at": "August 28, 2017 at 06:52AM", "created_by": "Roland_Schregle", "parent_id": "radiance-general_012242", "id": "radiance-general_012245"}