{"body": "Hi Marcus,\n\n\nWelcome to the wonderful, confusing world of \"trans\".\n\n\nI don't know of any good way to measure oddly-shaped translucent  \nmaterials.  Perhaps others on the list will have suggestions for  \nthat....\n\n\n> I have some additional questions concerning the trans material  \n> type. In a Radiance reference manual, it is stated:\n>\n> \"Trans is a translucent material, similar to plastic. The  \n> transmissivity is the fraction of penetrating\n> light that travels all the way through the material. The  \n> transmitted specular component is the fraction of transmitted light  \n> that is not diffusely scattered. Transmitted and diffusely  \n> reflected light is modified by the material color. Translucent  \n> objects are infinitely thin.\"\n>\n> First, should the transmissivity + transmitted specular component =  \n> 1 in order for the material to be physically correct? Also, since  \n> the transmitted specular component is the fraction of transmitted  \n> light that is not diffusely scattered, does this mean that this is  \n> apart of the direct calculation or is this too apart of the  \n> indirect calculation.\n\n\nThe reason the trans parameters are so peculiar is so their valid  \nrange is easy to understand -- between 0 and 1 for everything except  \nroughness.  (For physical value ranges, you may also consult the file  \n\"ray/doc/notes/materials\".)  Pages 325 and 326 from Chas' chapter in  \n\"Rendering with Radiance\" are also invaluable.  There have been a  \nnumber of threads on trans over the years, and this is definitely one  \nfor the Radiance FAQ, should it ever materialize -- no pun intended.\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-June/003744.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "June 02, 2006 at 11:15PM", "created_by": "Greg_Ward", "parent_id": "radiance-general_003743", "id": "radiance-general_003744"}