{"body": "On Thursday, May 29, 2003, at 10:40 PM, Marcus Jacobs wrote:\n> I am in the evaluation phase in my quest to purchase a new computer.  \n> From what I have been told, the Motorola G4 processor is far superior  \n> in scientific calculations as compared to x-86 based processors (i.e.  \n> Intel/AMD).\n\n\nI was told similar, on this list in fact.  But the thing is, while that  \nmay be true in theory, the bang for the buck king of the hill is still  \nover at AMD.  Here is my very unscientific and newbie-esque story:  I  \nlearned about the wonders of  OS X thru Greg Ward; I had plunked my  \nhead in the Intel/Lightscape sand for years.  But after talking to him  \nabout OS X I learned that it was a user friendly UNIX, and that is what  \nappealed to me the most, not any theoretical pipeline/gigaflop  \nsuperiority.  I bought a G4 PowerBook over a year ago, and was thrilled  \nwith the performance, but I was still learning, loading pretty small  \nmodels.\n\n\nBack in October of last year, I started using Radiance in production,  \nand saw that the time was near that I would need to have a dedicated  \nmachine to run Radiance calcs, so I loaded RHL on an old Pentium 450 we  \nhad lying around.  The calc times on that were about the same as the  \ntimes on my PowerBook, which is a G4 550 with 512MB of RAM.  I was told  \nthere was probably something wrong with my hardware (stop laughing at  \nthe double-entendre), but a trip to Mark Stock's Radiance timings  \nwebpage (http://mark.technolope.org/pages/rad_bench.html) will tell a  \nsimilar tale.  The simple fact of the matter is that you can buy more  \nRadiance-photon-number-crunching-per-dollar/euro/drachma/sheckel-what- \nhave-you with homebuilt PCs than you can with Apple's hardware.  That's  \nnot to say that Macs are crap.  I love my Mac.  But where speed is  \nking, in floating point land, I have experienced better calc-per-dollar  \nin the AMD world than that of Apple.\n\n\n> If it weren't for the existing investment that I have in PC based  \n> software (particularly software that utilizes a dongle which will not  \n> work on a Mac even with virtual PC)...\n\n\nVirtually Useless PC should be banned.  It is too slow to run Notepad  \nefficiently, much less anything actual humans need to use to get some  \nwork done.\n\n\n>  I would probably purchase one. But because of the existing investment  \n> that I do have in PC based software, I am trying to do a cost versus  \n> benifit analysis for purchasing a Mac. Has anyone here been able to do  \n> a rough estimate as to the decrease in rendering time when using a Mac  \n> as compared to x-86 based processors. I was considering in lieu of  \n> purchasing a Mac, I would purchase a dual Pentium 4 Zeon and compile  \n> it on Linux. If I am correct, the GNU C compiler has a SSE2  \n> optimization option.\n\n\nI would think the Zeon would outperform the G4, dollar for dollar.  But  \nI'd bet AMD can do even better.\n\n\n> Also I have l have looked at puchasing a AMDs 64 bit Opteron based  \n> workstation. I do believe there can be some performance gains achieved  \n> if it can be used in conjunction with a 64 bit Operating System.  \n> Anyway, you all can see that i am very confused as to which direction  \n> I should take so any advice is very much appreciated.\n\n\nNow here is a new horizon that I too am very interested in.  I read  \nwith delight the tales of joy surrounding the release of the Opteron.   \nSuSE already has a 64 bit version of Linux, and I for one am unclear on  \nwhat that means for us Radiance people.  I'd love to hear some insight  \nabout what the 64-bit movement means in terms of performance for the  \ntypical rpict process. =8-)\n\n\nRob Guglielmetti\nrpg@rumblestrip.org\nwww.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000812.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "May 29, 2003 at 11:41PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_000813", "id": "radiance-general_000812"}