{"body": "Jeffrey McGrew wrote:\n> And actually, I've got a secret plan to make better and more\n> widespread use of it where I work (Gensler).\n\n\nSame thing here, though I my company _wants_ to use Radiance.\nI just have to sort out the workflow first.\n\n\n> 1. Revit likes to model glass as a solid plate, not a flat surface. So a\n> bit of glass is a rectangular solid, not a flat plane. So when I try to\n> make the windows into Illum's so that they spread light into the room,\n> I'm getting errors and problems because I think it's looking for a flat\n> plane with the normal pointing into the building. How important is it to\n> have the Windows be a lightsource for interior renderings?\n\n\nI think your looking for high quality renderings of the interior, so\nyou definitely want to use mkillum to restrict your scene to the interior.\nIf it's just a crude rendering I'd create a sky and wouldn't bother\nmuch about the windows as light source.\n\n\n> Is there some\n> way, via Mkillum or something, that I could quickly work around this\n> issue? I can flatten the glass in Max, but that's an extra step and one\n> that seems to also cause issues with zero-area light surfaces.\n\n\nYou could write a script to delete polygons with material glass based\non their area (reduce 6 sides to 2) and vicinity to already checked\npolygons (reduce 2 to one) but that's not going to be easy. You might\nbe able to edit the windows in MAX to get a Radiance friendly geometry. \n\n\n> 2. When I export out of Max, I get a .OBJ and a corresponding .MTL\n> materials file. I currently use Grep and such to pull out all the\n> material definition names out of the RAD file I get from OBJ2RAD, and\n> then creating the .MAT radiance material file by hand. I'd love to hear\n> a way to take the exported .MTL file and turn it into a starting point\n> for my .MAT (short of having to write my own tool to do so...).\n\n\nPlease see the man page for obj2rad. The top section describes\nmaterial mapping based on the context (or material) of the face\nin the obj file. If you use the same set of materials in all your\nmodels you could create a material library and a corresponding\nmapping file. Obj2rad then assigns the correct Radiance material\nname (as far as I understand this point, never used it much).\n\n\n> Now, we're just designers, and looking for design feedback not hard\n> numbers. We'd be happy with something somewhat-accurate, for if/when we\n> need 'real numbers' we'll typically turn to a lighting designer who know\n> how to generate accurate numbers.\n\n\nYou're welcome! If you can provide Radiance geometry we might\noffer a discount ... ;)\n\n\n\n\nThomas\n\n\n***********************************************************************************\nThis e-mail, (and any attachments) is confidential and may be privileged.  It may be read, copied and used by the intended addressee only.  If you have received this in error please contact BDP immediately. \n\n\nIf you have any queries, please contact the sender.\n***********************************************************************************\nBuilding Design Partnership\nRegistered in England No 2207415:\nRegistered Office: Building Design Partnership Ltd, Sunlight House, PO Box 85, Quay Street, Manchester, M60 3JA, http://www.bdp.co.uk\n***********************************************************************************\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-May/003661.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "May 11, 2006 at 10:11AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_003659", "id": "radiance-general_003661"}