{"body": "THanks again for the advice.  Replies to the replies below:\n\n\nOn 22 May 2002, at 22:33, Roland Schregle wrote:\n> For your single measurement you'd use:\n> \n> echo 60 60 30 0 0 1 | rtrace -h -I scene.oct\n> \n> Ain't UNIX fun? :^)\n\n\nIt's getting more fun all the time, as I move out of the \n\"complete idiot\" category and into the \"pathetic novice\" \ncategory, unix-wise.  Greg's tip about OSX and his pre-\ncompiled binaries have really helped me get up & running \non a unix-based Radiance learning trip, and this list is \nnow helping too.  I appreciate it. \n\n\nOn 23 May 2002, at 8:31, Phillip Greenup wrote:\n\n\n> Do you have rillum?  if you have rillum, it makes this\n> process somewhat easier.\n> \n> 1. create an input file with a pile of measuring points and\n> positions, similar to your 60 60 30 0 0 1.  cnt and rcalc\n> can help in the creation of this file, but it can also be\n> done in any text editor, or spreadsheet and exported as an\n> ascii file.  use one line per measuring point. 2. rillum\n> [rtrace options] octree < infile > outfile\n\n\nWell, that sounds like a useful little program.  I don't have \nthis.  Where do I get it??  I am using pre-compiled \nbinaries for OS X, created by Greg Ward.  Most of the \nother stuff is there, but not glrad or this rillum.  \n\n\nI'd compile the source myself, but I get errors all the time, \nboth on OSX and Linux. (Yes, I installed Yellow Dog Linux \n2.2 on my Powerbook.  I couldn't help myself.)  And at the \nmoment I'm far more interested in using Radiance than \nadministering a unix system, so I guess I'm cheating a bit \nby using precompiled binaries.  =8-)\n\n\n> the output file then contains a column of illuminances\n> corresponding to the measuring points and orientations\n> defined in the input file.  if you wish, you can then use\n> lam to put the input and output files together in a table.\n\n\nOn 22 May 2002, at 14:21, Greg Ward wrote:\n> a better example for a grid\n> of 15 by 30 points spread in a 10x20 room and 2.5 feet \noff\n> the floor with a half foot margin on each side would be:\n> \n> % cnt 15 30 | rcalc -e\n> '$1=(10-.5)/(15-1)*$1;$2=(20-.5)/(30-1);$3=2.5' \\\n>  -e '$4=0;$5=0;$6=1' | rtrace -I -h [options] octree \\\n>  | rcalc -e '$1=179*(.265*$1+.670*$2+.065*$3)' > \noutput.dat\n\n\nThanks Greg.  Since I don't have rillum (yet) this works \nwell.  I typed this up in a text file, and did a chmod 755 on \nit, so I can call that whole mess with one filename.  \n(Roland- fun with unix! ;-)) However, my problem now is \nthat it recorded values of zero!  The scene is not dark.  I \ndouble checked the inputs.  It's still zero.  My room is \n12'x14', but I'm working in inch units, so my code went \nlike this:\n\n\ncnt 15 30 | rcalc -e \n$1=(144-6)/(15-1)*$1;$2=(168-6)/(30-1);$3=30' \\\n-e '$4=0;$5=0;$6=1' | rtrace -I -h [options] octree \\\n  | rcalc -e '$1=179*(.265*$1+.670*$2+.065*$3)' > \noutput.dat\n\n\n(note: the first two lines above are on one line in the \ncommand file.  Damn emailer.)\n\n\nThis should place a grid of \"light meters\" facing up, 2'6\" \noff the floor, right?  Why is my scene illuminance reading \nzero??  It's a daylit space!  When I load a pic into ximage \nand pick a point & press return, I get radiance values of \n.298, .428, on the floor.  Hmmm...\n\n\nAlso, I'm wondering how rtrace gets its information, since \nit's working with an octree, not a pic file.  I don't \nunderstand how it can compute irradiance so fast unless \nit somehow works with a pic file and/or the cached \nambient file.  Along those lines, if you want accurate \nvalues for a room, and only have generated a pic of, say, \nthe north elevation, how accurate are the vertical \nilluminance values on the south elevation?  \n\n\n\n\n Rob Guglielmetti <rpg777@earthlink.net>\n    http://home.earthlink.net/~rpg777\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-May/000261.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "May 23, 2002 at 11:35AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_000258", "id": "radiance-general_000261"}