{"body": "Rob Guglielmetti wrote:\n> Ugh.  Yeah, programs like Revit and 3DS, et al. make glazing planes as \n> 3D objects with six polygons.  No good.  Your errors and problems are \n> definitely related to this.  mkillum expects a single polygon, looking \n> in.\nOK, that's what I thought. I'm not using Mkillum yet, just trying to \nmake the windows into a Illum source with Skyfunc and not having much luck.\n> Not sure how you're flattening the planes, but I'll bet you're still \n> ending up with a pair of triangular polys representing the glass \n> plane, and who the hell knows which way they're facing.  mkillum likes \n> regular polygons.  Page 577 of Rendering with Radiance has the gory \n> details. Not sure the answer to your problem, just stating the issues.\nI'll look that up. Thanks for the confirmation.\n\n\nI'm able to flatten the planes in Max via the 'Edit Poly' modifier. \nThankfully, all of those 6-sided polys have their Y-axis pointing the \nsame way it appears, even if tilted/turned, so I can flatten them all \nwith a single tool. However, this doesn't remove the side polys, and \nleaves you with two flat faces I suspect, so I'll have to research this \nmethod more.\n> If you can grep the stuff out, I'd bet you could write something to \n> take the result(s) and generate a corresponding .mat file, with shell \n> scripting techniques, or python or perl, or whatever.\nYeah, my unix god friend pointed me towards AWK as a simple solution. \nI'm just lazy, and can't write code quickly (not a programmer) so I was \nhoping that there might be a solution out there already.\n> Sounds like a plan. The thing is, you are closer to real numbers than \n> most lighting designers, by having the wherewithal to tackle \n> Radiance.  Don't short-change yourself.  A good model and sound \n> parameters in Radiance beats any of the tools commonly used in \n> lighting design, IMO.\nDidn't know that. Huh. Well, Revit produces very good models (other than \nthis glass thing) so I'm halfway there I guess.\n\n\nJeffrey\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-May/003664.html).</sup>", "attachments": [], "created_by_name": "Jeffrey McGrew", "created_at": "May 11, 2006 at 05:33PM", "created_by": "Jeffrey_McGrew", "parent_id": "radiance-general_003659", "id": "radiance-general_003664"}