{"body": "Carsten Bauer wrote:\n\n\n> there's one master distributing the blocks, the workers\n> which do the tracing, a collector receiving finished scanlines (and in\n> the end  puzzles everything together for the big picture) and of course\n> the ambient slave, who receives amb. values and broadcasts them to all\n> the other workers. This ambient slave alone has access to the file for\n> storing them. Only at the beginning of a new run the workers can access\n> an already existing ambfile for reading in values.\n\n\n\n\nIn a thread on the dev list from Wed, 12 Jun 2002\nhttp://www.radiance-online.org/pipermail/radiance-dev/2002-June/000001.html\nI said the following, which was received with quite a bit\nof scepticism:\n\n\n   Since Windows doesn't support NFS file locking\n  (and neither did cygwin, last time I looked), we'll need to find\n  a better solution for concurrent access to ambient files. I can\n  think of two portable ways to do this: Either we invent a file\n  based locking mechanism, or we establish a seperate server\n  process that accepts network store and retreival requests by the\n  actual simulation processes. The latter would be more technicall\n  involved, but probably a lot more robust. Any thoughts?\n\n\nAnd now, half a year later, you tell us that you already have such\na server implemented? Only that you call it \"slave\"... ;)\nDoes your \"slave\" require PVM? If yes, then that would probably make\nit platform independent, otherwise you'd have to tell us some more\ndetails. Personally, I think that this alone would be worth adding\nto the ANSified Radiance core, with the management stuff up for\ndiscussion.\n\n\nBut maybe we can now really move the details to the dev list. I'm\ncross-posting this, so there's no need to reply on the general list.\n\n\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-January/000531.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "January 18, 2003 at 06:44AM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_000518", "id": "radiance-general_000531"}