{"body": "Hi Axel,\n\n\n> Found your talk. I also looked at the examples in the rtcontutor\n> directory (which seems to have disappeared in the 3R9 tar ball). The\n> geometry you used for the light ducts is relatively simple. I am\n> particularly interested in round light pipes, not square light ducts.\n\n\nAs I said, I used planar geometry so I could compare to the virtual  \nsource result.  Rtcontrib will work with any geometry.\n\n\n> I noticed that in model.mat, you define the material for the duct as\n> metal, only to immediately re-define it as mirror:\n>\n> ----------------8<-----------------\n> void metal mirror_mat\n> 0\n> 0\n> 5 .9 .9 .9 1 0\n>\n> void mirror mirror_mat\n> 0\n> 0\n> 3 .9 .9 .9\n> ----------------8<-----------------\n>\n> I understand why you would prefer mirror instead of metal: it creates\n> virtual sources of the sun, dealing with the direct component. So\n> would the only option with a round pipe be to break it up into\n> polygons?\n\n\nI don't recall why I left the original definition in there, but the  \nlater one is all that matters.  There's not a lot of sense in  \nbreaking your cylinder into long polygons, as it would end up  \ncreating an insane number of virtual sources.  Better to leave it as  \na cylinder and use the metal type, since mirror doesn't do anything  \nfor curved geometries.\n\n\n> It strikes me that this particular example of rtcontrib is useful for\n> demonstrating its use with sky components, so a large number of sky\n> distributions and sun positions may be computed rather quickly once\n> the coefficients (individual images) are generated. Guess you used the\n> light ducts simply to add some interest to the scene. The same scene\n> complexity could as well have been simulated without rtcontrib if an\n> animation (\"input/output relations\", as you called it) was not sought.\n\n\nActually, I was trying to come up with a scene that would be very  \ndifficult to simulate w/o rtcontrib -- if the light pipe had curved  \nsurfaces, for example.  In such case, you wouldn't have been able to  \nrender even a single time point if it included the sun without  \nrtcontrib.\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-August/005323.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "August 23, 2008 at 09:50AM", "created_by": "Greg_Ward", "parent_id": "radiance-general_005319", "id": "radiance-general_005323"}