{"body": "James,\n\n\nLM-83 indicates that ASE values greater than 10% (when calculated with no shading applied) have unsatisfactory visual comfort even when manual shades are available to the occupant.  It clearly states that ASE is computed without interior shading devices.  LM-83 did not state that both sDA and ASE should be combined, but LEED made the  decision to require both to achieve the maximum daylighting LEED points.  If both of these are achieved, daylight conditions should be excellent, although the ASE metric can be met with 100% diffuse glazing, which might not be very pleasing for the occupants since views are eliminated.  In my opinion, meeting the sDA+ASE LEED criteria will be very difficult, even when exterior shading such as an overhang is applied to a window.  I believe the 10% ASE metric is total coverage across the entire building work area, so you can meet it with 20% of the points receiving direct sunlight on the south side of a building if the north side has 0% coverage and there is no east-west glazing.   I believe the criteria are designed to promote the elimination of direct sunlight through a window that will result in little need for interior shades.  Higher point totals are likely provided because it is difficult to meet.\n\n\nI expect that most buildings will achieve the LEED daylighting credit by showing that 75% or 90% of the space has between 300 and 3000 lux at 9AM and 3PM on the clearest days around the fall and spring equinoxes.  The challenge with this test is that blinds or shades are not applied in this analysis, so points with direct sunlight will likely receive greater than 3000 lux and will not count toward the coverage area.  Reaching 90% coverage can be challenging since it, too, requires the elimination of most of the direct sunlight at two different times of the day.  This option also promotes the use of daylighting design that applies exterior shading devices.\n\n\nRick\n\n\n\n\n-----Original Message-----\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-daysim/2014-May/000052.html).</sup>", "attachments": [], "created_by_name": "Richard Mistrick", "created_at": "May 20, 2014 at 09:01AM", "created_by": "Richard_Mistrick", "parent_id": "radiance-daysim_000048", "id": "radiance-daysim_000052"}