{"body": "Hi German.\n\n\nThe most important information you need you will find in the ies2rad man\npage. In general you use it to create a library of luminaire *.rad and\n*.dat files which you can later reference into your scenes via xform. I\nfound it more convenient and flexible for my exporters to create files with\ntriangular markers and use \"!replmarks ...\" to place multiple luminaire\nfiles. That way you can later replace all luminaires in an array with a\nsingle change in the scene file.\n\n\nWhen you write a plugin you have to pay attention to the units of the ies\nfile and adjust the -d parameter accordingly. Unfortunately ies2rad doesn't\nread that information from the file.\n\n\nThe geometry in IES files is limited to discs, ovals, rectangles and\nextrusions of these shapes. Mostly you will find the 2 dimensional shapes\nfor recessed and spot lights while the 3 dimensional shapes are used for\npendants (boxes and cylinders). If you want to avoid these crude things in\nyour model and use detailed geometry instead (from a dxf file, for example)\nthen you use the -i option to create an illum sphere. The sphere will be\nused with the luminance data generated from the ies file. You have to place\nthe detailed geometry of fixture into the sphere yourself. ies2rad doesn't\ndo that for you.\n\n\nI found that geometry provided by manufacturers is very detailed and can\nlead to problems in large models. MGF geometry information is extremely\nrare.\n\n\nYou can use the -t option to set the lamp type. This defines the color\ntemperature. The -m option allows you to set a maintenance factor that all\nartificial lighting calculations require. Not that some lamp type entries\nin the lamp.tab file already include a correction factor for the lamp so\nyou have to take this into account when calculating the final value of -m.\nI found it safest to use \"-t WHITE\" (which does not have a correction) and\nlump all the efficiency reductions and maintenance factors together into a\nsingle -m value.\n\n\nEuropean manufacturers provide are more likely to provide Eulumdat file\nspecs for their luminairs. Sometimes they convert these for you into IES\nfiles. If you can only get LDT files you can use DIALUX or something\nsimilar to convert the LDT to IES files. It used to offer this option a few\nyear ago, at least. There may be other converters out there, but I don't\nremember the names.\n\n\nHth, Thomas\n\n\nOn Fri, Aug 7, 2015 at 2:09 PM, Germán Molina Larrain <germolinal at gmail.com>\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-August/011163.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "August 08, 2015 at 07:46AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_011161", "id": "radiance-general_011163"}