{"body": "Hello,\n\n\nA few years ago I did similar things as you are doing. Here are some \nadvices you may find useful:\n\n\nAt 11.03.2005 15:35, you wrote:\n>The technique I used is simple, I have been using the following commandline:\n>\n>ximage trace.pic | rtrace -ab 1 -ds 0.2 -dr 6  -dt 1 -otodp -h -x 1 -i\n>ok.oct  > raytrace_sample.dmp\n\n\nYou may have noticed that rays which are directed towards source objects \n(e.g. the sky hemisphere) get point coordinates that are in fact the origin \n(0,0,0). This leads to many rays wrongly directed to the origin instead of \ngoing in the right direction. The solution I found is to filter the rtrace \noutput just to ignore these rays. This can be done using rcalc like this:\nximage trace.pic | rtrace -ab 1 -ds 0.2 -dr 6  -dt 1 -otodp -h -x 1 -i \nok.oct |  \\\nrcalc -e 'abs(x)=if(x,x,-x);cond=abs($7)+abs($8)+abs($9)' > raytrace_sample.dmp\n\n\n>To make the graph more clear, it would be interesting to color them for\n>instance accordingly to how often a ray bounced. What would be a good way\n>for scripting rtrace such that I'll be able to do so?\n\n\nI just outline herefater a technique that works for a scene with opaque \ndiffusers only. You may also adapt this technique to other type of materials.\n\n\nFirst define a new plastic with a .9 reflectance:\nvoid plastic new_mat\n0\n0\n5 .9 .9 .9 0 0\n\n\nThen apply this new material to your scene file:\n\n\npfilt -m new_mat original_scene.rad >new_scene.rad\n\n\nAlter also all light emitting types (i.e. glow, light, illum) of your scene \nso that their R,G,B values are 1\n\n\nBy doing so the radiance values that is attached to a single ray will be \n0.9^n with n the number of bounces it has encoutered.\n\n\nThen add to your rtrace output the value of each rays using option -otodpv \n(this last v is the thing you need!)\n\n\nThe output of rtrace can then be processed using rcalc to retrieve the \nnumber of bounces n that you may then use to whatever you need:\nrtrace -otodpv... | rcalc -e 'n=$10/log(0.9); ... '\n\n\nRaphael Compagnon\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-March/002527.html).</sup>", "attachments": [], "created_by_name": "Raphael Compagnon", "created_at": "March 11, 2005 at 04:50PM", "created_by": "Raphael_Compagnon", "parent_id": "radiance-general_002526", "id": "radiance-general_002527"}