{"body": "Georg Mischler wrote:\n> You always have to say what you're comparing to. What Apple\n> compares in their PR is the CPU frequencies. Since the PowerPC\n> is a true RISC CPU, it will process about twice as much data per\n> cycle. This means that eg. an 800 Mhz Mac will roughly equal\n> a 1600 Mhz PC running Linux (your mileage may vary with Windows).\n\n\nWell, that's exactly what just didn't add up in my (admittedly basic) \ntests.  But Mark Stock's Radiance speed tests page \n(http://mark.technolope.org/pages/rad_bench.html) says the same thing. \nThe \"RISC two-for-one-special\" doesn't seem to be present when comparing \nRadiance render times rom Apple & PC.  Pillo did a bunch of tests on G3 \nand G4 laptops; not sure if there is a desktop Mac timing on there. \nGreg, maybe you wanna load up the test model on your new Mac hot rod??\n\n\n> Given the similar frequency range, it is indeed very likely that\n> something is wrong here.  Note that laptops (on both sides) use\n> different types of CPUs and probably other components, which will\n> slow down a lot of stuff, even when the system doesn't switch to\n> sleep mode in between...  Just think of the hard disks for\n> example, which rotate relatively slow to reduce noise and power\n> consumption.\n\n\nYes, but my tests were done on small models that went straight into RAM \nand stayed there.  I turned off all power save functions as well, as I \nsuspected that might have been the problem.  Perhaps there's still \nsomething off.  Dunno.\n\n\n> Probably not much. The main advantage of a 64 bit system is the\n> larger address range. There may be compiler options that allow you\n> to load several values into the same registers together, but I\n> wouldn't expect any wonders from that if the software isn't written\n> with it in mind. And other (or maybe the same) compiler options will\n> cause harm, if they change eg. the size of an int.\n\n\nThanks for this info...\n\n\n\n\n\n\n\n\n      Rob Guglielmetti\n\n\ne. rpg@rumblestrip.org\nw. www.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-June/000830.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "June 02, 2003 at 09:37AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_000813", "id": "radiance-general_000830"}