{"body": "Hi Christian,\n\n\n> Concerning the glass with the values of a Lee color filter i just  \n> want to make sure that i got all right:\n> I calculated the RGB values from the spectrum, taking in  \n> consideration that Y is not =1 but 0.642.\n> Then i got the transmissivity which is 0.92.\n> I multiplied my RGB values with 0.92 and thats it, or not?\n\n\nI really don't know where you got the 0.92 value from a normal  \ntransmittance of 0.642, assuming that's what Y is.  The proper  \nprocedure is to figure out the transmission from the transmittance  \nusing ray/src/cal/cal/trans.cal, which is also discussed on p. 240 of  \n\"Rendering with Radiance.\"  First, you need to normalize your RGB  \nvalues to match your Y normal transmittance.  For this, you can use  \nray/src/cal/xyz_rgb.cal.  Run the following:\n\n\n\tcd ray/src/cal/cal\n\ticalc xyz_rgb.cal trans.cal\n\n\nLet's say you have a measured RGB of 82 53 19, you would define a  \nnormalization factor like so:\n\n\n\tnf = 0.642 / Y(82,53,19)\n\n\nThen, compute the actual RGB normal transmittances using:\n\n\n\t82 * nf\n\t$1=0.900124166\n\n\n\t53 * nf\n\t$2=0.581787571\n\n\n\t19 * nf\n\t$3=0.208565356\n\n\n(The lines with '$' in front are the outputs of icalc.)  Then, set  \nthese values one by one to the Tn (normal transmittance) variable  \nused in trans.cal, and query the tn (normal transmission) value that  \ncorresponds:\n\n\n\tTn = $1\n\ttn\n\t$4=0.980257446\n\n\n\tTn = $2\n\ttn\n\t$5=0.6342239\n\n\n\tTn = $3\n\ttn\n\t$6=0.227507866\n\n\nThese are the values you actually use in glass:\n\n\n\tvoid glass LeeGlass\n\t0\n\t0\n\t3 0.980 0.634 0.228\n\n\nThis assumes your glass has an index of refraction of 1.52.  If this  \nis wrong, then you should assign a different value of n before you  \ncompute the tn values, and add the appropriate value to the glass  \nprimitive.\n\n\n> Is there some kind of \"roughness\" for glass too? The glass with the  \n> filter on top is too \"glossy\", reflective, shiny or whatever you  \n> would call it. I would want it more \"dull\". ( I dont know if this  \n> is the right term in this context)\n\n\nI have no clue what a Lee filter looks like.  Is it smokey?  Is it  \nrough?  There is no roughness value for glass -- Radiance assumes  \nthis is a polished surface.  In case of a rough front surface and a  \nsmooth back surface, you will have to do something special.  In the  \ncase of scattering in the transmission distribution, you can use the  \ntrans type and use the winxmit.cal file with a brightfunc to  \napproximate the angular transmission.\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-April/003569.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "April 20, 2006 at 05:51PM", "created_by": "Greg_Ward", "parent_id": "radiance-general_003568", "id": "radiance-general_003569"}