{"body": "Terrance McMinn wrote \n> Hello All,\n> \n> Thomas you have made an excellent contribution to the radiance community\n> with your SketchUP exporter. I assume this script would also work with\n> the free Google Version of SketchUP as well. That software was of\n> limited use to radiance modelling as it did not have the 3DS converter\n> available in the PRO version.\n\n\nYes, of course. There would be no motivation for me to write a script\nthat doesn't work on the free version. But from the Ruby point of view\nboth versions are identical. \n\n\n> A point here, for the Google SketchUP (free version) users would be for\n> the user to manually modify the 'sky' file for location and orientation\n> as that option works differently from the PRO version of SketchUP.\n\n\nI am not aware of different settings between the two versions. The script\nuses information stored in the 'location' and 'shadow' settings. You can\nmodify the sky appearance in SketchUp but I do not use this information\nand don't even know if it's accessible via scripting.\n\n\n> To this effect a couple of extra comments in the 'sky' file for the\n> novices would be useful.\n\n\nI can certainly add a few comments ...\n\n\nAbout the interface 'design':\n\n\nSketchup has a very limited but simple dialog toolbox which is what I'm using\nright now. It looks odd but it does the trick. More soffisticated dialogs are\npossible with DHTML (JavaScript - the 'tip of the day' is an example for that)\nbut I won't start working on that before I have a good idea about which options\nto present. And I have to be sure someone out there needs it because it would\nbe useless for me.\n\n\nRegards,\nThomas\n\n\nViel oder wenig? Schnell oder langsam? Unbegrenzt surfen + telefonieren\nohne Zeit- und Volumenbegrenzung? DAS TOP ANGEBOT FÜR ALLE NEUEINSTEIGER\nJetzt bei Arcor: günstig und schnell mit DSL - das All-Inclusive-Paket\nfür clevere Doppel-Sparer, nur  29,95 \u0080  inkl. DSL- und ISDN-Grundgebühr!\nhttp://www.arcor.de/rd/emf-dsl-2\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2007-November/004544.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "November 01, 2007 at 06:48AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_004530", "id": "radiance-general_004544"}