{"body": "Hi Marija,\n\n\n>> Surfaces made of these materials pass as if they aren't there.\n>\n> What does this exactly mean when values on the image are traced in  \n> ximage?\n> For example if I have a window made of some glass material or some  \n> curtain on it made of trans material. On irradiance image when I  \n> try to trace value of some pixel on the window surface, what do I  \n> get? Is it irradiance of the objects behind the window (outside  \n> ground, buildings etc)? Does window/curtain transmittance has an  \n> influence on reported value?\n\n\nIf you query a pixel on a window, the window acts as if it's not  \nthere, so it's transmittance has no effect.\n\n\n> What happens for surfaces made of transparent BRTfunc materials  \n> (like double glazing)? Are they ignored too, or their irradiance  \n> value is reported?\n\n\nThe BRTDfunc isn't one of the materials on the list, so it shows up  \nwith an irradiance value like other materials.  I'm sorry if this is  \nconfusing, but you can usually tell simply by looking at the image  \nwhich materials are transparent and which aren't.  If you want all  \nmaterials to be treated the same and irradiance to be computed for  \neverything, you can use the following in place of the rpict -i option:\n\n\nvwrays [view options] -ff -x xres -y yres -pa 0 | rtrace -h -ff -opN  \noctree | rtrace -ffc -I -x xres -y yres > irrad.pic\n\n\nThe first trace comes up with the intersection points and surface  \nnormals for the second trace, which computes irradiance at those  \npoints.  You need to be sure that your view has no distant light  \nsources in it, since those don't have intersection points or surface  \nnormals.\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-September/005365.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "September 09, 2008 at 08:24AM", "created_by": "Greg_Ward", "parent_id": "radiance-general_005344", "id": "radiance-general_005365"}