{"body": "Hi Jeffrey,\n\n\nJeffrey McGrew wrote:\n\n\n> I am using AutoDesk Revit for the modeling, then exporting\n> from that to AutoCAD where everything becomes a polyface mesh,\n> and then using RADOUT to generate my .RAD files. The other\n> approach I've done is to export from Revit to DXF in parts,\n> and then use the DXF2RAD tool to translate them into .RAD.\n\n\n> However the modeling capabilities of Revit *far* outshine\n> those of AutoCAD when it comes to modeling buildings; so\n> even having to jump through these translation hoops, it's\n> still faster than modeling in AutoCAD to begin with. Revit\n> is, more or less, 'Inventor or SolidEdge for Architects'.\n\n\nSounds interesting.  I must admit I don't pay close attention to what's \ncoming out of Autodesk's, um, doors, besides AutoCAD.  I use my \nAutoCAD/ADT and hope that they don't raise the price too much.  Revit \nsounds interesting though.  Perhaps I'll have a look.\n\n\n>>It's not a  \n>>Radiance limitation, it's an ACIS translation problem.\n> \n> \n> Oh no, I never ment to imply that it was a Radiance\n> limitation; I meant to imply that it was a limitation\n> with the translation programs; in that\n> they aren't aware enough to translate, say, a cylinder\n> in a DXF to a cylinder in Radiance.\n\n\nI never meant to imply that you meant to imply that either.  Wait; now \nI'm confused. =8-)  Yes, it's frustrating to accept that while Radiance \ncan deal with fantastic complexity, and smooth curves (don't get me \nstarted on *that* again), it does so internally.  You either speak \nRadiance or accept lots of triangles or facets. I guess most of us \naccept triangles.  It's less of a limitation than it was in the past, \nwhat with memory & CPU cycles coming cheaply now, but it still makes for \nillum headaches and I guess texture mapping is a pain.\n\n\n> Thanks a great deal for this link. I'm certain that\n> this will help a great deal! Something like this\n> was exactly what I was looking for; lacking the\n> ability to make 'good' RAD files directly from\n> my CAD software, I needed some way to easily\n> 'swap' elements within my scenes. Thanks again!\n\n\nYep, it's indispensible for that, and I assume is exactly why Greg wrote \nit.  Have fun!\n\n\n\n\n\n\n      Rob Guglielmetti\n\n\ne. rpg@rumblestrip.org\nw. www.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-October/001109.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "October 23, 2003 at 10:54AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_001102", "id": "radiance-general_001109"}