{"body": "Hello again,\n\n\nYes, what the sensor measures is an interesting question, especially since many manufacturers state that their product reads illuminance when it clearly does not. I do not know if this is a big deal for annual energy simulation or commissioning as long as there is a setpoint that allows the photosensor to track workplane illuminance throughout the year. I think it is usually hard to find such a setpoint though, whether it is a cosine response or 'some sort of radiation' signal.  \n\n\nSPOT does allow you to assess the situation (photosensor spatial response, location, etc.) in the design stage by relating signal setpoint (user input) to signal received (rsensor results) and showing the resulting annual workplane illuminance. Illuminance at the sensor, instead of sensor signal, is used to give a commissioning report at the end of a SPOT project. The report assumes a diffuse lighting condition can be created in the space where commissioning will take place.  This is because the ratio of illuminance to signal is taken from rtrace and rsensor calcs with just a CIE overcast sky. Oh, and another photocell characteristic to consider is wavelength sensitivity - SPOT does not do this but could cause a larger impact than the spatial distribution in some cases.\n\n\nI don't know about making SPOT cross-platform, Zack Rogers might be able to answer that. There are some cross-platform python scripts with the download that you might find useful. \n\n\nIt seems to me that rsensor uses a step function to determine which sensitivity value to use but maybe Greg can straighten me out on this too or explain more. \n\n\nAlso, I apologize for the repetitive post earlier. I did not see Greg's until later. Thanks! Jennifer\n\n\n-----Original Message-----\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-October/006273.html).</sup>", "attachments": [], "created_by_name": "Jennifer Scheib", "created_at": "October 12, 2009 at 07:39PM", "created_by": "Jennifer_Scheib", "parent_id": "radiance-general_009589", "id": "radiance-general_006273"}