{"body": "Hi Axel,\n\n\nResponses inline...\n\n\n> c) the mirror material can only be used on planar objects, hence it's\n> no good inside a tube (inverted cylinder). How good would a metal tube\n> in combination with ridiculously high number of bounces be?\n\n\nWould work for the sky, but not the sun.\n\n\n> e) then there's the new rtcontrib program\n> (http://luminance.londonmet.ac.uk/radiance_mailinglists/general/ \n> 2005-May/002710.html):\n> \"Rtcontrib can also be used by the more adventurous among you to\n> compute input/output relations for devices such as light pipes and\n> shading systems, although I have yet to test such an approach,\n> myself.\" --Greg\n> There is a directory ray/src/rtcontutor, but the example explains\n> rtcontrib's use for daylight coefficients, not light pipes. I\n> personally can't quite work out how it would possibly replace a\n> forward raytracer, so has anybody been adventurous yet used it for\n> this?\n\n\nI gave it a go for illustration purposes at the 2006 Radiance  \nworkshop.  You can download a QuickTime movie of the presentation from:\n\n\n\thttp://www.radiance-online.org/radiance- \nworkshop5/2006_Radiance_Workshop/\n\n\nIt's the talk entitled, \"Applying the Radiance rtcontrib program,\"  \nbut heed the warning and download the QT movie rather than hitting  \nthe link on your browser, because most browsers (including Safari)  \nbarf on it.  The key part you want to check out is \"Step 2\" in the  \nmirrored light pipe example.  I'm using flat surfaces, but only for  \ncomparison purposes.  The rtcontrib approach should work for any  \ngeometry.\n\n\n> f) How about gathering the external environment with a mkillum across\n> the pipe's entrance, then spreading the light in the interior using a\n> second mkillum at the pipe's exit?\n\n\nAgain, this wouldn't work for the solar component.\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-August/005321.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "August 22, 2008 at 09:42AM", "created_by": "Greg_Ward", "parent_id": "radiance-general_005319", "id": "radiance-general_005321"}