{"body": "Hi Zack,\n\n\nIndeed, the CIE skies can be defined by diffuse horizontal illuminance  \nor zenith luminance. Both options of course available in gensky.  I'm  \nnot too familiar with the procedures used to estimate sky type and  \nmagnitude since I invariably use climate data as the basis for  \ndefining skies.  For what it's worth, I've long believed that there  \nwas a 'disconnect' between what the sky model researchers were doing  \nand what end-users might actually want, i.e. a means of selecting sky  \ntype from basic quantities in the standardised climate files.\n\n\nEven if one could claim that a particular clear sky output was  \nplausible, it still seems wacky to predict for a clear sky without  \nsun. I've updated my commentary on this with a graphic to show just  \nhow much might be missing if you don't include the sun:\n\n\nhttp://www.iesd.dmu.ac.uk/~jm/doku.php?id=academic:daylight-compliance#daylight_leed\n\n\n> BTW - the latest public review draft of LEED 2012 goes away from  \n> this standard clear sky and requires the user to find the average  \n> hourly values between the clearest and cloudiest days within 15days  \n> of Sept 21 and Mar 21st. Someone must have been listening to your  \n> concerns!\n\n\nPerhaps, half-listening.  Averages for daylighting quantities can be a  \nconfounding notion, and often lead to contortions best left to people  \nwho enjoy doing this:\n\n\nhttp://en.wikipedia.org/wiki/Twister_(game)\n\n\nDo you have actual wording from the LEED draft?\n\n\nBest\nJohn\n\n\n\n\nDr. John Mardaljevic\nReader in Daylight Modelling\nInstitute of Energy and Sustainable Development\nDe Montfort University\nThe Gateway\nLeicester\nLE1 9BH, UK\n+44 (0) 116 257 7972\n+44 (0) 116 257 7981 (fax)\n\n\njm at dmu.ac.uk\nhttp://www.iesd.dmu.ac.uk/~jm\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2011-April/007761.html).</sup>", "attachments": [], "created_by_name": "John Mardaljevic", "created_at": "April 15, 2011 at 02:29AM", "created_by": "John_Mardaljevic", "parent_id": "radiance-general_007750", "id": "radiance-general_007761"}