{"body": "Hi Andrei,\n\n\nThe R, G, and B triplets on the website (at least those measured by me) \nare directly translated from explicit photometric measurements using a \nKM 2600d spectrophotometer. We use the same scripts that are in the \nRendering with Radiance book for doing this. If I recall correctly, the \nX, Y and Z tristimulus values are calculated simply by using the \nspectral measurements with the color matching functions (via \ncieresp.cal), and then xyz_rgb.cal is invoked.\n\n\nThe spectrophotometer takes measurements with specular component \nincluded (SCI) and with specular component excluded (SCE). Since plastic \nspecularity is equal energy, specularity is simply Reflectance_SCI - \nReflectance_SCE. The error in the database I referred to was something \nnaive I wrote long ago and never noticed: the R, G and B values \ndisplayed currently (R_website) come directly from the SCI measurement; \ntherefore, they contain the specular portions of the measurements. They \nshould be based on SCE values (diffuse reflections) and be further \nscaled by 1/(1-Specularity) in order to be photometrically correct. \nHence the correction equation I posted earlier in this thread. Come \ntomorrow morning (Singapore time), the issue should be fixed.\n\n\nIn good news, for 99% of the materials on the website, this makes little \nor no difference. For highly specular plastics, the extra diffuse \nreflection which results can be moderately large.\n\n\nRoughness values are not calibrated for most materials, and if they have \nbeen, it is simply by an eye test.\n\n\nBest,\nAlstan\n\n\nOn 1/24/2017 11:17 PM, Kolomenski, Andrei (JSC-SF311)[WYLE LABORATORIES,\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2017-January/012026.html).</sup>", "attachments": [], "created_by_name": "Alstan Jakubiec", "created_at": "January 24, 2017 at 07:58AM", "created_by": "Alstan_Jakubiec", "parent_id": "radiance-general_012019", "id": "radiance-general_012026"}