{"body": "On 28 Jul 2006, at 21:56, Ramana Koti wrote:\n\n\n> Though light shelves are widely perceived to bounce daylight into\n> interiors off of the ceiling and also cut down glare, they are\n> more effective in cutting down the glare and do not actually\n> increase the daylight levels at the back of the room.\n>\n> True or false? Why?\n\n\nBoth. Because light is a wave (and complicated).\n\n\nI've not done a proper study on the effectiveness of light\nshelves but my general understanding is as follows:\n\n\n1) Light shelves are useful when there is some sunlight to\n    redirect into the room. In this case they should increase\n    the daylight factor further into the room. If the room\n    is too long even a light shelve will not help. The room\n    geometry (and of course surface colours) have to fit to\n    benefit of a light shelve treatment.\n\n\n2) Because they are effectively an obstruction in the window\n    they will reduce the DF for the front and the middle of\n    the room. At the front we usually have plenty of daylight\n    and don't mind; in the middle the loss in DF might in fact\n    be bigger than the gain at the back which would reduce the\n    overall DF.\n\n\n3) Daylight studies (at least DF calculations) are usually done\n    with a standard CIE overcast sky. This sky model has no sunlight\n    component and is therefore most inappropriate to estimate the\n    efficiency of light shelves. A light shelve will only reduce the\n    available window opening and the light coming in.\n    However it's the only sky model mentioned in the British Standard\n    - and I suppose everywhere else - so it's used to get the one or\n    two numbers the architects need to get their BREEAM or LEED browny\n    points. [1]\n\n\n\n\nThomas\n\n\n\n\n[1] I'm open for any suggestion to improve this sad status of\n     daylight design in the current practitioners work - but please\n     start a new thread.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-July/003866.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "July 29, 2006 at 09:35PM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_003865", "id": "radiance-general_003866"}