{"body": "Hi Zack and Phil.\n\n\nThank you very much for your most helpful suggestions.  My experiments are in two parts.  Firstly,\nI am attempting to simulate as accurately as possible the lighting conditions under a real atrium\nroof canopy, and comparing with illuminance measurements measured directly under the roof.  In\nterms of modelling it accurately, I think Optic5 (and associated database) will be a useful way to\nderive transmittance information.  I have still not quite decided whether to take the information\n(calculated transmittance of multi-layer configurations) from the export and create a simple\n'glass' primitive, or to use the BRTDFunc generated.  Perhaps I will experiment and see whether it\nmakes much of a difference.\n\n\nThe second part involves a systematic varying of the transmittance of the glazing in the\nsimulation.  Here I believe it would be appropriate to use the simple glass primitive, and vary the\nr,g,b,n parameters (though I think n should stay constant at 1.52 (or whatever it is...), and I\nthink it said in the manual page that having only the r,g,b arguments has Radiance use the default\nn, fine for my needs).  I thought that the BRTDFunc may have included some function depending on\nangle of incidence that would make it more accurate than the glass primitive, but as it doesn't, I\nwill stick with the glass (as I am dealing with overcast skies, the 'grazing angle' changes in\ntransmittance may not be as critical (though still a factor) as if I were looking at direct light).\n\n\nOnce again many thanks\n\n\nDan Lash\nPhD researcher\nSheffield Hallam University, UK\n\n\n\n\n\n\nradiance-general@radiance-online.org writes:\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-January/001397.html).</sup>", "attachments": [], "created_by_name": "Daniel Lash", "created_at": "January 15, 2004 at 10:48AM", "created_by": "Daniel_Lash", "parent_id": "radiance-general_001394", "id": "radiance-general_001397"}