{"body": "Hey Rob,\n\n\nHow are you determining the reflectance of your trans materials, \n(measurement or cut sheet)?\n\n\n-Jack\n\n\nRob Guglielmetti wrote:\n\n\n> Well, I tried Greg's suggestion of setting the limit weight to a very \n> low number, but all that did is manage to scrounge up a few additional \n> lux.  This actually made things look worse, because my problems are \n> with the really dense shades (which are already coming up with higher \n> numbers than I'd expect).\n>\n> I have a spreadsheet here with the results of all my tests so far.  If \n> anyone's interested in looking at it I'd be happy to share it.  \n> Perhaps there's a problem with my interpretation of this data.  I \n> dunno. But the tests indicate that whenever I try a 1% shade in any \n> combination, I get very odd results from rtrace.  And the whole reason \n> I'm doing this test is because we were getting similar odd results on \n> our real model; I was trying to simplify things so I could perhaps \n> isolate something that was causing these oddities.  So far, no joy.  I \n> shared my trans material definitions for all these tests earlier, but \n> if anyone wants them to have a look I can send those as well.\n>\n> My fear is that I'm simply trying to find too small a percentage of \n> the available light, and relative comparisons between different shade \n> materials will not be valid for this model. (?)  I mean, this test \n> model still has two pieces of diffuse glass in it, and the skylight is \n> prety small, so already the building form/glazing is removing a ton of \n> light from the space.  Then when I start throwing shades in the \n> skylight cavity, we're getting down to really tiny fractions of the \n> exterior light.  I dunno, I'd love to hear any thoughts.\n>\n> ----\n>\n>      Rob Guglielmetti\n>\n> e. rpg@rumblestrip.org\n> w. www.rumblestrip.org\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general@radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n>\n\n\n\n\n#\tJohn E. de Valpine\n#\tpresident\n#\n#\tvisarc incorporated\n#\thttp://www.visarc.com\n#\n#\tchanneling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000745.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "May 14, 2003 at 01:25PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_000733", "id": "radiance-general_000745"}