{"body": "Hi Erik,\n\n\nI would be interested to know whether your rating of the tone mapper offered in Photomatix as poor \nis based on a comparative survey. If such a survey has been conducted, what were the criteria used \nfor rating the algorithms? What was the background and number of participants of the survey? And \nwhich settings have been used for producing the Photomatix results?\n\n\nPlease note that only a fraction of the photos tagged with HDR at Flickr have been produced with \nPhotomatix. There are other software offering tone mapping capabilities, and of course Photoshop \nCS2 is the most well-known and used by photographers. I believe you are grossly overestimating the \npopularity of Photomatix. Furthermore, most of the Flickr's images produced with Photomatix have \nbeen post-processed in other imaging software, and therefore are not the direct output of its tone \nmapper. \n\n\nPhotomatix offers user controls to parametrize the algorithm to the user's personal taste, and many \nat Flickr seem to like to dramatize the effect with settings that are far away from the default values. \nThe approach of Photomatix is to let the user decide what is best for his/her photos, and not have it \nimposed by the engineer who designed the algorithm. Photoshop CS2 apparently follows the same \napproach, as its \"Local Adaptation\" HDR Conversion method allows a great deal of control over the \nmapping, better than with Photomatix in fact. \n\n\nWhy should a software be blamed for allowing photographers to adjust the settings and produce \ntone mapped images that specialists in HDR imaging consider non-photorealistic? \n\n\nPhotomatix is intended for photographers and not for 3D artists or other categories of users. \nPhotographers in general do not wish to produce photorealistic images. They are not interested for \ninstance in adding motion blur to make their images look photorealistic, as motion blur is precisely \nwhat photographers want to avoid. The same applies to HDR and tone mapping: most photographers \nare not interested in taking several exposures for HDR if the final result is going to be a \n\"photorealistic\" image that looks like a dull Low Dynamic Range photograph. \n\n\nGeraldine Joffre\n\n\nOn Thu, 10 Aug 2006 12:07:10 +0100 (BST), E. Reinhard wrote\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2006-August/000127.html).</sup>", "attachments": [], "created_by_name": "Geraldine Joffre", "created_at": "August 11, 2006 at 10:36AM", "created_by": "Geraldine_Joffre", "parent_id": "hdri_000115", "id": "hdri_000127"}