{"body": "Hi Marcus,\n\n\nDidn't we have this conversation a few weeks ago?  Look at the recent \npostings from Mark de la Fuente and the various responses regarding \nillum's and illum shapes.\n\n\nThe simplistic source sampling code in Radiance assumes that a \nrectangular distribution of rays may be used.  This is done more in the \ninterest of speed than anything else, but it does place some limits on \nthe shapes of sources you can model.  The closer to a rectangle (or \nparallelepiped) your source is, the closer to -dj 1 you can go with \nyour source sampling.  Triangles are problematic because Radiance fits \nthem into a rectangle and distributes the rays about this rectangle's \ncenter.  In the case of a right triangle, this sends a ray exactly to \nthe center of the hypoteneus, and floating point errors take over from \nthere to produce a hit about 50% of the time.  Not a good situation, \nand other triangles guarantee we'll miss every time with this sampling \nstrategy.\n\n\nA better approach for illum's, as I mentioned in one of my earlier \nresponses to Mark, is to create a larger rectangular illum to cover \nyour opening, disregarding the actual shape of your window elements.  \nFor a large window with many elements, you're better off using a single \nillum to cover it, anyway, so you don't send multiple samples when it \nisn't really necessary.  Mkillum will compute the correct average for \nthe larger illum surface.  So long as this surface doesn't intersect \nthe walls or have similar problems with its fit to the window, the \nresult should be a reasonable approximation.\n\n\nThe \"aiming failure\" warning message should be taken seriously, unless \nyou happen to know from geometric arguments that it is a rare condition \ngenerating this error.  In general, it means that you are \nunderestimating contributions from the associated source or illum.\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-September/001999.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "September 01, 2004 at 11:12PM", "created_by": "Greg_Ward", "parent_id": "radiance-general_001998", "id": "radiance-general_001999"}