{"body": "Hi,\n\n\nI wanted to add a few comments on this.\n\n\nThe \"-i <radius>\" option to ies2rad creates a sphere of radius specified \nby -i. This sphere has a an illum type applied to it to produce light. \nThe illum is modified by a brightfunc specifying the output distribution \nbased on the converted photometry data. However there are a few things \nto note:\n\n\n   1. an illum is invisible - however it gives off light, if you are\n      having problems a good first test is to convert your ies data\n      without the -i option so you will get a \"light\" material defined\n      rather than an \"illum\" material\n   2. ies2rad -i creates a sphere, you need to understand where the\n      sphere is relative to other surface geometry such as a ceiling,\n      you may have problems if your sphere cuts through other geometry\n   3. an illum can specifiy an alternate material to show up in its\n      place (however if you have a sphere defined via ies2rad where in\n      fact there should be a ring then this will not look right):\n\n\n        void glow my.glowing.source\n        0\n        0\n        4 1 1 1 0\n\n\n        void brightfunc my.illum.distribution\n        <.....>\n        0\n        1 1\n\n\n        my.illum.distribution illum my.illum.source\n        1 my.glowing.source\n        0\n        3 1 1 1\n\n\nI have always advocated that whenever anyone is using ies photometric \ndata, one should create a simple test box to place the output of ies2rad \ninto in order to quickly view what is going on. This way you can see if \nthe things are behaving the way they need and/or if they need additional \ntransforms to get things in the correct location/orientation.\n\n\nIn the case where you want to create more detailed geometry representing \nthe fixture and perhaps a glowing source, then the thing to do is to \ncreate this geometry and use a glow for the source surface and then \neither enclose this in an illum sphere or other enclosing geometry or \nfloat a quad or ring in front of the glow (assuming relatively \ndirectional output) and again apply the illum distribution. However be \naware of what Rob G. has pointed out that there will be some \ndistributions that will \"cut off\" dependent on view angle.\n\n\nTo deploy multiple instances of a light into a scene you can use xform \nas I think Thomas has outlined. This will work when thing are generally \nevenly spaced. If you have a more irregular deployment then you need to \ntake a look at \"replmarks\" (man replmarks), which will replace a \ntriangular marker with whatever you want (light or other kind of \ninstanced geometry).\n\n\nI hope this helps.\n\n\nRegards,\n\n\n-Jack de Valpine\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-January/004733.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "January 27, 2008 at 04:31PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_004720", "id": "radiance-general_004733"}