{"body": "(Looks like Greg & I are at the same spot in our inboxes)\n\n\n>From the manpage for falsecolor:\n\n\n\"Falsecolor produces a false color picture for lighting analysis.  Input is a rendered Radiance picture. ...  The default multiplier is 179, which  converts  from  radiance or irradiance to luminance or illuminance, respectively.  A different multiplier can be given with -m to get daylight factors or whatever.\"\n\n\nSo in the case of falsecolor, you don't need to do anything by default to get the photometric values. =) You DO however need to supply the proper input images. Greg just replied with how to do that with 'rad'. #teamwork\n\n\nOn 2/16/16, 8:11 AM, \"Raghuram Kalyanam\" <kalyanam at rhrk.uni-kl.de<mailto:kalyanam at rhrk.uni-kl.de>> wrote:\n\n\nHi Rob,\n\n\nThanks for your reply. Could you elaborate on how to get irradiance image and convert that to illuminance using standard luminous efficacy.  I have tried using rpict as you said, but it turned out a radiance(luminance) image.\nI executed the below command.\n\n\nrpict -vf Views/Scene_3.vf -av .5 .5 .5 -i scene.oct | falsecolor | ximage\n\n\n(Basically I generated radiance pictures (previously) directly with rad, I guess rad calls rpict internally. But how could we pass -i argument  to rpict in this case!! So i guess the above command might have some problem)\n\n\nI got false-color image with a contours of luminance.\n\n\nAny way I wanted Luminance and Illuminance in numerical values for corresponding to the pixels. Could you help me how to approach, or may be with an example.\n\n\nBest Regards,\nRaghu\n\n\nOn Feb 15, 2016, at 2:04 AM, Rob Guglielmetti <rob.guglielmetti at gmail.com<mailto:rob.guglielmetti at gmail.com>> wrote:\n\n\nThere are two basic methods for calculating illuminance with Radiance. You can pass one or more points to rtrace, which will return a value(s) for that specific point(s); the other way is to pass in a view to rpict, which will return values for each pixel in the view. By default, both tools return radiance. If you want illuminance, you need to request irradiance instead of radiance, and then convert that output to illuminance using the standard luminous efficacy function.\n\n\nSpecifically, it sounds like you want to know how to get illuminance from the specific image you attached to your question here. In this case, you'd need to re-render the image as an irradiance image instead of a radiance image, using the -i option to rpict. With that image, you could pass it through falsecolor, producing a falsecolor illuminance map or flood plot of the illuminance on all the (non-glazed) surfaces in the image. A second option pipeline to falsecolor can plot isocontours on the original image above. See the falsecolor manpage (http://radsite.lbl.gov/radiance/man_html/falsecolor.1.html) for details.\n\n\n\n\n\n\nOn Fri, Feb 12, 2016 at 7:02 AM, raghuram kalyanam <raghuram.kalyanam at bauing.uni-kl.de<mailto:raghuram.kalyanam at bauing.uni-kl.de>> wrote:\n\n\nHi Everyone,\n\n\nI would like to know which is the best way to measure illuminance at certain view points in the room (radiance generated picture)  below. Let me also know which tools gives what kinds of results.\n\n\n<scene_Scene_3.jpeg>\n\n\n\n\nThanks & Regards,\nRaghu\n\n\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-February/011496.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "February 16, 2016 at 11:56AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_011485", "id": "radiance-general_011496"}