{"body": "thanks everyone!\n\n\nMark, just for fun, I'm trying your -aa 0 -ad 16 trick right now (it'll \nbe a while before I can post a result, methinks).\n\n\nMartin, yours was a good heads up as to the essence of the problem -- \nonce again I'm expecting brute force CPU cycles to make up for a lack of \nunderstanding about the guts of Radiance.\n\n\nThis is good, though.  I finally realize that mkillum can be thought of \nas a way of rolling your own ies files, sorta.\n\n\nGreg Ward wrote:\n\n\n> Hi Rob,\n> \n> This seems to be a classic example of where you just can't rely on the \n> interreflection calculation in Radiance to solve your problem for you.  \n> The basic assumption in this approximation is that the indirect \n> illumination varies slowly over surfaces, which clearly isn't the case \n> in this scene.\n\n\ner, right.  =8-/\n\n\n> Solution: you need to apply mkillum to create pseudo light sources \n> (imposters) for your indirect luminaires.  To do so, put a shallow box \n> with an open top around a single ceiling-mounted light source (5 \n> rectangles) and use the \"void\" modifer for these, making sure they face \n> out into your room.  Let's say you called this file \"light_in.rad\".  \n> Using either the octree for your room or a reduced one that just has \n> that one light source switched on (better), you would run mkillum thus:\n\n\nlemme make sure I understand; these 5 rectangles would define the inside \nrecess of the coffer, yes?  And I would call it out like so:\n\n\nvoid polygon coffer.top\n0\n0\n12\n\t0 0 -5\n\t0 10 -5\n\t10 10 -5\n\t10 0 -5\n\n\n... and so on?\n\n\nFor the\n> sake of calculational efficiency, I recommend that you also change the \n> light primitives in your original luminaire files to the \"glow\" type \n> with an effective distance equal to the diagonal of your luminaire \n> dimension, so as to avoid sending shadow rays to these sources \n> unnecessarily.\n\n\nI *think* I understand...\n\n\n> The net result should be a fast and accurate rendering of your space.\n\n\nThat's all I ever wanted. =8-)\n\n\nI'll try these suggestions. Thanks guys.\n\n\n\n\n\n\n      Rob Guglielmetti\n\n\ne. rpg@rumblestrip.org\nw. www.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-September/000964.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "September 09, 2003 at 12:44PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_000963", "id": "radiance-general_000964"}