{"body": "Dear Greg\n\n\nThank you for your feedback concerning smoothing and UV texture co-ordinates\nusing the OBJ2MESH utility.\n\n\nConcerning the UV co-ordinate mapping distortion on one of my test renders.\nAfter investigating the error further, I determined that the cause of this\nminor fault was due to an independent utility that converted the CAD model\nto an .OBJ file and was not due to OBJ2MESH or RADIANCE.\n\n\nOn my web page, I have added a technically correct render using a CAD model\ncorrectly exported by a file conversion utility in the .OBJ format,\nprocessed by OBJ2MESH and rendered by RADIANCE, concluding my tests\ninvestigating RADIANCE renders combining smooth phong rendering with UV\nbitmap mapping at a face level.\n\n\nFor the final test render, please scroll to the bottom of the page:\n\n\nwww.daiservices.btinternet.co.uk/Radiance/Radiance_v3_5_UNIX/Phong_shading_a\nnd_bitmap_textures/Phong_shading_and_bitmap_textures.htm\n\n\nConRAD software was created by OpenEntry  www.openentry.dk and serves to\nconvert a 3DS file to a number of RADIANCE files; in fact all files\nnecessary to create a high quality RADIANCE render.  It works only on the PC\nunder Windows 9x and later (I believe) which is why RADIANCE UNIX users may\nhave not heard about it.  It is a comprehensive and effective program which\nalso allows access to virtually all aspects of RADIANCE and I generally\nregard it as a RADIANCE graphic user interface.  Hence my preference for the\n3DS file format.\n\n\nSince RADIANCE v3.5 for UNIX compiles and functions perfectly with\nCygwin UNIX for the PC, it is possible to run RADIANCE UNIX in a Cygwin UNIX\nwindow on a MS Windows desktop, simultaneously providing access to RADIANCE\nUNIX and RADIANCE tools for the PC such as ConRAD - a highly functional and\nproductive combination.\n\n\nKind regards\n\n\nJohn Graham\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000766.html).</sup>", "attachments": [], "created_by_name": "Digital Architectural Illustration Services", "created_at": "May 15, 2003 at 04:34PM", "created_by": "Digital_Architectural_Illustration_Services", "parent_id": "radiance-general_000718", "id": "radiance-general_000766"}