{"body": "Hi!\n\n\nThank you for your help!\n\n\n> Only if the colorpict pattern was included in the original file you\n> used to create your octree instance.  If it is defined in a separate\n> material file included with the scene containing the instance, the\n> transformation will not be applied the same way.\n\n\nI think I understand, while I still don't get this working. I have added some \nlines to my Makefile now that copy the lines defining the colorpict modifier \ninto the geometry file of the instance instead of defining the colorpict \nmodifier in my global materials file. So I have a objectname.rad.mat file for \nevery object, which is included into the the file I get from dxf2rad. This \nfile has a statement \"void colorpict mypattern....\", and a line \"mypattern \nalias l_object mymaterial\", with mymaterial defined in the global materials \nfile. This should work...?\n\n\n> You really should follow Schorsch's advice also about when to use the\n> instance primitive.  There really needs to be a help file or something\n> on instances, and I seem to remember writing something like this\n> somewhere, but now I can't even find it...  The rule of thumb I use is\n> that there have to be at least 200 geometric primitives in an object\n> before it's worth making an instance.  Otherwise, the overhead of\n> tracing rays through instanced octrees negates the memory savings.\n\n\nYes, I will do these \"optimation\" later... at the moment, I try the general \nconcept of using instances, as most objects have quite complex geometries, or \nat least they will get more and more complicated.\n\n\n> Replmarks replaces the markers with transformed scene files (or\n> instances), and as long as you put the related colorpict's in the\n> transformed scene files (or instances), and not in the replmarks input,\n> you should be OK.\n\n\nNow I'm really not sure anymore if I understood anything right... If I \nputanything (geometry and colorpict statement) into the instance, and place \nthis instance in my scene with replmarks, the colorpict mapping will be \ntransformed to the position of the instance!??? So, if I have an plane at \n0;0;0, with a mapping (using picture.cal, pic_u, pic_v) applied with \ncolorpict without any transformation (which means it is at 0;0;0 on the \nplane), I than oconv this into an octree, and place this octree with \nreplmarks into my scene, the plane with it's pattern will appear at the \ntriangle markers positions, not only the transformed geometry without pattern?\n\n\nThank you,CU, Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-October/000454.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "October 22, 2002 at 09:46AM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_000452", "id": "radiance-general_000454"}