{"body": "My first \"major\" language was Autolisp (the veterans here will \nremember).\nThat got me hooked on the functional approach, which I still value today\nin other languages.\n\n\nThen I found that the API had a very nasty bug (IRRC, \"(entget)\" without\npicking anything crashed Autocad R7 on SunOS), which made me look into \nC.\nThere I learned that even a seemingly \"simple\" language can give you\ntremendous power.\n\n\nNext I learned the object oriented approach with Oberon. Directly at\nthe source and on the original Oberon hardware (never met Wirth himself,\nthough). Since then, encapsulation and inheritance come naturally to me,\nbut I also detected that I didn't like the overly verbose Pascal syntax.\n\n\nWhile working on a Radiance GUI in Autolisp (yes, that's a thing),\nI discovered a then rather new and largely unknown language. It combined\nfunctional and object oriented features (both optional), and had a \nsimple\nsyntax that would not get into the way.\nThe current incarnation of Python is still my language of choice.\nFortunately, most relevant 3D software (minus Sketchup) has a Python\nAPI nowadays.\n\n\nWorking on code from others, I gradually acquired the basics of C++.\nWhile that one makes memory management simpler than in C (using\npredefined classes and templates), I'll probably never manage to dig\ninto most of the more complicated features in there.\n\n\nAnd more recently, I did some deeper excursions into JavaScript.\nThat's the price to pay when you want to bring interactive 3D\ngraphics to the web...\n\n\nCheers\n-schorsch\n\n\n\n\nAm 2016-04-13 02:37, schrieb Randolph M. Fritz:\n> We recently had an inconclusive discussion of computer languages over\n> on radiance-dev. At the end of it, I was left wondering what languages\n> people are using in their research, engineering, and design practices.\n> \n> My impression is that Python has become something of a standard in the\n> research community, with tools like SciPy, NumPy, and SAGE widely\n> used, though Perl has a library comparable to NumPy in PDL, and there\n> is a SciRuby also, of course, LISP.\n> \n> On the statistical side there is R and Excel and LibreOffice Calc.\n> \n> Then there is MATLAB, Mathematica, MAPLE, and even Maxima is still \n> around.\n> \n> I suppose we might also have some Visual Basic and C# users around\n> \n> So who is using what? What do people like?\n> \n> Randolph\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-April/011694.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "April 13, 2016 at 09:44PM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_011683", "id": "radiance-general_011694"}