{"body": "A \"file not found\" error is different from the permissions error you were getting. Do you have your lib directory set in your RAYPATH environment variable? I came in this one late so forgive me if this is redundant but you should have a RAYPATH defined, and it should point to your lib dir (where you should have all the Radiance lib files, such as these dat files and other critical files for Radiance's operation). Most of us also add the current working directory (\".\") to the PATH and RAYPATH as well. (Your PATH should point to wherever you have the Radiance binaries.)\n\n\nYou should not have multiple copies of everything as it makes it hard to maintain consistency, and makes troubleshooting these kinds of path and permissions errors harder too.\n\n\n\n\nOn 3/16/16, 5:23 AM, \"urtza.uriarte at upc.edu<mailto:urtza.uriarte at upc.edu>\" <urtza.uriarte at upc.edu<mailto:urtza.uriarte at upc.edu>> wrote:\n\n\n\n\nDear Andy,\n\n\nI have tried with;\n\n\nsudo chmod 664 GenericTranslucent20.dat\nsudo chmod 664 rang.cal\n\n\nsudo chmod 644 GenericTranslucent20.dat\nsudo chmod 644 rang.cal\n\n\nsudo chmod 600 GenericTranslucent20.dat\nsudo chmod 600 rang.cal\n\n\nsudo chmod 700 GenericTranslucent20.dat\nsudo chmod 700 rang.cal\n\n\nand the padlock continues anyway (The files there are in /usr/local/bin/radiance/bin/ and  /usr/local/bin/radiance/lib/, as well). I have tried with rcontrib and it scripts this anyway:\n\n\n\n\nrcontrib -f /usr/share/radiance/klems_int.cal -b 'kbin(-sqrt(.5),sqrt(.5),0,0,0,1)' -bn Nkbins -m windowglow -I+ -ab 2 -ad 512 -lw 2e-5 sc-vi3M_vmx.oct < sc-vi3M.pts > photocells1.vmx\n\n\nrcontrib: fatal - cannot find data file \"GenericTranslucent20.dat\"\n\n\nI do not know what happen but I will continue finding an error (that padlock is very strange).\nThank you very much.\nBest regards,\nUrtza.\n\n\n\n\n\n\nurtza.uriarte at upc.edu<mailto:urtza.uriarte at upc.edu> escribió:\n\n\nDear Andy,\nThank you very much for your instructions.\nI will try with them.\nBest regards,\nUrtza.\n\n\n\n\n\n\nAndy McNeil <mcneil.andrew at gmail.com<mailto:mcneil.andrew at gmail.com>> escribió:\n\n\nUrtza,\nHere's some more information on file ownership and permissions for linux:\nhttp://linuxcommand.org/lc3_lts0090.php\nAndy\n\n\nOn Tue, Mar 15, 2016 at 11:23 AM, Andy McNeil <mcneil.andrew at gmail.com<mailto:mcneil.andrew at gmail.com>> wrote:\nUrtza,\n\n\nYou should open up permissions on those two files like so:\n\n\nsudo chmod 664 GenericTranslucent20.dat\nsudo chmod 664 rang.cal\n\n\nThis changes permissions to allow owner and group read/write and everyone read.\n(you need to be in the directory or give the full path to the file).\n\n\nAndy\n\n\nOn Tue, Mar 15, 2016 at 9:19 AM, <urtza.uriarte at upc.edu<mailto:urtza.uriarte at upc.edu>> wrote:\n\n\nDear Lars,\n\n\nThank you very much for your reply.\n\n\nI tried with Five-Phase method earlier and all command worked. However, now I exported the model from Rhino and I have some materials that they need two specific files. I do not why they do not run without sudo, placing where there are others, as well (They keep always the padlock, I copy there from DIVA's files. They are not from radiance package previously installed). I use oconv, rtrace and rpict with sudo and they work without problem. Nervertheless, if using sudo is not good I remove those materials and I could use rcontrib without sudo.\n\n\nThank you for your suggestions. I read Axel Jacob's tutorials but rereading will be fine.\nBest regards for you,\nUrtza.\n\n\n\n\n\n\n\"Lars O. Grobe\" <grobe at gmx.net<mailto:grobe at gmx.net>> escribió:\n\n\nDear Urtza,\n\n\ntwo comments on your installation - this should be solved before you even start using a complicated combination of commands such as the three-phase method.\n\n\nFirst, with a correct configuration of your system you will not need to run rcontrib as super-user (sudo). Your regular user account just needs read-access to the .dat and .cal files in this case, so why would you not grant the proper permissions?\n\n\nSecond, as rcontrib is not found, what makes you think it is installed? Did you install Radiance from sources, did the build complete without errors, and did you include the directory containing the binaries in your PATH environment variable? Does any other Radiance command work for you?\n\n\nI would recommend having a look at Axel Jacob's set of tutorials first, including the unix-introduction. Otherwise you risk messing up a lot of your models with work-arounds, and even risk the integrity of your system by using sudo where it should definitively not be applied.\n\n\nCheers, Lars.\n\n\n\n\n\n\n\n\nDear experts,\n\n\nI am trying with Three-Phase Method for Simulating Complex Fenestration, following A McNeil tutorial.\n\n\nI am using Ubuntu 14 OS. I need use sudo command because I have GenericTranslucent20.dat material and rang.cal that they are locked anyway. However, when I have launched sudo rcontrib, it scripts that:\n\n\n\n\nsudo rcontrib -f /usr/share/radiance/klems_int.cal -b 'kbin(-sqrt(.5),sqrt(.5),0,0,0,1)' -bn Nkbins -m windowglow -I+ -ab 2 -ad 512 -lw 2e-5 sc-vi3M_vmx.oct < sc-vi3M.pts > photocells.vmx\n\n\nsudo: rcontrib: command not found\n\n\n\n\nCould someone say what the problem is? Thank you in advance.\nBest regards,\nUrtza.\n\n\n\n\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-March/011588.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "March 16, 2016 at 09:32AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_011579", "id": "radiance-general_011588"}