{"body": "Greg Ward wrote:\n\n\n> Hi John,\n>\n> The best way to do this is to create a Makefile that manages the \n> creation of auxiliary files needed during rendering (such as meshes).  \n> That way, you only run obj2mesh when you really need to -- i.e., when \n> the input file has changed.  Some have used the trick of inserting \n> inline commands in their Radiance scenes that don't actually produce \n> any output, but update some file (such as a luminaire), but I don't \n> recommend this practice as it makes loading of the scene just that \n> much slower, and it generates a warning message, besides.\n>\n> A simple Makefile might look like the following:\n>\n> # John's first Makefile\n>\n> view:    myscene.oct\n>     rad -o x11 myscene.rif\n\n\nminor NB: Tradtionally, the space in front of the command (\"rad -o\") has \nto be a 'tab' (not 'spaces').\n\n\nFor those with time and interest, the GNU make manual at  \nhttp://www.gnu.org/software/make/manual/  might be highly recommended. \nPrint, bound and put it next to the K&R C-book on the shelf. Make allows \nnicely compact (thru slightly magically at first glance) ways to specify \nhow to generate your Radiance results from input scenes. Very handy to \nre-understand what one had done at that (already archived) project a \ncouple of months/years ago.\nTechnically there are other make implementations around; their core is \ncompatible, while GNU's make has some nice features others don't have, \nand it should be available on all platforms. \"scons\" was mentioned by \nsome folks as a replacement of make, - I don't know about its \ncapabilities, other that it runs on Windows.\n\n\n-Peter\n\n\n\n\n pab-opto, Freiburg, Germany, http://www.pab-opto.de\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-March/001535.html).</sup>", "attachments": [], "created_by_name": "Peter Apian-Bennewitz", "created_at": "March 24, 2004 at 10:24AM", "created_by": "Peter_Apian-Bennewitz", "parent_id": "radiance-general_001532", "id": "radiance-general_001535"}