{"body": "Hi Mark,\n\n\nIs your high-res image an hdr? If so would it be worth looking into \nmksource to recover broad areas of the sky (clusters of star) as illum \nsources? Then your high res image can be mapped onto a glow source with \nthe lighting provided by a set of illum sources (multiple ones with \nvarying solid angles), derived from the hdr.\n\n\n-Jack de Valpine\n\n\n\n\nMark Stock wrote:\n> Hello,\n>\n> I am working on a star map for use with night renderings, and it seems \n> like it should be decomposed into two layers: one is a high-resolution \n> imagemap showing the stars themselves, the other is a low-resolution \n> \"light map\" that should be used to actually illuminate the scene.\n>\n> The problem is that I want the \"light map\" layer to do the \n> illumination, but I don't want it to be visible. I want the image map \n> to appear in the sky in the final rendering.\n>\n> I know that I can use maxrad=-1 in the image map glow source to \n> prevent it from contributing to scene illumination, and maxrad=0 to \n> allow the light map to illuminate. But mixfunc must be placed between \n> the colorpict and the glow source, forcing me to either allow both to \n> illuminate, or neither. But when the imagemap contributes to \n> illumination, the result is very noisy (obviously).\n>\n> This wouldn't be a problem if I could use two sky-dome sized glow \n> sources in the same scene: \"skyglow source skydome 0 0 4 0 0 1 360\". \n> But Radiance only sees the last one to be defined.\n>\n> And I can't make the light map into an \"illum\" because it then gets \n> treated as a point source at the zenith of my \"source\" description \n> (ignoring the 180-degree size of the source disc).\n>\n> Do I need to add transparency to the imagemap before making it into a \n> rad=-1 glow source, so that when a ray is traced between the stars, it \n> hits the illuminating light map rad=0 glow source? I am reluctant to \n> include another circa-gigabyte imagemap to the scene just for that.\n>\n> Am I missing something else or is this impossible?\n>\n> Mark\n>\n> PS. Shouldn't the file size limit for colorpict images be raised? I \n> get a warning for using even a 134MB picture file. I intend to go much \n> larger.\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\n\n\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-September/006217.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "September 14, 2009 at 01:51PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_006216", "id": "radiance-general_006217"}