{"body": "In the Radiance validation I carried out using measured sky luminances, I\nalso tested a number of sky models including Perez (gendaylit).\n\n\nOf the 754 skies, there were 41 for which the Perez model description could\neither not be generated (outside parameter range - 27 skies) or which produced\nnegative vertical illuminances (14 skies). These were eliminated from the analysis\nfor this model leaving 713 skies. The negative vertical illuminances\nresulted from distortions in the sky luminance distribution that can\noccur unexpectedly for certain combinations of input parameters. These\nparameter combinations were present in the data collected by the BRE \nbut they were not encountered in the Berkeley data that were used to \nderive the model. This effect was noted by Littlefair and an \nadjustment to the model to prevent this distortion was advised by \nPerez. A routine examination of the gendaylit code showed this fix\nto be present.  So it would appear not to correct all occurrences.\n\n\nThe presence of a distortion was taken to be a negative value for any\nof the predicted vertical illuminances. The actual luminance distribution\nfor the sky was not examined. So the possibility remains that some of\nthe other skies may yet have exhibited some distortion.\n\n\nThe distortion manifested itself, weirdly, as a region of -ve luminance\nsky that could be seen in rview as a conspicuous strangely coloured patch.\nNote, Radiance (v2.4) didn't complain that -ve luminances were encountered\nwhen rays 'hit' the glow material.  Which is fair enough, who'd expect -ve\nluminances to be present?  Also, -ve luminances notwithstanding, the diffuse\nhorizontal illuminance predicted using rtrace was *correct*.  So, other\nparts of the sky were no doubt high (+ve) luminance to compensate.  As\nnoted above, a minimum test that distortions were not present would be \nreasonable predictions for vertical illuminances from the Perez sky.  To\nbe certain, you'd really have to test individual rays that sampled the\nhemisphere.\n\n\nThe above is a report of what happened. I'm not suggesting that Perez/gendaylit\nshould not be used.  In fact, as far as I recall, the parameters that led\nto these distortions were also around sunrise/sunset with diffuse horizontal\nilluminances of only a few klux - not a big deal for daylighting/energy calcs.\nRather, i'd caution that strange things can happen (or at least did) when gendaylit\nis (was) routinely used to generate skies from measured data.\n\n\nFor desperate insomniacs, sky model tests (Chapter 5) and other stuff can\nbe downloaded from here:\n\n\nhttp://www.iesd.dmu.ac.uk/~jm/zxcv-thesis/\n\n\nSleep well....\n\n\n-John Mardaljevic\n\n\n\n\nDr. John Mardaljevic                     \nSenior Research Fellow\nInstitute of Energy and Sustainable Development\nDe Montfort University\nScraptoft\nLeicester LE7 9SU, UK\n+44 (0) 116 257 7972   \n+44 (0) 116 257 7981 (fax)\n\n\njm@dmu.ac.uk   \nhttp://www.iesd.dmu.ac.uk/~jm\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-June/000312.html).</sup>", "attachments": [], "created_by_name": "John Mardaljevic", "created_at": "June 13, 2002 at 03:00PM", "created_by": "John_Mardaljevic", "parent_id": "radiance-general_000309", "id": "radiance-general_000312"}