{"body": "Hi Alejandro,\n\n\nthe question is not that easy... Usually you compare two cases and then \nlook for the differences (as you want to do)\nBut the first question is, what is the \"reference\" you want to compare \nto. A comparison with a black surface is definitely not \"fair\" - it \noverestimates the influence of the facade. I would rather use a case \nwithout an opposite building or using one with a diffuse surface (but \nthen again, what color do you assume as \"reference\"... if you are on \ngreece islands, this would be white around 70% reflectance, in northern \nGermany red brick around 20% reflectance...). So not to end in \ndiscussions about a meaningful reference, I would go for the \"no \nbuilding\" reference. So then you have two cases and you end up with two \ndifferent values, so you can state \"the facade causes an increase of the \nDGP by XX compared to an unobstructed view to the surrounding.\n\n\nIf you are dealing with specular reflections of the sun on your facade, \nthen you have to be careful to use a larger image size.  (at least \n1200x1200, better 1500x1500 in order to have enough pixels to see the \nreflexion of the sun)- even evalglare is getting very slow. and be \ncareful about pixel sampling, jittering settings and the -lw limit.\n\n\nAnd just to be sure - don't use any of the existing simplified methods \nto calculate DGP (they are not based on a full rendering), because they \nare based on illuminance calculations using rtrace -I - in that case you \nwill miss the specular reflection of the sun (it doesn't matter if it is \nglass, plastic or metal) if you don't use a special material mix on your \nsurface containing also the mirror material.\n\n\nAnd finally: Be aware, that DGP is just a measure for discomfort glare \nINSIDE a building. It does not include disability glare and is also no \nmeasure for discomfort glare OUTSIDE a building, where you have much \nhigher adaptation levels.\n\n\nBest,\n\n\nJan\n\n\n\n\nAm 4/22/15 um 4:21 PM schrieb J. Alstan Jakubiec:\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-April/010847.html).</sup>", "attachments": [], "created_by_name": "Jan Wienold", "created_at": "April 22, 2015 at 09:07AM", "created_by": "Jan_Wienold", "parent_id": "radiance-general_010844", "id": "radiance-general_010847"}