{"body": "Hi Christian,\n\n\nIt sounds like we're back on track, here.  I'm relieved.\n\n\n> 1. I have reflectance values for surfaces in XYZ. Measured with an  \n> spectrofotometer with a D65 test source inside. Actually it was the  \n> same\n>   Minolta CM-2002 as in your paper. I have data with and without  \n> the specular component. (SCI or SCE) Which on would you suggest or  \n> does it depend on the surface?\n\n\nI typically use the SCE to get the diffuse and the difference between  \nthe SCI and SCE (specular included and excluded) measurements to get  \nthe specular reflectance component, but it only works for fairly  \nsmooth surfaces.  If a surface is too rough, the components get mixed  \nin the glossy reflection, which ends up being larger than the  \nspecular trap in the CM-2002.\n\n\nFor non-metals, the SCE value is better for determining the surface  \ncolor.  For metallic surfaces, I would use SCI.\n\n\n> 2. These surfaces are to be seen in a scene with sources which have  \n> color temperatures ranging from 2400 to 3000 Kelvin.\n>    For these sources i calculated the xy coordinates with  \n> blackbody.cal.\n>   3. I think this is the first problem.  The reflectance values for  \n> the surfaces should have been measured with a tungsten test  \n> illuminant in the spectrofotometer.\n>    And the spectral data would have been better than XYZ. Is that  \n> right?\n\n\nDid you erase the info. from the CM-2002?  Maybe the spectral data is  \nstill there.  It would be better to use it if you have it.  Even if  \nyou used a tungsten illuminant to determine the XYZ value, shifting  \nto a different illuminant without the spectral data is a shaky business.\n\n\n> 4. As i understand you in your conversation with Will, the  \n> premultiplying part is only efficient if i would have spectral  \n> data. If i have only XYZ data, i convert both reflectance values  \n> and color values of the sources to Sharp RGB color space like so:\n> rcalc    -f xyz_rgb.cal      -f Sharp.cal    -e '$1=R($1,$2,$3);  \n> $2=G($1,$2,$3);  $3=B($1,$2,$3);'\n\n\nThis is correct.\n\n\n> 5. Now i render my picture and add the correct primaries to the  \n> picture header with your suggested script. (addSharp.csh)\n\n\nRight.\n\n\n> 6. When i call 'ximage' with rtrace -I, i should get the right  \n> illuminance values or not?\n\n\nUmm...  It doesn't matter what you give to ximage at that point,  \nsince you're having rtrace do the calculation.  This is  just as  \nwell, since ximage ignores the color primary and white point  \ninformation in the picture header, and would report (slightly) wrong  \nluminance with the 'l' command starting from anything besides  \nRadiance RGB color space.\n\n\n> 7. To change the primaries for a special display i use 'pcond'  \n> later. I guess 'pcond' does a white point transformation?\n\n\nYes.  It performs a proper von Kries transformation, using the Sharp  \ncolor adaptation matrix.\n\n\n> 8. Does 'normtiff' does a white point transformation as well?\n\n\nYes.  If a Radiance converter takes a -p option with 6 arguments,  \nthen it's doing color and white point conversion.\n\n\n> Would this procedure be the best what i can get out if my data for  \n> \"correct\" color display?\n\n\nI think so.  I won't make you any warranties, though.  Without  \nspectral data, the accuracy is going to be highly dependent on your  \nparticular materials.\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-April/003613.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "April 27, 2006 at 04:03PM", "created_by": "Greg_Ward", "parent_id": "radiance-general_003612", "id": "radiance-general_003613"}