{"body": "Hi Anthony, Jack,\n\n\nWhat Jack says about simulating light pipes is right.  simulating these with radiance in general will not work.  i haven't tried the photon map, but sounds like it should work for you there.\n\n\nregards modelling prismatics or similar materials, there are a couple of cal-files that can help.  prism.cal is part of the standard radiance distribution, and allows the modelling of prismatic glazing, using the prism2 material primitive.  lcp0.cal is another (not part of the standard distribution but i can supply it) that models laser cut light redirecting panels (LCPs).  this also is for use with the prism2 material primitive.\n\n\nthe use of each of these cal files is not simple.  it requires manual editing of scene files, careful orientation of geometry and material definitions and knowledge of the form of the prismatic or laser cut panel being modelled.\n\n\nlet us know if you would like the LCP cal file, or more help creating prism2 definitions.\nPhil.\n\n\n_______________________________\nPhillip Greenup\nSpecialist Engineer\nArup Australasia\nLevel 10, 201 Kent St\nSydney NSW 2000\nPh (02) 9320 9426\nFax (02) 9320 9321\n\n\n\n\n>>> Jack de Valpine <jedev@visarc.com> 25/02/2004 1:37:34 am >>>\nHi Anthony,\n\n\nTo simulate the perfomance of things like light pipes, you need to use a \ntool with forward raytracing capabilities, radiance in its classic form \nis a backward raytracer:\n\n\n    * forward raytracing - trace rays from sources in scene to eyepoint\n    * backward raytracing  - trace rays from eyepoint back into scene\n\n\nOne way to do forward raytracing is \"photon mapping.\" Roland Schregle \nhas written an extension to radiance that performs photon mapping:\n\n\n    * http://www.radiance-online.org/ see \"examples & extensions\" in the\n      software section\n    * http://www.ise.fhg.de/alt-aber-aktiv/radiance/photon-map/ \n\n\nSince this is an extension to the core radiance engine, this will \nrequire moving beyond Desktop Radiance.\n\n\nNote there are two prism material types in Radiance: prism1 and prism2. \nThese would probably be useful for defining the properties of the \nprismatic glazing, the trick is acquiring perfomance data for the \nphysical material(s) and correctly modeling the behavior with these \nradiance material types. I have not really used these material types \nbefore. However there should be others in the group who can provide \nfeedback to you.\n\n\nIt is also possble the depending on how you breakdown your problem that \nthere are simpler ways to do what you want. For example what are the key \nissues of what you are trying to simulate and evaluate:\n\n\n    * properties of light pipe performance - then this probably requires\n      the use of photon mapping\n    * properties of prismatic glazing as enhancers of light distribution\n      - can this be seperated out from the light pipe and evaluated\n      using more classic techniques in standard radiance, in other words\n      can you make some estimates for light output from the side\n      apertures of the light pipe and thus remove the actual simulation\n      of the light pipe behavior?\n\n\nI expect you wil get other input, which I will look forward to reading \nmyself.\n\n\nBest Regards,\n\n\n-Jack de Valpine\n\n\nPS: I have cross posted to radiance-general, to give the discussion \nwider input.\n\n\nAnthony J. Farrell wrote:\n\n\n>Hi folks,\n>\n>I wish to analyse the light distribution to an office room supplied from a\n>light pipe fitted with side apertures.\n>\n>The apertures will contain prismatic glazing or a blind reflector.\n>\n>I have drawn the light pipe using desktop radiance, and made the surface 97%\n>spec ref. as from typical light pipe manufacturers data.\n>\n>I wish to include prismatic glazing or other novel glazing types such as\n>blind reflectors to enhance the light distribution from the side aperture.\n>\n>Can anyone give me some insight as to how I may do this, since the glazing\n>database that comes with desktop radiance only contains common glass types,\n>and not prismatic or such like - perhaps one of you know of a patch for\n>desktop radiance that provides several different prismatic glazing types, or\n>of code for Radiance that includes for it.\n>\n>Thanks, and best regards,\n>\n>Anthony Farrell\n>Dublin Institute of Technology, Ireland.\n>\n>\n>  \n>\n\n\n\n\n#\tJohn E. de Valpine\n#\tpresident\n#\n#\tvisarc incorporated\n#\thttp://www.visarc.com \n#\n#\tchanneling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-February/001483.html).</sup>", "attachments": [], "created_by_name": "Phillip Greenup", "created_at": "February 25, 2004 at 10:14AM", "created_by": "Phillip_Greenup", "parent_id": "radiance-general_001481", "id": "radiance-general_001483"}