{"body": "Hi Tom,\n\n\nThanks for your help. The angles thing has sorted itself out now. I thought i read somewhere that east of south was positive, but obviously not! From my results it makes sense if it were your way.\n\n\nI near enough did what you recommended already, but i dont think i clarified what i wanted judging by your response.\n\n\n>>If I understand you right you want a material with 100 % diffuse transmittance.\n\n\nI am after a material with 100% diffuse reflectance\n\n\nMy material,reflector.rad\n\n\nvoid plastic reflector_mat\n0\n0\n5 1 1 1 0 0 \n\n\nreflector_mat ring reflector\n0\n0\n8 0 0 0\n  0 -1 0\n  5 0\n\n\nAn example of one of my xforms,\n\n\n!xform -n reflector -t 0 0 10 -rz 38 -rx -48.8 reflector.rad\n\n\nThese angles are following the azimuth and altitude of the sun, i used rz and rx because of the way my ring was made. I have made my plastic material with a 0,0 spec and roughness value to get a perflectly reflecting diffuse surface (r,g,b are 1,1,1). Im now aim to look directly at my surface and measure the luminance from it.\n\n\nThere isnt really a question in this email, just thought id reply to yours, thanks for your help!\n\n\nChris\n\n\n\n\n\n\nThis e-mail and any attachments may contain confidential and/or\nprivileged material; it is for the intended addressee(s) only.\nIf you are not a named addressee, you must not use, retain or\ndisclose such information.\n\n\nNPL Management Ltd cannot guarantee that the e-mail or any\nattachments are free from viruses.\n\n\nNPL Management Ltd. Registered in England and Wales. No: 2937881\nRegistered Office: Serco House, 16 Bartley Wood Business Park,\n                   Hook, Hampshire, United Kingdom  RG27 9UY\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-July/003839.html).</sup>", "attachments": [], "created_by_name": "Chris Foster", "created_at": "July 25, 2006 at 10:29AM", "created_by": "Chris_Foster", "parent_id": "radiance-general_003830", "id": "radiance-general_003839"}