{"body": "Hi Mark!\n> Yes, I have that paper. I aim to include the atmospheric horizon glow \n> in another step (mixfunc with the stars), and not even include the \n> stars when their influence is negligible. The illumination from the \n> stars will also only be effective when there is no moon (or a new moon).\n\n\nSo would you expect any difference when using stars clustered into \ngroups by mksource and just averaging all the stars contribution over \nthe whole hemisphere?\n\n\nOne way would be to use mkillum on a facetted hemisphere. The resolution \nof this hemisphere could be adjusted (use gensurf) until you see no \nfurther improvements by increasing the resolution. I guess running \nmksource would create more or less the same result, as there will not be \nvery concentrated regions on the night sky that mksource could optimize \nfor. Maybe you would use the 145-patch sky dome for mkillum.\n\n\nOne other way you could go (please do not beat me for this Greg, I know \nthat I tend to do funny things with Radiance :-) ) is to create such a \nsimplified but correct sky dome, and using the photon map extension \ncreate a global photon map for your scene that will account for the \nambient calculation (the one which gets noisy with the high-res image \nmap). Then you replace the simplified sky dome by the one showing all \ndetail, but keeping the old global pmap render our image. This should \ngive a good result, as for the direct calculation having the high-res \nimage map does not cause problems. To help distributing the photons in \nthe first step, creating a big photon-port box around the area that will \nbe visible in your image would be very helpful of course.\n\n\nI am not sure whether it is possible to force radiance to reuse an \nambient file without doing further refinement on it (ok, no it gets \nevil...). I would guess that you could do the trick I tried with the \nphoton map by rendering the image first with the simplified glow sky, \nfilling up your ambient file (without the noise that you would get from \nthe high-res light probe). If you would re-use this ambient file in a \nsecond step with the high-res map, even if new values are written to it \nthere should be much less noise, and in my understanding the result \nshould still be correct. But - I have not tried it... ;-) Any comments \non this?\n\n\nCheers,\n\n\nLars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-September/006224.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "September 15, 2009 at 06:40PM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_006216", "id": "radiance-general_006224"}