{"body": "Hi Francesco,\n\n\n> Details of the Redhat 9 NFS system are here:\n> http://www.redhat.com/docs/manuals/linux/RHL-9-Manual/ref-guide/ch-nfs.html\n>\n> NFSv3 is the default, so I guess it is the one used (I'm not the\n> administrator of the cluster), but it is also possible to use NFSv2.\n>   \nI am quite sure that you must use NFSv3.\n> I need to check what's in the /etc/exports file, now that I think about\n> it. Changing sync/async and wdelay/no_wdelay could have some effect.\n>   \nI have struggled with NFS based file locking (on Linux) on and off for \nquite some time. Most of our work usually uses smp nodes so this is \nnormally not an issue.\nBut I have been looking back into this more recently for some cluster \nbased rendering. I would seriously suggest taking a look at:\n\n\n    http://nfs.sourceforge.net/\n\n\nWhich has a fairly extensive set of information on NFS.\n\n\nFor locking to work correctly I am pretty sure that you need to specify \nthe (sync) option on the server and/or the client side. However NFSv3 is \nsupposed to do sync by default as apposed to v2 which did aysnc. The \nlatter is faster however leads to a wide variety of issues. It is quite \nlikely that you also need to specify the (noac) option, which means that \nthe client is not caching file status information instead it always goes \nto the server to check the file status. Both of these options together \nmake things slow... To improve performance I believe that you can do a \ncouple of things: 1) increase number of nfsd processes available to \nhandle requests and 2) specify larger rsize and wsize (assuming a fast \nnetwork transport).\n> >From the client side, initially the options were \n> rw,soft,bg\n> I think now they are more like  \n> rsize=8192, wsize=8192, auto, user, rw\n>\n>   \nI read somewhere, that (hard,intr) is preferable but I will have to look \nthis up.\n\n\nPlease note that I have been trying to read up on this as well as other \nshared filesystems, I have not had a chance to test a lot of this out. I \nwould be interested to hear what you learn.\n\n\n-Jack\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-September/003941.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "September 02, 2006 at 02:33AM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_003935", "id": "radiance-general_003941"}