{"body": "On 20.02.2006, at 18:18, Gregory J. Ward wrote:\n\n\n> Hi Thomas,\n>\n> As I indicated in my last e-mail, which you must not have received\n> before sending this one, it is simplest to correct for the difference\n> in (u,v) coordinates in the Radiance pattern specification.  There\n> is no need to either modify obj2mesh or the .OBJ exporter to obtain\n> a correct mapping.  Radiance coordinate mappings are programmable\n> for a reason...\n\n\nI received you message 15 minutes to late. Anyway I changed it now\naccording to your example (that could be included in the man-page,\nbtw.).\n\n\n> If you want to create a utility to automate the process, I suggest\n> creating one that converts the texture input to Radiance picture\n> format, simultaneously outputting an appropriate material/pattern\n> definition, which must be served as an input to obj2mesh, anyway.\n\n\nI have done that already. I can't count on the existence of the\ntexture image in the filesystem (could be stored in the Blender\nscene file) so the image is created if necessary, converted to\nHDR and saved as a resource for the Radiance scene.\n\n\nOptionally I could apply 'normpat' as well but the default texture\n(rgb = 0.9) does not need that. The image aspect is now part of\nthe texture definition as well.\n\n\n> If you're ambitious, you could even look into translating the\n> material parameters to Radiance's physically-based model. Does\n> this make sense?\n\n\nWe thought about that but the material definitions used in Blender\n(and probably all other 3D modelers) are only useful to define\na nice looking material, not one that's physically correct. We\nwill use a 'library' instead and define the Radiance description\nby assignment or name.\n\n\nSame thing with luminaires BTW. The typical 3D object 'lamp' has\nnot enough information to define a real world luminaire. Our\nlibrary backend for luminaires may be the topic of another post\nin a few days.\n\n\n\n\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-February/003428.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "February 20, 2006 at 07:31PM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_003425", "id": "radiance-general_003428"}