{"body": "Hi Randolph,\n\n\nyour header looks ok, I just wanted to be sure there are no \"technical\" \nreasons for the strange behavior (e.g. a tab in from of a EXPOSURE or \nmultiple exposures might cause troubles.)\n\n\nThe trouble you run into is, that you detect a lot of glare pixels. It \nseems your selected task area is rather dark (average luminance in that \narea is 26cd/m2), that means in that case all pixels above 26*5=128cd/m2 \nare treated as potential glare sources. So around 80-90% of the image is \ntreated as glare source pixels and since you don't have any pixel over \n50000 cd/m2 (max is 13559) all these pixels are summarized to one glare \nsource.\n\n\nI don't know details about your scene (maybe you can send me also an \nexample image), but I would assume that the luminance of the task area \nyou have defined does not correspond to the adaptation luminance, which \nI expect to be higher in an environment with an average luminance of 636 \ncd/m2.\nI guess if you look at the output image, more or less everything except \nthe area you have defined is treated as glare source.\nIf the space is used in a usual way (lets say similar like office tasks, \ncomputer or reading tasks), then the applied setting is not working \nproperly. If the task is a computer screen, then probably you have to \nincrease the luminance of the screen to 120-200cd/m2. If the 25 cd/m2 is \nrealistic (e.g. you have a dark screen) then I would probably apply a \nfixed value (e.g. 2000cd/m2) as threshold for the glare source detection \n(-b 2000). Or just run evalglare without any task option, in that case \nany pixel larger than 5*636=3180cd/m2 is treated as a glare source. This \nmight lead to more realistic glare sources.\nIn principal it is good to check which parts of the scene are detected \nas glare pixels, that's why I integrated the -c option (coloring the \ndetected glare sources) from the beginning, because algorithms can \nalways fail and the detection of realistic glare sources in any kind of \nscene is a rather challenging task. That's why I also have implemented \nthree detection options (fixed threshold, average luminance threshold \nand the task area threshold method). In my experiments, the task area \noption worked best, but in other situations (probably like yours) it \nmight be better to apply another algorithm.\n\n\nWith less detected pixels you have also much less calculation time, \nwhich was your original concern. The scenes I'm evaluating usually, the \ncalculation time mostly does not exceed 30s. For the annual glare \nevaluation using DGP, I've developed another method where the generation \nof the image and the evalglare evaluation takes in average less than a \nsecond in total for one timestep , based on a simplified image (-ab 0) \nand daylight coefficient method to derive the illuminance at eye level \n(based on daysim, but this can be done also with the 3 or 5 phase method).\n\n\nBut important to know: If you expect, that the contrast between task \n(e.g. if the 25cd/m2 are \"real\" and people would adapt to this level) \nand background (e.g. 1000cd/m2) is a problem, then I'm afraid that none \nof the existing glare metrics will detect that properly -even if you \nadjust the parameters and glare sources are detected more realistically. \nWe are currently planning experiments to overcome this problem, but this \nneeds some time to improve the existing models.\n\n\nJan\n\n\n\n\n\n\n\n\n\n\n\n\nOn 12/04/16 05:22, Randolph M. Fritz wrote:\n> Here you go. Unfortunately, the gmail's web client doesn't preserve\n> tabs, but maybe this will do. If not, let me know and I will get you\n> the exact file.\n>\n> Getinfo:\n> #?RADIANCE\n> CAPDATE= 2016:04:11 19:51:15\n> GMT= 2016:04:12 02:51:15\n> evalglare -t 500 500 0.541052 -vf screen_w.vf -d -c gc.hdr gltw0014.hdr\n> evalglare 1.17 release 15.07.2015 by EPFL, J.Wienold\n> VIEW= -vth -vp 1.033 0.6043 1.018 -vd -0.5 0 -0.05 -vu 0 0 1 -vh 180\n> -vv 180 -vo 0 -va 0 -vs 0 -vl 0\n> FORMAT=32-bit_rle_rgbe\n>\n> stdout:\n> 1 No pixels x-pos y-pos L_s Omega_s Posindx L_b L_t E_vert Edir\n> Max_Lum Sigma xdir ydir zdir Eglare_cie Lveil_cie\n> 1 596380.000000 489.332038 454.899168 772.713096 4.8394297435 1.186575\n> 58.877235 25.889767 1531.311361 1495.264730 13559.250000 5.358756\n> -0.999743 -0.021000 -0.008520 1495.264730 520.702975 5.358756\n> dgp,av_lum,E_v,lum_backg,E_v_dir,dgi,ugr,vcp,cgi,lum_sources,omega_sources,Lveil,Lveil_cie,band_avlum:\n> 0.296236 636.826041 1531.311361 58.877235 1495.264730 24.791222\n> 31.521862 0.000000 32.233898 772.713096 4.839430 3473.890869\n> 520.702975 -99.000000\n>\n> stderr was blank. A BSDF proxy surface was in the image.\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\nDr.-Ing.  Jan Wienold\nEcole Polytechnique Fédérale de Lausanne (EPFL)\nEPFL ENAC IA LIPID\n\n\nhttp://people.epfl.ch/jan.wienold\nLE 1 111 (Office)\nPhone    +41 21 69 30849\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-April/011681.html).</sup>", "attachments": [], "created_by_name": "Jan Wienold", "created_at": "April 12, 2016 at 06:50AM", "created_by": "Jan_Wienold", "parent_id": "radiance-general_011677", "id": "radiance-general_011681"}