{"body": "Hi Achim.\n\n\nThe description of your project makes the situation clearer.\n\n\nOn Thu, Nov 26, 2009 at 9:52 AM, Achim Geissler\n<achim.geissler at intergga.ch> wrote:\n> What I want to do is this: I have a large building with external shading\n> that has a non-trivial geometric form. This shading is to be opened (to a\n> certain degree) at a given azimuth only if no direct radiation which would\n> hit the facade can get past in this location. So the task is to let the sun\n> travel around the building and for each position of interest check if any\n> direct hits can be found on any surface of the building façade behind the\n> shading.\n\n\nBoth options I mentioned could be used here:\n\n\nA - stencil:\n1) based on a view of the building facade you generate x,y,z coordinates\n    (sensor points). The resolution of your sensor points depends on the\n    view and image specification; it has it's limits but compared to a grid\n    it should be better. You can probably restrict the area to test to a\n    representive patch.\n2) the direction is the surface normal at that point\n3) with -ab 0 and only the sun (no sky dome) you create an image\n4) If any of your image points is bright (not 0) you have a hit. You can\n    use pvalue to do this automatically or just look at the image.\n\n\nB - search for material:\n1) define grid resolution to apply to building facade\n2) use sun direction as test direction\n3) use rtrace with -os (surface) or -oM (material) and without -I+\n4) if you get a \"sun\" or \"solar\" for any of the points you have a hit\n\n\nC - combined method:\n1) from stencil to create the grid points\n2), 3), 4) as B\n\n\n> Your suggestion seems to imply that this should be possible with rtrace.\n> Does setting -dr 0 mean that only direct beams are considered by rtrace? Or\n> does one need a good combination of -ds, -dt and -dc? The sun is the only\n> \"active\" source of light. I would set reflection of all shading surfaces to\n> Zero.\n\n\nIn the second case all these settings do not matter. We are using the\noutput format spec to let rtrace report about the material it hits instead\nof the radiance of that surface. For the stencil method I do not think\nthese settings are an issue because you only have the sun in the sky\nand a single light source is tested automatically by rtrace. I might be\nwrong, though.\n\n\n> I am not sure what your input example describes. Having the material names\n> of \"hit\" surfaces given would seem O.K. if this can be constrained to\n> \"direct\" only, as the goal is to have \"no direct hit\".\n\n\nIn the example I \"tested\" 3 directions from point (0,0,0).\nIn an rtrace output you would have 3 lines of materials.\nAssuming that the sky material is called \"skyglow\" only\nthe first ray actually hits the sky. You can name the materials\nas you like, of course. In fact, I don't use a sky at all and\nlook for \"*\" in the output which rtrace reports if it doesn't hit\nanything.\n\n\n\n\nRegards,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-November/006363.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "November 26, 2009 at 04:57AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_006346", "id": "radiance-general_006363"}