{"body": "Ciao Stefano!\n\n\nOn Jun 11, 2004, at 6:51 PM, Stefano Callegari wrote:\n>\n> First, are you sure the ies data are correct?\n\n\nIt looks fine to me in two different photometric file viewers, as well \nas in plain text...\n>\n> It seems a symmetric fitting.\n\n\nIt is.  No problems there.  That was just for example.\n\n\n>> http://www.rumblestrip.org/site-img/rad/assym.jpg\n>\n> This time it seems an asymmetric fitting. What you meen with\n> *directional*?\n\n\nSorry, I mean exactly the same thing, asymmetric.\n\n\n>> Eureka!  I have defied physics!  It was after looking at this image \n>> that\n>> I re-checked the ies file, and discovered that it's the LM-63-95 spec.\n>> This is a problem, because the spec calls for the 0-180 vertical plane\n>> to be oriented parallel to the lamp axis, whereas it's more common to\n>> orient it perpendicular.  ies2rad can't even have a check for this,\n>\n> It's right, the 0-180 plane normally must be oriented parallel to the\n> lamp axis. This is a general rule to point right the fitting.\n\n\nDepends on which version of the IES spec you reference, and this is the \nwhole problem.  There is a good bit about it in Ian Ashdown's Lightfair \npresentation \"Thinking Photometrically\".  A link to the course notes is \nat the bottom of the page referenced by this url (there is also an \nexcellent summary of the IES file format in there):  \nhttp://www.helios32.com/resources.htm\n\n\nI have cribbed from these course notes the following section 3.6.2, \n\"Luminaire Orientation and Position\":\n\n\n\"Given a luminaire with an asymmetric luminous flux distribution (such \nas a fluorescent  wall-washer), it is essential to orient the luminaire \ncorrectly in a CAD model.  Unfortunately, this can be more difficult \nthan you might expect.\n\n\n\"The first problem is that the various IESNA LM-series documents \nprovide contradictory  specifications on how the photometric web is to \nbe oriented with respect to the physical  outline of a luminaire.  For \nexample, IESNA LM-63-95 implies (but does not specify) that the 0–180 \ndegree  vertical plane of the photometric web is oriented parallel to \nthe lamp axis of linear  fluorescent luminaires. If the luminous flux \ndistribution is bilaterally symmetric about the  90–270 degree vertical \nplane (that is, perpendicular to the lamp axis), then the horizontal \nangles must be reported from 90 to 270 degrees.\n\n\n\"However, IESNA LM-41-98 recommends (but does not specify) that the \nphotometric web  for such luminaires be oriented perpendicular to the \nlamp axis, with 0 degrees being the “beam side.”  Most (but not all) \nfluorescent lighting manufacturers have ignored IESNA LM-63-95 and  \nfollowed the recommendation of IESNA LM-41-98. This means that the \nlighting design  software program user must manually examine the IESNA \nLM-63 text file to see whether  the photometric web is oriented \nparallel or perpendicular to the lamps axis. If this  information is \nnot stated in the file header, the user may have to contact the \nluminaire  manufacturer.\"\n   - From Ian Ashdown's \"Thinking Photometrically\"\n\n\nSo, I guess we could call it a faulty file, but really it seems to me \nto be a difference in opinion as to how the photometric web is supposed \nto be arranged, between the manufacturer that supplied this IES file, \nand the IES spec. Or am I missing something (else)?\n\n\n-Rob G.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-June/001808.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "June 12, 2004 at 04:19AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_001805", "id": "radiance-general_001808"}