{"body": "Mark de la Fuente wrote:\n> Hi group,\n>  \n> Just curious if anyone has tried this before.\n>  \n> I need to make a diagram showing where direct sunlight hits the floor in \n> a room with an odd skylight.  I have a basic idea just from using a \n> solar chart, but I would like to accurately illustrate every possible \n> sun patch location.\n>  \n> My thought was to make a loop where I render all possible sun positions \n> for half the year (renderings with sun only, no sky, and with -av 0 0 \n> 0 -ab 0) and add all the images together as I go.  The resulting image \n> would show where the sunlight is falling for the entire year.  Depending \n> on how fine I make my sky changes, this might result in quite a \n> few calculations.  (6 months x 16 hrs per day =  96 calculations.. not \n> too bad)\n>  \n> Has anyone tried to do this before?\n\n\nI've always used animations for that sort of thing, but your idea sounds \ncool.  One thing that you may want to do is actually give your ambient \nvalue a little boost, so that the other surfaces are slightly \nilluminated.  Otherwise, it's tough to tell what you're looking at. The \ndirect sun patch against an all-black background could be tough to place \nin context, depending on what is illuminated by the sun. John M. shared \na tip at last year's workshop too, he used a green-tinted ambient value \n(-av 0 .5 0) so that it's clear what illumination is \"fake\" and what is \ndirect sun.  Giving your model a little \"ambient glow\" with -av will \nmake for a clearer rendering, I think.\n\n\nI've never merged images together like that and would be interested to \nhear how you go about it, and what issues there are to consider, such as \nexposure & filtering.  I'd love to see what you come up with.  This \ncould be a useful tool.\n\n\nP.S.\nSince you're doing -ab 0, the number of calculations shouldn't be a \ncause for alarm, the direct calculation is really fast.\n\n\n\n\n\n\n      Rob Guglielmetti\n\n\ne. rpg at rumblestrip.org\nw. www.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-October/002081.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "October 28, 2004 at 04:12PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_002080", "id": "radiance-general_002081"}