{"body": "Giovanni,\n\n\nI have the windows version of radiance on my machine.  I don't think it comes with false color.  I believe this is because false color is a c-shell script and windows does not use C-shells, it uses the dos prompt instead.  If I were you, I would look into adding Cygwin to your windows computer and installing radiance within Cygwin.  Then you would have the full functionality of radiance on a windows machine.  (This is what I do and it works great)  (And is free)  You could also set up a dual boot on your machine and either boot radiance or boot linux (not a practical solution in my opinion) (also free).  Or you could use VMware and run both windows and linux simultaneously.  This is possibly the best option, but I've never tried it since I don't own a copy of VMware. (not free)\n\n\nAs far as the Cygwin option goes, I have not been able to compile radiance on Cygwin myself and have relied on the link below.  I would love to know how it was done.  I have however, been able to compile radiance on Suse Linux...\n\n\nFor Cygwin radiance see...  http://www.dream.unipa.it/dream/pub/dot/anselmo/radiance/03.php and follow the link (http://www.bozzograo.net/radiance/) to the updated binaries.  (Thanks again to Francesco Anselmo for those)\n\n\nFor Cygwin go to www.cygwin.com \n\n\nGood luck!\n\n\nMark de la Fuente\n\n\nPS.. as a side note, I find the hdrview program (http://www.debevec.org/FiatLux/hdrview/) to be very useful as well.  It's too bad you can't print from there though.  Anyone know of a windows viewer that allows you to adjust the exposure of an image and also print?\n\n\n\n\n[{--Wm. Tao & Associates, Inc.--}] This message and content is privileged, intended only for recipients named and/or addressed.  If the receiver/reader is not a representative of the intended recipient, any review, forwarding, dissemination or copying of this message or its content, in part or in whole, is prohibited. If you have received this message in error, please notify the sender immediately by Reply email, and Delete the original message and attachments.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-April/005888.html).</sup>", "attachments": [], "created_by_name": "Mark de la Fuente", "created_at": "April 07, 2009 at 08:24AM", "created_by": "Mark_de_la_Fuente", "parent_id": "radiance-general_005880", "id": "radiance-general_005888"}