{"body": "As Mehlika points out, there are slight differences in destination  \ncolor spaces to account for, but the major one is actually in the  \ncamera itself.  Most manufacturers spend a fair amount of time  \n\"tuning\" their cameras' colors to have a more pleasing, photographic  \nlook, without regard to color accuracy.  In general, I have found the  \nCanon DSLRs to stick fairly close to the sRGB specification,  \nespecially if a \"Neutral\" color setting is used.  Nevertheless,  \nworking from RAW images is a reasonable way to get around most of the  \nin-camera processing that undermines absolute CIE color accuracy.\n\n\nI do not believe that HDRShop does anything to the camera's color  \nspace, other than an attempt to linearize the three channels.  The  \nsame is true of Photosphere, although it does attempt to get an  \nabsolute luminance calibration, and provides features for inputting  \nyour own per-camera or per-image luminance calibration factor.  If  \nyou use dcraw.c or Photoshop's RAW converter in \"don't touch\" sRGB  \ncalibration mode, you should get out something reasonably close to  \nthe sRGB primary color space, provided you have shot with a daylight  \nwhite balance.  (See note below on WB settings.)  I have had good  \nluck using dcraw myself, and found it's color transformations to be  \nfairly reliable.  (See Dave Coffin's website on dcraw.c at <http:// \ncybercom.net/~dcoffin/dcraw/> for code and related links.)  Neither  \nHDRShop nor Photosphere can unscramble the eggs once the colors have  \nbeen messed around in a typical digital camera, and I suspect this is  \nbehind the large delta's in Mehlika's report for primary colors.\n\n\nRegarding white balance, shooting in daylight mode assures that your  \nmeasurement condition matches the sRGB color space, so you have some  \nhome of getting out absolute colorimetry, which naturally will  \ninclude any coloration due to the light source.  In other words, the  \ncamera will measure something like what you would measure with a  \nchroma meter.  If instead you apply an appropriate white balance  \nsetting, e.g. incandescent under tungsten lighting, the camera  \nperforms some sort of von Kries transform (one would hope), bringing  \nneutral colors back to the D65 white point of sRGB.  The problem then  \nis that you would have to know exactly what transform was applied to  \nget back to absolute colors, and in general you cannot know.  For my  \nwork, I shoot with the appropriate white balance when what I care  \nabout is appearance in my HDR results, and I shoot with D65 when I'm  \ngoing for color (and luminance) measurements.  Remember that white  \nbalance will affect the luminance values as well.\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2006-September/000140.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "September 27, 2006 at 10:26AM", "created_by": "Greg_Ward", "parent_id": "hdri_000135", "id": "hdri_000140"}