{"body": "Dear Ery,\n\n\nYou can use evalglare with a regular hdr image as far as I understand it.  \nJan can correct me if I'm wrong :). As Thomas notes, it is best to have  \nthe full hemisphere image, but if you don't have such an image, you can  \nstill get pretty good results with a couple of steps:\n\n\n1. Make sure your hdr is calibrated to photometric units of cd/m2. Doyle  \nand Reinhart also have a pretty reasonable tutorial on doing this using  \nPhotosphere:  \nhttp://www.gsd.harvard.edu/research/gsdsquare/Publications/HDR_II_Photosphere.pdf\n2. You'll want to make sure that in the header to your HDR, it has a  \nRadiance view type that is pretty close to the opening angle of the camera  \nlens you are using. An example will be something like, \"VIEW= -vtv -vh 60  \n-vv 40\" which are some parameters I just pulled from a random  \nrpict-generated image on my computer. In the ideal case, your view type  \nwould be the angular fisheye, \"-vta -vh 180 -vv 180\". I think that this is  \nautomatically taken care of to some degree by Photosphere, but its worth  \nchecking before using your images for analysis.\n3. It is also useful to have an illuminance reading from the time the  \nphoto was taken. The DGP calculations rely on total vertical eye  \nilluminance and contrast. Usually, the illumimance at the eye is  \ncalculated directly from the fisheye image, but when you don't have a view  \nencompassing a hemisphere, you can provide the illuminance separately by  \ncalling evalglare as, \"evalglare -i VerticalEyeIllumianance file.hdr.\"\n\n\nBest,\nAlstan\n\n\nOn Mon, 06 Feb 2012 21:26:49 -0500, Thomas Bleicher  \n<tbleicher at googlemail.com> wrote:\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2012-February/008349.html).</sup>", "attachments": [], "created_by_name": "Alstan Jakubiec", "created_at": "February 06, 2012 at 06:52PM", "created_by": "Alstan_Jakubiec", "parent_id": "radiance-general_008346", "id": "radiance-general_008349"}