{"body": "If you can get ahold of a Unix-based system, be it a Mac running OSX or a Linux system, your experience will likely be better, yes. But I do think that with the latest installer we provide here (https://github.com/NREL/Radiance/releases/tag/5.0.a.3) and the \"Git Bash shell\" from here (https://msysgit.github.io/), you could get pretty darn close to the same experience as you would on *nix.\n\n\nGood luck!\n\n\n- Rob\n\n\nOn 5/18/15, 1:44 AM, \"urtza.uriarte at upc.edu<mailto:urtza.uriarte at upc.edu>\" <urtza.uriarte at upc.edu<mailto:urtza.uriarte at upc.edu>> wrote:\n\n\n\n\nHi everybody,\n\n\nThanks for your suggestions. I have a doubt for a month when I have started using Radiance. Is Linux advisable to use for Radiance? Perhaps, it may in the long run be better.\n\n\nKind regards!\nUrtza.\n\n\n\n\n\n\n\"Guglielmetti, Robert\" <Robert.Guglielmetti at nrel.gov<mailto:Robert.Guglielmetti at nrel.gov>> escribió:\n\n\nHi Chris,\n\n\nThe main advantages I see in using Git's Bash shell for Windows are\nsmaller footprint, easier installation, and tighter integration. I haven't\ndone extensive testing, but it seems like the Git Bash shell gives Windows\nusers a more similar and compatible experience to that of the Unix user,\npotentially allowing folks to use things like Andy McNeil's tutorials,\nas-written.\n\n\nThe installer is 17MB and just *works*, adding a shortcut to a \"Git Bash\"\ncommand prompt. Once fired up, you have access to your existing file\nsystem, and all the basic CLI tools a Unix user us used to (e.g. ls) are\nthere and just work, along with things like wildcards. =) There's no other\nsystem tuning to do. I haven't used or set up Cygwin in a long time but\nthis Git shell is a lot easier than the Cygwin I've used. I still haven't\ntested any of the more esoteric Radiance command pipelines (such as what's\nused to get view parameters passed to rcontrib), but ASSuming they work,\ncoupled with a Windows Python or Ruby interpreter I'd bet you can get\npretty close to the Unix experience on Windows with little brain damage\nnow.\n\n\nHaving said all that, there are still things that the Windows user gives\nup in RadianceLand. The built-in multithreading (in rcontrib, rtrace,\nrpict, et al.) doesn't work; there are a few remaining Radiance commands\nthat are written in csh so those (probably (might?)) won't work; native\nmanpage support is lacking; and Roland had to use some sub-optimal\nfunctions to get all the photon map stuff to build on Windows. Still, I\nthink we've come a long wayŠ\n\n\n- Rob\n\n\n\n\nOn 5/15/15, 11:40 AM, \"Christopher Rush\" <Christopher.Rush at arup.com<mailto:Christopher.Rush at arup.com>> wrote:\n\n\nRob,\nGetting off-topic, but not sure if it warrants a separate thread... you\nimply that we can run Radiance commands in the Git for Windows bash\nshell. Is there an advantage to doing so, in comparison to Cygwin (which\nI have used in the past)? Both would have the clear advantages of being\nable to use more powerful scripted commands when compared to the Windows\ncmd prompt, but Git-bash is more lightweight while Cygwin would be more\npowerful (for things unrelated to Radiance?)? In both cases install\naccording to normal Windows Radiance installation and adjust paths as\nnecessary in each environment?\n\n\n-Chris\n\n\n-----Original Message-----\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-May/010928.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "May 18, 2015 at 08:52AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_010926", "id": "radiance-general_010928"}