{"body": "Hi Ji Zhang!\n\n\n> L = f(altitude, azimuth)\n>\n> how to generate a sky file which describes the cumulative sky brightness\n> distribution pattern based on this formular.\n\n\nDid you take a look at skybright.cal? It should serve as a starting \npoint. Your file should be far less complicated, though. Learning the \ncal-file-language in Radiance is done best by\n\n\n1) studying examples (the lib/ directory is full of them)\n\n\n2) studying rayinit.cal (it contains all the variables that are \navailable to you as well as functions - e.g. the surface normal Nx Ny Nz \nthat should useful\n\n\n4) trying with simple examples, debugging / comparing results to what is \nexpected\n\n\nLater, if you modify (using brightfunc) a source of type glow (RGB 1 1 \n1) calling the cal file, you can multiply the (1 1 1) by the variable \nselected in the brighfunc definition and (hopefully) defined in the \ncal-file.\n\n\nUsing gensky, everyone is already doing this. Looking at the output of \ncalling \"gensky 03 21 10CET +i -a 51 -o 7\":\n\n\n(...)\nvoid brightfunc skyfunc\n2 skybr skybright.cal\n0\n7 4 1.05e+01 3.82e+00 1.12e+00 0.807462 -0.462819 0.365792\n(...)\n\n\nThis means that skyfunc is a modifier that, if applied to a glow \nmaterial, will multiply each of the three channels (which is usually \nRGB) of the glow material with the value of variable skybr.\n\n\nThe value of skybr is found by evaluating the skybright.cal file (which \nis in your Radiance library directory):\n\n\n(...)\nskybr = wmean((Dz+1.01)^10,\n                 select(A1, sunnysky, cloudysky, unifsky, intersky),\n                 (Dz+1.01)^-10, A3);\n(...)\nA1 is the first parameter passed into the cal-file (the first parameter \nof the fourth line of the calling brightfunc definition, '4' in this \nexample. The select command here checks the value, and, as it is '4' \nhere, returns the 4th of the four skytype-variables - intersky. Compare \nto the gensky command line: gensky 03 21 10CET +i -a 51 -o 7 (+i means \nintermediate sky with sun).\n\n\nA3 is 3.82e+00 according to my skyfunc definition (see above), and \nrefers to the ground plane brightness.\n\n\nDz is defined in rayinit.cal: Dx, Dy, Dz is the ray direction vector at \nthe time of evaluation - which means at the time the ray hits the \ngeometry modified by the brightfunc, which is the sky dome here.\n\n\nThis is as an example how the typically used gensky tool makes use of \ncal-files. Again, yours should be less complicated. Just keep everything \nclean and in accordance with Radiance concepts and everything in SI \nunits, and write comments :-)\n\n\nAnother idea, you mention cumulative skies - unless there are problems \nwith interpolation, you may consider brighdat, which uses data files for \ninput.\n\n\nCheers, Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2011-March/007711.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "March 15, 2011 at 12:12PM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_007708", "id": "radiance-general_007711"}