{"body": "Hi Jason,\n\n\nDoes the BSDF include the effects of glazing?  If so, you should be able to follow the template in <http://radsite.lbl.gov/radiance/refer/refman.pdf> to include the window in your scene easily enough:\n\n\nBSDF\nThe BSDF material type loads an XML (eXtensible Markup Language) file describing a bidirectional scattering distribution function. Real arguments to this material may define additional diffuse components that augment the BSDF data. String arguments are used to define thickness for proxied surfaces and the \"up\" orientation for the material.\n\tmod BSDF id\n\t6+ thick BSDFfile ux uy uz funcfile transform\n\t0\n\t0|3|6|9\n\t\trfdif gfdif bfdif\n\t\trbdif gbdif bbdif\n\t\trtdif gtdif btdif\nThe first string argument is a \"thickness\" parameter that may be used to hide detail geometry being proxied by an aggregate BSDF material. If a view or shadow ray hits a BSDF proxy with non-zero thickness, it will pass directly through as if the surface were not there. Similar to the illum type, this permits direct viewing and shadow testing of complex geometry. The BSDF is used when a scattered (indirect) ray hits the surface, and any transmitted sample rays will be offset by the thickness amount to avoid the hidden geometry and gather samples from the other side. In this manner, BSDF surfaces can improve the results for indirect scattering from complex systems without sacrificing appearance or shadow accuracy. If the BSDF has transmission and back-side reflection data, a parallel BSDF surface may be placed slightly less than the given thickness away from the front surface to enclose the complex geometry on both sides. The sign of the thickness is important, as it indicates whether the proxied geometry is behind the BSDF surface (when thickness is positive) or in front (when thickness is negative).\n\n\nThe second string argument is the name of the BSDF file, which is found in the usual auxiliary locations. The following three string parameters name variables for an \"up\" vector, which together with the surface normal, define the local coordinate system that orients the BSDF. These variables, along with the thickness, are defined in a function file given as the next string argument. An optional transform is used to scale the thickness and reorient the up vector.\n\n\nIf no real arguments are given, the BSDF is used by itself to determine reflection and transmission. If there are at least 3 real arguments, the first triplet is an additional diffuse reflectance for the front side. At least 6 real arguments adds diffuse reflectance to the rear side of the surface. If there are 9 real arguments, the final triplet will be taken as an additional diffuse transmittance. All diffuse components as well as the non-diffuse transmission are modified by patterns applied to this material. The non-diffuse reflection from either side are unaffected. Textures perturb the effective surface normal in the usual way.\n\n\nThe surface normal of this type is not altered to face the incoming ray, so the front and back BSDF reflections may differ. (Transmission is identical front-to-back by physical law.) If back visibility is turned off during rendering and there is no transmission or back-side reflection, only then the surface will be invisible from behind. Unlike other data-driven material types, the BSDF type is fully supported and all parts of the distribution are properly sampled.\n\n\n\n\nSomething like:\n\n\nvoid BSDF myFilm\n6 0 myFilm.xml 0 0 1 .\n0\n0\n\n\nmyFilm polygon etc...\n\n\n\n\nThe orientation of the film may or may not matter.\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2017-December/012365.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "December 08, 2017 at 10:55AM", "created_by": "Greg_Ward", "parent_id": "radiance-general_012362", "id": "radiance-general_012365"}