{"body": "Just in case:\n\n\nWe have just completed a validation of 9 daylighting simulation\npackages. This validation will be published in the reference book on\nLighting Engineering under the editorship of academician J.B.Aizenberg\nand I can confirm that only Radiance and AGi32 provide correct\nqualitative and quantitative results.\n\n\nWe've got 17.7% maximum relative difference with SuperLite 2 and\nhigher than 150% relative difference with Lightscape.\n\n\nWe wanted to test Inspirer from Integra Inc., Japan, because they\nclaim it provides phisycal accurate simulation results. But,\napparently, they didn't provide us with the package for evaluation.\n\n\nRG> Jack de Valpine wrote:\n\n\n>> Hi Giullio and others following this thread,\n>>\n>> <RANT MODE>\n>> It seems to me that this is a problem with proprietary shrink wrap \n>> software renderers. Who really knows what is going on under the hood, \n>> whose word should be taken for the validity of the physical model, \n>> what validations have occurred?!\n>>\n>> Users see the product marketing materials that talk about Global \n>> Illumination and \"physical accuracy,\" and they believe the hype! That \n>> seems to me to be pretty dangerous if you are going to be using the \n>> tool to somehow \"validate\" design issues!\n\n\n\n\nRG> Can I get an amen-ahh!\n\n\nRG> I got into it with a CAD/modeling pundit several years ago, when he \nRG> stated in a review that Viz was capable of producing renderings that \nRG> were \"95% accurate\".  What the hell does that mean?  Well, I asked him,\nRG> and he said he spent a full day with Stu Feldman (one of the two \nRG> founders of Lightscape), and that was what he walked away with.  I told\nRG> him he didn't get his money's worth on the half-day seminar.  We went \nRG> back and forth on this, I told him he was doing his readers a great \nRG> disservice, and in the end I was made to feel like a loser for being in\nRG> such a small industry that no one cares about.  Something about \"if you\nRG> want to stick with Lightscape, good luck, it's not going to be supported\nRG> anymore, blah blah...\"  The good news is, it forced me to finally learn\nRG> Radiance.  =)  The problem is that that review went into Cadalyst \nRG> magazine, which is read by lots of Architectural CAD drafters and \nRG> renderers, and as you mention they aren't necessarily concerned with the\nRG> goings on under the hood.  And then you have people showing renderings\nRG> to clients and saying \"oh yes, that's what it will look like, we used \nRG> software that's 95% accurate!\"  Which is amazing, since many of these \nRG> people driving the program don't know how to read a polar curve on a \nRG> luminaire cutsheet. Oops.\n\n\n>>\n>> I know that there are systems that have implemented GI to varying \n>> degrees and sophistication. But the problem is you probably have to be \n>> an uber expert to use them and/or code up custom material/lighting \n>> shaders. Still though the question is what validation has occurred. I \n>> think that most commercial renderers and users of said systems are \n>> really not that interested in physical validity, they are most \n>> interested in the outcome/appearance of the final image. It does not \n>> really matter how it get there.\n\n\n\n\nRG> ...and if the result looks nice in half the time, screw accuracy. That\nRG> was a lot of the complaining I saw on the M-R forums, was how slow it \nRG> was.  It's comments like that that really give you insight into how \nRG> little these people understand the problem of solving GI. \n\n\n>>\n>> It seems to me that the one commercial product that showed some hope \n>> in its original (pre-acquisition) form was Lightscape. However, Rob \n>> Guglielmetti has explored and written pretty extensively on this topic \n>> seemingly with only partial satisfaction (my apologies to Rob G. for \n>> such a cursory summary, he did some really excellent work on this). \n>> Note I also believe that the original developers of Lightscape were \n>> truly interested in enabling people to use a tool with a reasonable \n>> and practical level of physical validity.\n>> </RANT MODE>\n\n\n\n\nRG> Thanks Jack.  I was merely trying understand the product's limitations\nRG> because I wasn't ready to commit to learning radiance in production.  \nRG> =8-)  And you are right about the developers.  At least in the case of\nRG> Rod Recker (the other Lightscape developer), I definitely felt like he\nRG> was interested in giving the world a tool.  Sure, getting rich off it is\nRG> a nice bonus, but he seemed to be interested in taking that Cornell \nRG> education and channeling it into a lighting tool.  He's a really nice \nRG> guy and wish him the best of luck at Autodesk.  It's truly unfortunate\nRG> what happened to that product, but then again it was severely limited in\nRG> what it could do.  Of course, who knows what it'd be like today had the\nRG> right people stayed in the decision-making seat.  Then again, how far \nRG> can one go with radiosity?  (Well, I guess the folks at Lighting \nRG> Analysts can answer that one, and the answer is \"pretty damned far\".  \nRG> Their AGI product continues to improve, and with people like Martin at\nRG> PSU doing validations with it, it becomes more and more robust.  But I\nRG> still prefer Radiance.) \n\n\nRG> Interesting thread; sorry for the somewhat off-topic verbiage, but I \nRG> think we all learn from these exchanges too.\n\n\nRG> - Rob Guglielmetti\nRG> www.rumblestrip.org\n\n\n\n\nRG> _______________________________________________\nRG> Radiance-general mailing list\nRG> Radiance-general at radiance-online.org\nRG> http://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\n\n\n\n\n\n\nBest Regards,\nIlya A. Zimnovich                          mailto:webmaster at audice.com\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-January/003290.html).</sup>", "attachments": [], "created_by_name": "Ilya Zimnovich", "created_at": "January 18, 2006 at 08:32PM", "created_by": "Ilya_Zimnovich", "parent_id": "radiance-general_003274", "id": "radiance-general_003290"}