{"body": "Hi Greg and Jelle,\n\n\nI don't think any of this discussion was meant to start a flame fest \npro/con windows/linux/unix.\n\n\nOne solution that we are testing right now is using VMWare to run linux \nvirtual machines under windows xp. With this setup we can run our \npreferred modeling application, Autocad, under windows and Radiance \nunder linux all on the same physical piece of hardware. Note though that \nthe Radiance work on this setup is really for setup and prepping of \nmaterials, views and scenes. We still run simulations on more powerful \nproduction servers.\n\n\nVMWare can also be used to do the opposite to run a Windows XP virtual \nmachine under linux. In essence this enable two \"machines\" (or more) to \nrun on the same piece of hardware. File sharing can be dealt with in a \nnumber of ways ranging from a simple mechanism built into VMWare to \nrunning a Samba server on the linux side.\n\n\nObviously there are some minimal costs involved with using VMWare. To \nbuild/set-up virtual machines you need to get a license for VMWare \nWorkstation which is under $200. However you really only need one in \norder to build virtual machines that can be deployed onto other \nhardware. Once a virtual machine is created it can be used on other \nworkstations with VMWare's free VMWare Player tool for running virtual \nmachines. Note that VMWare's product offerings are pretty broad and for \nthis reason somewhat confusing, for example I recently learned that they \nhave another free product called VMWare Server that sound's like it can \nalso be used to create virtual machines so this might be worth looking \ninto.\n\n\nAnother virtualization product to keep an eye on will be XenSource. \nAlthough they have demo'd with windows based vms, I think their \nvirtualization solutions currently only work for varying flavors of \nunix/linux.\n\n\nOK, now to potentially add fuel to the flame fest fire.... Our in-house \nworkflow is based on a production process where the 3d modeling \napplication(s) are decoupled from the rendering application, eg they are \nnot an integrated solution. I prefer to think that they are best in \nbreed solutions. And there are a whole host of reasons that make \ndecoupling rendering from modeling very important and useful. Modeling \noccurs in one set of preferred applications while rendering/simulation \noccurs in another, Radiance. The different applications have different \nuser interfaces. Because of this, different os's are needed to run the \npreferred applications, it is just a simple fact of life.\n\n\nOn another note, I know that there are opensource solutions such as Wine \nwhich it sound like Wine Doors is a spin off of. I think that Wine can \nsuccessfully used to run some windows applications but the question is \nwhether you can run something like Autocad or any other robust 3D \nmodeling/CAD production tool. However, I suspect that the installation \ncould be a real bear. In these days of Windows Update/WGA, etc., it \nseems to me better/simpler to use a commercial product.\n\n\nBest,\n\n\n-Jack de Valpine\n\n\nGregory J. Ward wrote:\n> Without debating the merits or drawbacks of Windows vs. Unix, let me \n> just speculate that a reasonable Windows environment (e.g., VirtualPC \n> or similar) will probably be available for Intel-based Apple hardware \n> soon, allowing one to run most Windows applications at native speed \n> and sending files directly to Radiance running under OS X.  Since a \n> decent dual-core Mac mini can be had for less than $800 US, a fraction \n> of the cost of most of the CAD systems we're discussing, this may be a \n> reasonable solution for some, and Radiance runs quite fast on that \n> platform.  The current \"Boot Camp\" approach requires radical switching \n> between systems, which is no fun in my opinion.  This situation is \n> bound to improve since the hardware is capable -- probably before the \n> year is out.\n>\n> Has anyone tried \"Wine Doors\" or found a convenient way to run Windows \n> under a running Linux system, allowing files to be passed between?  \n> This might also be a reasonable solution for those needing the latest \n> bits of Radiance.\n>\n> Native Windows binaries of Radiance are great, and it's wonderful that \n> Francesco has provided these to the community for free, and kudos as \n> well to Ignacio for nrv!  From my limited experience with Cygwin, I \n> tend to agree with Jelle that this approach leaves much to be \n> desired.  It's much better to do away with the middleman, especially \n> when it keeps munging process memory.\n>\n> Multiprocessing and advanced Radiance features are going to be lacking \n> or lagging on Windows for the indefinite future, since most \n> development happens under Unix, and that's just the way it is.  Even \n> so, being a year behind is better than being 8 years behind and \n> growing, which is where Desktop Radiance is regrettably stuck.\n>\n> -Greg\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n>\n\n\n\n\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-June/003772.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "June 16, 2006 at 02:54PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_003767", "id": "radiance-general_003772"}