{"body": "Hi Greg,\n\n\n> The -oo option and -od option report the origin and normalized ray\n> direction (respectively), but only with -I-.  When you set -I+, then\n> rtrace fudges the calculation by creating a ray 1 unit above an\n> imaginary Lambertian surface, and this is why the origin (and\n> direction if you check) do not match your input.  Instead, the\n> intersection point (-op) and surface normal (-on or -oN) will match\n> the origin and direction given.\n\n\nThis is baffling. I always used just plain -I, without +/-, and it worked.\nI am indeed after illuminance.\n\n\nLet me repeat this:\n- rtrace -defaults: -i- (so illuminance is off, hence luminance)\n- -i/-I is a boolean switch (or are they two independent boolean switches?)\n- I have -I in my rtrace command line. This toggles the default, turning\nit on.\n- with i/I set to on, the origin should be set to the input, no?\n\n\n> This is not a new bug in 3.7, but something that's been there since I\n> enabled reports of parameters besides ray value with -I+ in the 2.3\n> release.  Perhaps you weren't using the -I+ setting in your previous\n> scripts.\n\n\nNo, just -I\n\n\n> I think I could fix this behavior if it's really screwing you up.  I\n> agree that it's confusing to have the -oo and -od options change\n> their apparent reporting depending on the -I setting, but they are\n> reporting the values on the ray actually traced.  You don't start out\n> at the surface and direct the ray straight up in order to compute\n> irradiance.  That wouldn't work.\n\n\nI think I understand the subtlety of measuring luminance vs. illuminance,\nso the added '1' and the inversed direction doesn't worry me. The\n'toggling' is, though.\n\n\nThanks for your reply, anyhow.\n\n\nCheers\n\n\nAxel\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-October/003041.html).</sup>", "attachments": [], "created_by_name": "Axel Jacobs", "created_at": "October 24, 2005 at 06:18PM", "created_by": "Axel_Jacobs", "parent_id": "radiance-general_003039", "id": "radiance-general_003041"}