{"body": "Hi Ikrima,\n\n\nNot really knowing your exact needs, I'll try to answer:\n\n\n>\n> As Daysim and SPOT Pro's main difference is mainly how to treat with sun\n> and sky components, is that applies to all radiance-based-engine tools\n> (including Radiance command-line approach itself)? By other words, is the\n> way sun-and-sky-being-treated the main motivation to go for\n> radiance-based-engine-tools rather than simple tools (i.e. like Ecotect)?\n\n\nThe Daylight Coefficient or a Design Day interpolation annual simulation\napproaches do not have to be unique to Ray-tracing engines, like Radiance.\nRadiosity engines can make use of the same concepts for annual simulation.\nRadiosity can often run a single point in time quicker, with other\nlimitations, and so can calculate more coefficients or design days.  I am\nnot sure, but I believe Ecotect is providing an interface to Radiance for\nsimulation and maybe has its own sun path and solar shading design tools.\n\n\n\n\n> So if someone needs to just investigate how different complex fenestration\n> systems will affect indoor daylight coefficients (no illuminance levels nor\n> pictures needed), there is no need to generate BSDF data for those CFS and\n> even no need to use radiance?\n>\nI believe good representative BSDF data, or just a good model of the\nfenestration system itself, would still be very important to get a good\ncalculation of daylight coefficients (which is as challenging of a\ncalculation as illuminance).  Using Radiance based tools is not necessary\nas there are other Ray-tracing and Radiosity based tools that can do\nsimilar calculations.  One convenient thing is that the Radiance based\ntools use this standard XML BSDF definition now which aligns with the\nWindows 7 software giving greater access to these definitions.\n\n\nRegards,\nZack\n\n\n\n\nZack Rogers, P.E., LEED AP BD+C\nDaylighting Innovations, LLC\n808 S. Public Road, Suite 200\nLafayette, CO 80026\n(303)946-2310\n\n\n\n\nwww.daylightinginnovations.com\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-May/010916.html).</sup>", "attachments": [], "created_by_name": "Zack Rogers", "created_at": "May 13, 2015 at 09:38PM", "created_by": "Zack_Rogers", "parent_id": "radiance-general_010914", "id": "radiance-general_010916"}