{"body": "Hi George,\n\n\n> Newer version of Radiance:\n>\n> I'm embarrassed by your raising the subject of\n>  me getting a newer version of Radiance onto\n>  my computer; that's been on my mind. I do\n>  need to catch up but to my shame have done\n>  nothing. Richard Morris at Arup Lighting in\n>  London helpfully suggested Cygwin as\n>  the way I can get more in line with everybody else\n>  and up to speed despite being a Window$ user,\n>  and pointed me to Francesco Anselmo's site.\n\n\nThat's a good suggestion, though you might want to wait until Francesco \ncompiles the latest 3.6.1 release, which just came out yesterday.  That \nway, you'll be sure to have the most recent additions.  I haven't used \nCygwin (or PC's) myself, but I guess it works.  FreeBSD is my favorite \noption on Intel hardware -- much easier to manage than Linux for most \nthings, though of course Linux comes with a friendlier desktop these \ndays.  If you can afford it, an Apple running OS X is a very good \ninvestment.  The time you save in administering it will more than \ncompensate for the higher price tag, and the G5 performance is quite \ncompetitive with Intel and AMD machines these days.  Plus, you'd get to \nrun all your Office applications and Photosphere to boot!\n\n\n> Optics5 data:\n>\n>  My apologies for being unclear on using Optics5\n>  data:  all I did was take the rad file outputs from\n>  Optics5 for each proprietary type of glass and\n>  put that data into my Radiance materials files,\n>  nothing more. How sophisticated Optics5 output is,\n>  I have no idea. I guess in an ideal world\n>  Optics5 would spool off a customised Radiance\n>  BRTDfunc for each glass type or combination of\n>  glass and framing in a glazing system, but\n>  somehow I don't suppose it actually can. I am\n>  guessing what you get are averaged values\n>  derived from hemispherical test data which you\n>  use as simple transmission and reflection\n>  factors. I can't see the incident angle figuring in\n>  the output anywhere. Maybe someone would\n>  like to put me right.\n\n\nYou didn't post your reply to radiance-general -- just to me.  Did you \nmean to post it?  I will post this reply in case others want to pipe \nin.  I don't have any experience with Optics 5, other than files people \nhave shown me.  From what I can tell, it does a pretty rudimentary job \nmodeling glazings in Radiance -- not even accounting for Fresnel \neffects on reflection and transmission.  The glaze script I wrote for \nVisarc does a more reasonable job in this regard, but lacks the \nextensive database of Optics 5.  I misunderstood and thought you had \nused it to compute the BRDF for the blinds, which I didn't think it \ncould do.  I guess from what you say, it can't.\n\n\n> Mkillum-driven calculations:\n>\n> Thanks to your advice on using mkillum-driven\n>  calculations, it's now full steam ahead with that.\n> As I'm using mkillum for the first time, I am taking\n>  it as read that there will be a way I can use an\n>  illum to account for all those room cases\n>  with different external obstructions and\n>  significant reflections arising from the rooms'\n>  external contexts.\n\n\nYes, that is correct.  Mkillum simply acts as a \"go-between,\" mediating \nand accelerating the window contributions in your model.  As I said in \nmy first reply, it doesn't help so much if all you're doing is \ncalculating a few illuminance values, but if what you want is a nice \npolished image, I've found it to be indispensible.  I only wish it were \na little easier to use.\n\n\n> BRTDfunc:\n>\n> There would be a huge cheer from me if\n>  you were to publish a BRTDfunc with macro\n>  performance approximating reasonably to\n>  venetian blinds. \n\n\nUnfortunately, a good cheer might not be quite enough motivation, but \nI'll give it a look.\n\n\n> I do take right on my chin your point about\n>  my getting a reasonable match in a couple of\n>  arbitrary cases being no substitute for good\n>  modelling. I’m still interested in any real\n>  world venetian blind physical data, such as\n>  anyone may have, not just so as to provide\n>  capability for validation of whatever the\n>  BRTDfunc may turn out to be, but also\n>  generally for other studies.\n\n\nI know Kostantinos Papamichael did a fair amount of research on \nvenetian blinds for his Ph.D.  You should be able to find some of his \narticles.  Go to the following URL and type in Papamichael.  That name \nshouldn't create a lot of search collisions:\n\n\n\thttp://www-library.lbl.gov/lbnl_reports/sf\n\n\n> A thought: maybe it would be too much to go\n>  for in one function, but it seems to me that\n>  perhaps a useful general BRTDfunc for surfaces\n>  with pseudo-venetian-blind macroperformance\n>  properties would need switches for the user to \n>  specify say a world vector normal to the slat axes\n>  and a slat angle relative to the surface normal.\n>  Then if possible maybe such a BRTDfunc could\n>  be made to work for vertical blinds too. Maybe I’m\n>  wrong, but my subjective impression is that real\n>  blinds have direct and diffuse transmissions which\n>  are both asymmetric w.r.t the azimuth angle of the\n>  incident ray relative to the slat axis in the surface\n>  plane, the diffuse distribution for each ray case\n>  being itself asymmetric w.r.t azimuth angle. Ouch.\n\n\nYes, it should be possible.  Of course, a BRTDfunc for venetian blinds \nwon't account for all that goes on outside a window, because Radiance \ndoes not sample the directional diffuse component of its BRDF types.  \nThis is where mkillum and the photon mapping add-on will have the upper \nhand.\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-October/002084.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "October 28, 2004 at 08:42PM", "created_by": "Greg_Ward", "parent_id": "radiance-general_002078", "id": "radiance-general_002084"}