{"body": "Dear Mostapha,\n\n\nIt is shocking (in a good way) to read that this old code makes sense to you :). Apart from generating two *da results at the same time when you mix an active and a passive user as the same time, I originally wrote that code because I had proposed (in the 2004 Solar Energy Lightswitch paper) that building occupants should be considered an equal mix of active and passive users. With that assumption the electric lighting energy use reported is a mean of an active and a passive user:\n\n\nuser_profile 2\nstring_user_description  50 1 1                <-- a user who uses electric lighting and blind controls in an active fashion\nstring_user_description  50 2 2                <-- a user who uses electric lighting and blind controls in a passive fashion\n\n\nI do not think that anybody ever used the passive concept. The results may be too depressing even though I still think that considering what would happen in a building if occupants used their controls in a passive way (electric lighting always on and shading always down) has some merit. In the past few years we have mainly been using the active user as the default for the manual reference case against which automated systems should be compared. We are then using\n\n\nuser_profile 1\nactive 100 1 3\n\n\n<-- this describe one type of user (100%) who uses electric lighting (1) and blinds (3) actively. The 3 instead of the 1 for the blind control indicates that if annual daylight glare probability profiles are available they are used for the simulation instead of the direct sunlight (*.dir) profile. This user is the default user which is why the user_profile keyword can be omitted if you go with it.\n\n\nLet me know whether this makes any sense. If it does I will add it to the Daysim site. If not, I will clarify.\n\n\nWarm regards,\n\n\nChristoph\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-daysim/2014-January/000041.html).</sup>", "attachments": [], "created_by_name": "Christoph Reinhart", "created_at": "January 13, 2014 at 08:21PM", "created_by": "Christoph_Reinhart", "parent_id": "radiance-daysim_000038", "id": "radiance-daysim_000041"}