{"body": "George Michaelson wrote:\n\n\n>  I did a kitchen with a mix of off-white and brushed steel\n> aluminimum surfaces. I found that the amount of colour picked up by\n> 'gloss' surfaces was increadibly high, but if I didn't select off-whites\n> for detailed surfaces like tongue-and-groove wood, I got huge brightspots\n> which wiped out the image unless I wound back the lightbulbs to 5 watt\n> railway specials.\n\n\nDid you notice that you can change the \"exposure\" to which the\nfinal image is displayed? It has a very similar effect to the\ncombination of shutter speed and iris opening in a photo camera.\nThe pcond program mentioned by Peter is just another step beyond\nthat, which also takes some physiological properties of the human\neye into account, that may depend on the absolute brighness levels.\n\n\nIt could also be that you made your surfaces too glossy. Most people\ngreatly overestimate the amount of gloss in their visual environment.\nIn reality, gloss levels for non-metallic surfaces are typically\nway below 5% (rather around 1 - 2%).\n\n\n\n\n> I know that the chrome tap is reflecting part of a\n> perfectly rendered image of the lightbulb onto every shiny surface within\n> a 40 foot radius, but now I'm over 40 I can't see those little images\n> unless I stand real close. Does radiance have to render them? isn't\n> there some middle ground where it does high definition for some things\n> but not others?\n\n\nIt's called pixel resolution.\nIf you render a picture where the tap is three pixels wide and two\npixels high, then I'm pretty sure you won't recognize the bulb that\nis theoretically reflected in its surface. If the tap fills half\nof your image, then you probably *want* to recognize the reflected\nbulb, and given the right distance, you certainly will. But even\nwhen the final image doesn't show a recognizable mirror image of the\nbulb, you still want to notice the sparcle of the reflection, so\nthere is really no other useful \"middle ground\" here.\n\n\nNote btw., that the surrounding surfaces will *not* see a perfect\nmirror image, unless you use the \"mirror\" material for the tap,\nwhich you shouldn't. If you use just a shiny metal, then the diffuse\ncalculation from other nearby surfaces will hit the tap at most once\nor twice, which isn't enough for an exact reflection. Only surfaces\nthat are very close will again see more, simply because the tap fills\na significant part of their surrounding space.\n\n\nBtw: In real live, just because your eyes don't want to resolve\nthat mirror image anymore, doesn't mean that they don't receive\nthe information about it. If you want to simulate that effect with\nRadiance, you can simply apply a soft blur to the final image... ;)\n\n\n\n\n> (I am not a professional. I do not depend on this software. If you do,\n>  and need it to remain pure, I don't disagree.\n\n\nYes, we do indeed! (at least for a reasonable definition of \"pure\")\n\n\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch.com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2001-December/000083.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "December 11, 2001 at 11:05AM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_000081", "id": "radiance-general_000083"}