{"body": "Greg Ward wrote:\n\n\n> It's probably because the sequence didn't capture enough dynamic range,\n> or there were no smooth gradients.  The best strategy is to use a good\n> sequence to get the camera response, then store it and reuse it via\n> hdrgen's -r option.  (See the related tips in the attachment.)\n\n\nHi Greg and everyone,\n\n\nGreg, I've been meaning to ask you about this.  I have been shopping for a\nnew digital camera lately, and one of the criteria I have is the ability\nto easily capture workable HDR images.  Now, at the Berkeley workshop you\ndemonstrated doing this wth your Olympus 3030, which has the ability to\ntake a 5-image autobracketed sequence, all separated by a stop.  This\ngives you the ability to shoot a rough HDR sequence, handheld.  This is\nwhat I was looking for, and I recall you saying that for these kind of\nquickie HDR sequences one needed to make sure the midrange exposure was\nseparated by at least two stops from the endpoints.  I assumed this was to\nensure capturing the \"entire range\" of a \"typical scene\" (we have\ndiscussed the limitations of this method in capturing the immense dynamic\nrange of a scene with direct sun, etc).\n\n\nOf course when one looks at the current crop of digicams, the field\nquickly gets thinned out when applying this criteria.  All too often a\nnice camera (like the new Sony V3) is eliminated because its autobracket\nfunction consists of a three shot maximum, separated by a single stop --\nnot enough.  At work, we have a Canon Rebel, which also only does three\nshots for an autobracket sequence, but can separate them by two stops a\npiece.\n\n\nSo, I'm wondering.  If I got a camera like the V3, which only goes one\nstop to either side of the ideal exposure, but *first* use a tripod and\ncreate an excelent HDR sequence as per your (excellent) quickstart guide,\nand create and save a camera response curve for my V3 from that sequence,\nwould my crude handheld three-shot/1-stop HDR sequences be reasonably\naccurate (assuming again, moderate dynamic range scenes)?\n\n\nThat was a long and winding sentence, but I hope you get the idea. (?)\n\n\nP.S.\nJust today I saw your camera for $225 on a closeout special at a store in\nManhattan that's not even known for low camera prices.  Ahh, technology.\n\n\nP.P.S.\nI was in the aforementioned store looking to purchase a power supply for\nmy work computer because the cooling fan in its power supply rolled over\nand died 30 minutes into my workday this morning, a morning when I was\njust finally getting caught up.  Ahh, technology.  =8-)\n\n\n- Rob Guglielmetti\nwww.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-January/002271.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "January 07, 2005 at 02:53AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_002264", "id": "radiance-general_002271"}