{"body": "** Proprietary **\n\n\nRob, thank you.  I actually stumbled upon the script last night as well.  Had I noticed that \" ' \" is not the same as \" ` \" I would have gotten it to work much sooner!\n\n\nBut just for anyone who runs into this in the future...  ranimate pipes the output of the ANIMATE variable into rpict just like it would if you were using the OCTREE variable.  Only since our scene is dynamic, a script is needed that will produce an octree but not actually store it in a file.\n\n\nIn my case I was using a file called genoctree.script, so my ranfile included ANIMATE= genoctree.script\n\n\nAs I recall, genoctree.script looked something like this:\n\n\nframe=$1\ntime=`ev \"6+($frame/2)\"`\ngensky 1 28 $time > sun.rad\noconv -i scene.oct -f sun.rad\nrm sun.rad\n\n\nWhere I'm telling the computer I want to create my sky starting from 6:30 AM and every frame from then on will add = ½ hour.\n\n\nNow, if anyone can help me figure out a way to get a time stamp on each frame, that would be great!\n\n\nMark de la Fuente\nmdelafuente@wmtao.com\n\n\n\n\nMark de la Fuente wrote:\n\n\n> I have a building where I would like to make an animation of the sun\n> moving across the space.  It seems that if you have a static scene and a\n> dynamic view, then you use the OCTREE (say OCTREE= scene.oct) variable\n> in the ranfile while the view variable and file contains all the\n> different views (one per frame).  However in my case I would have a\n> static view and a dynamic octree.\n\n\nHi Mark,\n\n\nI have no experience with ranimate or ranimove, so I can't say for \ncertain that there's no way to do that with those tools.  However, There \n*is* a way to animate your sun, simply using rpict and some shell \nscripting.  John Mardaljevic's script in \"Rendering with Radiance\" is a \nprime example. The basic idea is that you set up a for-each loop for \neach timeslice you want to render.  John's script plugs the variable \ninto the time parameter for gensky.  Alternately you could feed the \nvariable to sed to directly modify a sky.rad file.  That way, you could \nuse rad to produce the renderings.\n\n\nAlso, if you're primarily concerned with seeing the movement of the sun \npatch, a neat trick (again John M's idea) is to render the stills with \n-ab 0 and assign some decent -av so that you can at least see the rest \nof the space.  By eliminating the ambient calculation, your stills will \nrender ultra-quickly; you can be watching the sun path in minutes, \nrather than hours.  As Martha Stewart used to say, that's a Good Thing. \n  (These days, she says \"I swear to tell the truth, the whole truth and \nnothing but the truth.\")  =8-)\n\n\n\n\n\n\n      Rob Guglielmetti\n\n\ne. rpg@rumblestrip.org \nw. www.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-January/001446.html).</sup>", "attachments": [], "created_by_name": "Mark de la Fuente", "created_at": "January 28, 2004 at 06:34PM", "created_by": "Mark_de_la_Fuente", "parent_id": "radiance-general_001439", "id": "radiance-general_001446"}