{"body": "Hi Ji Zhang!\n\n\n> May I ask whether it's possible to \"isolate\" the contribution of\n> short-wave and long-wave solar radiation using Radiance?\n>\n> One of our colleagues wants to get these values for the calculation of\n> \"mean radiant temperature\" for the purpose of analyzing the implications\n> of urban geometries on thermal comfort.\n>\n> Correct me if I'm wrong, the irradiation value obtained in Radiance is\n> the total solar radiation energy received on a given surface.\n>\n> So, is this \"total\" value encompasses the full spectrum of solar\n> radiation, including the visible part and the short-wave and long-wave\n> parts that are not visible to human eyes?\n>\n> If it is, then, is there a way to single out the contribution from\n> short-wave and long-wave radiation separately?\n>\n> Clarification and advices are deeply appreciated!\n\n\nYou are (almost) completely free to choose what wavelength range to \nsqueeze into any of the three channels that we usually refer to as RGB. \nSo instead of calling the first channel \"RED\", you could call it \n\"Shortwave\". As long as you use the three channels for the same \nwavelength ranges when defining materials, sources, and interpreting \nresults, that is fine for radiative transfer of energy.\n\n\nHowever I would advice not to make use of the possibility of rendering \nall these wavelength ranges at once by making use of the three channels. \nIt would be better to set all three channels to the same wavelength \nrange, so work with \"neutral grey\" lights and surfaces. The reason is \nthat there are some (few) parts of Radiance's code where the channels \nare weighted according to human perceiption assuming RGB-like wavelengths.\n\n\nAnother question is how to find how much of the absorped short-wave \nsolar irradiation may get emitted as long-wave radiation by a surface. \nRadiance does not consider such \"shift\" effects. So IR radiation by \nsurfaces heating up in the sun would not be reflected.\n\n\nCheers, Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2011-July/007984.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "July 17, 2011 at 11:49PM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_007982", "id": "radiance-general_007984"}