{"body": "Hi Chantal,\n\n\n1.- I’m not sure of the use of the ‘BSDFproxy polygon inside’ included in\n> the glazing_bsdf.rad file.\n>\nThe BSDF material is applied to this surface. It allows Radiance to use the\nBSDF data in lieu of sampling the geometry during the direct sun simulation.\n\n\n\n\n> If the latter was generated by genBSDF and includes already the dimensions\n> of the venetian blind, the model, the glazing, and the thickness is also\n> specified…why do we need to specify the coordinates of the polygon (same of\n> the glow material) in this file?\n>\nThe BSDF is not always produced by genBSDF, it can come from WINDOW or from\nmeasurement as well. But regardless, the intention is that optical data in\na BSDF file is not specific to a size of window, and so you could use it in\nvarious sized windows.  For example if lightlouver produces a BSDF for\ntheir product using genBSDF for one project you might want to use it in a\n2m window for one project but a 3m window for another. Addtionally there\nmay be times when you want to use a different thinckness for the\nsimulation.  I can think of probably half a dozen reasons why you might not\nwant to use dimensions baked into a BSDF file, an as is typical with\nRadiance we lean towards generalization.\n\n\n\n\n>\n>\n> I also wonder if we need to use proxy when only if we have a system such\n> as venetian blinds. Is possible to use it also if we have a daylight system\n> as thick as a glass pane such as lasercut panel 6mm?\n>\nYes, but it isn't worth it unless you have a good Radiance material model\nfor the lasercut panel.  Otherwise you're better off using the BSDF\n(assuming it was measured).\n\n\n\n\n>\n>\n> I guess that I can shorten this question by: what would be exactly the\n> function of the proxy geometry?\n>\nThe BSDF, even high resolution tensortree BSDFs, are spatially averaged.  A\nvenetian blind that is angled to admit stripes of light modeled with only a\nBSDF will result in a rectangular patch of intermediate brightness.  Using\nproxy geometry results in bright sun alternating with dark shadows.\n\n\n>\n>\n> 2.- Regarding this, in the tutorial you have to rotate the geometry in\n> order to generate the two xml files (section 6.2) my\n> silly-silly-super-silly question is:  what would be the orientation of\n> the resulting xml file? Are we re-orientating it by the last three values\n> of the orientation vector in the glazing_bsdf.rad ?\n>\nThe WINDOW XML file standard says inside is +Z outside is -Z, up is +Y.\nIn Radiance we use up as +Z and inside and outside, well it depends on the\nspace your modeling.\n\n\n\n\n>\n>\n> 3.- I have a final question that just came now when trying the 5Phase:\n> What would be the number to use in rcontrib –bn when creating the\n> direct-sun-coefficient-matrix?\n>\n> As I understand, it represents the number of sky patches, and it will\n> generate the values of the RGB in the output file. But, if I use –e MF:6 –f\n> reinhart.cal –b 5186, I obtain a matrix result with 31116 columns, which is\n> the number of sky patches six times? Please tell me where am I wrong.\n>\n\n\nThere should be three values per skypatch (R G and B) I don't know why you\nare getting twice as many.  Can you send the full command you are using?\n\n\nAndy\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2013-November/009848.html).</sup>", "attachments": [], "created_by_name": "Andy McNeil", "created_at": "November 01, 2013 at 11:23AM", "created_by": "Andy_McNeil", "parent_id": "radiance-general_009847", "id": "radiance-general_009848"}