{"body": "Barbara Matusiak wrote:\n\n\n> I wonder if it is possible to convert pictures taken by digital camera \n> to Radiance format? And if yes, how it could be done? The Radiance \n> format enables reading of luminance values directly from the pictures, \n> something that could be very usefull in the project I plan to start soon.\n\n\nYes, but only if you shoot the images in a specific manner and convert \nthem to high dynamic range (HDR) format first.  A single image does not \ncontain the dynamic range necessary for what you want to do.  But for \ntypical scenes, if you simply bracket your exposure (using aperture, not \nchanging shutter speed) by two F stops in each direction, you can use \nutilities like Debevec's HDR Shop or Greg Ward's Photosphere (or his \ncommand-line hdrgen) to merge those into an HDR image with the full \ndynamic range.  You can then use Radiance tools like falsecolor (and \neven pcond) to extract real luminance information from a photograph.\n\n\nWe use a Canon Digital Rebel here in my office to create these image \nsequences.  The autobracket function of the camera is very useful for \nthis.  Many \"prosumer\" cameras have this feature, but you must make sure \nthe camera will separate the images by two f-stops.  Of course you can \ndo it manually too, but then you usually need a tripod to keep \neverything in registration.  You also need to \"go manual\" to capture \nscenes of really high dynamic range, using more images to capture the \nfull range.\n\n\nI've been meaning to place some samples on my website, but haven't had \ntime.  But these resources are better anyway:\n\n\nhttp://www.anyhere.com/\nhttp://www.debevec.org/HDRShop/\n\n\nHDR photography is extremely cool.  You can even use HDR images as light \nsources for Radiance scenes!  Santiago Torres of this list has done \nquite a bit of work in that.  Search the radiance-general archives for \ndetails.  Have fun!\n\n\n\n\n\n\n      Rob Guglielmetti\n\n\ne. rpg at rumblestrip.org\nw. www.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-May/001756.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "May 28, 2004 at 04:38PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_001754", "id": "radiance-general_001756"}