{"body": "Jia.\n\n\nSee further answers within ...\n\n\nOn Sat, Jan 16, 2010 at 4:37 PM, Hu,Jia <hujia06 at gmail.com> wrote:\n> Hello Andy:\n>\n> Sorry for my late reply. I am new for Radiance and have to learn more to\n> reply you.  Before discussing the previous question,   could I ask how I\n> can open the text editor and save as file with extension like .rad after I\n> install Ubuntu 9.10 because I am unfamiliar with Ubuntu (Linux)?\n\n\nI currently don't have an Ubuntu system installed but I think this still\napplies:\n\n\n> Gedit is the default Ubuntu text editor, which you can launch by clicking\n> Applications->Accessories->Text Editor on the desktop menu system.\n\n\nWhen you save files always make sure that you save in plain\ntext (*.txt).\n\n\n> For the question in my last email, I asked that because someone\n> did some simulations before but the results seems weird. In those\n> simulations,  two identical small offices are developed with only one\n> difference. In one office, the angles of the blinds are 0 degree. For\n> another, the windows are separated into three sections (the height\n> for each section is the same). The blinds with 0 degree are also the\n> same for each section. The illuminance of the sensor points are\n> calculated for the two offices. Theoretically, the illuminance should\n> be identical or quite similar. But as I said in my last email, the\n> illuminance shows a big difference.\n\n\nAs Andy said, without details about the rendering parameters and\nthe scene/window geometry it's hard to tell why the values are so\ndifferent. Scenes with blinds are sensitive to the right rendering\nparameters because you have to account for multiple reflections\nto achieve satisfactory results. If the scenes were rendered with\nsettings that are not accurate enough you will get largely differing\nresults.\n\n\nAnother option is that the two scenes had different sky settings\nwhich will also result in different (absolute) illuminance values.\n\n\n> In addition to your explanation, is that right another possible reason is\n> the computer hardware difference. For example, one computer may calculate\n> 5+3=8, while another calculates 5+3=7.8888.  If possible,  Is there any test\n> file to test the accuracy of computer before running Radiance?\n\n\nRadiance was written to be usable on multiple platforms. There\nis a built in tolerance for rounding errors which takes care of the\nabove situations. However, you can get different results (to the\npoint where the calculations are untrustworthy) if you apply very\nstrong optimisation options when compiling the binaries. I assume\nthat you have used the binaries from the Debian/Ubuntu distribution\nprovided by Bernd Zeimetz so this should not be the cause of\nyour problem.\n\n\nThere is no standard test scenario for Radiance. I think you can\ninstall example scenes in Ubuntu as a separate package. Some\nof these are also discussed the book \"Rendering with Radiance\".\n\n\nOnce you have Radiance running (i.e. it produces images that look\nabout right) it's hard to verify the accuracy because each rendering\ndepends on the scene complexity and selected rendering parameters.\nBasically you have to do a set of verification renderings with changing\nsettings until you have shown that your error is within a certain limit.\n\n\nI also used other lighting simulation apps to check that my\nresults are at least in the same order of magnitude (especially\nwhen artificial lighting is involved).\n\n\nMark Stock has written a benchmark scene which you can use\nto test your installation. It will run for a few hours, though. It renders\na scene at high quality settings (for a picture output) and if your\nresult looks like the (tiny) image on his page Radiance works fine.\n\n\nhttp://markjstock.org/pages/rad_bench.html\n\n\nRegards,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-January/006470.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "January 17, 2010 at 02:58AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_006464", "id": "radiance-general_006470"}