{"body": "On Jun 3, 2006, at 8:30 AM, Marcus Jacobs wrote:\n> So I think they are actually more complicated that the example that  \n> I showed to you before. Out of curiosity, just as many modeling  \n> software estimate a complex surface as a mesh of planes or  \n> triangles, could the same principle be used for the lighting  \n> fixtures themselves. In other words, instead of seeing each fixture  \n> as a single complex surface, can it be considered it as just a  \n> group of flat planes? One item that I need to have addressed is  \n> whether I should model the diffuse shades a single surface or if it  \n> acceptable to have inner and outer surfaces (you can think of it as  \n> having a thickness to it). See here:\n>\n> http://i35.photobucket.com/albums/d178/marcdevon/luminaireview.jpg\n\n\nHi Marcus,\n\n\nWithout actual photometric data (such as an ies file) to apply to  \nyour group of flat planes, you have to model the actual comple  \ngeometry.  But I'm afraid I may have misunderstood your question.  As  \nfor the single/dual surface question, I guess it depends on how close  \nyour views will bring you to the shade.  The trans material is  \ninfinitely thin, and it'd be best to model the thng as a single  \nsurface.  For closeup work, you may need to introduce thickness but  \nthat's gonna get a lot more complicated from a valid material  \ndefinition standpoint.\n\n\n\n\n>\n>\n> The information in Rayfront's user manual and pages 325-326 from  \n> RwR were VERY useful to me in gaining insight as to how Radiance  \n> treats light. There was a word that was mentioned that has me  \n> worried. Measure. Aside from not having any experience with  \n> performing a empirical test of light distribution, measuring light  \n> sounds very expensive. May I ask, would purchasing the needed  \n> equipment require a second mortgage to be taken out or giving up  \n> one's first born? Is it required to use transfunc or transdata in  \n> lieu of trans to obtain acceptable accuracy?\n\n\nMmmm, measurements, yeah.  The gear can be expensive.  Let's see, at  \nmy old job, where I did these measurements, I used an illuminance  \nmeter, a luminance meter and a theatrical spotlight (ETC Source Four  \nHID, aka \"leko\", or ERS).  The light fixture was a free sample, but  \nyou could use other sources too.  The illuminance meter (Minolta  \nSomethingorother-nowdiscontinued) was about $800 and the luminance  \nmeter (Minolta LS-100) was more expensive, I believe almost three  \nthousand USD.  Actually, here are a couple of links I just found for  \nthe meters I used (the illuminance meter I link to here is a newer  \nmodel than I used, but it's basically the same thing).\n\n\nhttp://www.tequipment.net/MinoltaTL1.asp\nhttp://www.tequipment.net/MinoltaLS100.asp\n\n\nIt's expensive not to mention time-consuming, but it's also fun and  \nis an excellent example of the power of Radiance, in that Radiance is  \nhappy to accept material data as complex as you are willing to gather.\n\n\nMaybe Peter can chime in with his thoughts on this stuff, and maybe  \nan update on his goniophotometer project?\n\n\n- Rob\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-June/003747.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "June 03, 2006 at 06:56PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_003743", "id": "radiance-general_003747"}