{"body": "Greg,\n\n\nI think I may have found the issue. I was creating a simpler scene to send\nover when I realized that the angular dependence was actually working. I\nalmost missed it because the differences were small, but it was working.\nSo, I went back to the original test and I discovered that the difference\nwas that I had been using aliases in the original test, but had had not\nused them in the simplified scene I sent you, sorry about that. Could that\nbe it?\n\n\nWhen I use aliases the mirror material seems to ignore the modifier:\n\n\nvoid glass glass_alt_mat\n0\n0\n3 0.96 0.96 0.96\n\n\nvoid brightfunc glass_angular_effect\n2 A1+(1-A1)*(exp(-5.85*Rdot)-0.00287989916) .\n0\n1 0.08\n\n\nglass_angular_effect mirror glass_mat\n1 glass_alt_mat\n0\n3 1 1 1\nvoid  alias window glass_mat\n\n\nIf I use 'window' as the material for the geometry, then 'glass_mat' alias\nis used instead, but the 'glass_angular_effect' modifier seems to be\nignored. However, if I apply 'glass_mat' as the material for the geometry\nthen it does work. So, I wonder if this is a reasonable explanation and if\nit can be explained by the work aliases work. If that is the case it would\nbe great to know if there is a way around it so I can keep using aliases\nwhilst making sure modifiers are not ignored.\n\n\nMany thanks,\n\n\nRioboo\n\n\nHi Rioboo,\n\n\nYour bat file only creates a single rendering with a single solar\nposition.  In fact, I don't understand the output, which looks much\ndarker than it should be for direct solar illumination.  Are you\nrendering different solar angles?  Can you do it with a simpler test\ncase, like a single piece of glass with your mirror parallel to a\ndiffuse surface that does not face the sun?  If you ran that at\ndifferent solar incident angles, the value divided by the cosine of\nthe incident angle (to account for grazing sunlight) should follow the\nFresnel approximation you are using.\n\n\nCheers,\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-June/011795.html).</sup>", "attachments": [], "created_by_name": "goodriver laurus", "created_at": "June 14, 2016 at 02:34AM", "created_by": "goodriver_laurus", "parent_id": "radiance-general_011789", "id": "radiance-general_011795"}