{"body": "On May 19, 2009, at 8:09 PM, Paul Chilton wrote:\n> In the .rif file, I'm creating the mkillum function which I've used  \n> the tutorial example is; mkillum= -av 18 18 18 -ab 0 . I then go  \n> into the .rad file to find the properties and geometry of the  \n> skylight and then copy and paste those values and descriptions  \n> separately into a new .rad file and save it as window.rad. In  \n> the .rif file I then refer to this window.rad file by specifying  \n> illum= window.rad. My interpretation of this procedure is that  \n> rather than the ambient being the generator of light into the space  \n> it is now the window itself which is the light source.\n\n\nHi Paul,\n\n\nSo you're on your way. Lars has explained that mkillum will do the  \n\"bringing of the direct component closer to your scene\" as I  \nsuggested. A couple of other pointers:\n\n\nYou want to create impostor geometry or define your skylight apertures  \nas illum sources. You do this by adding \"illum=\" lines to the .rif  \nfile. Let's say you have a skylight defined by a skylight.rad file,  \nthat describes the polygons that make up the skylight opening; you  \nwould remove that reference from the \"scene=\" line(s) and add an  \n\"illum=\" line. You are telling rad to take any polygons defined in the  \nillum= files and do a backwards raytrace from those polygons and out  \ninto the scene beyond. Generally this is the exterior environment, and  \nas such the rays traced stand a much better chance of hitting the sun.  \nThe results of this raytrace operation are saved and applied as a data  \nfile to the polygons defining the skylight or aperture and that  \naperture becomes a light source. I would not worry about an -av value  \nfor your mkillum= line, but I would definitely increase the -ab value  \nto 2 or 3, and -ad 512.\n\n\nYou should not do anything to the .rad files from there. rad is great;  \nif you tell rad (via the illum= line(s)) which surfaces should be  \nprecalculated as light sources, rad will manage the creation of these  \nsecondary light sources as they are called and create its own separate  \nrad files that substitute the precalculated illums for the  \ncalculations and/or renderings. Definitely look at the rad manual page  \nfor more info on this...\n\n\n- Rob Guglielmetti\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-May/005999.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "May 19, 2009 at 09:09PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_005989", "id": "radiance-general_005999"}