{"body": "Hi Jack\n\n\n> It looks like you are getting light in your image. There seems to be a \n> lot of light on the floor. Perhaps it is not working the way you expect?\n\n\nThe image I posted is of the correctly modeled luminaire before trying \nto replmark it as an octree (1st attempt which seems to be a dead end) \nor replmark an octree of geometry and separately replmark -x 4 ies files \n(2nd attempt which did not give any light output - ies markers did \noverlap geometry octree bounding cube) or replmark -x it as a single \n.rad file (3rd attempt not giving same light output as the posted image, \nbut some light output nonetheless).\n\n\n>\n> One thing to do that might help at least verify the spatial location, \n> would be to edit luminaire/hessamerica+++ca45-71r+++6500.rfl and make \n> sure that the light source is \"light\" rather than \"illum.\" This way \n> you can see its location in the image. Then make a scene that only \n> includes:\n>\n> !replmarks -x luminaire/hessamerica+++ca45-71r+++6500.rfl l_ies \n> scene/l_ies.rad\n\n\nI am pretty sure the distribution is close to correct now, I already did \nthe \"light\" definition to ensure this.  For this fixture, my illum box \nis 4' x 1'9\" x 2'6\", encompassing the reflector, supports, and lamp for \neach arm.  The central support arm does pass through this illum box, but \nmost candelas are going forward so I do not think this is causing \nsignificant inaccuracies in the resulting distribution.  I think the \nshadow lines on the floor are a little more intense because of this but \nthat's about it.  Any issues with applying ies data to such a large \nillum box?\n\n\nThanks for the suggestions!  Have you been successful using replmarks -x \nfor light sources in your renderings?  I think the double use of \nreplmarks -x (once for the 4 ies files, and then again for my final \nplacement) may be causing my problems now.\n\n\nZack\n\n\n\n\nZack Rogers\nEngineer / Daylighting Designer\nArchitectural Energy Corporation\n2540 Frontier Avenue, Suite 201\nBoulder, CO 80301 USA\n\n\ntel (303)444-4149 ext.235\nfax (303)444-4304\nhttp://www.archenergy.com\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-June/002761.html).</sup>", "attachments": [], "created_by_name": "Zack Rogers", "created_at": "June 23, 2005 at 08:15PM", "created_by": "Zack_Rogers", "parent_id": "radiance-general_002756", "id": "radiance-general_002761"}