{"body": "On Aug 11, 2006, at 10:42 AM, Kirk Thibault wrote:\n\n\n> On Aug 11, 2006, at 4:36 AM, Geraldine Joffre wrote:\n> <snip>\n>>\n>> Photographers in general do not wish to produce photorealistic  \n>> images.\n>> Geraldine Joffre\n>>\n> </snip>\n>\n> This is a very interesting statement, especially in light of 3D  \n> modelers and renderers who are trying to produce \"photorealistic\"  \n> images by using HDR photographs as radiance maps and reflectance  \n> maps.  Fascinating philosophical point of view!  I guess it comes  \n> down to one's definition of what is \"photorealistic\".\n\n\nThe quoted statement makes little sense to me as well, but perhaps  \nfor different reasons.\n\n\n\"Photorealism\" is a term that (I thought) means something \"looks like  \na [traditional] photograph.\"  Of course, when anyone picks up a  \ncamera, they already have understood and accepted that the image it  \nproduces will (most likely) be a 2D, monocular view of the scene that  \nis cropped by a rectangular sensor/ film plane, and subject to the  \ntechnology of the capture method. The resulting image looks nothing  \nlike what a human would see at the time, but many people still enjoy  \nphotographs (!) because they communicate part of what was seen at the  \ntime by triggering the mind to have a reaction. Good photographers  \nheighten the reaction to an image by choice of subject, framing,  \nlighting, processing, etc. This is all a part of the subjective  \nnotion of \"photorealism,\" and we see where this idea is stretched  \neveryday in bleached out colors in car ads, heavily retouched fashion  \nmodels, or even cropping a mother-in-law from a vacation photo.\n\n\nWhat people have been trying to do since the inception of photography  \n(the darkened room with a hole in one wall, or \"camera obscura\") is  \ncapture *some* of \"what is seen by the eyes\" at a specific time and  \nplace, and HDRI is trying to advance and redefine what is seen as a  \n\"traditional photograph\" by capturing *more* of what is seen by the  \nhuman eye (among other things). So, in my opinion, today's  \nphotographic HDRI (and tone-mapping) is quite \"non-photorealistic.\"  \nIsn't that the point? To reduce some of the limitations of photography?\n\n\nAnyway, this is all \"a storm in a teacup\" to me. Every image that  \ngoes into or out of my computer is subject to my whims and the  \ntechnology I have access to. I would imagine the same is true for  \nmost everyone else who takes photos - you post an image you  \npersonally think looks good. Plus, I've seen some truly awful results  \nfrom other TMOs put into powerpoint presentations to show what is a  \n\"good result,\" but my idea of \"awful\" is just where the author's  \nopinion departs from mine, as far as aesthetics are concerned. I  \ndon't see their example image or TMO as an obstacle to HDRI and  \ntonemapping - next year (or next month) there will hopefully be a new  \nadvancement and maybe myself and many others will find a use for this  \nnew research as well... when it gets into our tools, that is.\n\n\n-Mark\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2006-August/000130.html).</sup>", "attachments": [], "created_by_name": "Mark Banas", "created_at": "August 11, 2006 at 10:06PM", "created_by": "Mark_Banas", "parent_id": "hdri_000115", "id": "hdri_000130"}