{"body": "Hi Thomas,\n\n\nWell that is interesting about Sketchup models. And to clarify, my \nexperience has really been in trying to take client built sketchup \nmodels and get them into something useful. So my experience biased by \nbig not very well built/organized models provided by others. I guess the \nthing that I am glad to hear is that like any modeling tool, if well \nused and controlled, you can get something useful out of it. I would \ncertainly be interested in trying your translator if and when you feel \nit is ready to share.\n\n\nBest,\n\n\n-Jack de Valpine\n\n\nThomas Bleicher wrote:\n>\n> On 23 Oct 2007, at 13:43, Jack de Valpine wrote:\n>\n>> Hi Tom,\n>>\n>> One workflow option, much as I dislike suggesting it, is perhaps to use\n>> Sketchup as an intermediate. It looks like Vectorworks will save out \n>> an skp.\n>> Sketchup (commercial version) can then save out an obj format file, \n>> which can\n>> be converted with obj2rad. I have very limited experience with \n>> Sketchup, but\n>> in my few experiences, I have found that the models are very very hefty.\n>\n> Sketchup is no so bad. I have written a Ruby script to export Sketchup \n> models\n> to Radiance and I'm about to finish and release it soon (I keep saying \n> that\n> for 2 weeks now...). Sketchup has some nice features (like n-sided \n> polygons\n> and a total lack of complex geometric primitives) that can be translated\n> nicely into Radiance. It has not seen much testing (yet) and if Tom needs\n> a solution today I can only offer a work in progress.\n>\n> Anyway, Sketchup doesn't make the models 'hefty'; it's the users. If you\n> have a messy model in Sketchup/Vectorworks/Autocad it will end in a messy\n> model in Radiance.\n>\n> I remember that there is another script around which was presented at the\n> first Radiance Workshop in Fribourgh years ago. That might have seen some\n> further development and be in a more user friendly state.\n>\n> Other options: does Vectorworks offer a scripting API? A very simple\n> Radiance exporter should not be hard to do and can probably be derived\n> from a sample script (access to the 3D faces is all that's required).\n>\n> You could use Blender and Francesco's or my own export scripts. The\n> biggest problem is to find a format of the DXF file that Blender can\n> understand. But that's the problem of all export-import-export tool\n> chains (and ultimately of the DXF file format).\n>\n> Finally, I have written a partial DXF to Radiance converter in Python\n> once. It was written with one particular DXF file in mind and I don't\n> think I even added support for 3D faces. If you have a small DXF example\n> I could see if it works and perhaps add bit to support the most basic\n> files. I stopped playing around with that because I couldn't work out\n> some problems with transformations. But if Vectorworks exports to a plain\n> 3D space it should be fine.\n>\n> Regards,\n> Thomas\n>\n>\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n\n\n\n\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2007-October/004509.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "October 23, 2007 at 12:03PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_004494", "id": "radiance-general_004509"}