{"body": "On 16 Jan 2008, at 19:10, wjr wrote:\n\n\n> Hi everyone, again\n>\n> OK, things are getting better, thanks to all of you.\n\n\nWell, congratulations and welcome to the Radiance community.\n\n\n> Recap: running Solaris10 on ultrasparcIII, Installed development  \n> tools, ran ./makeall install, answered all questions, installed  \n> into /opt/Radiance3.6a\n\n\n3.6 is old! You should have downloaded 3.8 from the official site.\nDoesn't matter to you at the moment but please remember to report\nyour version (and platform) if you have any troubles and want to ask\nthe mailing list.\n\n\n>    and   /usr/local/bin........, verified that all files exist,  \n> ( even read a few of the ReadMe files)\n\n\nThe Readme files are sources of wisdom! You should read them all!\n\n\n> modified my path ( local.cshrc) to include $path:     set path =  \n> (bin /usr/bin/ usr/ucb /etc /bin $path .)   Printed the reference  \n> manuals and user guides and tried to make sense out of the  \n> tutorials.  huh?!\n\n\nRight path. The ultimate step is to buy the book 'Rendering with  \nRadiance'.\n\n\n> Now What????? What should I be looking for? What does Radiance look  \n> like?\n\n\nRead the README again, in particular the part that starts with:\n\n\n     \"The most important program to learn about if you are a\n     new user ...\"\n\n\nThen read the man page for 'rad' (and every other Radiance\napp you are going to use).\n\n\nThe basic idea is this:\n\n\nFirst there is a lot of text files describing your scene geometry.\nYou convert these files to a scene file (\"octree\") with the command\n'oconv'. Then you run 'rpict' (for images) or 'rtrace'/'rtcontrib'\nwith this scene as input to create your desired output.\n\n\nYou can find a few examples bundled with the source code in the\n'obj' directory. Unfortunately they also contain a bit of shell\nscripting which makes the whole think look more complicated than\nit is.\n\n\nThe best (free) beginner tutorial IMO are Axel Jacobs' course\nnotes for his Radiance course:\n\n\nhttp://luminance.londonmet.ac.uk/learnix/docs.shtml\n\n\nRead those, follow the exercises and try to understand what's\ngoing on in the example scenes.\n\n\n> How do I begin? I'm used to using CAD programs with a user\n> interface of some sort. I don't see one for Radiance.\n> Maybe I missed something along the way.\n\n\nThe one and only interface for Radiance is the shell. Amen.\n\n\nThere are some interfaces/exporters/converters for CAD and\n3D apps which will help you with creating the scene geometry\n(I think Arris has been mentioned already).\n\n\nGetting the materials and rendering parameters right, however,\nis a source of endless frustration|joy [delete as appropriate].\n\n\n> Please help, again.\n\n\nLooking back at your earlier emails I get the impression that\nyou are more interested in pictures than lighting analysis.\nSee if you can find something about this (old) Arris to Radiance\nconverter to get your CAD into Radiance format. If that doesn't\nwork there is a script for Blender that should work on Solaris.\nIf you can create '.obj' files you can convert those to Radiance\nwith a tool included in the distribution.\n\n\nThat should keep you busy for a while.\n\n\nRegards,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-January/004700.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "January 16, 2008 at 01:07PM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_004698", "id": "radiance-general_004700"}