{"body": "Hi Milan!\n\n\n>> It will still be useful to render some views (plan view, perspectives) to\n>> understand what is going on. Artefacts due to ambient settings not adapted to\n>> e.g. you fenestration become evident when you look at a splotchy image, but\n>> may be difficult to understand from some few illuminances.\n>\n> Thank you for advice. This is useful.\n\n\nAs Marija wrote, you can also just put a grid of sensor points into the \nscene. The background of my proposal was that a rpict-generated image \nmay be useful to track problems in the scene, even though the irradiance \nvalues you get would certainly be affected by the geometry added as a \nworking plane (which is not necessary when using a grid as rtrace \ninput). So if you take this approach, do not compare the results of a \nrendered image including work plane geometry to sensor point \nilluminances rendered without such geometry - they must be different. \nBut look out for suspicous shadows, splotches, noise, gradients that \nlook too smooth or not as smooth as you would expect it from the \ngeometry. Do all the basic checks (Afternoon sun coming in from \nEast...?) to find out whether the model is ok, this may help avoid a lot \nof trouble. For illuminance readings, you will have to remove the work \nplane geometry before running rtrace.\n\n\n>> You need only one glass pane. Same as in real. The only pitfall is that,\n>> without mkillum, you would get a lot of noise at acceptable ambient settings,\n>> or never ending rendering times. So just use a mkillum surface at your glass\n>> pane, and on the inner side of the blinds.\n>\n> I know that I have to use mkillum surface at my glass pane, I just forgot to\n> write it. Thank you anyway. But, how can I use mkillum surface on the inner side\n> of the blinds?\n\n\nAs long as the blinds are outside the glass, everything is fine and you \ncan use the glass surface as an mkillum input. If you ever should have \nto render a model with blinds on the inner side of the window, it is \nimportant to remember that the mkillum pane has to be inside the \ncomplicated geometry to precalculte.\n\n\n> Please, can you explain me this: \"render illuminance on a work plane (maybe you\n> put a desk surface into your model) using rpict -i\".\n\n\nAs you may already know, rpict per default gives you an image according \nto choosen projection, which means it results in an array of luminance \nvalues. You may however use the -i switch to get an image showing \nirradiance values on the visible surfaces. Using falsecolor, you can get \na quick idea on how illuminance is distributed over the surfaces of your \nscene.\n\n\nCheers, Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-December/007583.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "December 29, 2010 at 05:45AM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_007574", "id": "radiance-general_007583"}