{"body": "Chris, Greg, all\n\n\n>> I've run into a problem with falsecolor on the latest CVS version\n >> (compiled this morning). When I try to generate a falsecolor image\n >>  without a legend (by setting -lw 0 or -lh 0), I get an error:\n>> \"/tmp/<temp dir>/scol.hdr: bad picture size\"\n >>\n>> If I try to run the same command on the same image using the\n >> official 4R0 release I also have compiled, I do not get this error\n >> and the falsecolor image is successfully generated without a legend.\n>>\n>> Can anyone else replicate this error? Or is it possible that I have\n >> a compiling error somewhere along the way? Any help/insight would\n >> be greatly appreciated.\n\n\n> Thanks for pointing out this error.  The falsecolor C-shell script\n > was replaced with a Perl script written by Axel Jacobs, and I guess\n > this particular option wasn't tested.  There was a set of\n > single-quotes  that needed to be double-quotes, which I have fixed and\n > checked in this morning.  It should appear in tomorrow's HEAD.\n\n\nSorry about this oversight. Yes, I submitted a Perl replacement of the \nfalsecolor.csh script a couple of months ago. I wrote the Perl script \nsome time ago, needing to run fc on a server that didn't have CSH \ninstalled. Well, it seems I did not test all options thoroughly. \nApologies for that.\n\n\nI have since looked at some of the other CSH scripts, and started \nre-writing some of them. In the long run (Radiance 5.0???), I was hoping \nto get rid of all of them and replace them with Perl. If there are any \n'Perlistas' out there willing to adopt a CSH script and turn it into a \nPerl one, please get in touch with me. I would not like to burden Greg \nwith this for now. Maybe amongst us, we can come up with a 'coding \nstandard' to have some consistency here. I've got a few ideas and \nexperice with Perl coding (WebHDR is all done in Perl), but it's all a \nbit rusty...\n\n\nAxel\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2011-January/007603.html).</sup>", "attachments": [], "created_by_name": "Axel Jacobs", "created_at": "January 04, 2011 at 04:47PM", "created_by": "Axel_Jacobs", "parent_id": "radiance-general_007601", "id": "radiance-general_007603"}