{"body": "Hi Victor,\n\n\nAs is often the case with Radiance the problem likely lies outside what you\nthink is causing it.  That is why we need more info to properly diagnose.\n\n\nI'd suggest posting all your scene files (sky, geometry and materials), rif\nfile and complete list of commands you are using to achieve inconsistent\nresults.  Proper etiquette is not to attach files to a list posting, but\ninstead upload them to a website and include a link in your list posting.\n\n\nWhile I wait for more info, I'll speculate that maybe rad is creating an\noctree file with extra or fewer scene files because the rif file is missing\nsomething.\n\n\nBest,\nAndy\n\n\n\n\n\n\n\n\nOn 2/4/10 2:33 AM, \"Lars O. Grobe\" <grobe at gmx.net> wrote:\n\n\n> Hi Victor, again, please take some time to clearly describe what you do!\n>> I am sorry about my explianation!\n>> If i delete the rif file and change the command \" rad 5.rif\" into\n>> \"oconv 5.rad 5_sky.rad > 5.oct\". And run again, the result looks right\n>> and reasonable.\n> So\n> 1) you delete the rif-file\n> 2) you type oconv 5.rad 5_sky.rad > 5.oct\n> 3) you get a reasonable result\n> \n> I do not believe this as most probably you did not get any result. If I\n> reproduce your steps until here, all I get is an oct-file called 5.oct.\n> You did not even run any simulation according to your description. I do\n> not know what the meaning is of \"and run again\".\n> \n> Do not take this as unfriendly, but if you expect people on this list to\n> spend time thinking about your problem and helping out, the least you\n> could do is to take your time to describe the problem and the steps that\n> led you there. By the way, after having the typo in the subject line for\n> how many posts, I corrected it. Please be a bit careful with what you\n> post here. There are lots of quite busy professionals on this list, who\n> will always do their best to help out if they get asked in a proper way.\n> \n> Cheers\n> \n> Lars.\n> \n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-February/006505.html).</sup>", "attachments": [], "created_by_name": "Andy McNeil", "created_at": "February 05, 2010 at 09:51AM", "created_by": "Andy_McNeil", "parent_id": "radiance-general_006501", "id": "radiance-general_006505"}