{"body": "\"Unlike most other Radiance material primitives, the trans material is \nneither intuitive nor straightforward to apply.\"\n - Charles Ehrlich\n\n\nMarcus Jacobs wrote:\n\n\n> Dear Group\n>\n> I am modeling a bathroom that will use translucent light fixtures \n> similar to this:\n>\n> http://www.homedepot.com/cmc_upload/HDUS/EN_US/asset/images/eplus/725916808877_3.jpg \n>\n>\n> I wish to accurately simulate the light distribution from the fixtures \n> however I do not know where to begin as far as determining physically \n> valid parameters for the trans material. Does anyone here know where I \n> may obtain data for such light fixtures and how to correctly translate \n> this data into Radiance?\n\n\n\n\nHi Marcus,\n\n\nUnfortunately this is one of those areas where the best course of action \nis some measurement, followed with some trial and error.  Trans can \neffectively model this material, however.  I did a bunch of measurements \nof a translucent glazing several years ago, to obtain the transmittance \nat the normal as well as every 15-degrees off-axis. A trans material was \nthen created and progressively modified until the curves for the trans \nand the measurements aligned pretty well.  This will be fairly easy, \nassuming you can get a flat glass sample of those tulip-shaped shades. \n(Full disclosure: Greg helped me fit the data to a valid trans \ndescription, which is a large part of why it was fairly easy.)  \nMeasuring the actual shade itself would be a real bear, I'd expect.\n\n\n>\n> I have some additional questions concerning the trans material type. \n> In a Radiance reference manual, it is stated:\n>\n> \"Trans is a translucent material, similar to plastic. The \n> transmissivity is the fraction of penetrating\n> light that travels all the way through the material. The transmitted \n> specular component is the fraction of transmitted light that is not \n> diffusely scattered. Transmitted and diffusely reflected light is \n> modified by the material color. Translucent objects are infinitely thin.\"\n>\n>\n> First, should the transmissivity + transmitted specular component = 1 \n> in order for the material to be physically correct? \n\n\nThe best references for trans are the flowchart at Schorsch's site, \n(http://www.schorsch.com/rayfront/manual/transdef.html) and pp 325-326 \nin RwR. \n\n\nGood luck; I know Visarc Jack did some courthouse renderings a long time \nago that featured these large alabaster pendant bowl-like shades, and \nthey looked amazing; the trans really captured the soft lamp image quite \nwell.  Maybe Jack can share what he did?  Even if he measured the actual \nshade, they had a fairly large radius to them.  Your tulip shades will \nbe a real challenge, I think.\n\n\n- Rob\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-June/003745.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "June 02, 2006 at 11:25PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_003743", "id": "radiance-general_003745"}