{"body": "Ciao Roberto.\n\n\nI'll start with the end of your e-mail:\n\n\n> I don`t know if my way is right but I`d like to know\n> something about it and what sky is better to use\n> to get the horly internal illuminace values to link\n> these ones to EnergyPlus or Trnsys.\n\n\nSo you really want to know internal illuminance values for a given\nscene for the whole year? (I hope you know you can get the external\nilluminance from the epw file.)\n\n\nMy summary of your problem:\n\n\nYour idea is to use Daysim (or Radiance) with a climat data file to\ncalculate the internal illuminance values and plug these into E+ or\nwhatever. Your first step is to calculate external values in an empty\nscene to \"validate\" your sky model. Doing this in Daysim and Radiance\n(with gendaylit) you got two sets of results with significant\ndifferences.\n\n\n> The parameters used to do it are:\n>\n> -ab 4 -ad 1024 -as 256 -ar 512 -aa 0.1 -lr 2 -st 0.015 -sj 1 -lw\n> 0.004 -dj 0.5 -ds 0.001 -dr 2 -dp 512\n\n\nI hope you did have a -I option in there some where. You also only\nneed to increase your \"-ab\" to 1 to get the \"diffuse\" part.\n\n\nNow the interesting bit:\n\n\nIf you look at your results or the global horizontal values you will\nsee that the Daysim values are roughly 25%-30% higher than those\ncalculated in Radiance. However, they are consistently higher (which\nis good). I would expect that the difference is a result of the\napproach the two applications have:\n\n\n1) Daysim calculates a sky component and just maps the sky onto this\ndistribution to get a particular result.\n\n\n2) Radiance used the sky directly in it's raytracing calculation.\n\n\nBoth sets of results are bound to be different from the actually\nobserved illuminance on the ground. You can extract the illuminance\nvalues from the EPW file and compare them to the calculated results.\nIf you find that one of the sets is reasonably accurate go with that.\n\n\nYou can also use the measured values to 'calibrate' your calculations\nand scale the internal results according to a reference calculation\noutside. If your reference point value is different from the EPW\nrecord you increase or decrease the calculated illuminance to\ncompensate for the overall difference.\n\n\nYou can do this either with the Daysim or Radiance results. I would\nguess that a calculation for a whole year would be faster in Daysim.\n\n\nRegards,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2011-February/007675.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "February 04, 2011 at 03:48PM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_007674", "id": "radiance-general_007675"}