{"body": "Hi,\nhere something:\n\n\n-1- you need to change time and NOT aperture, since depth of field changes\nwith aperture settings.\n(depth of field could be simply explained as the parameter that indicates\nhow we are able to see more things in focus other than just the foreground)\nfurthermore close apertures eliminate some lens artefacts like coma (light\nsources are elongated when close to the frame of the picture, expensive\nlenses have not this problem though)...  \nas a general suggestion for luminance measurement I would recommend to use\nbig F numbers.\n\n\n-2- aperture=F stop=F number   <> time, exposure time,shutter speed\n\n\nbasically there is a curtain inside the camera that moves:\nthis is the shutter and takes care of let in the light\n(speed is indicated in seconds and fraction of seconds, 1/60 is 1/60 of\nsecond sometimes it is written as 60)\n\n\nthere is a diaphragm inside lenses,\nthis close  when the picture is being taken, leaving just an hole in the\nmiddle, the hole dimension is the aperture.\nthe smaller the hole the bigger is aperture number (it's a fraction 1/1.4\n1/2 1/2.8 .... 1/16 1/22 1/32 ... 1/64)\nthe smaller the hole the bigger depth of field\n\n\n\n\n\n\n-3a- 'trouble about HDR patches' doesn't seem to be a problem, it is a\nwarning and results are always fine... sounds like 'warning no light source\nfound' and you are calculating a DF... ;-))\n\n\n-3b- this happens when images have not enough data to create the camera\ncalibration curves... \nmay be others can explain in depth....\n\n\n-4- this could be because the images are too different or some exif data are\nmissing (sometimes this happens because the software that imports images\noverwrite exif data)\n\n\n-5- no idea\n\n\n-6- I found the same thing, however a good tripod 'fixed' all my problems\n;-))\n\n\nHope it helps,\ncheers,\npillo\n\n\n\n\n\n\n\n\n\n\n -----Original Message-----\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-January/002265.html).</sup>", "attachments": [], "created_by_name": "Giulio Antonutto", "created_at": "January 06, 2005 at 06:34PM", "created_by": "Giulio_Antonutto", "parent_id": "radiance-general_002264", "id": "radiance-general_002265"}