{"body": "Hello, John.\n\n\nOn Thu, Nov 11, 2010 at 10:49 PM, John <john.sullivan.cl at gmail.com> wrote:\n> Hello,\n>\n> My name is John and I am trying to get automatic communication between Radiance\n> and other programs for my thesis.\n> I just discovered this group.\n\n\nWelcome.\n\n\n> These archives look very useful. Hopefully I have not been wasting\n> my time working on something that the people here have completed\n> already.\n\n\nDon't worry, it wouldn't be the first time ...\n\n\n> Has anybody figured out, for example, how to incorporate radiance\n> simulations into loops running in other programs?\n\n\nLinking an application to Radiance (for control or geometry input) is\nin general a three step process:\n\n\n1) export the scene geometry to Radiance (write text files)\n2) control the steps necessary for the Radiance calculations (execute\nsystem commands)\n3) import the results back into your application (read text or binary files)\n\n\nI expect that most advanced modelling or scientific applications\nhave scripting capabilities that allow you to do these three tasks.\n\n\n> such as rhino, autocad, or even matlab?\n\n\nOthers have already written about Matlab.\n\n\nFor Rhino you can have a look at DIVA-for-Rhino (www.diva-for-rhino.com)\nwhich does at least the export and control bits. I think it's focused on\nDaysim but that's more or less tailored version of Radiance\n\n\nAutocad has a number of scripting options. I think VBA should\nallow you to script all the necessary steps. You may have a\nproblem with the export because Autocad does not always allow\naccess to polygone data that's necessary for Radiance. I am not\naware of a current project or product that exports from Autocad\nto Radiance.\n\n\nThere are also a number of 3D modellers for which Radiance\nexport tools are available. Some (like Blender) are open source\nso you can get all of the source code and modify it as required.\n\n\nLet us know about your progress.\n\n\nRegards,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-November/007452.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "November 12, 2010 at 06:23AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_007448", "id": "radiance-general_007452"}