{"body": "Hi Martin, \n\n\nsome short comments to your suggestions:\n\n\n> rview version of rpiece\nwould be a nice thing to have. Indeed, I already wrote something like\nthis (although not based on rpiece, but generally on a separate parallel\nprocessing library (PVM)). The problem is, however, that the succesive\nrefining scheme of rview needs a lot of data shuffling when sending the\noutput of different processes to the display, so the parallel rview came\nout really slooooooow, which is why I abandoned it and do parallel\nprocessing only in rpict mode.\n\n\n> easier application of picture mapping\ntry to include the picture/texture mapping and the object on which it is\nmapped in one file. When placing this file with xform to an arbitrary\nposition and orientation, the mapping function gets transformed\nautomatically as well\n\n\n> reliable smoothing functions\nthe smoothing option in e.g. gensurf (-s) works very well. I don't have\nany experience in cases when polygon meshes are imported from CAD\nprograms, although I already thought about an independent smoothing\nprocess which could be let loose on any given polygon set. \nQuestion: does the smoothing generally get lost when importing stuff\nfrom, say, Autocad ?\n\n\n> the ambient calculation..\nwell, there's no easy way to accomplish difficult tasks. Intricate\ngeometry demands a high sampling density, interpolation always is some\nsort of 'secondary' measure which - no matter how sophisticated it is\nperformed - often reaches its limits rather soon . Nevertheless, I judge\nyour given settings to be very high. I had much succes in achieving\nvisually appealing images (judged not only by myself.. :) with far\nlesser parameter settings. \n\n\n-Carsten\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-October/000436.html).</sup>", "attachments": [], "created_by_name": "Carsten Bauer", "created_at": "October 16, 2002 at 01:31PM", "created_by": "Carsten_Bauer", "parent_id": "radiance-general_000425", "id": "radiance-general_000436"}