{"body": "Hello Avinash,\n\n\nThere are two possible issues that I can think of: one regarding image \nsize (more likely culprit), and the second regarding metadata (less \nlikely). I am pretty sure the image size issue will solve your problem, \nbut you may also get improved results using images processed in a \nslightly different way. Here are possible solutions:\n\n\nSOLVING THE IMAGE SIZE ISSUE\n\n\nDepending on the exact pixel count of your hdr, you need to make slight \nadjustments to one of your image angle values. Using a camera and lens \nsimilar to yours (Nikon D90 & AF-S Nikkor 35mm 1:1.8G), I collected a \nseries of raw and .jpg processed images. In my 3 experiments, I got the \nfollowing image sizes (shown with Matlab code):\n\n\nnef = [4310 2868];\njp1= [4288 2848];\njp2= [1936 1286];\n\n\nAccording to your notes, you set vv and vh as follows:\n\n\nvv = 25.74\nvh = 37.4\n\n\nNow, I will recompute vv according to the pixel values and vh noted \nabove, which will show slightly different vv values:\n\n\nvv_t1 = 2*atand(nef(2)/nef(1)*tand(vh/2))\nvv_t2 = 2*atand(jp1(2)/jp1(1)*tand(vh/2))\nvv_t3 = 2*atand(jp2(2)/jp2(1)*tand(vh/2))\n\n\nNotice that the answers are slightly different than vv above:\n\n\nvv_t1 = 25.3864\nvv_t2 = 25.3403\nvv_t3 = 25.3431\n\n\nA detailed explanation is available in this posting from May 16, 1994: \nhttp://radsite.lbl.gov/radiance/digests_html/v2n7.html#VIEW_ANGLES\n\n\nSOLVING POSSIBLE METADATA ISSUE\n\n\nI am not sure if this will help, but I suspect another culprit may be \neither missing metadata in your Photoshop .jpg images, or (maybe but not \nlikely) the .hdr algorithm in Photoshop. I've tested the following 3 \npossible solutions using the same D90 and hdrgen wrapper variants--all \nof which seem to preserve the metadata in the images, and produce \nphotometrically accurate results (list members, please correct me if I \nam wrong about the above metadata assumptions)...\n\n\nMethod 1)\n\n\nTo process .nef images, see Greg's suggestion posted on February 20, \n2012: \nhttp://www.radiance-online.org/pipermail/hdri/2012-February/000363.html. \nThis seems to be the best raw to hdr method, as it seems to produce the \nmost photometrically accurate images.\n\n\nMy line of code looks like this: raw2hdr -o test01.hdr *.NEF (although I \nshould have included a calibration image).\n\n\nOr, to use .jpg images, which are less accurate photometrically (but \nstill works), try either of the following procedures:\n\n\nMethod 2)\n\n\nWith .nef images still in the Nikon D90, use on-board post processing of \n.nefs to .jpgs. That should give you the right metadata embedded in the \n.jpgs, which may have been lost in the Photoshop .nef to .jpg conversion \nprocess. I've tried this method, and it works. On the D90: Press \nplay-->select image-->press \"ok\"-->NEF (RAW) Processing-->(Chose your \nfavorite settings)-->EXE. Repeat that process for each image. Then \ncreate the .hdr using hdrgen, Photosphere, or the online tool. I used \nPhotosphere in this case.\n\n\nMethod 3)\n\n\nYou can do batch processing (.nef->.jpg), using Nikon's ViewNX 2 on your \ncomputer, as follows: Select your images, then: File-->Convert \nFiles-->Convert. I've also verified that images from this method work \nwith Photosphere. Or create .hdr with Photosphere, hdrgen, or the online \ntool.\n\n\nNote that with methods 2 or 3, you will have .jpg images that will be \nprocessed using hdrgen or photosphere (or maybe Photoshop). Keep in mind \nthat Method 1 is the most difficult to set up, but will produce the best \n(i.e., most photometrically accurate) results.\n\n\nI hope these suggestions help (and don't lead you astray).\n-Chris\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2013-April/000462.html).</sup>", "attachments": [], "created_by_name": "Chris Kallie", "created_at": "April 23, 2013 at 11:21PM", "created_by": "Chris_Kallie", "parent_id": "hdri_000461", "id": "hdri_000462"}