{"body": "Hi,\n\n\nsorry, so again, I try to be clear in asking this time ;-) By the way, \nhave nice holidays (I hope that's the reason for your travel ;-)!\n\n\nAll is about the question how to map pictures onto a surface without \ncorrupting its material properties. I understand that colorpict \nmultiplies the material color components with those of the picture.\n\n\nIf I have a grayscale image processed by normpat (which means that the \naverage gray value is 1.0) and apply it to a material, the overall \ncolor and brightness will remain the same. So I get the \"pattern\" from \nthe image, but the surface still has the correct material properties \n(color, brightness etc). I used this so far.\n\n\nNow I want to use a colored picture for mapping. I also apply normpat \nto it, so, as far as I understand, the average of all R, G and B must \nbe 1.0, right? For example, I use a normpat'ed picture of green marble. \nI than apply this using colorpict to a surface, which has a \"marble\" \nmaterial. Will the overall color and brightness still be that of the \ndefined material, as the picture map has the average of 1.0?\n\n\nThe background: I try to use exact data for material definitions, but \nthe image maps can't all be color corrected. So I want the overall \ncolor and brightness from defined materials, e.g. from the plastic \nmaterial, and use the map only for what I would call \"local color \nvariation\". The reason is that I have e.g. red marble, got its color, \nbrightness and all that defined as plastic marble. But the marble has \nblue particles which won't appear if I use a grayscale imagemap. So I \nwant to use a normpat'ed (NOT colorcorrected e.g. by macbethcal!) to \nbring these blue parts onto the surface. The whole surface however must \nstill have the average color of my plastic marble material.\n\n\nIf I understand the man-page of normpat, that's just what it was \ninvented for. However, I am a bit unsure, as all Radiance documentation \nuses colorpict with a bright white material.\n\n\nTIA+CU, Lars.\n\n\nLars O. Grobe\ngrobe at gmx.net\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-June/001859.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "June 29, 2004 at 01:34PM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_001837", "id": "radiance-general_001859"}