{"body": "Howdy all,\n\n\nGuess what's in five weeks? Yeah, that's right, the Radiance Workshop! \n\n\nhttp://www.nrel.gov/buildings/2013_radiance_workshop.html\n\n\nNREL is thrilled to play host to you all, and we look forward to a nice turnout for the 12th annual celebration of that plucky ray tracer known as Radiance. Developed at LBNL and EPFL, Radiance continues to evolve, as do utilities and interfaces for the Radiance engine. Come out to NREL in sunny Golden, CO, USA August 12-14 2013, and share/see what's been going on in the Radiance community, meet your colleagues, and see some Radiance-influenced, daylit buildings on NREL's campus.\n\n\nDay 1 will feature presentations and demos on core Radiance additions, and interfaces. *Please* consider giving a presentation on your own work/experience with Radiance during days 2 and 3. Participant presentations really are the heart of the workshop; I will post a preliminary schedule of speakers soon. Meanwhile, I need more speakers! Don't be shy. Your work with Radiance begets more funding for core development, after all. \n\n\nRegistration is free, but dinner is on you this time around. This is what is known as a good deal. Please see the url above for details about the workshop, and see below for details on getting to and staying in Golden:\n\n\nhttp://www.nrel.gov/about/golden_info.html\n\n\nThis is a not-so-subtle prod to get you to email me -- if you haven't already -- your intent to participate in the workshop. If you are a foreign national, please send me your email ASAP so we can get your visitor paperwork started. ASAP, as in NOW. \n\n\nLooking forward to seeing you here next month.\n\n\nCheers,\n- Rob\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2013-July/009613.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "July 09, 2013 at 08:43AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_009615", "id": "radiance-general_009613"}