{"body": "Hi Ilya!\n\n\n> 1. Is there way to estimate diffuse reflectance without using of\n> integrating sphere? Also, to some extent, can the reflectance measured\n> under overcast sky conditions be referred to as diffuse reflectance?\n\n\nYes, the integrating sphere is only one possible instrument. \"Diffuse \nreflectance\" is usually referring to direct-hemispherical reflectance \nwithout whatever is defined as specular. The problem with turning it the \nway that you measure it as hemispherical-direct (incident light over \nhemisphere, measured at perpendicular angle) is that you must know the \nBRDF, and as far as I understand the idea, would need a uniform \nhemispherical source (overcast is non-uniform). A small integrating \nsphere is not all that expensive, by the way...\n\n\n> 2. How do you calibrate your CCD cameras for taking luminance measurements?\n\n\nAgain - using an integrating sphere, a stabilized light source, and a \ncalibrated detector as a reference. One example where we did that was \npresented at the Radiance Workshop in 2008:\n\n\nhttp://www.radiance-online.org/radiance-workshop7/Content/Jacobs/jacobs-fribourg2008d.pdf\n\n\n> 3. With uncalibrated camera, I guess the reflectance values can be\n> estimated using HDR shots of GretagMacbeth ColorChecker chart as\n> reference. The ColorChecker chart's reflectance values are known, right?\n> So, it is possible to compare the values from the shot of a sample\n> against the values from the shot of the chart to estimate the\n> reflectance of the sample?! But where can I get the GretagMacbeth\n> ColorChecker Rendition chart's RGB reflectance values? I wonder if\n> anyone have measured them?!\n\n\nThey are printed on its back, and you can assume the chart to be a nice \ndiffuse surface. However, the pixel values in you picture represent \nluminance (or radiance), not reflectance!\n\n\n> 4. What are in the \"macbeth_spec.hdr\" and \"macbeth_pub.hdr\" files? What\n> data are in these files?\n\n\nI think the spec-file is the reference giving the chart, while the \npub-chart may be used for calculations, but I am not sure now. The image \nfiles are used for macbethcal-\"calibrations\".\n\n\n> 5. Having estimated BRDF for a particular material sample can we\n> estimate the material's diffuse reflectance?\n\n\nIf you have measured the BRDF (which is done using other instruments \nthen an integrating sphere, and a bit more complicated), you can derive \nthe diffuse reflectance by integrating the transmission hemisphere's \ndata and substracting the integral of the specular range. If you start \nwith estimating a BRDF, I have my doubts that you will end up with \ncorrect values. Using a grey-chart and comparing using you eyes may be \nmore promising. But maybe you do both and compare your results.\n\n\nCheers, Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-November/007430.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "November 04, 2010 at 02:12AM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_007425", "id": "radiance-general_007430"}