{"body": "Hi Amarpreet,\n\n\nGood timing, I was just eating lunch here...\n\n\nsethi@asu.edu wrote:\n\n\n> ... However the sky ...  is defined so easily even though it is so complex.\n\n\nWell said; I wish more of our clients understood this very simple truth!\n\n\n> Here are the questions:\n> 1. All I do to specify the sun is write the following one line for the sun : \n> does gensky model the sun as a light material using these definitions?\n> !gensky 4 11 13:0 +s -a (latitude) -o (longitude) -m (meridian) –B (horizontal \n> diffuse irradiance) –R (horizontal direct irradiance, can direct normal be \n> used?)\n\n\nGensky is very flexible, and simple, but added complexity is available. \n   =8-) The manpage explicitly lists all the options, but I don't \nbelieve specifying direct normal irradiance is an option.  You can \nspecify the sun radiance, however.  Others can probably give better info \non these options, as I tend to use the lat/long/timezone/TOD method.\n\n\n> 2. Should skyfunc be defined by me before it is used as a modifier in the sky \n> definition, or does the skyfunc modifier take the input from the first line \n> (as above) to modify the glow command?  (pg 355 of RWR)\n\n\nYou've got it, skyfunc is *defined* by gensky, and *applied* by you in \nyour subsequent source statements.  When you use skyfunc as a modifier \nright after the inline !gensky command, the sky glow is modeled using \nyour input parameters from that gensky command.\n\n\n> 3. Following parameters define the sky and I believe it is modified so as to \n> give a blue hue etc, but how is it determined as to what it should be for a \n> specific case?\n> skyfunc glow skyglow\n> 0\n> 0\n> 4 .986 .986 1.205 0 (these values are modified, sometimes 4 .9 .9 1 0 is used \n> also for sunny skies)\n> \n> skyglow source sky\n> 0\n> 0\n> 4 0 0 1 180\n\n\nBy specific case you mean sky color?  The color is totally arbitrary, \nhowever this is very important, the weighted average RGB must add up to \n1!  If you pick values that give you a pleasing sky color but add up to \ngreater or less than 1, your sky luminance will be incorrect.  It will \nbe factored by the deviation from 1 in your average.  And, .9 .9 1 \n(which is used as an example blue sky on the gensky manpage) is just \nsuch a combination!  I mentioned this to Greg a little while ago, and I \nthink it got fixed in the distribution, but the radiance website still \nhas the error:\n\n\nhttp://www.radiance-online.org/pipermail/radiance-general/2003-May/000789.html\n\n\n(hmm, Schorsch, yours still has this error as well: \nhttp://www.schorsch.com/rayfront/manual/htmlman/gensky.html)\n\n\n\n\n> 4. Similarly while defining the ground, what is the best way to determine what \n> the ground values for RGB should be – I have been contemplating between using \n> one of the following case but what should I base the decision on? How do you \n> judge as to what values should be used for your specific case?\n> skyfunc glow ground_glow\n> 0\n> 0\n> 4 1 .7 .25 0 (or 4 1 1 1 0 is used, I am guessing, for a uniform glow!)\n\n\nColorwise, the same thing applies for grounds and skies.  Use a color \nthat makes sense and don't over saturate it, and make sure its weighted \naverage equals 1.  As for ground reflectance, just make sure you specify \nthe average ground reflectance in your gensky command with the -g \nparameter.  When skyfunc sees the negative z component to your ground \nhemisphere it will modify the reflectance of that glow by whatever \nfactor you used in -g. When you use this feature, as long as the -g \nreflectance matches whatever material you use for your local ground \nplane, you will get a very good match (except at certain shallow viewing \nangles) between the local plane and the distant horizon.\n\n\n\n\n\n\n      Rob Guglielmetti\n\n\ne. rpg@rumblestrip.org\nw. www.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-October/001056.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "October 14, 2003 at 02:10PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_001055", "id": "radiance-general_001056"}