{"body": "Lots of questions, I think I can answer some of them…\n\n\n\n\n> \n> 1- In the tutorial, a single polygon (relative to the outline of the glazing surface) is modeled in the scene at the exterior side of the window. This polygon is referenced to generate the daylight matrix. A second polygon is modeled in the scene on the interior side of the window and it is referenced to calculate the view matrix. \n> \n> I was wondering if I could generate two identical co-planar polygons  where the normal vector of one polygon is looking at the interior side  and the normal vector of the other polygon looks at the exterior side to be referenced, respectively, for the view matrix and daylight matrix calculations? if so, would it still be necessary to model the thickness of the walls hosting fenestration systems in the simulation scene?\n\n\n\n\nYou could do that, just make sure that your octrees for the view and daylight matrices only contain one the other polygon. If you have a coincident pair of polys in the same octree, it’s up to chance which one is hit by each ray traced. It’s already critical that every ray be counted toward something meaningful (this is the reason for the phases in the first place, with complex fenestration systems). \n\n\n\n\n> 2- What is the \"proxy geometry\" in the five-phase method? is the \"proxy geometry\" exclusively a reference to the polygon at the interior side of the window system that is assigned a BSDF material?\n> or is the \"proxy geometry\" a reference to the 3D geometry of the  venetian blinds (or any other type of shading layer of the fenestration system) in the scene?\n\n\n\n\nIt’s the latter. That geometry serves to block the direct light, in that phase of the workflow.\n\n\n> \n> 3- what is the \"thickness\" as the first parameter in the Radiance BSDF material type referring to? is it measured as the distance between the daylight matrix polygon on the exterior side of the window and the view matrix polygon at the interior side?\n\n\nYes.\n\n\n\n\n> \n> or does \"thickness\" refer to the depth of the entire fenestration system including the glazing panes and any shading layers?\n> \n> 4- If I model the mullions defining the edge condition of any individual glazing pane in 3D scene, what would be the difference between using LBNL's Window to generate a BSDF file and using genBSDF?\n\n\n\n\nHmm, I don’t think there would be a difference in terms of the Radiance BSDF and calculations. \n\n\n> \n> 5- What would be the difference between using a BSDF file based on Klem's division scheme with higher resolution (where each Klem's patch is subdivided to 4 new patches) and using a tensor tree BSDF?\n\n\n\n\nThe difference would be higher accuracy in the case of the tensor tree BSDFs, at the expense of longer stimulation times, much larger files (both the input and output), and longer BSDF generation times.\n\n\n- Rob\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-January/011466.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "January 31, 2016 at 08:40AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_011465", "id": "radiance-general_011466"}