{"body": "Thanks Andy! I recommend VLC player for all your codec brain damage issues. Seems to play everything (it's what I used to listen to the original files), it's free, and it was suggested to me by none other than John M from this very list.\n\n\nhttp://en.wikipedia.org/wiki/VLC_media_player\n\n\nThis is such a good bunch of peeps.\n\n\n- Rob\n\n\nRob Guglielmetti\nNational Renewable Energy Laboratory (NREL)\nCommercial Buildings Research Group\n15013 Denver West Parkway MS:RSF202\nGolden, CO 80401\n303.275.4319\nrobert.guglielmetti at nrel.gov\n\n\n\n\n\n\nOn 9/19/12 11:07 AM, \"Andrew McNeil\" <amcneil at lbl.gov<mailto:amcneil at lbl.gov>> wrote:\n\n\nHi Everyone,\n\n\nI've re-encoded all the audio files from the workshop because some people had problems listening to them on windows PCs.  The new files play using iTunes, quicktime or various other *good* media players on windows.  They still don't play with windows media explorer (unless you've managed to install the right codec).  I've also updated a few of the presentations over the last couple of days.\n\n\nThe trouble with posting materials quickly is that revisions become necessary...\n\n\nAndy\n\n\n\n\nOn Mon, Sep 17, 2012 at 10:59 AM, Andrew McNeil <amcneil at lbl.gov<mailto:amcneil at lbl.gov>> wrote:\nAll,\nI've just uploaded the last of the presentations, including replacing presentation that had pdf export artifacts.  Greg's photos have also been posted.  If anyone else has photos they'd like to share, send them to me and I can add them.\n\n\nThere are now zip files so you can download all the presentations at once.\n\n\nAndy\n\n\n\n\n\n\n\n\nOn Sun, Sep 16, 2012 at 9:45 PM, Guglielmetti, Robert <Robert.Guglielmetti at nrel.gov<mailto:Robert.Guglielmetti at nrel.gov>> wrote:\nThanks to all for hosting this event, attending the event, and for sharing the event with those of us who were unable to attend. Very interesting presentations, and I have not yet seen/heard them all yet!\n\n\nNext year at NREL? I guess I'll get started on that now. =)  (that would be awesome.)\n\n\n- Rob\n________________________________________\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2012-September/008895.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "September 19, 2012 at 10:25AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_008876", "id": "radiance-general_008895"}