{"body": "Zack Rogers wrote:\n\n\n> First, the efficacy radiance uses for a 32W T8 is 179lumens/W?  I'm assuming\n> that efficacy is for light energy and not power consumed.  Is this the same\n> for all lamps?  Most of the time the efficacy of a lamp refers to the power\n> consumed, a typical T8 having an efficacy of 2900lumens/32W or 90lumens/W.\n\n\nI'm not sure if efficacy is really the best word here. The value\nof 179 is simply the factor that Radiance normally uses for\nconverting between photometric and radiometric units (lumens per\nWatt of radiation in the visible spectrum), taking into account the\nresponse curve of the human eye for a \"uniform white\" light color.\n\n\nSince Radiance knows nothing about electricity, the electrical\npower consumption of your lamp has no relevance in the\ncalculation at all. For all we know, you could just as well be\nworking with a magic oil lamp!\n\n\n\n\n> Also, I agree that the luminous surface is 0.0979m2 (I had missed a length of\n> 4' in my calc).  Then you calculated the radiance with\n>\n>   16.2W / (0.0979m2 * Pi) = 52.7 W/m2/sr\n>\n> This is the total radiant output per steradian per area.  However, it seems\n> like the total steradians you should be dividing by is the entire sphere that\n> the 16.2W of radiant energy is filling, a sphere being 4*pi steradians.\n> This gives;\n>\n>  16.2W / (0.0979m2 * 4 * Pi) = 13.17 W/m2/sr\n\n\nWhy do we divide by Pi? Good question...\nI don't have a degree in math myself, so I can't explain this\nvery well either. The best hint might be that we're looking at a\ndiscrete direction (a point out of a continuum), and not at a\nfraction of the total [hemi]sphere (a subset of that continuum).\nOur direction has a solid angle of zero, while your line of\nthought assumes a solid angle of 1.\n\n\nThat doesn't really explain the division by Pi, but at least it\nshows why a division by 4*Pi for the full sphere (or 2*Pi for the\nhemisphere) would be wrong. The factor of Pi can probably be\nfound somewhere in the derivation of the integral that stands\nbetween radiance and radiant exitance, but I'll leave that as an\nexcercise for the readers... ;)\n\n\n\n\n> So, I'm still a little confused with the math here,\n\n\nDon't worry, so is everybody else!\n\n\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch.com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2001-December/000102.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "December 21, 2001 at 03:04PM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_000101", "id": "radiance-general_000102"}