{"body": "Hi Lars,\n\n\nRob has some good tips about using rad to generate rendering options \nusing the OPTFILE setting, and I use this feature a lot, myself.  There \nare many ways to run the rad command, and the man page is the best \nplace to look for understanding these.  In its most basic form, it acts \nlike a simple makefile to build an octree, optionally running mkillum, \nand maintain a set of rendered and filtered pictures.\n\n\nHowever, if you're doing a set of runs over different lighting \nconfigurations, scene alternatives, etc., you often need a lot more \nthan rad can offer in terms of scene building.  I sometimes use a \nmakefile to maintain the various octrees I use based on scene input, \nthen employ a rad input file that specifies only the OCTREE setting -- \nno explicit scene files.  This can also be specified on the rad command \nline, so a single rad input file can suffice for many scene \nalternatives.\n\n\nFor generating animations, the ranimate program does a reasonable job, \nthough it really needs updating for running animations over a network \nnow that rsh no longer exists....\n\n\nWith regard to fisheye projections, the -vta option can go up to a 360 \ndegree field of view, where you get a circular image whose \ncircumference is essentially a single value corresponding to the \ndirection opposite the -vd parameter.  I don't know anything about \nptviewer, or the kinds of projections it uses.  You may need to write a \nscript and pass it to rtrace with the -fac (and -x & -y) options to \ntake ray origin and direction on the input and produce a color picture \non the output.  Using this method, you can get any projection onto a \nrectangular image that you can describe mathematically.\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-November/000495.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "November 27, 2002 at 09:42AM", "created_by": "Greg_Ward", "parent_id": "radiance-general_000493", "id": "radiance-general_000495"}