{"body": "Hello again,\n\n\nThank you Peter for your reply. The animation is really impressive. And I\nunderstand your point about parallax error. I guess there`s always a price\nwith either method since there`s only one image map to start with. If I\nunderstood well Greg`s post, there are different ways to do this, each with\npluses and minuses, depending in window size or distance to outside objects,\netc. So, I`ve been trying what I could through the weekend with mixed\nresults.\n\n\nFirst, I tried to map a rendered fisheye image of the sky to a source,\nreplacing gensky, but there`s something strange with my transformations (the\nsky appears diamond shaped...:/), so I need to review the mapping, but it\nseems to be working. Like Rob said, the possibilities are really cool [Hi\nRob!]\n\n\nI was thinking on taking HDRs of inside and outside of a building (at the\nsame time) and then compare the results with inside renders using a mapped\nsky for outside. Has anybody tried it?\n\n\nOTOH, I defined a simple room with a sky outside (using gensky) and then\ntook fisheye images of the sky and the view out of the window. I followed\nGreg`s instructions with fiseye.cal, and it worked perfectly (of course!)\nBut when taking rtrace measurings, there was a slight difference between the\nmodel with the original sky and the mapped model (about 4.5%) Could this be\nbecause of the relative size of the window (1/9 of the wall in this case)?\nor maybe I`m doing something wrong? I assume the rtrace parameters have\nnothing to do since they`re the same in both cases, but maybe I`m wrong\n(again?)\n\n\nI understand all this was meant to help Rob with a particular practical\nproblem but I was interested in the more general case. I am now in the\nprocess of measuring daylight in a real building, and I thought this could\nbe a good way to validate results with renderings (I will nedd to use\nrenderings later) Then, sorry if I diverge from the original post. And\nthanks again for your help.\n\n\nSantiago.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-June/000852.html).</sup>", "attachments": [], "created_by_name": "Santiago Torres", "created_at": "June 09, 2003 at 01:42PM", "created_by": "Santiago_Torres", "parent_id": "radiance-general_000818", "id": "radiance-general_000852"}