{"body": "Hi All,\n\n\nI just want to follow-up on this a bit.\n\n\nClearly there are a lot of CMS options such as Wiki and others that have \nalready been mentioned. I think though rather than revisiting what tool \nto use, we really need to focus on what content would be valuable, how \nit is organized and who would be interested in producing what content. I \nthink that we really need to rely on care and thoughtfulness that Peter \nA-B and Daniel Fuller have already given to what is the appropriate \nsolution for managing the content, in this case Plone.\n\n\nThere is a huge amount of valuable information that gets generated on \nthis list. However it is sometime difficult to realize the value because \none has to dig through email archives. There are a lot of topics that \nonce resolved could do with some kind of summary, how-to, faq, mini-faq \n(whatever you want to call it). I know there are probably several \ninstances where I can contribute some content for example. Perhaps we \nneed to start to get people lined up for contributing to various topics \nbased on Greg's previous outline?\n\n\nI. Installation and Set-up\n    A. Standard (UNIX) distirbution\n    B. Radzilla\n    C. Windows alternatives\n    D. Other packages\n\n\nII. Tutorials\n    A. Basic\n    B. General, Advanced\n    B. Electric Lighting\n    C. Daylighting\n\n\nIII. Input\n    A. CAD links and conversion tools\n    B. Photometry & Sky models\n    C. Generator programs\n    D. Scene processing (xform, replmarks, oconv, etc.)\n\n\nIV. Computation\n    A. Rendering (batch & interactive)\n    B. Illumination calculations\n    C. Executive programs (rad, rayfront, etc.)\n\n\nV. Output\n    A. Image processing\n    B. Image viewing\n    C. Image format conversion\n    D. Graphing & plotting\n\n\nI note that there is no section on materials. Perhaps there needs to be \nan item E in section III Input for materials. And perhaps as a sub item \nthere should be something on translating glazing data from Optics to \nRadiance, for which I will put my name down as writing something about.\n\n\n-Jack\n\n\n\n\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-November/004082.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "November 04, 2006 at 06:56PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_004054", "id": "radiance-general_004082"}