{"body": "Peter,\n\n\nThank you for your comments. I hope the following response\nwill be helpful.\n\n\nOn Mon, 16 Aug 2004, Peter Apian-Bennewitz wrote:\n> >\n> >I first tried pdfblur, which outputs a series of views, each\n> >of which can be rendered with rpict or created with pinterp.\n> >\n> I'm not quite sure I see the light here yet, but I'm interested, as\n> rshow had some experimental features of generating the views (actually\n> before realizing there are some cmdline tools buried deeply somewhere),\n> that's how the lower image at\n> http://www.pab-opto.de/radiance/render_vergleich/intro.htx was rendered\n> with 16 single views.\n\n\nRight, that seems to be the method that pdfblur uses: creates a\nnumber of different views, each of which you need to create using\neither rpict or pinterp.\n\n\n> Before decompiling the rcalc script, could you briefly say why your\n> method is faster ?\n\n\nIt is faster for a certain class of problems: very\nhigh-resolution images with significant depth-of-field effects.\nIts advantage lies in the fact that no sharp renderings are ever\ncreated---those sharp renderings cause the wispy sharp lines in\nthe image you refer to, and one image that I linked to.\n\n\nThe rcalc script borrows heavily from the rcalc expression\ninside of the pdfblur script. Where the pdfblur script applies\ndepth-of-field blur on an image-wise basis, my command-line\nversion applies it on a pixel-by-pixel basis.\n\n\n> To give a hint of the little bits I do understand: Out-of-focus pixels\n> average over a larger solid angle as in-focus ones. Even the solid-angle\n> of in-focus pixels is truly not zero, that's why we need oversampling to\n> avoid aliasing. Traditional methods calculate anti-aliased images with\n> shifted view points and directions which are than added to give the\n> blurred final result. Do I understand correctly that your method\n> incorporates the depth-of-field information into the per-pixel averaging\n> over the per-pixel-solid-angle ? Speed advantage would than come by\n> avoiding unnecessary rays. Is there an easy way to understand how ?\n\n\nUsing pdfblur with pinterp, you *do* only resample pixels in\nareas where the blur effect is significant, thus saving time.\nThis method, though, is not compatible with the \"-aa 0 -ps 1\"\nmethod that I presented earlier. This is because using -aa 0\nwith a very low -ad value (4 or 8) gives very noisy images,\nand the entire image must always be oversampled in order to\nobtain smooth final images. With the understanding that the\nentire image needed to be resampled many times, I wanted a\nDOF method that would be noisy on a pixel-basis, but that would\nsmooth out when the image size was filtered down.\n\n\n> With the old method, each of the images has the same size, so one pixel\n> is effectively oversampled by the number of images. Whether in-focus or\n> not. Are you saying that the out-of-focus ones need more sampling than\n> the in-focus ones ? And the in-focus don't gain much from the higher\n> sampling ?\n\n\nThis is true for non-noisy images (with high settings for\n-ad and -as), and it the aim of pdfblur with pinterp, but\nis not the case for the very-high-resolution, noisy images\nthat dominate my recent work. The most recent production\nimage that I made was at 24,000^2 resolution, and used\nrather low-quality ambient value settings. After appropriate\nsize reductions, a very fine quality 7200^2 image resulted.\n\n\nNote that because every pixel is resampled, I could very\neasily have rendered a larger number of images at the\nfinal resolution (7200^2) instead of one very large one.\nI may shift to that method in the future.\n\n\n> PS: nice Radiance webpages of yours\n\n\nThanks! It's taken me a bit of time to assemble the material that\nis there, but there is ever more that I'd like to share. Within\nthe next half-year, I hope to have a website up for my digital\nvisual art, most of it created with Radiance. I'll be sure to\nnotify the list when that happens.\n\n\nMark\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-August/001979.html).</sup>", "attachments": [], "created_by_name": "Mark Stock", "created_at": "August 18, 2004 at 10:27PM", "created_by": "Mark_Stock", "parent_id": "radiance-general_001973", "id": "radiance-general_001979"}