{"body": ">> Talking about the limitations of CRT's. Has somebody seen\n>> DLP-technology displays in action and maybe even made some colour\n>> measurements? Apparently, the colour resolution can be cranked up to\n>> 15 bits per channel and the luminance range is also much bigger. I\n>> only wonder, if the 15-bit resolution per channel is actually really\n>> an improvement in terms of colour resolution for a given luminance\n>> level (in comparison to a traditional 8 bit resolution)  or is\n>> basically necessary to cover the increased luminance range?\n\n\nWe have just finished a project calles SynthLight, which sets out to teach\nlighting through 3D (well, it's only stereoscopic images and movies).\nhttp://www.learn.londonmet.ac.uk/packages/synthlight/index.html\n\n\nWe experimented a lot with different display technologies for our 3D\nstuff. While DLP seems to be the be all and end all of projector\ntechnologies (high output, contrasts in the range of 1000 .. 5000), the\ncolour rendering is really what lets them down. There are at least 3\ngenerations of DLP projectors out now (DLP is a technology developed and\nlicensed by Texas Instruments), all seem to have issues with colour\nrendering. If you compare the colours on a computer screen (TFT or CRT)\nand compare them to a DLP projector hooked up to the same computer, you\nwill find that the colour rendering of the projector is noticeably (very\nmuch) poorer. For colour, LCD projectors seem to be much better, although\nthey have less of a contrast ratio (several 100:1, rather than several\n1000:1).\n\n\nThis link\nhttp://www.audioholics.com/techtips/specsformats/displays_LCD_DLP_plasma1.html\nhas a very nice comarison chart, although it doesn't mention colour as\nsuch (you will have to trust me on this one...).\n\n\nCheers\n\n\nAxel\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-May/001695.html).</sup>", "attachments": [], "created_by_name": "Axel Jacobs", "created_at": "May 13, 2004 at 01:56AM", "created_by": "Axel_Jacobs", "parent_id": "radiance-general_001679", "id": "radiance-general_001695"}