{"body": "On 8/8/17, 11:50 PM, \"Joe\" <solarjoe at posteo.org> wrote:\n\n\n>\n>Does pcond -h something like automatically calculate the maximum\n>luminance\n>and adjust the exposure? Or will it also apply the different perception\n>of red, green and blue?\n\n\n\n\nSomething like that, yeah. When low-luminance scenes are detected (by\ninspecting the pixels’ values), the loss of color acuity is modeled.\nDisability glare and veiling reflections are modeled as well. The exact\ngoings-on are detailed in Chapter 7 (Roadway Lighting) of the Rendering\nwith Radiance book, and the -h option to pcond is simply a combination of\nluminance-based tweaks to the pixels, discussed in that chapter. The\noutput images lose all validity at the pixel value level, but they make\nfor compelling images on low dynamic range displays.\n\n\nYou will definitely want to look at Rob Shakespeare’s work (he’s\npresenting an update at this years’ Radiance Workshop) with using Radiance\nimages and tone mapping to simulate scenes as perceived by aging eyes.\nIt;s awesome stuff, and a great illustration of the value of Radiance\nimages and the tools used to create and analyze them.\n\n\n>Is there a parameter for rvu to automatically set the exposure using the\n>maximum Luminance\n>calculated?\n\n\n\n\nIn rvu you can hit ‘e’ and the pick a point near where you know max\nluminance to be and it will scale the exposure accordingly, albeit\nlinearly. You can also use ‘pextrem’ at the command line to get the\nmaximum and minimum pixel values (and x,y locations) of an input image.\nAnother utility you may be interested in is ‘phisto’, which will create a\nhistogram of a series of input images and supply a value you can use to\nexpose the input images uniformly (sorta).\n\n\n- Rob\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2017-August/012230.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "August 09, 2017 at 08:23AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_012220", "id": "radiance-general_012230"}