{"body": "Hi Rob,\n\n\nRob Guglielmetti wrote:\n> Hi Jack,\n>\n> At the risk of sounding like a crusty old man, I've been hearing that \n> this is going somewhere for over a decade now.\nWell, I've been known to be a bit of a curmudgeon myself.... \nparticularly on this topic\n>   But I do agree that hardware and to a certain extent software is \n> looking more than ever like it's ready for this challenge.  I still \n> would argue that the end users are not.  \nNo and I would suggest that real BIM is completely disruptive, so it \ngoing to be interesting. And I am trying to consider how this technology \nmight be useful for us, not close to any answers at all though.\n> Despite there being an AIA layer naming standard for ten years, I have \n> yet to get a couple of drawings from a couple of architects that use \n> the same \"standard\".\n> And yes, it does seem like the further you go back, version-wise, the \n> more problems you have.\nYeah, I have never really understood the layering standards (not that I \never paid much attention to them). We have always tried to be pretty \nfunctional in terms of naming conventions (glass-vision, glass-frit, \nint-wall, int-ceil ....), it just make the layers more intelligible at \nleast for our needs.\n> The file size issue is related to this; each progressive version \n> downgrade caused the file to grow a bit more.  In our case, this model \n> was exported to AutoCAD 2008 format by the architect, then converted \n> by me to 2004 and 2000 format, just to see the differences.\n>\n>> As an aside, I really wish that the folks at Autodesk would provide a \n>> method for exporting to obj format. Not that this helps with managing \n>> gigantic 3D data sets, but it would at least provide good workflow \n>> from Autodesk tools to other applications....\n> Yeah, I agree.  This is one of the reasons for our office purchasing a \n> license of SketchUp Pro, is the export capability.\n>\nHmm, well I will be interested to hear more about this. I guess my \nrecent experience with the tool make me feel like washing my hands (but \nthis has more to do with a big ugly model than anything else)... I still \nhave my evaluation going so I should do some experiments on real models.\n\n\nI think bigger picture though, the real intermediate file format for \nbetter or worse is obj, the main problem with this in my mind is then \nloosing out on selected Radiance primitives such as spheres, cylinders, \nand polygons of vertices > 4... as well as having more potential issues \ncontrolling tessellations of geometry that must NOT be tessellated such \nas geometry being used in any illum source location.\n\n\n\n\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2007-October/004518.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "October 23, 2007 at 03:01PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_004494", "id": "radiance-general_004518"}