{"body": "On 2 Aug 2002, at 15:59, Peter Apian-Bennewitz wrote:\n\n\n> two thoughts:\n> How does a user know the real visual appearance of the \"light\n> yellowish wood\" he finds in the library ? Plus variants like\n> \"polished\" \"slightly polished\" etc. One may supply photographs of the\n> real thing, but I'm not sure that's good enough. Secondly, measuring\n> materials (spectral and/or angular) is, even with automated and fast\n> machinery, some work, data processing and modeling are too, especially\n> for an easily increasing number of materials, such as in a catalogue. \n\n\nWell, it's still a good start, for the newbies (like me) especially.  \nLearning by trial and error is so time consuming; a \"starter set\" of \nmaterials that are maybe from a common pallete, that could be \nused as a starting point for experimentation could help the trial and \nerror process move along a bit more quickly. \n\n\n> It'll be very valuable to get feedback from users how they would use\n> any form of catalogue - education or project work, for filling in data\n> when no materials are given in a project or for matching a given\n> material in a project ?\n\n\nHere's my perspective, coming from the Lighting Designer-who-\nuses-Lightscape side of the fence: we tend to use \"value-only\" \nmaterials in Lightscape (ie, hue=0, saturation=0, value=.xx, where \n\".xx\" is the \"reflectance\" of the material).  The limited reflection & \ntransmittance capability of Lightscape does not allow for really \ncomplex material definitions.  In addition, most other lighting \ndesign calculation programs used in the US (Lumen Micro, AGI, \netc) don't support anything more than a reflectance value.  So long \nago I adopted this simplified method of material definition in \nLightscape.  Our models are greyscale representations of spaces.  \nWe like to think of them as \"electronic foam core models\". We shy \naway from hyper realism in the interest of time, and also in the \ninterest of reducing the number of variables.  \n\n\nBut I've always wanted to learn Radiance, and the latest debacle \nwith Lightscape going the way of the dinasour (and the advent of \nOS X) have pushed me into the radiance camp at long last.  So \nnow I have this wonderfully capable calculation program, and \nsuddenly have all these possibilities in terms of materials and \nreflection models.  It's exciting, but daunting.\n\n\nSo, a catalog of materials with known properties, perhaps tested \nwith your gonio-photometer would allow me to create Radiance \nmodels that I could stand behind.  Even if it's not all-inclusive, at \nleast if there were a selection of common materials with known \nperformances, we could use them and then extrapolate as \nnecessary, until a more fully-developed library is created. \n\n\n> I had the idea of compiling a reference sample catalogue, around 8-12\n> material samples (e.g. 3x6cm) initially, plus their measurement data\n> and fitted Radiance model. Would be quite handy for projects and\n> feasible too, using my 12 year old, still used and fully automated\n> gonio-photometer at FhG-ISE or a newer one, but I doubted there'll be\n> enough interest. \n\n\nWell, I for one *am* interested!!  I actually have been meaning to \nask you if your device is available to test submitted samples, \nPeter.  I'm involved in a 1/2-scale gallery mockup right now, costing \nthe museum client hundreds of thousands of dollars, because \nLightscape was in no way up to the challenge of testing the \nglazings.  Radiance probably could have, but not without good \nBRDF data.  Only way to obtain that is with your gonio-photometer. \n Would this be an option in the future, perhaps for a fee?  We send \nyou samples, you send us data files?  \n\n\n:::::::::::::::::::::::::::::::::\nRob Guglielmetti\nhttp://home.earthlink.net/~rpg777\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-August/000378.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "August 02, 2002 at 11:21AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_000376", "id": "radiance-general_000378"}