{"body": "Hi Jelle,\n\n\nYes, I think that there are few different strategies for workflow that \ndifferent people/groups on this list employ. I know that everyone has \ntheir reasons and preferences. We employ our own strategy and tools for \nworkflow management.\n\n\nI think that some of the real strengths of radiance are more built into \nthe ability to perform what I would term \"technical\" or \"performance \nsimulations\" focused on material and/or lighting performance. Most of \nour work though tends to be more about making nice pictures of \narchitecture. For better or worse there are a lot of very powerful \noff-the-shelf rendering/animation packages that are awfully good at \nmaking nice pictures. So from some standpoints, unless the client is \nafter a performance simulation, they really do not care about the \ntechnology. So perhaps one of the strenghts that you may have in your \nservices is in fact your workflow and method of working with your \nclients to accomplish their objectives.\n\n\nJust my thoughts offered for discussion.\n\n\n-Jack\n\n\nJelle Feringa / EZCT Architecture & Design Research wrote:\n\n\n>Hi Jack,\n>\n>Thanks for your suggestions.\n>To make it clear: I'm not fussing about the workflow I developed to produce\n>the Radiance output. Those are some of my most dark & inner secrets only to\n>be shared with certain mailing lists ;)\n>The idea is to find a way to communicate the abundance of data a Radiance\n>image contains. One of the more original ways of doing so, is perhaps the\n>example given _the book_, where Charles Ehrlich is pointing out how to fake\n>asa/iso exposure of a Radiance image. Which isn't a particularly useful\n>thing to do, but does give insight to the extent of control a decent\n>Radiance operator has. \n>\n>Thanks for supporting the virtual prototype thing... I'm not a fan of\n>marketing yadi yadi yah, but one has to stand firm when comes to Radiance\n>accuracy. The point of accurately modeling light & materials is taken, for\n>sure.\n>\n>Cheers,\n>\n>Jelle.\n>\n>-------\n>\n>Hey Jelle,\n>\n>Just a few thoughts here. Explaining rendering systems to clients is \n>always difficult. I think that unfortunately clients typically just want \n>good looking images and do not neccessarily care how the images is \n>\"made.\" However, I think that you are probably on a good track to \n>consider the results of a Radiance simulation as a virtual prototype, \n>which means something more than just a \"rendering.\" But in order for \n>this to hold true, the underlying data, (lighting levels, materials, \n>geometry and other fundamental assumptions in the scene) used to \n>generate the simulations needs to be \"accurate\" to some standard \n>suitable for the given objective. Filtering an image with tone mapping \n>offers one way to view the scene in the image.\n>\n>-Jack\n>\n>\n>\n>_______________________________________________\n>Radiance-general mailing list\n>Radiance-general at radiance-online.org\n>http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n>\n>  \n>\n\n\n\n\n#\tJohn E. de Valpine\n#\tpresident\n#\n#\tvisarc incorporated\n#\thttp://www.visarc.com\n#\n#\tchanneling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-July/002844.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "July 19, 2005 at 05:56PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_002843", "id": "radiance-general_002844"}