{"body": "Carsten Bauer wrote:\n> Roland Schregle wrote:\n\n\n>> And Carsten, what *do* you really want? :^)\n> \n> Money!  ... and <beep> ! and more money .. and much more <beep> !\n\n\nWell, I always appreciate frankness. :^)\n\n\n> back to business: the number of photons is both straightforward and not \n> very helpful at the same time (anyway, it is more intuitive than many \n> other Radiance parameters). But what do e.g. 471100 photons really mean \n> in terms of accuracy or even image appearance?\n\n\nNothing -- they're just numbers. That'd be like interpreting the \nsemantics of a knitting pattern. At least that's my conclusion after \ndabbling with it for 5 years. :^)\n\n\nBut seriously... there *is* an optimum photon count / bandwidth \ncombination, but currently it's still a matter of trial and error. Bias \ncompensation is a workaround, albeit a slow one, and not entirely devoid \nof artifacts.\n\n\n> Additionally, the photon-map currently is not adaptive, distributing and\n> gathering are strictly separated. So controlling pmap 'form the output\n> end of the line', i.e. the image, is not possible now. \n\n\nYou're probably suggesting something along the lines of Suykens' density \ncontrol mechanism, which evaluates a local error metric during \ndistribution. Of course that requires importance info, which is totally \nlacking in the current pmap implementation, and would require *major* \nrevision. With the bare essentials you oh so subtly mentioned above \n(don't forget fame, fortune, learjet, mansion in Malibu, royal suite in \nDubai's Burj Al Arab, weekends with starlets, stable of Ferraris, \nbasement full of Crays, blah blah blah) not in the offing, I'm not \ninclined to invest the significant time and shove this functionality \ninto the code. (Like I said, I appreciate frankness.)\n\n\nOf course, *you're* welcome to try, seeing as you've already delved in \nthe code. :^)\n\n\n\n\nRoland Schregle\nPhD candidate, Fraunhofer Institute for Solar Energy Systems\nRADIANCE Photon Map page: www.ise.fhg.de/radiance/photon-map\n\n\nEND OF LINE. (MCP)\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-May/001767.html).</sup>", "attachments": [], "created_by_name": "Roland Schregle", "created_at": "May 31, 2004 at 03:28PM", "created_by": "Roland_Schregle", "parent_id": "radiance-general_001745", "id": "radiance-general_001767"}