{"body": "I suggest to use two parallel approaches, one with your LED, one with\nan incandescent low voltage. The problem with LED luminance\nmeasurements from HDRI is that a) the color gamut is small and b)\nthat the photopic sensitivity curve V(lambda) currently used is\nincorrect. It underestimates blue wavelengths quite a bit. Therefore,\nstart with an incandescent first, because LEDs have a strong blue peak\naround 440 or 460 nm, depending on the manufacturer. Therefore, you\nhave to mess with V(lambda) and then with tristimulus values which are\njust not good enough for LEDs, including white ones.\n\n\nWhen you use the incandescent instead use it in a black lab. Place a\nfew  white paper samples on the walls at different known locations.\nPlace your incandescent at a defined location. Derive the geometry,\nall distances and all angles between those white papers and the lamp.\nTurn the incandescent on and the room lights off. Measure the\nluminance of the white papers at a location that you marked with a\nsoft pencil. Make HDR images and determine the luminance and scale.\n\n\nBased on the luminance values of the papers, you can now derive the\nluminance of the incandescent filament. Make HDR images of the\nfilament as seen from those papers. Check if the corresponding\nilluminance values of the white paper at reflectance around 85%\ncorresponds to the luminance values of the filament in that direction.\n\n\nRepeat several times to give you confidence.\n\n\nOnce you are heading in the right direction, you can repeat the whole\nprocedure with an LED. But this time your values will be around 20-30%\noff. You should really use a CCD camera with a photopic filter to get\nbetter values, and then try tom come up with a procedure to minimize\nerrors for the HDR approach.\n\n\nRegards\n\n\nMartin Moeck\nOsram\n\n\n\n\n\n\n\n\n\n\nOn Thu, Mar 1, 2012 at 9:46 PM, Tyukhova, Yulia <ytyukhova at unomaha.edu> wrote:\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2012-March/000402.html).</sup>", "attachments": [], "created_by_name": "purple200", "created_at": "March 01, 2012 at 10:35PM", "created_by": "purple200", "parent_id": "hdri_000385", "id": "hdri_000402"}