{"body": "escher@climate.bauwesen.uni-dortmund.de wrote:\n\n\n> I want to generate indoor illuminance values in Lux for a validation\n> with measured values of an office room.\n\n\nHi Joerg,\n\n\nI don't wanna discourage you, but you're in for some MAJOR headaches.\nPhysical validations are a formidable task, to say the least. Errors are\nnumerous and unavoidable, and you'll have to figure out where they come\nfrom and isolate them. \n\n\nWe've done a physical validation of the RADIANCE photon map at\nFraunhofer ISE, and I'm still trying to figure out some of the errors in\nsome instances. We kept everything as simple as possible. Even then,\nit's still a nightmare.\n\n\nWe didn't even bother with daylight because of its fluctuations, but\nused an artificial source instead. We also gave up using \"real\" daylight\nsystems in the measurements after we discovered that most of them have\ndefects (warping, etc) which vastly affect the light redirection and are\ndifficult to model. Furthermore, some systems may even give rise to\npolarising effects, which cannot be modeled with RADIANCE. In the end,\nwe resorted to measurements with a simple light shelf.\n\n\n> To obtain results for illuminance I execute rcalc for the coordinates\n> of the real  measured points using a function I found in the mailing\n> archive\n> \n> rcalc -e '$1=47.435*$1+119.93*$2+11.635*$3'\n\n\nI assume you're converting irradiance to illuminance here. You can of\ncourse use your measured sky illuminance directly in the simulation\nwithout the need for conversion -- RADIANCE won't care whether it\ncalculates in watts or lumens. \n\n\nBeware that spectral effects can introduce some deviation if you treat\nthe walls as monochromatic in the simulation. You could roughly estimate\nhow much the daylight spectrum is modified by wall interreflection\nbefore V(lambda) weighting by the sensors, which I assume is the case in\nyour setup.\n\n\nYour validation is also complicated by the wall paint in your office.\nWall paint tends to be off-specular and in some cases even\nretroreflective. RADIANCE's gaussian BRDF model will NOT account for\nthese effects. I suspect the paint's specular component (and no paint is\ntruly lambertian) contributes significantly to your error.\n\n\n> Unfortunatly I don't obtain reasonable results\n\n\nWelcome to the club! :^)\n\n\nLike I said, you're in for a VERY tough treat here. Life sucks when\ncomparing SimLife[tm] to RealLife[tm]. Good luck!!!\n\n\n--Roland\n\n\n\n\n\n\nEND OF LINE. (MCP)\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-March/000608.html).</sup>", "attachments": [], "created_by_name": "Roland Schregle", "created_at": "March 31, 2003 at 12:10PM", "created_by": "Roland_Schregle", "parent_id": "radiance-general_000605", "id": "radiance-general_000608"}