{"body": "> Unless you're really, really careful, the communication with the FPGA \n> will kill any savings you make in the ray tracing times on a hardware \n> implementation.  This has been found time and again for the past \n> decades by the numerous people who have written or attempted \n> ray-tracing on hardware.  The literature is extensive in this area, and \n> I suggest you start with one of the textbooks on parallel rendering \n> algorithms, such as:\n>\n> Practical Parallel Rendering\n> by  Alan Chalmers (Editor), Timothy Davis (Editor), Erik Reinhard\n>\n> http://www.amazon.com/exec/obidos/tg/detail/-/1568811799/\n> qid=1109613036/sr=1-1/ref=sr_1_1/104-1366464-7333544?v=glance&s=books\n>\nThanks for the advice. :)  I'm pretty sure that the memory capacities of \nFPGAs nowadays would allow me to store everything I need on the device, \nwhich should ensure communications overhead is relatively marginal. Most \nof the work I'm interested in doing with radiance is high-resolution and \nhigh-accuracy (10k renders, with high -ab & -ad)  so I'm hoping that the \ntasks would be computensive enough to give me sufficient performance \ngains as to make it worthwhile. Anyhoo, I'm off to the bookstore...\n\n\n> Regarding oconv, you might have better luck converting some larger \n> models into a Radiance mesh, which uses less memory to represent \n> triangular tesselations.  Most CAD software these days spits out \n> hundreds of thousands of polygons, even when they aren't needed, such \n> as for large, flat surfaces.  Using Alias/Wavefront .OBJ as your export \n> format, obj2mesh can convert these models much more efficiently into \n> Radiance.\n>\nI'll give it a go. Just for reference, the models I'm using have less \nthan 10k polygons so I'm not sure that that is the problem. (I've had \nproblems in the past with 1k models.)\n\n\nmike\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-March/002474.html).</sup>", "attachments": [], "created_by_name": "Michael Kruger", "created_at": "March 01, 2005 at 01:06PM", "created_by": "Michael_Kruger", "parent_id": "radiance-general_002469", "id": "radiance-general_002474"}