{"body": "I typically do what Randolph does, exporting to DWG and using Rhino to assign materials and convert to OBJ. A shortfall of this is that you get an exported DWG organized by layers, and possibly loose or confuse some material assignments from Revit in the process. There is an option in exporting the DWG from Revit to export options by one of the layering standards but with overrides for each unique property within a layer (getting layers like A-WALL, A-WALL-1, A-WALL-2 for different wall construction types).\n\n\nI wonder if exporting from Revit to FBX preserves some of those materials or construction data for each surface more directly than the layer organization. I haven’t had luck with the FBX export workflow in the few times I tried it (long ago). The FBX file standard might remain more standard and stable with each new release of Revit because I think it’s meant to be something like a parallel to DXF (DWG is to DXF, as RVT is to FBX in my mind, but I could be wrong).\n\n\nIf we all were interested in making the first workflow more open source (aka less costly), could probably do the same with Blender (in lieu of Rhino or Max). But that’s still relying on DXF or DWG and the possible loss of material information. However the material information directly in a Revit model is probably not to be trusted anyway. Just because something is assigned “paint type 1” or whatever it might be, doesn’t help decide the material.\n\n\nFor possibilities of automation, etc., a strength of Rhino is that RhinoScript (and maybe Grasshopper) give a scripting possibility to do things like flatten glass assemblies in that software. I guess the same could be said for Sketchup and Ruby, but Rhino seems to be more prevalent with architects these days. Maybe the same could be done for Blender but I’m not particularly familiar with scripting possibilities in Blender.\n\n\n-Chris\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-November/011343.html).</sup>", "attachments": [], "created_by_name": "Christopher Rush", "created_at": "November 13, 2015 at 07:45AM", "created_by": "Christopher_Rush", "parent_id": "radiance-general_011337", "id": "radiance-general_011343"}