{"body": "Hi Rob and Bernhard\n\n\nOn Wednesday, September 24, 2003, at 01:00 PM, Bernhard Spanlang wrote:\n\n\n> Also with ambient bounces >0 Radiance has difficulties smoothing the \n> normals\n> correctly. You will get\n> some smoothing artefacts if -ab >0.\n\n\nI haven't tackled this issue with the poser figures - but it would \nprobably be worthwhile to remove this type of geometry from the ambient \ncalculation with -ae or -aE anyway - (at least for architecture rather \nthan stage work).\n\n\nbtw Rob, (after a long break away) back to that earlier problem of the art \ngallery: I know this is contrary to most of the advise - but you know i \nstill think it worthwhile in principle to render it using brute force -  \nie without illums on the coffering (i think that was Martin's original \nsuggestion). The coffering detail doesn't look complicated enough to have \nreally caused Radiance probs - and there are enough apertures in the space \nthat it seems like they should have been picked up by a reasonable setting \nfor -ad & -as and provide a well behaved indirect lighting distribution.\n\n\nUsually this is a bloody robust approach, if not working well then there \nis almost always a justified suspicion that something else going on - such \nas a piece of geometry stuck out in space and messing up -ar and -aa.\n\n\nAnd i'd agree with Martin again in that it's good to move away from \nrelying on RAD - far better to get to grips directly with specifying rpict \nparameters. I find that once settled on generally appropriate params for \nbuildings (accounting for model size in -ar and -aa) - usually switching \nbetween high/low quality, slow/fast rendering can be controlled enough \njust via -ab and image size and then -ad -as.\n\n\ncheers\nalex\n\n\n*******************************************************\nA. J. Summerfield                 alex@arch.usyd.edu.au\nFaculty of Architecture, University of Sydney\n\n\nOutside of a dog, a book is man's best friend.\nInside a dog, it's too dark to read.       Groucho Marx\n*******************************************************\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-September/000991.html).</sup>", "attachments": [], "created_by_name": "Alex Summerfield", "created_at": "September 24, 2003 at 05:55PM", "created_by": "Alex_Summerfield", "parent_id": "radiance-general_000988", "id": "radiance-general_000991"}