{"body": "Hi\nthanks for your suggestions greg, though i'm afraid i'm still having a \nbit of trouble getting to grips with this one!\n\n\nI have my hdr capture sources working fine, and now i've got them scaled \nto emit a physically correct brightness.\n\n\nbut i'm still struggling with the colour rendering.\ni have converted my CIE XYZ values to radiance RGB primaries, and \nrendered a test scene. the colour is a bit out for what the filter \nshould be, but not wildly i dont think.\ni have read your paper though, and i would like to try the rendering in \na diferent colour space, for the sake of comparision, and also to \ncorrect the white point.\n\n\nconverting to sharp RGB:\n-i think i can just change some constants in the xyz_rgb.cal file, \n(values for sharp RGB are given in Sharp.cal) to change the clour space.\n-i assume that all colours (ie of materials as well as sources) have to \nbe converted?\n-the rendered picture will then be in th sharp RGB colour space, which \nximage does not use, so every pixel in the image then has to be \nconverted to back to the radiance RGB primaries. is this right? if so, \nis there a utility to apply the transformation to a .pic file or do i \nneed to write a script?\n\n\nwhite point adjustment:\n-presumably the white point that radiance uses is the same as most \nmonitors (D65 i think) so i need to transform from the white point of \nthe XYZ colour space to that of the sharp RGB (or radiance RGB) colour \nspace, but only because of this change in colour space.\n-can anyone start me off with how to apply the white point \ntransformation? i assume it uses the vonKries.cal file, and that the \ninputs (initial and final white point cramaticities) are standard values \nfor the colour spaces in question, but how is it used!?\n-the XYZ data (and the xy coordinates) i have are given for both a C \nsource (the CIE standard?) and for a tungsten lamp with colout temp \n3200K, so i presume i should use the tungsten readings (as my lamps are \ntungsten).\n-the sources i am modelling are tungsten, but i want an accurate \nrepresentation of what the colour will look like, so presumably i need \nsome sort of white point transformatin to correct their slight \norangeness, as the eye is quite good at correcting this, i believe. how \nshould i specify this? i know the lamps' colour temperature (about 3200K).\n\n\n\n\n\n\nand finally, how should i apply the colour to my sources?\n-i have XYZ tristimulus and xy cromaticity coordinate data for the \nfilters i want to use, but i'm not sure of the best way to apply it.\n(data comes from eg.  http://www.leefilters.com/LPFD.asp?PageID=248  )\n-i could either the calculated RGB values to scale the output from my \nsource primative (though would i have to take the Y value \n(reflectance/transmission depending on the context i believe) into \naccount, or is this done automatically in the conversion?). This is what \ni did for my first test run earlier (converting XYZ values to radiance \nRGB primaries, and then not using the Y value again), and the result \nseemed to bright for the filter i was using (i had 2 sources in the \nscene, one coloured, the other not, and they were both of similar \nbrigtness).\n-or i could use the RGB values to define the transmission of a thin \npiece of glass, and place this in front of the source (as a real filter is).\n\n\n\n\ni'm sorry to keep asking long questions, but thanks once again for the \nhelp, its proved invaluable in building up my understanding Radiance, \nbut its also really kindled my interest in the whole area!\nwill\n\n\n\n\n\n\n\n\nGregory J. Ward wrote:\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-March/003526.html).</sup>", "attachments": [], "created_by_name": "william reynolds", "created_at": "March 27, 2006 at 06:47PM", "created_by": "william_reynolds", "parent_id": "radiance-general_003524", "id": "radiance-general_003526"}