{"body": "Hi Greg,\n\n\nThank You for the quick answer.  I don't know about the history of this debate because I'm quite new in this mailing list.\nI think for the CIE standard stuff, sticking on the standard routines is ok.\n  But this formula is also used for all the dynamic daylighting stuff like\nGendaymtx\nGendaylit\nDaysim\netc.\nalso for shading studies: I'm wondering that so much computing effort is investigated to render the shading and on the other side the position of this shading is incorrect (especially in Autumn) because of\na very rough calculation of the sun position. The error is not so big, but it could be avoided very easy by using a better formula for solar declination.\nMaybe there could be two functions, one for the standard calculations and one for \"real\"  calculations.\n\n\nMartin\n\n\n\n\nVon: Greg Ward [mailto:gregoryjward at gmail.com]\nGesendet: Donnerstag, 17. Dezember 2015 17:14\nAn: Radiance general discussion\nBetreff: Re: [Radiance-general] Calculation of solar declination in sun.c\n\n\nHi Martin,\n\n\nThis debate comes up every so often with the solar calculations used in Radiance and related tools.  The main question is, do we stick with the established standard, which provides for easy \"apples to apples\" comparisons, or do we update our formulas to get a more precise answer?  In the case of the original CIE sky models, which this solar calculation is used in primarily, the accuracy is not that great, so getting the sun in exactly the right place is a minor quibble.  If, on the other hand, you need precise sun position for solar shading studies or the like, then it's easy to argue for a better formula.  I don't think computing power was ever the issue with Radiance.  We don't compute the sun position for every ray-traced or anything silly like that.\n\n\nAs Rick points out, the use of 368 is part of the IES standard calculation, but I'm not entirely sure what anomaly it is correcting for.\n\n\nCheers,\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-December/011416.html).</sup>", "attachments": [], "created_by_name": "Martin Gut", "created_at": "December 17, 2015 at 08:55AM", "created_by": "Martin_Gut", "parent_id": "radiance-general_011407", "id": "radiance-general_011416"}