{"body": "--0-1548740294-1027028281=:74407\nContent-Type: text/plain; charset=us-ascii\n\n\n\n\nDear Radiance Community,\n\n\nThere are probably many people who would like to attend the Radiance Workshop (me among them) who cannot afford the approx. $2000 price tag including hotel and airfare from the US (west coast) to Switzerland.\n\n\nTherefore, I would like to offer that if there are any individuals or companies who would like to provide a sponsorship of other individuals to attend the workshop, that I would be willing to facilitate the transfer of such donated funds for this activity.  As my motivation to provide this service, I nominate myself as the second sponsoree. :-)  I will provide in return to the sponsoring individuals and companies, a full write-up of the workshop including any significant advancements and other gems.  Sponsors will also be given public credit for their sponsorship, if desired.  I will charge no commission, overhead, or taxes, or any other fees for this service, other than the cost of my personal attendance at the workshop.  The sponsorship will pay only for airfare, lodging and workshop fees.  Meals, ground transportation, other expenses and $500.00 of the initial cost are the responsibility of the attendee.\n\n\nTo make this manageable, I would suggest a minimum donation of  $500.00 so that with  3 sponsors, one person's cost is covered, assuming that other sponsorees also contribute $500.00 on their own behalf.  I will also make the first contribution of $500.00.  We need five more sponsors.   To avoid any appearance of a \"scam,\" I will not accept a sponsorship for myself unless there are sufficient funds for at least one other person to attend.  Of course, that other person can not be my wife or family member.\n\n\nSo, please let me know ASAP if you would like to contribute to this effort so that we can get some cheap airfare.  I will provide a full refund to all donors if I do not receive sufficient funds for two sponsorships ($3000.00 at current exchange rates.)  I also request that payment be made by PayPal so that we can minimize transaction costs and delays.  If you have any concerns about my trustworthiness, then please contact Greg Ward and the other workshop sponsors for referrals.\n\n\nIf you are interested in being sponsored to attend, please write a 1-page (or less) description of the reason for your interest in attending the event and submit it to me.  Please state how much of the cost you can afford ($500.00 minimum) and how much financial assistance you are seeking, and list any expesses you have already incurred, if any.  Please provide three references with phone numbers and email addresses so your qualifications can be verified.  For the sake of maximizing attendance at the workshop, I requests those individuals who are currently scheduled to present papers at the workshop and have already secured funding not participate in this program.  However, if your attendance is in jeopardy because of lack of funds, I would reconsider this option.\n\n\nMy interest in attending the workshop is to present a \"business plan\" proposal to the workshop attendees describing the structure of a \"Radiance Consortium\" to coordinate the open source development of Radiance and Desktop Radiance, and to meet with Radiance users outside of the workshop hours to discuss and revise the content of this proposal.  I will distribute a copy of the proposal at the end of the workshop to all attendees.\n\n\nIf you need to reach me by phone, my cell phone number is (530) 400-9570.  You can call any time and leave a message, if you wish.\n\n\nThank you for this opportunity.\n\n\nSincerely,\n-Chas\nCharles Ehrlich\n\n\n\n\n\n\n\n\n\n\nMessage: 2\nDate: Wed, 17 Jul 2002 08:51:30 -0700\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-July/000345.html).</sup>", "attachments": [], "created_by_name": "Charles Ehrlich", "created_at": "July 18, 2002 at 02:38PM", "created_by": "Charles_Ehrlich", "parent_id": "radiance-general_000290", "id": "radiance-general_000345"}