{"body": "Hi all,\n\n\nyou can use evalglare also without a fish-eye lens, but you have to be \naware of following:\n\n\nIf you want to use the DGP, then you need to have a vertical illuminance \nvalue. Per default, this value is calculated by evalglare by the use of \nthe image. But this can be done only, if you have a full fish-eye view. \nIf you don't have the fish-eye view, you can provide this value by the \n-i option (see the comment of Alstan). Then, you should measure the \nvalue by a luxmeter. If you haven't measured the illuminance, then it is \nproblematic. The smaller you view angle is the higher is the error you make.\nPlease be aware, that recent studies showed, that the glare caused by \ndaylight can be described best, if you take into account the vertical \nilluminance. So if you don't measure it (or measure it only partly by \nrestricted view), you might get far away from a real glare evaluation. \nIn other words: If you wanna do a daylight glare evaluation, you have to \nmeasure the vertical illuminance (either by a full fish eye or by a \nluxmeter).\n\n\nPrincipally, evalglare does not depend on the view type. So if you have \na smaller view (and you catch with your cam potential glare sources) + \nan additional luxmeter you can do a reliable daylight glare evaluation.\n\n\nUp to the current version(0.9f), some view types were not supported \n(like -vth), but this will change :\n\n\nThere will be a new version (1.0) released NEXT week, which will have \nfollowing new features (I will announce it, as soon as it is on the \nserver) :\n\n\n-all current view types will be supported (except parallel view) - that \nmeans also -vth !\n-valid view is checked (many problems occurred, because users treat the \nimage with programs like pcompos before putting into evalglare. But \nthen, the view got lost and a wrong view leads to totally wrong results! \nNow this will be handled by the new evalglare )\n-view options can be provided also per command line option\n-disability glare is also calculated\n-cut-out the \"Guth\" visual field\n\n\nJan\n\n\n\n\n\n\nJ. Alstan Jakubiec schrieb:\n> Dear Ery,\n>\n> You can use evalglare with a regular hdr image as far as I understand \n> it. Jan can correct me if I'm wrong :). As Thomas notes, it is best to \n> have the full hemisphere image, but if you don't have such an image, \n> you can still get pretty good results with a couple of steps:\n>\n> 1. Make sure your hdr is calibrated to photometric units of cd/m2. \n> Doyle and Reinhart also have a pretty reasonable tutorial on doing \n> this using Photosphere: \n> http://www.gsd.harvard.edu/research/gsdsquare/Publications/HDR_II_Photosphere.pdf \n>\n> 2. You'll want to make sure that in the header to your HDR, it has a \n> Radiance view type that is pretty close to the opening angle of the \n> camera lens you are using. An example will be something like, \"VIEW= \n> -vtv -vh 60 -vv 40\" which are some parameters I just pulled from a \n> random rpict-generated image on my computer. In the ideal case, your \n> view type would be the angular fisheye, \"-vta -vh 180 -vv 180\". I \n> think that this is automatically taken care of to some degree by \n> Photosphere, but its worth checking before using your images for \n> analysis.\n> 3. It is also useful to have an illuminance reading from the time the \n> photo was taken. The DGP calculations rely on total vertical eye \n> illuminance and contrast. Usually, the illumimance at the eye is \n> calculated directly from the fisheye image, but when you don't have a \n> view encompassing a hemisphere, you can provide the illuminance \n> separately by calling evalglare as, \"evalglare -i \n> VerticalEyeIllumianance file.hdr.\"\n>\n> Best,\n> Alstan\n>\n> On Mon, 06 Feb 2012 21:26:49 -0500, Thomas Bleicher \n> <tbleicher at googlemail.com> wrote:\n>\n>> Ery\n>>\n>> You can use the pinterp program to convert from one projection to \n>> another.\n>> See the man page for an example or dig in the archives where this has \n>> been\n>> discussed before. However, note that the glare equations are based on a\n>> full hemispherical image. You will have to fill in the missing \n>> perimeter of\n>> your converted fisheye image with values of the right brightness or your\n>> glare evaluation will be off.\n>>\n>> Regards,\n>> Thomas\n>>\n>> On Mon, Feb 6, 2012 at 9:15 PM, Ery Djunaedy \n>> <ery.mailinglist at gmail.com>wrote:\n>>\n>>> Folks,\n>>>\n>>> I have a bunch of HDR images generated from photographs taken with \n>>> regular\n>>> -- non-fisheye -- lens. Is there a way that we can use these images for\n>>> glare analysis in evalglare? The evalglare description says that it \n>>> only\n>>> accepts fisheye images. There is a tutorial from Harvard GSD (Doyle and\n>>> Reihart) that shows a non-fisheye photo in evalglare:\n>>> http://www.gsd.harvard.edu/**research/gsdsquare/**Publications/HDR_III_** \n>>>\n>>> Evalglare.pdf<http://www.gsd.harvard.edu/research/gsdsquare/Publications/HDR_III_Evalglare.pdf> \n>>>\n>>>\n>>> I am wondering whether this can be done at all.\n>>>\n>>> Thanks,\n>>>\n>>> Ery\n>>>\n>>> ______________________________**_________________\n>>> Radiance-general mailing list\n>>> Radiance-general at radiance-**online.org<Radiance-general at radiance-online.org> \n>>>\n>>> http://www.radiance-online.**org/mailman/listinfo/radiance-**general<http://www.radiance-online.org/mailman/listinfo/radiance-general> \n>>>\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\n\n\nDr.-Ing. Jan Wienold\nHead of Team Passive Systems and Daylighting\nFraunhofer-Institut für Solare Energiesysteme\nThermal Systems and Buildings\nHeidenhofstr. 2, 79110 Freiburg, Germany\nPhone: +49(0)761 4588 5133 Fax:+49(0)761 4588 9133\njan.wienold at ise.fraunhofer.de\nhttp://www.ise.fraunhofer.de\n\n\nIn office: \nMo,Tue: 8:30-18:00\nWe,Thu: 8:30-16:00\nFr:  8:30-15:30\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2012-February/008353.html).</sup>", "attachments": [], "created_by_name": "Jan Wienold", "created_at": "February 07, 2012 at 10:27AM", "created_by": "Jan_Wienold", "parent_id": "radiance-general_008346", "id": "radiance-general_008353"}