{"body": "Hi Jia,\n\n\nyou should check the rsensor program - that was developed by Greg to do\nexactly what you want. The manpage describes well how to define your sensor\nfile and how to use rsensor.\n\n\nHope this helps,\nbest,\nDavid\n\n\n\n\n2014-02-20 8:45 GMT+01:00 Jia Hu <hujia06 at gmail.com>:\n\n\n> Hello,\n>\n> I have a sensor and the sensor has different readings according to angle\n> between incident ray and normal. Theoretically, this readings should be\n> [cos(theta)*value of incident rays] hitting the sensor point (theta = angle\n> between ray hitting the surface and sensor normal).  However,t our sensor\n> is not this  relationship and I have to adjust the simualtion results to\n> fit the actual sensor readings.\n>\n>\n>    - one of the methods I can think of is to get directions of all the\n>    incident rays hitting the sensor point and then calculate all the angles\n>    between incident rays and sensor normal, and adjust the radiance values\n>    before using rtrac to calculate the actual illuminance values.  Is that\n>    feasible?   I notice there is a \"t\" option in rtrace, but it will return\n>    all the rays, not just rays hitting the sensor points.\n>    - Radiance traces only 1 ray from the sensor points or sample a number\n>    of rays from sensor point? (my understaning was that rtrace first traces a\n>    number of rays to check DIRECT light source and get the results, and then\n>    traces a SINGLE ray following the sensor normal and then sampling more when\n>    hitting a surface? if in this case, how can I determine the anges of direct\n>    and indirect rays?)\n>\n>\n> Thanks,\n>\n> jia\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n>\n\n\n\n\n\n\nDipl.-Ing. Dr. David Geisler-Moroder\nHofwaldweg 14/20\n6020 Innsbruck\nAustria\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2014-February/010101.html).</sup>", "attachments": [], "created_by_name": "David Geisler-Moroder", "created_at": "February 20, 2014 at 12:10AM", "created_by": "David_Geisler-Moroder", "parent_id": "radiance-general_010100", "id": "radiance-general_010101"}