{"body": "Hi Jia!\n> I asked this question in Autodesk Discussion Group and they say \"FBX from\n> Revit 2010 is only compatible with Max 2010. It doesn't work like\n> earlier versions of FBX where other programs could open it.\"  So the problem\n> is that current Revit uses a new version of fbx while Rhino seems to use an\n> old one.\n>   \nSounds familiar to anyone who has been using Autodesk-products before. \nOnce you save your data in one of their formats, it is basically gone - \nformats are changing with every release and are hardly documented anywhere.\n\n\nStill as another hint, there are two attempts to get access to at least \nsome data in dwg files. One is still in development:\n\n\nhttp://www.gnu.org/software/libredwg/\n\n\nThey have not published their recent updates to the code, but aim at \nsome rather ambitious parsing library for dwg.\n\n\nThe other attempt is support for 3d-dxf in Blender:\n\n\nhttp://wiki.blender.org/index.php/Extensions:2.4/Py/Scripts/Import/DXF-3D\n\n\nThe idea here is to ignore dwg (which is changing too often and has \nterrible documentation if any) and instead rely on dxf. They recommend \nthe use of another external tool to convert from dwg to dxf in case it \nis required, which works perfectly fine also using wine on Linux.\n\n\nStill, as a note from my side: if Revit does not support any export out \nof Autodesk formats at all, and the application is generating models for \nsimulation - may be Revit is just the wrong software for this? There is \na lot of great, relieable modeling software out there developed by \ncompanies playing fair and not locking users away from their own data... \nI cannot imagine to spend money on a modeler that does not support any \nstandard format (e.g. step or iges would be a must and would already \nsolve your problems).\n\n\nCheers, Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-May/006831.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "May 06, 2010 at 04:01AM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_006819", "id": "radiance-general_006831"}