{"body": "oops... obviously there was an update of my email client and the \nreply-button is not automatically replying to the discussion group any \nmore...\nof course I wanted to share it to all.\nbelow is what I wrote.\n\n\ncheers\nJan\n\n\n> Hi John,\n>\n> thanks! That explains it! I was a bit confused that uniform was not uniform, but it makes sense not to have a drastic change between sky and ground.\n>\n> The easiest way for a uniform hemisphere is of course not using skybright.cal at all and use directly 10000/179  for the three channels of the glow material... I realized this while walking outside under a nice mixed winter sky.\n>\n> thanks again!\n> cheers\n>\n> Jan\n\n\nOn 11/19/2017 07:33 PM, John Mardaljevic wrote:\n> PS.  Jan reminded me (off list) that, of course, if you *only* want a uniform luminance hemisphere, then there is no need to use gensky.  However, should you want an *exact* representation of any of the CIE types (i.e. without any blending of the luminance at the horizon), then the suggested fix will work.\n>\n> By the way, for quantitative work, say, simulating illuminance values using CIE skies created by gensky, this luminance blending at the horizon will almost certainly *not* have any significant effect for anything but weird scenarios.  Thought I'd better mention that :-)\n>\n> Back in 2002, I was setting up a `weird scenario': mapping the CIE clear sky pattern onto a hemisphere of finite size to predict the effect of parallax in sky simulator domes.  Since some of the sensor points were nudging right up against the (finite extent) horizon, the effect of the blending was noticeable.  That (rather arcane) study is described in a 2004 paper:\n>\n> http://journals.sagepub.com/doi/abs/10.1191/1365782802li055oa\n>\n> Cheers\n> John\n>\n>\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> https://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\n\n\nDr.-Ing.  Jan Wienold\nEcole Polytechnique Fédérale de Lausanne (EPFL)\nEPFL ENAC IA LIPID\n\n\nhttp://people.epfl.ch/jan.wienold\nLE 1 111 (Office)\nPhone    +41 21 69 30849\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2017-November/012331.html).</sup>", "attachments": [], "created_by_name": "Jan Wienold", "created_at": "November 19, 2017 at 10:45AM", "created_by": "Jan_Wienold", "parent_id": "radiance-general_012326", "id": "radiance-general_012331"}