{"body": "Hi,\n\n\njust three ways:\n\n\nUse dxf. This makes sense if you are e.g. working with AutoCAD. Get \nGeorg Mischlers dxf2rad (www.schorsch.com), which is available for a \nlot of platforms. When exporting, take care of the units (I have always \n1unit=1meter, so the same as in most radiance apps). Use different \nlayers for materials. dxf2rad will use the layernames as modifiers in \nthe exported rad-model. Than write a material-mapping file, using \naliases. That way, you can use ONE material file, that you will re-use \nfor all your projects (simply adding new materials when needed) and put \nall the layer-to-material information into the mapping-file, that will \nbe valid just for the model. If you are working on Mac or Unix, make \nsure to encode the (ascii)-dxf file in the ms-dos world format.\n\n\nUse obj. This is available as an export option for different \n3d-packages. It is supported by obj2rad and the new mesh primitive in \nRadiance. Be careful, the coordinate system in radiance is with the \nz-achis up! Many of these modeler use other coordinate systems! The \nobj-export will often be triangulated, but you can use surface normals \n(e.g. for smoothing) and texture coordinates. As such, I would always \nprefer it for the not-so-classic architectural models containing lots \nof curved surfaces.\n\n\nUse 3ds. This means that you first convert to mgf, than to rad. You can \nget \"smoothed\" surfaces like with obj, and 3ds is available in many \n3d-modelers, too. You can get some simple material definitions based on \nthe 3ds-file, so you should be able to view the exported rad-file \nwithout changes by objview (the other formats' importers don't use the \nmaterial / color information). However, some of the advanced features \nradiance offers with obj now are not available with 3ds (tecture \ncoordinates).\n\n\nIf you have a big model, and used some kind of blocks (symbols, \nreferences, however your cad calls them), you can try to import them as \ninstances or by using xform. This might help to reduce the memory \nneeded during rendering a lot, however, it adds complexity to the \nimport. Maybe we will have a converter that can handle blocks and \nexport them as such to radiance without user interaction (I read that \nan early radout release was able to do so?).\n\n\nBe careful with some CAAD apps. Archicad e.g. tends to include all \ndetails in the model, and if you want to render the overview of a large \nbuilding, you won't want all the door-locks and furniture in your \nmodel. So try to control the details as needed (use layers etc, \nassigning the void modifier can switch off objects, right?).\n\n\nWhat applications are you working with?\n\n\nI use dxf for most architectural models, obj for free-forms (curved \nsurfaces, smooth surfaces). U used radiance with AutoCAD, ArchiCAD, \nFormZ, Vectorworks.\n\n\nGood luck, CU Lars.\n\n\nLars O. Grobe\ngrobe at gmx.net\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-August/001982.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "August 20, 2004 at 01:33PM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_001981", "id": "radiance-general_001982"}