{"body": "Dear Alex,\nDear Alstan,\n\n\n> Are you sure your low dynamic range pictures are properly exposed from \n> which you construct the HDRI?\n>\n> Meaning, the fastest shutter speed picture has no saturation (i.e. all \n> white pixels) and your slowest shutter speed picture has some black \n> pixels?  You need to make sure this is true else you won't get proper \n> illuminance calculation and also your bright spots (i.e. high\n> luminance) will be under reported.\n\n\nWell, I took 15 images with auto-bracketing (1EV between each image). I always check that the fastest shutter speed is almost all black pixels (no white pixels) and the slowest shutter speed is almost all white pixels (no black pixels). If I have too high luminance in my field of view, then I use a neutral density filter so that my darkest image does not have any white pixel.\n\n\n> I'd like to follow up with some other potential things to look out for in addition to what Alex suggested and questions based on your description. We dealt a lot \n> with this via the papers on HDR we published last year.\n\n\nYes, I have read it.\n\n\n>  * Full fisheye HDR images should always be cropped to a bounding\n>    square and the view edited or input inline via Evalglare when doing\n>    analysis. Are you cropping the images in all cases?\n\n\nYes, all images are cropped at the end (after hdrgen and vignetting calibration) to a 1000x1000 square (with pcompos and pfilt) and the VIEW line in the header is modified to a -vta -vh 180 -vv 180.\n\n\n>  * Where is your 1.39 calibration factor derived from? It is useful to\n>    measure luminance for every HDR photo taken from an easy to identify\n>    (and nearly-neutral) surface for use in calibrating images rather\n>    than a constant. Typically the discrepancies I find when I\n>    /don't///measure luminance this aren't as high as what you found\n>    however.\n\n\nI derived my calibration factor when doing the vignetting calibration process. I did the vignetting calibration according to the method suggested in Cauwerts et al. (2013) paper. Therefore I have a calibration factor for each aperture:\n\tf/3.5 --> 1.32\n\tf/5.6 --> 1.38\n\tf/11  --> 1.48\n\tf/16  --> 1.59\n\tf/22  --> 1.84\n\n\nThe reason why the f/3.5 calibration factor is not 1.39 anymore, is because I noticed that using hdrgen command with -e and -a options when creating my HDR images, gave me better results. It changes the exposure of the generated HDR images and I thus only got differences between measured and HDR-derived values of max 30% (it was 50% before). Therefore, I recalculated my calibration factors with the last generated HDR images.\n\n\n>  * You should look up the recent discussion, \"[HDRI] Convert\n>    equisolidangular to equiangular projection\" which strongly suggests\n>    the Sigma 8mm f/3.5 to be a -vta / equidistant / equi-angle lens.\n>    Reprojecting the image could add some error in this case.\n\n\nWell, I think this is not the case. The SIGMA 8mm f/3.5 has an equisolid projection.\nI am quite sure as I received this information from Sigma UK. Moreover, I checked the information Sigma gave me by measuring myself the projection of the lens. I did it following David Geisler-Moroder method, that he presented at the 15th International Radiance Workshop in 2016. And I also got an equisolid projection. I could send you more info if you want.\nThe images have thus to be reprojected from equisolid to equidistant.\n\n\nBest,\n\n\nClotilde\n\n\n-----Message d'origine-----\nDe : hdri-request at radiance-online.org [mailto:hdri-request at radiance-online.org] \nEnvoyé : jeudi 9 février 2017 23:47\nÀ : hdri at radiance-online.org\nObjet : HDRI Digest, Vol 88, Issue 7\n\n\nSend HDRI mailing list submissions to\n\thdri at radiance-online.org\n\n\nTo subscribe or unsubscribe via the World Wide Web, visit\n\thttp://www.radiance-online.org/mailman/listinfo/hdri\nor, via email, send a message with subject or body 'help' to\n\thdri-request at radiance-online.org\n\n\nYou can reach the person managing the list at\n\thdri-owner at radiance-online.org\n\n\nWhen replying, please edit your Subject line so it is more specific than \"Re: Contents of HDRI digest...\"\n\n\n\n\nToday's Topics:\n\n\n   1. Re: Illuminance and luminance values underestimation from\n      calibrated HDR images (J. Alstan Jakubiec)\n\n\n\n\n\n\n\n\nMessage: 1\nDate: Fri, 10 Feb 2017 06:45:43 +0800\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2017-February/000615.html).</sup>", "attachments": [], "created_by_name": "Clotilde Pierson", "created_at": "February 10, 2017 at 05:01AM", "created_by": "Clotilde_Pierson", "parent_id": "hdri_000610", "id": "hdri_000615"}