{"body": "Hi Christian,\n\n\nI'm afraid you lost me, here.\n\n\n> Forget my other question, at first i want to make sure that i model  \n> a simple filter in the right way.\n> And that is why i want to stick to the values LEE gives for a 3200K  \n> lamp.\n> These are: X= 58.8 , Y=62.4 , Z=37.2\n\n\nOK, I see these values on the URL you sent earlier <http:// \nwww.leefilters.com/LPFD.asp?PageID=193>.\n\n\n> with xyz_srgb.cal i get: R= 76.088002   G=61.6146944   B=  \n> 29.8622268, ( i want to calculate this with the D65 white point)\n\n\nSince the XYZ values were measured using a 3200 K tungsten  \nilluminant, converting to sRGB only gives you back the same orange  \ncolor.  You haven't really changed illuminants, because xyz_srgb.cal  \ndoesn't do a white-point conversion.\n\n\n> As the filter won't have a bigger transmission than 1, i divide  \n> through 100.\n> Now i get values of: R= .761   G= .616   B= .299;\n> If i apply these to glass polygon i get a yellow/orange filter with  \n> my tungsten 3200 K source in the scene.\n\n\nDoes the scene your simulating use a tungsten source or not?  If it  \ndoes, you should model it as a pure white light, because you have  \nincorporated the illuminant color into your filter.  (This isn't a  \ngood idea for transmission as the angular function will be incorrect.)\n\n\n> Then is subtract 1 from RGB =  .239 , .384,  .701;\n\n\nThis where you lost me completely.  What made you think to subtract  \neach value from 1?  It doesn't work that way, even if it gets you  \nwhat you were expecting.\n\n\n> These values should now represent my blue filter, and it looks  \n> quite good!\n\n\nIf you want blue out of your filter from a tungsten source, you won't  \nget it.  You'll get something bluer than the source, but not truly  \nblue.  This all gets involved in the white balance issue, which I  \ncover in depth in the paper I keep mentioning:\n\n\n\thttp://www.anyhere.com/gward/papers/egwr02/\n\n\nI know it's a difficult read, but until you understand white  \nbalancing, colors are going to look consistently wrong to your eyes.\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-April/003608.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "April 25, 2006 at 06:48PM", "created_by": "Greg_Ward", "parent_id": "radiance-general_003601", "id": "radiance-general_003608"}