{"body": "Andrew,\n\n\nI guess the outcome then starts to depend strongly on what you consider to be an acceptable value for UDI-exceeded.  As the HMG work has indicated, that's a difficult one to determine empirically, and I for one can't suggest a 'target' value for the occurrence of UDI-e.  I'd like to see a UDI sensitivity study carried for a large number of spaces covering a wide range of space types (i.e. glazing orientation, single-sided, multi-aspect, etc.) [1].  If, as you say, extending the UDI upper bound to 3,000 lux results in designs that we suspect are less good than using 2,000 lux, then we really do need to pause and scratch our heads a little to nail this one.  However, your question suggests that going for UDI-a (300 - 3,000 lux) rather than 100 - 3,000 lux makes it less likely that the outcome is what we might have had with daylight factors.  Seems plausible -- do we have anything yet to support this hypothesis?\n\n\nI'd assumed that the 100 to 2,000 lux UDI range adopted in the FOS was simply taken from the Mk. 1 UDI formulation.  Do you know if, instead, it was actually the result of some testing of range limits?  By way of pedantry, suggest we use the term UDI to describe the complete range (e.g. 100 to 2,000 or, more recently, 100 to 3,000 lux), and UDI-autonomous for the occurrence between the design level (300 lux) and the upper limit (3,000 lux).\n\n\nBy the way, there is now a PDF available of the Lighting Supplement for the Dec 2012 CIBSE Journal:\n\n\nhttp://www.cibsejournal.com/archive/PDFs/CIBSE-Supplement-2012-12.pdf\n\n\nCheers\nJohn\n\n\n[1] I do have a suitable a building, but need to clear it with the clients.\n\n\nJohn Mardaljevic\nProfessor of Building Daylight Modelling\nSchool of Civil & Building Engineering\nLoughborough University\nLoughborough\nLeicestershire\nLE11 3TU, UK\n\n\nTel: +44 1509 222630 (Direct)\nTel: +44 1509 228529 (Pam Allen, secretary)\n\n\nj.mardaljevic at lboro.ac.uk<mailto:j.mardaljevic at lboro.ac.uk>\nhttp://www.lboro.ac.uk/departments/cv/staff/profile/367.html<http://www.lboro.ac.uk/departments/cv/>\n\n\nPersonal daylighting website:\nhttp://climate-based-daylighting.com<http://climate-based-daylighting.com/>\n\n\nOn 11 Dec 2012, at 21:57, \"Bissell, Andrew\" <a.bissell at cundall.com<mailto:a.bissell at cundall.com>>\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2012-December/009115.html).</sup>", "attachments": [], "created_by_name": "John Mardaljevic", "created_at": "December 11, 2012 at 02:55PM", "created_by": "John_Mardaljevic", "parent_id": "radiance-general_009107", "id": "radiance-general_009115"}