{"body": "Greg Ward wrote:\n> \n> Hi Everyone,\n> \n> I just read through Rob's very well-written and flattering article on\n> the workshop, which didn't include a single reference to baseball (must\n> have been some oversight).  I hope the other attendees enjoyed it half\n> as much as he did -- for my part, the workshop gave me loads to think\n> about as I go into Exponent for the last time today to clean out my\n> desk and contemplate what I'll do next....\n> \n> I'm sorry that my presentation on Radiance OpenSource raised more\n> questions than it answered.  I didn't want to conceal the fact that I\n> have no clear notion what it means, myself.  I am hoping it will be a\n> good thing.  Certainly, having LBNL continue to own and \"manage\" the\n> UNIX source code is not desirable, and the fact that they're willing to\n> let it go is something I take as a very good sign for the rest of us.\n> Still, it is nice to have a single, authoritative version on which to\n> base derivative works, so we may have to think up a way to do this\n> (possibly with LBNL's cooperation).\n> \n> Like I said, the workshop gave me lots to think about, and I made a\n> list of the improvements I would like to see in  the source code,\n> ordered here from most to least compelling from my standpoint.  I would\n> welcome feedback on this list with additions or things you think ought\n> to be made a priority.  The ones with an asterisk are features that\n> others have already done most (or all) of the work on, and the ones\n> with double-asterisks are enhancements I really need someone else's\n> help in doing.\n> \n> Possible Radiance Enhancements\n> -----------------------------------------------\n> 1. ANSI-fication and CVS, library conversion\n> 2**. Integration of Windows version or addition of Windows portability\n> and functionality\n> 3*. Photon map\n> 4. Direct calculation improvements\n> 5. Cylindrical arcs\n> 6. Rendering with light probes\n> 7*. Complex fenestration\n> 8**. Rendering artifact assistance pages\n> 9**. Material library/assistance pages\n> \n> I would also encourage people to try out Roland Schregle's photon map\n> extension to Radiance 3.4.  I think this could be a very good thing for\n> Radiance, but it probably needs some critical stress-testing before\n> being rolled into the main distribution.  At least, it would if I had\n> written it!\n\n\nActually, the validation we're doing can, in all fairness, only be\nconsidered an exemplary case study (albeit a pretty exacting one). What\nthis basically means is that we test the *fundamental* correctness of\nthe method. The caveat is that a poor choice of parameters can still\nthrow you off by several percent, at least locally in some regions of\nthe rendering. All the more reason for people try the thing out with\nscenes of their own. Stress-testing basically relies on the feedback I\nget from the RADIANCE community and entails applying the addon to a\nbroader spectrum of scenes.\n\n\nSee ya!\n\n\n--Roland\n\n\n\n\n\n\n\"Life is too short for core dumps\"\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-October/000427.html).</sup>", "attachments": [], "created_by_name": "Roland Schregle", "created_at": "October 08, 2002 at 12:58PM", "created_by": "Roland_Schregle", "parent_id": "radiance-general_000425", "id": "radiance-general_000427"}