{"body": "There are a couple of very basic example here:\nhttp://web.mac.com/geotrupes/iWeb/Main%20site/RadBlog/RadBlog.html\nThe idea is to subdivide larger grids into smaller grids and use bash  \nor xgrid if you have an apple to run all in parallel. I think you'll  \nfind three posts about this. Good luck!\n\n\nI just take the opportunity a little earlier than is supposed to  \nbe... but nevertheless...\nMerry Christmas and Happy New Year to all the Radiance friends!\nG/\n\n\n\n\nOn 22 Dec 2008, at 12:56, Marija Velickovic wrote:\n\n\n> Hi,\n>\n> I need to perform some rtrace calculations for big number of points  \n> and rather high calculation parameters, so I'm trying to use the  \n> full potential of dual core machines.\n> I saw that for example rvu or rad programs have option -n or -N to  \n> define number of parallel processes to be started. Is similar  \n> parallelization possible in rtrace program?\n> I've found \"-PP pfile\" option but I'm not sure how to use it. I  \n> supposed that \"pfile\" should be empty so program can write into it  \n> some control variables. When I started rtrace with -PP option 2  \n> processes are created: one for my  rtrace and one child rtrace  \n> process with the same parameters. When I tried to explore running  \n> processes it seems that only the first one is really running, while  \n> the second one is sleeping - so I don't have real paralellization  \n> here.\n>\n> I suppose I haven't understood something well, so if someone has  \n> the experience with rtace running on multiprocessor machines,  \n> please send me some ideas/hints.\n>\n> Happy holidays to all list members and their families,\n> Marija\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\nChiacchiera con i tuoi amici in tempo reale! \n http://it.yahoo.com/mail_it/foot/*http://it.messenger.yahoo.com\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-December/005623.html).</sup>", "attachments": [], "created_by_name": "giulio", "created_at": "December 22, 2008 at 01:00PM", "created_by": "giulio", "parent_id": "radiance-general_005616", "id": "radiance-general_005623"}