{"body": "Dear Lars,\n\n\nThank you very much for your reply. \n\n\nI tried with Five-Phase method earlier and all command worked. However, now\nI exported the model from Rhino and I have some materials that they need\ntwo specific files. I do not why they do not run without sudo, placing\nwhere there are others, as well (They keep always the padlock, I copy there\nfrom DIVA's files. They are not from radiance package previously\ninstalled). I use oconv, rtrace and rpict with sudo and they work without\nproblem. Nervertheless, if using sudo is not good I remove those materials\nand I could use rcontrib without sudo. \n\n\nThank you for your suggestions. I read Axel Jacob's tutorials but rereading\nwill be fine.\nBest regards for you,\nUrtza.\n\n\n\"Lars O. Grobe\" <grobe at gmx.net> escribió:\n\n\n> Dear Urtza,\n>\n> two comments on your installation - this should be solved before you\n> even start using a complicated combination of commands such as the\n> three-phase method.\n>\n> First, with a correct configuration of your system you will not need to\n> run rcontrib as super-user (sudo). Your regular user account just needs\n> read-access to the .dat and .cal files in this case, so why would you\n> not grant the proper permissions?\n>\n> Second, as rcontrib is not found, what makes you think it is installed?\n> Did you install Radiance from sources, did the build complete without\n> errors, and did you include the directory containing the binaries in\n> your PATH environment variable? Does any other Radiance command work for\n> you?\n>\n> I would recommend having a look at Axel Jacob's set of tutorials first,\n> including the unix-introduction. Otherwise you risk messing up a lot of\n> your models with work-arounds, and even risk the integrity of your\n> system by using sudo where it should definitively not be applied.\n>\n> Cheers, Lars.\n>\n>>  \n\n\n  Dear experts,\n\n\nI am trying with Three-Phase Method for Simulating Complex Fenestration,\nfollowing A McNeil tutorial.\n\n\nI am using Ubuntu 14 OS. I need use sudo command because I have\nGenericTranslucent20.dat material and rang.cal that they are locked anyway.\nHowever, when I have launched sudo rcontrib, it scripts that:\n \n\n\nsudo rcontrib -f /usr/share/radiance/klems_int.cal -b\n'kbin(-sqrt(.5),sqrt(.5),0,0,0,1)' -bn Nkbins -m windowglow -I+ -ab 2 -ad\n512 -lw 2e-5 sc-vi3M_vmx.oct < sc-vi3M.pts > photocells.vmx\n\n\nsudo: rcontrib: command not found\n\n\nCould someone say what the problem is? Thank you in advance.\nBest regards,\nUrtza.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-March/011582.html).</sup>", "attachments": [], "created_by_name": "Urtza Uriarte", "created_at": "March 15, 2016 at 09:19AM", "created_by": "Urtza_Uriarte", "parent_id": "radiance-general_011579", "id": "radiance-general_011582"}