{"body": "Hi Lars,\n\n\nThank you very much.\nYes, after analyzing my results I also think that I have a problem with the\nskylight but I can not understand where...\n\n\nI have already think to use the Radiance. Daysim is not good for me because\nI also want to simulate artificial light. I read somewhere that I can\ninsert my model in use Autodesk Ecotect Analysis software and the export it\nand simulate with the Radiance. Is this right?\n\n\nHowever I am not sure if it is free?\nWhere can I download it?\n\n\nBest regards,\nCatarina\n\n\n2013/2/22 Lars O. Grobe <grobe at gmx.net>\n\n\n> Hi Catarina!\n>\n>  My name is Catarina and I am trying to perform a lightning simulation\n>> with Desktop Radiance.\n>>\n> As far as I know, Desktop Radiance has not been supported for several\n> year. This list is on Radiance, which shares some underlying code with the\n> old Desktop Radiance, but has seen continous development over the years. I\n> suggest that you stop using Desktop Radiance and either go with \"pure\"\n> Radiance (which means to get into touch with the command-line tools\n> Radiance is made of) or one of the various frontends. Daysim, Relux, the\n> Blender-Integration as well as several integrations in more general\n> building simulation systems are among the options in the latter case.\n>\n>  I think I followed all the necessary steps to insert my model:\n>> - Design the geometry (its a simple cube, with the dimensions 5*5*2.8,\n>> and a window);\n>> - Attach materials to the surfaces;\n>> - Insert the luminaire;\n>> - Define a gride (I am using the reference grid simualation);\n>> - Define the orientation.\n>>\n>> After that, I perform the simulation but the results are very high (I\n>> obtain values for illuminance around 14000 or higher). Additionally, the\n>> lightning distribution around the room does not make sense. I have low\n>> values in some points and very high value in other.\n>>\n> It is almost impossible to give any useful comment here, as we do not know\n> the model (geometry), the material properties or the luminaire, plus we\n> have unsupported code. From what you wrote, you do not have any daylight in\n> your scene - still, the values you observe could indicate that you have a\n> sky model that you are not aware of, and measure illuminance where your\n> sensor gets hit by direct sunlight.\n>\n> Still, a very generic hint - if you observe funny results in your\n> illuminance simulation, take a \"look\" using a more \"natural\" camera setting\n> with a luminance calculation. This helps to identify problems in the model\n> (missing ceilings, coordinate systems where one would not expect them to be\n> located related to the camera, funny overlaps of surfaces, ...). Still -\n> Desktop Radiance is for historical interest but not for simulation work any\n> more.\n>\n>  I read something in your site about the optics 5 software. I have already\n>> install it and uninstall and the results remain awkward.\n>>\n> Optics 5 is a tool to find transmission properties of multi-layer\n> glazings. You can import these into Radiance - but Optics does not somehow\n> interfere with Radiance, and is a separate software.\n>\n> Cheers, Lars.\n>\n> ______________________________**_________________\n> Radiance-general mailing list\n> Radiance-general at radiance-**online.org<Radiance-general at radiance-online.org>\n> http://www.radiance-online.**org/mailman/listinfo/radiance-**general<http://www.radiance-online.org/mailman/listinfo/radiance-general>\n>\n\n\n\n\n\n\n\n\nCatarina Araújo\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2013-February/009308.html).</sup>", "attachments": [], "created_by_name": "Catarina Araújo", "created_at": "February 22, 2013 at 08:53AM", "created_by": "Catarina_Araújo", "parent_id": "radiance-general_009303", "id": "radiance-general_009308"}