{"body": "Randolph Fritz wrote:\n\n\n>   Unfortunately, there's a maintenance issue\n> (ANSIfication, which I am told is not quite complete) that the Radiance\n> development collective would need to address before a Cocoa interface\n> to these apps can be written.\n\n\nThe ANSIfication ist mostly complete. There are other changes to\nthe code base that would help more in making this possible, but\naren't going to be finished soon.\n\n\nIf anyone wants to start a GUI project (possibly rolling rview,\nrholo, and ximage functionality all into one), I wouldn't see any\nfundamental obstacles against beginning with that right away.\nThe important point is just to define very clear internal APIs\nfirst, on several levels. Once the core codebase gets more\nmodular and flexible, the seperation between front end and back\nend can be moved back and forth as the task requires. It's all a\nmatter of finding the right abstractions.\n\n\n\n\n> Meanwhile Georg Mischler's Rayfront <http://www.schorsch.com/>\n> addresses your issues under X Windows.  I'm not sure he has it running\n> on Mac OS X, but it would probably be a simple port.  However, it would\n> be a Unix app--not Mac-like at all.\n\n\nI simply don't have a working mac myself, or I would have ported\nRayfront a long time ago. Donations gladly accepted...\n\n\nBut that might really be a seperate topic. I'm not sure if I\nunderstand Rob correctly, but I think what he wants is primarily\na \"better rview\". While Rayfront has all the bells and whistles\nto set up a project with variations, and to create and assign\nmaterials, it still relies on the old rview on posix platforms.\n\n\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-July/001899.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "July 07, 2004 at 11:37PM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_001894", "id": "radiance-general_001899"}