{"body": "steve michel wrote:\n> A linear fixture is exactly what I had in mind. For a while I even \n> searched for 'bare bulb' photometry files from big lamp manufacturers \n> (GE or Philips) but none exist for fluor tubes (only par and mr16 \n> spots). But is the illum distribution method another one or a subset \n> of using flatcorr and lboxcorr techniques you describe??\n\n\nNo photometric files exist for bare fluorescent tubes probably because \nyou can't really test that condition, nor would anyone want to spend the \nmoney to do so.  A fluorescent tube will always be in a fixture, even if \nit's a simple striplight -- a simple ballast housing and two \nlampholders.  And that striplight housing will block part of the lamp, \nthereby altering the distribution, and THAT is what you would want to \nphotometer.  There are photometric files for simple fluorescent \nstriplights, I believe people like H.E. Williams have them.  The reason \nthere are photometric files for PARs -- a seemingly plain bare lamp \nsimilar to the fluorescent lamp example -- is that those lamps have a \nreflector and that reflector's effect IS worth evaluating.  PARs are in \nessence a \"fixture\", since they contain a light emitting filament as \nwell as an optical device to take that light and do something with it.  \nPhotometric files are all about describing what a fixture does with \nthose lumens the lamp starts out with.\n\n\nAnyway, the flatcorr and lboxcorr techniques are really enhancements to \nthe \"illum distribution method\" we've been discussing, and all of this \nis a more complex but elegant way of describing the luminous output of a \ngiven photometric file.  Think of a photometric file as a description of \nthe fixture performance at a single point, because that's what it is.  \nThis works great for a 5\" round aperture recessed downlight; stick that \ndescription on a disc-shaped piece of geometry, slap it on your ceiling \nand render away.  But when your photometric file is describing the \nluminous performance of a linear fixture, you need to spread this out \nalong the lamp length. This is what the -ds option to rpict does, as we \ndiscussed earlier.  Yes, it's a hack, yes, it's less than perfect, and \nyes, many smart people have offered alternate ways to photometer \nfixtures to improve on this, but implementation and adoption of a \nstandard for that is not on the horizon, as far as I know. \n\n\nSo, we take our point \"distribution description\" and array it along a \npolygon, at a frequency determined by the -ds option.  This works, until \nyou have a three dimensional fixture model, or even a large flat fixture \nthat is close to other geometry.  Then you must stretch and pull that \npoint description into a box shape, and apply it to an illum material.  \nIllum is a magical material (I know Greg is cringing hearing anything in \nRadiance described as 'magic'; trust me, it's still physically-based!) \nthat can emit light but becomes invisible when you look directly at it.  \nSo the idea is to create this \"imposter geometry\" that acts as the \nlight-emitting boundary and origin for the fixture.  Within the box you \nhave 3D geometry that represents the physical appearance of the fixture, \nbut the impostor box is doing all the lighting.  So flatcorr and \nlboxcorr are just little helper files that take that point \"distribution \ndescription\" and do all the stretching and pulling.  If the ies file was \nfor a table lamp, you might be able to use a simple sphere to do the \nsame thing (you'd describe a sphere whose radius is larger than the \nlampshade, which in this case is the thing doing the emitting, in the \nphysical world). \n\n\nAre we having fun yet?  Well, that's the general idea of what these do.  \nThis is not an alternate description of the distribution!  It's a way of \ntaking the distribution (again, described as a point) and mapping it to \na 3D form.  For raw quantitative analysis, it's unnecessary.  But if you \nwant 3D fixtures in your renderings, it's a process you'll need to \nunderstand.  The juicy bits of the technique start on page 320 in \nRendering with Radiance.\n\n\n- Rob Guglielmetti\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2007-April/004307.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "April 27, 2007 at 02:21AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_004304", "id": "radiance-general_004307"}