{"body": "Hi Steve !\n\n\nComparing measured values with one from simulation is always tricky, as\na lot of things have to be considered. \n\n\nTo begin with the average reflectance question: From a radiation point\nof view, you may average the three reflectances for red, green, blue, as\nthe rgb-channels simply represent three ranges of the spectrum with\nequal weight. Turning over to illumination, things become different, as\nthe human visual response of the eye has to be taken into account. For\nthis purpose, within Radiance a so called brightness is used, which is a\nweighted sum of the three rgb-channels\n\n\nB = 0.265*r + 0.670*g + 0.065*b \n\n\n(only first three digits of the coefficients are given, their sum is of\ncourse 1, multiplying this brightness with K = 179 lm/W makes it finally\na luminance value).\n\n\nExample: a uniform grey r=g=b=0.5, illuminated by white light (r=g=b=1)\nhas of course a brightness of 0.5, (remember that the sum of coeficients\nis one, so the above formula gives\n (0.265+0.670+0.056)*0.5 = 0.5)\n\n\nSomething more or less red, e.g. r=0.8, g=0.5,  b=0.2 with the same\naverage reflectance of 0.5 will however have a brighness (again, for the\nlight r=g=b=1) of 0.265*0.8 + 0.670*0.5 + 0.065*0.2 = 0.56, which is\ndifferent.\n\n\nSo, for comparing different materials, the brightness should be used.\nAdditional surface normal undulations will certainly have an effect on\nthe amount of received and reflected light. To determine this effect,\nyou have to do test runs with and wihout texture modification and\ncompare the results.\n\n\nLast but not least, the color of the light source has to be taken into\naccount, too. It has to be the same as the one of your test equipment. \n(Pictures are often rendered with uniform white light , r=g=b=1, to\navoid color biases, although this is not exact from a scientific point\nof view.) Color values for different lamp types can be calculated with\nthe Radiance \"lampcolor\" utility.\n\n\n\n\nSo, again, such a simple comparison is more tricky than one might think\nat a first glance.\n\n\nCarsten\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-July/000361.html).</sup>", "attachments": [], "created_by_name": "Carsten Bauer", "created_at": "July 22, 2002 at 04:03PM", "created_by": "Carsten_Bauer", "parent_id": "radiance-general_000360", "id": "radiance-general_000361"}