{"body": "(probably belongs on -dev, cross-posting to -general since this thread started there)\n\n\nThe general idea with the Linux Radiance package NREL distributes was simply to provide a tarball of the executables and library files. It's not intended to be an \"installer\". The thought was that if people are using Linux they probably could unpack a tarball to a proper destination and make the environment mods mentioned in any number of howtos. \n\n\nThat said, it would be great to offer more than that. We are working on a Chef recipe, in support of our OpenStudio-Radiance-on-the-cloud effort (!), which will be one way to easily bootstrap a Radiance box. CMake can also make an \"install script package\" of the Linux Radiance binaries, which is simply the tarball with a little sh wrapper that does the unarchiving. We used to post those to the OpenStudio website but I didn't think anyone was using them and they are still a big hack compared to Bernd's .deb, or our Chef script. Each of these have their own issues: the former is tied to major releases, and the latter is designed for headless installations. \n\n\nI have a list of things I'd like to do in the near future:\n- add files Greg added to src/util this week to CMake build system\n- support incremental versions somehow (may be totally independent of the CVS, it'd just be nice to tie our installers to a HEAD vintage for general housekeeping purposes (and Chef kinda needs this))\n- add a CMAKE_BUILD_HEADLESS target (this is also for Chef support but could help others)\n- dial in the linking on all packages to maximize backward compatibility; this seems to be the biggest problem with Linux.  \n- get some reasonably reliable CMake build/test scripts together (I have some, but I'd like to make them more general so we could share them with the community)\n- (really) offer incremental HEAD releases, perhaps timed to coincide with NREL's OpenStudio iteration build releases every two weeks. \n\n\nIf anyone has feedback or requests to go along with this list, let me know. I plan to cross all of these off by the end of February. \n\n\n- Rob\n\n\n-----Original Message-----\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2014-January/009955.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "January 21, 2014 at 07:57PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_009945", "id": "radiance-general_009955"}