{"body": "Rick,\n\n\nI believe this is a known but rarely encountered condition.  Radiance  \nhas various optimisations -- one of them is to assume that the  \noverall environment  reflectance is 0.5 (Greg, is that right?).   \nThat's fine for most realistic architecture.  Your situation is more  \nlike an integrating sphere.  From an earlier (private) exchange with  \nGreg regarding a \"dodgy\" validation where this effect showed up:\n\n\n> Forgot about the -as value, and I also forgot there is another  \n> place where the AVGREFL (0.50) undermines the calculation.  This  \n> value determines how many rays will be traced in deeper levels,  \n> which is the optimization I was referring to but didn't explain in  \n> my last e-mail.  I thought by setting -aa 0 that I would override  \n> this limitation, and it does in one place, but not the more  \n> important place where the weight of additional interreflections is  \n> assigned.  To get Radiance to really behave properly for this  \n> scene, one would have to redefine the AVGREFL macro to something  \n> closer to 0.95 and recompile -- not an honorable way to participate  \n> in a validation, however ill-conceived.\n>\n> Sooo... where does that leave us?  The only way you can get  \n> Radiance to send any rays at all at level 50 without recompiling is  \n> by setting -ad 1000000000000000 -ab 50, which is probably not a  \n> good strategy if you want to post a response during this century.   \n> It seems to me like this test was designed to thwart irradiance  \n> caching techniques in general, or Radiance in particular.  Why not  \n> use a box with mirrored walls?  I think Lightscape or whatever  \n> other radiosity software they might try wouldn't do as well in that  \n> circumstance.  It's not like either one is a case anyone would  \n> encounter in the real world, and the optimizations in Radiance have  \n> been working for real world problems for over 15 years.  Changing  \n> them to suit a special case as this would be silly, and would  \n> undermine the performance of the system in its intended domain.   \n> Given that Radiance is distributed in source form, there is nothing  \n> to prevent researchers with special needs redefining AVGREFL and  \n> recompiling the renderer to handle bizarre test cases such as this.\n\n\nIt sounds like you have one of those \"bizarre test cases\".  Which is  \nfair enough given the setting.\n\n\n-John\n\n\nPS.  Would love to see some of the renderings.\n\n\n\n\nDr. John Mardaljevic\nSenior Research Fellow\nInstitute of Energy and Sustainable Development\nDe Montfort University\nThe Gateway\nLeicester\nLE1 9BH, UK\n+44 (0) 116 257 7972\n+44 (0) 116 257 7981 (fax)\n\n\njm at dmu.ac.uk\nhttp://www.iesd.dmu.ac.uk/~jm\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-April/003557.html).</sup>", "attachments": [], "created_by_name": "John Mardaljevic", "created_at": "April 06, 2006 at 06:17PM", "created_by": "John_Mardaljevic", "parent_id": "radiance-general_003555", "id": "radiance-general_003557"}