{"body": "Tim Hanson wrote:\n\n\n> Please can you clarify the following re- trans material...\n\n\n> Do I use specular transmission with diffuse transmissivity when setting the\n> trans parameters?\n\n\nHi Tim,\n\n\nTo be honest, the one project I've done so far that made heavy use of \ntrans was approached in a different manner.   I took front-side \nilluminance & back-side luminance readings of my samples, shining a \ntheatrical spotlight at them.  These numbers were sent to Radiance \nCentral High Command (Albany, CA) via secret email address \n(gward at lmi.net), and the Radiance Grand Poobah himself derived proper \nvalues for trans.  He did this by old-fashioned trial & error, trying \nvarious trans values and plotting the results against my datasets, \ntweaking until the curves more or less matched up.  I summarized this \nprocess at radiance-online.org recently, even included sample code that \nGreg used to create the plots.  Here's the post:\n\n\nhttp://www.radiance-online.org/pipermail/radiance-general/2004-January/001415.html\n\n\nI never could get that shell script to work, but the bgraph input file \nworks if you feed it directly to bgraph.  That input file also contains \nthe Rosetta Stone you're looking for, I think: (excuse the wrapping)\n\n\nB(x)=Td/PI+Ts/(PI*sq(alpha)*sqrt(cos(theta)*cos(PI/180*x)))*exp(-\nsq(tan(PI/180*x-theta)/alpha))\n\n\nThat's where Greg mathematically described the Radiance trans behavior, \nto be overlaid with my dataset from the actual sample measurements.  You \nwill see the variables Ts and Td in there; those are Ts & Td from trans. \n  I should add that these samples did not have very much of a specular \ntransmitted component. I really don't know if this method would work if \nthere is a higher amount of specular transmission...\n\n\nHmmm, after all that, I didn't even answer your question!  In essence, \nwe worked backwards to arrive at a valid description.  To definitively \nanswer your speculodiffusetransmissionivity question will require more \nbrain power (cue lights; Chas enters stage left, Schorsch from stage \nright, and Greg arrives, deus ex machina-style, in a large winged \nchariot from above).  =8-)\n\n\n\n\n\n\n      Rob Guglielmetti\n\n\ne. rpg at rumblestrip.org\nw. www.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-March/001508.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "March 09, 2004 at 04:19PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_001504", "id": "radiance-general_001508"}