{"body": "Hi!\n> 1.        In the base case the slats have the same tilt angle at one\n> point of time (\"conventional control\").\n> 2.         In the prototype model, the blinds are divided into three\n> sections: Top , Middle and Bottom Blinds, each of equal dimensions\n> (\"splitcontrol\"). In each section blinds can have the different slat\n> tilt angle.\n(...)\n> For pilot testing I tested  conventional control for  0, 45 and 90\n> degrees and split control for 0, 45, and 90 degrees, too (i.e. I kept\n> the same tilt angle in each section of the split blinds just for the\n> pilot testing  and the result  comparison purpose).\n>\n> The results that I obtained show variation in the values of\n> Illuminance obtained for these two models (results difference ranges\n> from 10-150%) although the results should be the same.\n(...)\n\n\nSo you mean, as the blind settings are the same for both models during\nyour current test runs, you actually have the same model set-up with\ndifferent geometry?\n> genblinds whitealum main 0.0125 1.82 0.63 66 90 |xform -rz 90 -t 2.71\n> 0.05 2.06>66-1-90.rad\nIs the \"whitealum\" material specular or diffuse?\n> rtrace -h -I -ab 1 -ad 4096 -as 128 -av .02 .02 .02\n> hr.oct<mainsamples.inp|rcalc -e '$1=47.4*$1+120*$2+11.6*$3'>>$month.out\n\n\nAre you sure that your ambient paramters are suiteable for that set-up?\nAs far as I understand it, you get illumination only for the light\n\"directly\" hitting your surfaces from the sky you generated. So you have\na very non-uniform environment for your rtrace-call. Did you ever render\nan image of the scene, with the same parameters, using a fisheye-view\nfor the same view as your rtrace measurement point is getting? Imagine\nthe rtrace-measurement-point being a sensor, or put yourself into its\nplace, what do you expect to see - and do your rendering settings\naccount for that? As I have not seen the result, these are only guesses\nfor now, but I am pretty sure that you will need higher -ab settings for\nsuch a set-up (probably -ab 4 or higher), and using ar and aa settings\nto get a uniform luminance over your rooms surfaces. I guess your\nceiling is more or less black now (except the -av-contribution, but what\nis your aw than)?\n\n\nGood luck!\n\n\nCU Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-February/005798.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "February 26, 2009 at 08:52AM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_005797", "id": "radiance-general_005798"}