{"body": "Hi Greg,\n\n\n> Second, a quick explanation of what macbethcal does.  Macbethcal takes a \nThanks, that was very useful!\n\n\n> Third, I wanted to point Alexa and other interested readers to the \n> following reference, which explains the parts of human vision pcond \n> attempts to simulate and the algorithms behind it:\n> \n>     http://radsite.lbl.gov/radiance/papers/lbnl39882/tonemap.pdf\n> \n> I'll be the first to admit that it is not a perfect simulation of human \n> vision, and this is an ongoing area of research.  (Try a websearch on \n> \"color appearance models\" to get an idea.)  However, I think others will \n> agree that pcond can be useful, and is an improvement over the standard \n> \"linear with clamping\" method for image display.\n\n\nI don't doubt that it is better for image display and I think the idea \nwith these kind of mappings is to go down the route of 'perception' \nrather than 'physics', one reason being the current limitations of CRT's \ne.g.\n\n\nMy concern is physical accuracy. I want to display an image on a screen \n(eventually) and people should not be able to tell it apart from the \nreal world scene. Of course, I can only simulate colours and luminances \nthat my daft 8-bit monitor can actually render.\n\n\nTalking about the limitations of CRT's. Has somebody seen \nDLP-technology displays in action and maybe even made some colour \nmeasurements? Apparently, the colour resolution can be cranked up to 15 \nbits per channel and the luminance range is also much bigger. I only \nwonder, if the 15-bit resolution per channel is actually really an \nimprovement in terms of colour resolution for a given luminance level \n(in comparison to a traditional 8 bit resolution)  or is basically \nnecessary to cover the increased luminance range?\n\n\nIs that the same technology used in last year's emerging technology \nSIGGRAPH session:\nSeetzen, H., Stuerzlinger, W., Vorozcovs, A., Wilson, H.R., Ashdown, I.,\nWard, W. and Whitehead, L., 2003, High Dynamic Range Display System. \nSIGGRAPH 2003, Emerging Technologies Program.\nhttp://www.siggraph.org/s2003/conference/etech/hdr.html\n\n\nCheers,\nAlexa\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-May/001688.html).</sup>", "attachments": [], "created_by_name": "Alexa I. Ruppertsberg", "created_at": "May 12, 2004 at 06:55PM", "created_by": "Alexa_I._Ruppertsberg", "parent_id": "radiance-general_001679", "id": "radiance-general_001688"}