{"body": "Hi Steph,\n\n\nJust to give a comment on the needed sensor size. In my experience it is also suitable to use a DSLR type coming with an APSC sensor size format.\nFrom my experience I can recommend SIGMA DC series fish-eye lens types that are supporting and calculated for this sensor format. Thus they are  imaging the whole FOV of 180° circular to such a sensor.\n\n\nFurthermore regarding capturing an HDR I can agree the comment of Alstan that standard DSLR’s AEB functionality does not provide sufficient dynamics for the luminance levels provided by the scenario to be measured. Therefor you may need to perform a manually operated exposure time adjustment for releasing an image series of app. 7-10 images or using tools like Magic Lantern.\n\n\nBut there are limitations to the shortest exposure when capturing light sources that are PWM controlled or in any other way modulated light sources (not for daylighting ☺). For this case the limits are in the range of 1/250 – 1/50 sec.\nOn the other hand from my experience most DSLR camera types have problems of decreasing mechanical shutter reproducibility when be faster than 1/1000 sec shutter speed.\nIf you are faced with this problems it can be necessary using ND filter that does reduce DSLR’s sensitivity.\nIn connection using ND filter with fish-eye lens it ii recommended for placing the ND filter in-between lens and camera body. When using ND filter in front of lens you have an angular dependence of ND’s transmission that can over a decades. This is not so huge or negligible when placing the ND behind the lens.\n\n\nHopefully may comments are useful.\n\n\nBR\n\n\nTobias\n\n\nVon: Stef Cy [mailto:artcygne at yahoo.com]\nGesendet: Freitag, 20. Oktober 2017 01:12\nAn: hdri at radiance-online.org\nBetreff: [HDRI] DSLR for HDR images\n\n\nHi Alstan,\n\n\nThank you for your suggestions, may I ask what would be the implications of using a cropped-sensor camera for glare analysis?\nI've seen that full frame ones are more more expensive than small sensor ones. I don't remember exactly the thesis or the name of the study,\nbut I saw that they were using a cropped-sized sensor with special fisheye lenses (I think it was Sigma 4.5mm which its special for this kind of camera). Is that a crucial requirement to use full-frame for accurate glare results?\n\n\nWe were actually considering a Canon 80D or Nikon D7100, both have max shutter speed of 1/8000s but small sensor format...\n\n\nI'd really appreciate your comments on this..\n\n\nSt.\n\n\nP.S. Sorry if this msg doesn't get attached to the thread, I got it in the digest, I think I lost the original one\n\n\n\n\nHi Steph,\n\n\nA couple of things to look out for from my experience:\n\n\n  * Try to purchase a camera with a full-frame sensor. This is a\n    requirement for fisheye lenses used in glare analysis.\n  * The range of shutter speeds can make a difference as well for the\n    measure of very high luminances (1/4000s vs 1/8000s).\n\n\nBeyond those two use cases, any camera with a manual mode that can\nadjust the shutter speed quickly will work fine. I recommend to adjust\nthe shutter speed by hand or computer control rather than to rely on\nauto-bracketing. Still, if you want to go the auto-bracketing route, you\nmay consider a camera that supports a firmware hack like Magic Lantern\nwhich gives better bracketing capacity to cheaper DSLR cameras.\nOtherwise you'll end up needing to buy an EOS 5D or something in a\nsimilar price range for a good bracketing functionality.\n\n\nBest,\n\n\nAlstan\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2017-October/000679.html).</sup>", "attachments": [], "created_by_name": "Tobias Porsch", "created_at": "October 19, 2017 at 11:50PM", "created_by": "Tobias_Porsch", "parent_id": "hdri_000676", "id": "hdri_000679"}