{"body": "Hi Richard and rest of community,\n\n\nwe are actually working on a research project, dealing with user \nassessments with special focus on glare from daylight in office spaces.\nWe have already tested 100 subjects at two different locations under \nvery different conditions (facade systems, window sizes, viewing \ndirections...).\n\n\nAs a first result I can summarize, that all existing formula like dgi, \nugr, cie, vcp show a pearson correlation less than 0.15. Values less \nthan 0.5 can be also achieved by chance...\nTherefore I can not advice you to use these indices.\n\n\nI can already announce, that we will come up with a new, much more \nreliable index, which will be called \" daylight glare probability dgp\". \nThis dgp will model the probability, that a person in an office will be \ndisturbed by daylight glare. The publication on this will be submitted \nby me and Jens Christoffersen in few days to an special issue on \ndaylighting in \"energy and buildings\" and will hopefully published end \nof this year.\n\n\nAdditionally, we will come up with a new tool called \"evalglare\" , which \nis based on the RADIANCE picture format and will be available in mid  of \nthis year\nThis tool has some new features compared to findglare and will have the \nnew index implemented, too. (see also \nhttp://www.radiance-online.org/radiance-workshop3/cd/Wienold_extabs.pdf). \nAs soon as it will be available I will announce it.\n\n\nIn the meanwhile, I would chose the vertical eye illuminance as a \nmeasure for the glare - for this value we found reasonable results \ncomparing this to the percentage of disturbed persons.\n\n\nJan\n\n\n\n\nfurry at ihug.com.au wrote:\n\n\n>Hi all,\n>\n>I working on a glare study with reflected sunlight through a skylight causing \n>glare and we are evaluating different glass, laminates and meshes to mitigate \n>problems from the glare.\n>\n>When I use Radiance to evaluate each view, I can get the results for:\n>- Guth Visual Comfort Probability,\n>- CIE Glare Index (Einhorn)\n>- Unified Glare Rating.\n>\n>What I would appreciate some advice on is which is the most appropriate in this \n>case for determining when glare has been reduced to a generally acceptable \n>level.  Also, I am wondering what values would be considered acceptable for \n>each of these 3 methods of determining glare (ie. VCP > 70% or 50% ??? .. what \n>is generally considered acceptable?).\n>\n>Thanks for your help,\n>Richard\n>\n>\n>\n>\n>_______________________________________________\n>Radiance-general mailing list\n>Radiance-general at radiance-online.org\n>http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n>\n>  \n>\n\n\n\n\n\n\n   o -           \n  | \\            Jan Wienold\n                 Fraunhofer Institute for Solar Energy Systems\n                 SOLAR BUILDING DESIGN GROUP - DAYLIGHTING\n                 Heidenhofstr. 2 \n                 79110 Freiburg\n                 GERMANY\n\n\n\t\t In office: \n\t\t Mo, Tue: 9:00-18:00\n\t\t We-Fr:  8:30-14:00\n                 Phone: ++49 - (0) 761 - 4588 -5- 133\n                 Fax:   ++49 - (0) 761 - 4588 -9- 133\n                 Email: jan.wienold at ise.fraunhofer.de\n\n\n                 Internet:\n                 http://www.ise.fraunhofer.de\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-January/002306.html).</sup>", "attachments": [], "created_by_name": "Jan Wienold", "created_at": "January 20, 2005 at 10:57AM", "created_by": "Jan_Wienold", "parent_id": "radiance-general_002302", "id": "radiance-general_002306"}