{"body": "Alejandro,\n\n\nTwo points to remark here:\n\n\n1.- The error you are getting comes from the \"genklemsamp\" program, and not\nfrom rcontrib. The \"View Up\" is, by default, \"up\" (0,0,1); but that is also\nyour view direction. You will have to specify a \"view up\" that represents\nthe \"top of your skylight\", i.e., the superior part.\n\n\n2.- the -m option of rcontrib has to be filled with a material in your\nscene. In your case is \"skymat\". the -e option, in this cases, is what\nchooses the Reinhart subdivition (MF:1, MF:2, MF:3, ...), the higher, more\nsky subdivitions you get. The \"b\" is the number of the sky subdivition\n(bin) and the \"bn\" is the number of sky subdivitions. These values are\nrelated to the function you are using (reinhart.cal); and the only one you\nwould need to change is the MF:X option.\n\n\nHope it helps.\n\n\n\n\n2014-07-16 6:08 GMT-04:00 Alejandro Pacheco Diéguez <paxeco2205 at hotmail.com>\n:\n\n\n> Hi!\n>\n> I am trying to create a daylight matrix for a skylight on a horizontal\n> roof following the three-step method tutorial and I get the following error\n> message:\n>\n> C:\\Radiance\\bin>genklemsamp -vd 0 0 1 aa_ape.rad | rcontrib -c 1000 -e\n> MF:3 -f reinhart.cal -b rbin -bn Nrbins -m skymat -faf aa_octree.oct >\n> aa_dmx.dmx\n> *vwright: view up parallel to view direction*\n>\n> *aa_ape.rad contains a horizontal rectagle placed over the exterior\n> aperture of the skylight.\n>\n> I am trying to understand the different options in rcontrib but it seems\n> like I lack the knowledge to fully understand its description. Is there a\n> more basic description that could help me understand it better? For\n> example, I think I am supposed to describe the sky material somehow under\n> -m but I am not sure how to do that. Also I don't understand the -e, the\n> -b, -bn or the -faf options.\n>\n> Thanks in advance,\n>\n> Ale\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n>\n\n\n\n\n\n\n*Germán Molina L.*\nIngeniero Trainee\nHunter Douglas Chile S.A.\nCelular +569 89224445\n\n\n\n\n\n\n\n\n*Nota de Confidencialidad:* Este mensaje incluído los archivos adjuntos son \nconfidenciales y pueden contener informacion privilegiada protegida por \nley. Si Ud. no es el destinatario, deberia abstenerse de copiarlo, \ndistribuirlo, divulgarlo o usar la informacion contenida. Por favor, avise \ninmediatamente al emisor y borre este mensaje de su sistema. Los mensajes \nelectronicos son susceptibles de ser cambiados, infectados o adulterados \nsin autorizacion. No asumimos responsabilidad alguna por ninguna clase de \ncambios o sus consecuencias. Usted debe estar informado que la compania \npuede hacer un seguimiento de sus mensajes electronicos y su contenido, \ngracias.\n\n\n*Confidentiality Notice:* The information contained in this email message, \nincluding any attachment, is confidential and is intended only for the \nperson or entity to which it is addressed. If you are neither the intended \nrecipient nor the employee or agent responsible for delivering this message \nto the intended recipient, you are hereby notified that you may not review, \nretransmit, convert to hard copy, copy, use or distribute this email \nmessage or any attachments to it. If you have received this email in error, \nplease contact the sender immediately and delete this message from any \ncomputer or other data bank, Thank you.\n\n\nA informação transmitida é confidencial e para conhecimento exclusivo do \ndestinatário. Sua utilização, não autorizada, constitui crime passível de \nprisão. Todas as precauções possíveis foram tomadas para garantir que este \ne-mail não contenha vírus. Uma vez que nossa empresa não pode assumir \nresponsabilidade por nenhuma perda ou dano causado por este e-mail ou de \nseus anexos, recomendamos que o destinatário utilize seus procedimentos de \nantivírus antes de qualquer uso.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2014-July/010393.html).</sup>", "attachments": [], "created_by_name": "German Molina", "created_at": "July 16, 2014 at 06:27AM", "created_by": "German_Molina", "parent_id": "radiance-general_010391", "id": "radiance-general_010393"}