{"body": "Hi Claus.\n\n\nInteresting problem you have here.\n\n\n2010/12/29 Claus Brøndgaard Madsen <cbm at create.aau.dk>:\n\n\n> With a lot of inspiration from Thomas Bleicher’s tutorial\n> (http://sites.google.com/site/tbleicher/radiance/stencil) which he pointed\n> me to back in August (yes, it took me a while to gather the courage to go\n> down that path) I have managed to devise a small script (or rather a command\n> line) which allows me to render the irradiances received at any point in a\n> scene with all glow materials (the standard –i irradiance option for rpict\n> does not work for glow materials).\n\n\n[...]\n\n\n> My question is simply: how to reduce the significant amount of rendering\n> noise for the (near) vertical surfaces? The irradiance on those surfaces is\n> dominated by energy coming from the horizontal ground plane, which is a\n> single box object (genbox).\n\n\nWhen I look at your images I see the following:\n\n\n1) The vertical surfaces receive far more energy at the top than\n    the ground (strong white dots vs. green and yellow shades).\n    I think this indicates that the higher you get the more the\n    ground contributes to the energy. I'm not sure that's logical.\n\n\n2) The density is much better at the top than at the bottom.\n    Therefore the lower you get the more zero contributions you\n    get.\n\n\n> I feel I have tried “everything” with the render options (see my setting\n> below) but have seen no improvement in render noise … hope to get some\n> pointers/ideas from the list.\n\n\nWhen I look at your render options below I see that you have an\n'-ab' of 0 which limits your (final) rtrace calculation to the direct\ncomponent only. However, glow surfaces are considered direct\ncontributors in Radiance. If you want to use this setting you should\nchange all the definitions of 'glow' in your materials to 'light'. And\nthen you probably have to subdivide large polygons like the ground.\n\n\n> I use the following command line command to render the irradiance:\n> vwrays -ff -x $XRES -y $YRES -vf $NAME.vp \\\n> |rtrace -ffa -opN $NAME.oct \\\n> |sed '1,8d' \\\n\n\nInstead of sed you can just add \"-h\" to rtrace to suppress the\nheader information. No sed required. You should also add a \"-w\"\nto avoid any warning messages.\n\n\n> |rcalc -ia6 -of \\\n> -e '$1=$1 + 0.001*$4;$2=$2 + 0.001*$5;$3=$3 + 0.001*$6' \\\n> -e 'out(v)=if(sqrt($4*$4 + $5*$5 + $6*$6) - 0.9,v,-1)' \\\n> -e '$4=out($4);$5=out($5);$6=out($6)'  \\\n> |rtrace -ffc -x $XRES -y $YRES -I -ab 0  -aw 1 -ad 4096 -ar 4096 -dt 0.0 -dp\n> 8192 -ds 0.01 -dj 0.9 $NAME.oct > $NAME.irradiance.hdr\n\n\nRegards,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-December/007590.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "December 29, 2010 at 02:43PM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_007589", "id": "radiance-general_007590"}