{"body": "Well, I tried Greg's suggestion of setting the limit weight to a very \nlow number, but all that did is manage to scrounge up a few additional \nlux.  This actually made things look worse, because my problems are with \nthe really dense shades (which are already coming up with higher numbers \nthan I'd expect).\n\n\nI have a spreadsheet here with the results of all my tests so far.  If \nanyone's interested in looking at it I'd be happy to share it.  Perhaps \nthere's a problem with my interpretation of this data.  I dunno. But the \ntests indicate that whenever I try a 1% shade in any combination, I get \nvery odd results from rtrace.  And the whole reason I'm doing this test \nis because we were getting similar odd results on our real model; I was \ntrying to simplify things so I could perhaps isolate something that was \ncausing these oddities.  So far, no joy.  I shared my trans material \ndefinitions for all these tests earlier, but if anyone wants them to \nhave a look I can send those as well.\n\n\nMy fear is that I'm simply trying to find too small a percentage of the \navailable light, and relative comparisons between different shade \nmaterials will not be valid for this model. (?)  I mean, this test model \nstill has two pieces of diffuse glass in it, and the skylight is prety \nsmall, so already the building form/glazing is removing a ton of light \nfrom the space.  Then when I start throwing shades in the skylight \ncavity, we're getting down to really tiny fractions of the exterior \nlight.  I dunno, I'd love to hear any thoughts.\n\n\n\n\n\n\n      Rob Guglielmetti\n\n\ne. rpg@rumblestrip.org\nw. www.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000732.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "May 13, 2003 at 12:22PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_000733", "id": "radiance-general_000732"}