{"body": "Hi Thomas,\n\n\n> ...there is an alternative method to calculate illuminance values on a\n> (theoretical) surface thanks to Radiance's \"lego bricks\" architecture:\n> http://sites.google.com/site/tbleicher/radiance/stencil\n> (Warning: Content may not be suitable for beginners. Guru guidance advised.)\n\n\nI looked at this site and immediately got a headache. I still wrestling with \nBasic Radiance, and at this moment, I have no strength for stencil. I am a\nbeginner and too far away guru.\n\n\n> The value you choose for -ab depends on the complexity of your scene geometry\n> and lighting conditions. From what you have written so far you have an empty\n> room with one window and exterior blinds. I assume there is no outside\n> obstruction to the window.\n\n\nThere is no outside obstruction to the window. I have an empty room with one\nwindow and exterior blinds, plus four luminaires (but I think that they do not\naffect to the complexity).\n\n\n> Without the blinds you can cover the light distribution within the room\n> accurately with an -ab value of 3 or 4. If you add the blinds you will need\n> additional \"bounces\" to account for the light reflected from the blinds. I\n> assume you will need at least a value of 6 to achieve reasonable accurate\n> results.\n\n\nI have done some preliminary calculations for an empty room with blinds, but\nwithout a window model, and when I use rtrace with -ab 1 to -ab 8 (for more\naccuracy), I get larger and larger values for an illuminance. I assume that the\nlargest value for an illuminance (-ab 8) is close to correct value. (Similar\nsituation is explained on p.43, figure 33, Basic Radiance Tutorial, Axel Jacobs).\n\n\n> Before you do your evaluation calculations you should do some tests to find\n> parameters which are accurate enough for your situation:\n\n\n> 1) Use one typical scene setup and a sky definition without sun (only\n> skylight and ground) and calculate the illuminance on one point with\n> increasing values for -ab...\n\n\n> 2) With a reasonably accurate setting for -ab use the same scene and sky but\n> define a sequence of 10 or more points from the window to the back of the...\n\n\n> Your main concern about using multiple points is the processing time.\n> However, if you pass all the points to rtrace in one call rtrace will cache..\n\n\nThese are useful advices. I will do what did you say, but after a holiday.\n\n\nRegards, Milan\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-December/007591.html).</sup>", "attachments": [], "created_by_name": "Milan Cakanovic", "created_at": "December 29, 2010 at 03:23PM", "created_by": "Milan_Cakanovic", "parent_id": "radiance-general_007574", "id": "radiance-general_007591"}