{"body": "Hi Lars,\n\n\nWow, 2 weeks. That seems pretty extreme. What is your scene? Are you \nrunning on your OpenMosix cluster?\n\n\nBelow are some answers and thoughts....\n\n\n-Jack\n\n\nLars O. Grobe wrote:\n> Hi,\n>\n> I hope these messages will arrive one day when radiance-online.org is \n> back again...\n>\n> I am getting into trouble with rendering a large detailed model. If I \n> am setting ar as usually (ar=scene boundary/detail dimensions, I get \n> something like -ar 2000. That leads to slow processing with huge \n> memory useage (around 1.6 GB).\n>\n> I wonder if there is a way to reduce the general resolution in such \n> cases and increase accuracy in detailed regions only by ad, as and aa.\n>\n> I also wonder if there is at least some performance to win by changing \n> / releasing ambient parameters for high-res pictures after the \n> ouverture produced some values. While people did such things for a \n> while, later posts suggested that this is not safe. Is this true for \n> ALL ambient parameters?\n>\nYes, you can do this but NOT for all ambient parameters.  You should be \nable to make some adjustments to  aa, ad and as, for example:\n\n\noverture calc: -aa .15 -ad 1024 -as 512\nimage:            -aa .25 -ad 512 -as 256\n\n\nwhere ad and as are getting halved and aa increased by some amount.\n\n\nHow many ambient bounces are you using? I think for an interior scene \nwith illums at the window openings you should be able to set -ab 1....\n> Finally, I am using mkillum to cut one step from the ambient daylight \n> calculation, illums are covering all windows. Does this influence the \n> simple formula used to calculate ar, or is ar only determined by scene \n> geometry?\n>\n> I am a bit desperate, as the ambient paramters needed to produce clean \n> images lead to rendering times about two weeks per 1200x1200 picture \n> at the moment here, on a 3.2GHz P4... so I hope to optimize a bit by \n> tweaking ambient calculation. I am already using mkillum and ambient \n> exclude lists to accelerate things a bit. The scene will become even \n> \"worse\" when I switch on my artificial light sources...\n>\nIt may be worth it (at 2 weeks running time) to do some pretty serious \nexperiments with ambient parameters. You might also want to consider if \nthere is geometry that could be excluded from the ambient calculation \n(-ae or -aE), some examples might be very small geometry and/or geometry \nthat has very dark materials applied. Lastly, if you have not even got \nyour artifical lights on then you might want to consider if some of \nthese could be managed with a glow material with a radius of influence \ninstead of illum/light. Also worth considering is whether there are any \noptimizations that you might be able to do to the scene geometry...\n\n\n\n\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-September/003984.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "September 13, 2006 at 07:40PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_003983", "id": "radiance-general_003984"}