{"body": "Hi Parisa,\n\n\nin fact these are weighting functions derived from v(lamda). So you \nshould use them only when  all your quantities are in photometric units. \nIrradiance \"usually\" implies the solar spectrum, but in RADIANCE this \nis  used also only considering the visible spectrum (and then using the \nweighting). I'm not sure if a color weighting makes sense when talking \nabout radiometric quantities using the solar spectrum. Usually I \ncalculate everything in \"grey\" (r=g=b) when using the radiometric \nquantities, so this problem doesn't occur. Be aware, that you usually \ncalculate everything in photometric quantities in RADIANCE, so if you \nwant to calculate the solar spectral behavior you have to take care of \nusing the related values(solar transmittance for glazing, solar \nreflectance of surfaces and generate sky and sun with radiometric \nquantities). As far as I know only if you use gendaylit with the -O 1 \noption, then sky and sun are automatically in radiometric quantities \n(which means your results are in W/m*m solar spectrum).\n\n\nJan\n\n\nAm 6/22/15 um 5:50 PM schrieb parisa khademagha:\n>\n> Dear all,\n>\n>\n> I have two questions regarding the weighting factors (0.265, 0.670, \n> 0.065) that are used in the formula ( I = 0.265 I_R + 0.670 I_G + \n> 0.065 I_B ) with which one can convert the spectral irradiance triad \n> to irradiance. My first question is: where these weighting factor come \n> from? Do they incorporate the spectral sensitivity of the human eye \n> (so called V(λ)) in the irradiance calculation? My second question is: \n> should the summation of these weighting factors be always equal to 1.\n>\n>\n> Thank you in advance,\n>\n> Parisa\n>\n>\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\nDr.-Ing.  Jan Wienold\nEcole Polytechnique Fédérale de Lausanne (EPFL)\nEPFL ENAC IA LIPID\n\n\nhttp://people.epfl.ch/jan.wienold\nLE 1 111 (Office)\nPhone    +41 21 69 30849\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-June/011055.html).</sup>", "attachments": [], "created_by_name": "Jan Wienold", "created_at": "June 22, 2015 at 09:24AM", "created_by": "Jan_Wienold", "parent_id": "radiance-general_011053", "id": "radiance-general_011055"}