{"body": "Hi Peter, didn't see your reply 'till after my latest tome.\n\n\nPeter Apian-Bennewitz wrote:\n\n\n> IMHO, additional investment in a dual motherboard plus the extra CPU is\n> worth it, since you share disks, opsys, ram. CPU costs are rarely \n> linear with CPU speed, so you may end up with a better cost/performance\n> ratio with two slightly slower CPUs than with one top-notch CPU.\n\n\nTrue enough.  Still on the fence over this choice.  But I think current \nfunds will ultimately do the deciding for me (isn't that always the case?)\n\n\n> As Schorsch pointed out, split your rtrace input vectors to two rtraces\n> and half your computing time. Easy with shell or awk programming.\n\n\nThis is the main reason why I'm still on the fence.\n\n\n>>having two separate boxes I gain a little redundancy to boot.\n> \n> correct. Of course two dual machines are also an option....  \n\n\nNot at the moment.  See \"funds\" reference above. ;-)\n\n\n> PS: I had a glance at mosix, - definitely a neat idea from a kernel and\n> opsys perspective. However, while rendering for fun and profit, I'd\n> rather prefer to know what is happening on my machines. Imagine a\n> logfile of an aborted rpict. It states \".... rendered on foo\", whereas,\n> thanks to mosix, it had been transparently migrated during rendering to\n> a different box, with happened to have a faulty RAM segment.\n\n\nExcellent point.  I have enough trouble reigning in all the parameters \nof a given calculation and keeping everything straight.  I don't need \nthe computer doing things behind my back to further confuse me! ;-)\n\n\n\n\n\n\n      Rob Guglielmetti\n\n\ne. rpg@rumblestrip.org\nw. www.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-January/000526.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "January 17, 2003 at 12:42PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_000518", "id": "radiance-general_000526"}