{"body": "Guiseppe,\n\n\nThe three-phase method simulation method does not use the geometry of the\nshading device to work. In fact, one advantage of it is that only the\nBSDF.xml file is needed. If you check Andy's Three-phase method tutorial,\nyou will see that the calculation of the V and D matrices do not require\nneither the geometry of the shading device nor the BSDF of it (thus making\nit very easy to try multiple fenestration systems).\n\n\nAdding Geometry information to the BSDF file is useful for using pkgBSDF;\nnot really for the 3phase method. When rays have to go through the\nfenestration system (i.e. rendering a room with venetian blinds, or  when\ncalculating the third matrix of the 5 phase method) a combination of two\nillums that \"wrap\" the geometry and the geometry itself seems to be more\nefficient. My understanding (I might be completely wrong) is that the\nillums are used to transfer the diffuse (indirect??) radiation; and the\ngeometry is used for transfering direct radiation, casting shadows.\n\n\nMy answer to the first question:\n\n\n*1.  in the equation i=VTDs the T matrix has to contain the window geometry\nor take knowledge of these from the other two matrix(V,D)? *\n\n\nNope. After the V and D matrices are calculated, the simulation is\nperformed by simply multiplying matrices... no geometry.\n\n\n\n\nThe second question is something that confuses me... it would be good to\nhave clarification here.\n\n\nHope this helps!\n\n\nGermán\n\n\n\n\n2014-07-02 11:54 GMT-04:00 Giuseppe De Michele <giudm.87 at gmail.com>:\n\n\n> Dear all,\n>\n> I am working with the 3 phase method (only from a few weeks) and I am\n> trying to understand the BSDF file format and how the 3 phase method read\n> it.\n>\n>  I have noticed that if I use the bsdf created with the command:\n> genBSDF -n 4 +f +b -geom meter material.rad blinds.rad > blinds.xml\n> the .xml file contain same geometrical dimension (height, width). In fact\n> if I use the command:\n> pkgBSDF -s blinds.xml > blinds_pkg.rad\n> the output file contain the original geometry.\n>\n> Instead if I use the BSDF created or contained  in the database of WINDOW\n> 7 these file do not contain a geometry.\n> With pkgBSDF I got an error.\n>\n> My questions are:\n> 1.  in the equation i=VTDs the T matrix has to contain the window geometry\n> or take knowledge of these from the other two matrix(V,D)?\n> 2.  I have understood that 3 phase method uses only the front transmission\n> data [A. McNeil, Three-Phase Method tutorial]  but in\n>  an other discussion [\n> http://www.radiance-online.org/pipermail/radiance-general/2012-October/008969.html\n> ]  I have discovered that WINDOW and genBSDF use an opposite meaning of\n> front and back, so the front transmission regards radiance or window\n> meaning?And what part of the T matrix I have to use in the 3 phase method\n> for the respective cases (WINDOW or genBSDF)?\n>\n> Kind regards,\n> *Giuseppe*\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n>\n\n\n\n\n\n\n*Germán Molina L.*\nIngeniero Trainee\nHunter Douglas Chile S.A.\nCelular +569 89224445\n\n\n\n\n\n\n\n\n*Nota de Confidencialidad:* Este mensaje incluído los archivos adjuntos son \nconfidenciales y pueden contener informacion privilegiada protegida por \nley. Si Ud. no es el destinatario, deberia abstenerse de copiarlo, \ndistribuirlo, divulgarlo o usar la informacion contenida. Por favor, avise \ninmediatamente al emisor y borre este mensaje de su sistema. Los mensajes \nelectronicos son susceptibles de ser cambiados, infectados o adulterados \nsin autorizacion. No asumimos responsabilidad alguna por ninguna clase de \ncambios o sus consecuencias. Usted debe estar informado que la compania \npuede hacer un seguimiento de sus mensajes electronicos y su contenido, \ngracias.\n\n\n*Confidentiality Notice:* The information contained in this email message, \nincluding any attachment, is confidential and is intended only for the \nperson or entity to which it is addressed. If you are neither the intended \nrecipient nor the employee or agent responsible for delivering this message \nto the intended recipient, you are hereby notified that you may not review, \nretransmit, convert to hard copy, copy, use or distribute this email \nmessage or any attachments to it. If you have received this email in error, \nplease contact the sender immediately and delete this message from any \ncomputer or other data bank, Thank you.\n\n\nA informação transmitida é confidencial e para conhecimento exclusivo do \ndestinatário. Sua utilização, não autorizada, constitui crime passível de \nprisão. Todas as precauções possíveis foram tomadas para garantir que este \ne-mail não contenha vírus. Uma vez que nossa empresa não pode assumir \nresponsabilidade por nenhuma perda ou dano causado por este e-mail ou de \nseus anexos, recomendamos que o destinatário utilize seus procedimentos de \nantivírus antes de qualquer uso.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2014-July/010367.html).</sup>", "attachments": [], "created_by_name": "German Molina", "created_at": "July 02, 2014 at 09:24AM", "created_by": "German_Molina", "parent_id": "radiance-general_010366", "id": "radiance-general_010367"}