{"body": "OK Rob,\n\n\nI mean if you generate a CIE overcast sky with horizontal diffuse\nilluminance of 10,000 lux (to use the example of John Mardaljevic in\nRendering with Radiance, p357) and since Radiance uses luminous efficacy of\n179 lumens/watt:\n\n\n!gensky -ang 45 0 -c -B 55.866\n\n\nRun your test scene and repeat for for hdi of 100,000 lux\n\n\n!gensky -ang 45 0 -c -B 558.66\n\n\nThen it should produce results 10 times higher.\n(You can do a similar thing for sunlight with gensky -R setting to set the\nhorizontal direct illuminance).\n\n\nAnyway check that this test is running OK with the diffuser that is\n'working' - then move onto the problem diffuser.\n\n\nIf it doesn't show the proportional relationship then perhaps some of your\nsettings at these low lighting levels mean that absolute rounding may be\nhaving an undue effect. At low light levels small absolute errors will\nproduce large percentage errors in the quantitative results.\n\n\nAs you may be relying on a relatively few measurement points in very low\nlight levels - i reckon it would be worth doing some small renderings so you\ncan 'see' what is going on - for instance observing the distance between the\nambient calculation points causing light leakage problems (that appear as\nsplotches in images) or detecting modelling errors that are not significant\nat the higher illuminance levels.\n\n\nThe renderings could be used like an overture calculation - ie reuse the\nambient file to recalculate your illuminance values and compare with\nprevious results. Again there should be consistency in the results.\n\n\nhope this helps\ncheers\nalex\n\n\n> alex summerfield wrote:\n> \n>> If there is some error with the indirect calculation arising from the\n>> settings and very low light levels you may be able to pick this up by\n>> radically scaling up the light coming from the sources, then pfilt down the\n>> results by the same factor.\n> \n> I'm not sure I follow you here.  But your suggestion to use pfilt\n> implies that I'm creating renderings, when in fact I'm not.  I'm only\n> using rtrace to computer some hard numbers on this project (and my test\n> scene).  Could you expand a little bit on your suggestion though?  I'm\n> always looking to learn new tricks ...\n> \n> ----\n> \n>     Rob Guglielmetti\n> \n> e. rpg@rumblestrip.org\n> w. www.rumblestrip.org\n> \n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general@radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n*******************************************************\nA. J. Summerfield                 alex@arch.usyd.edu.au\nFaculty of Architecture, University of Sydney\n*******************************************************\nOutside of a dog, a book is man's best friend.\nInside a dog, it's too dark to read.       Groucho Marx\n*******************************************************\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000744.html).</sup>", "attachments": [], "created_by_name": "alex summerfield", "created_at": "May 14, 2003 at 06:21PM", "created_by": "alex_summerfield", "parent_id": "radiance-general_000733", "id": "radiance-general_000744"}