{"body": "Hello Stephanie,\n\n\nFirst, I want to clarify that genBSDF uses Radiance format as input, which\nis not the same as MGF. Actually, MGF is a format with some really cool\nfeatures, but rarely used (unfortunately?).\n\n\nAnyways... Any tool that exports Radiance or MGF formated geometry (which\nis also readable by Radiance) is useful for generating input for genBSDF.\nThat said, I do not use Rhino, but probably DIVA and Honey Bee or Ladybug\ncan help you on that. Otherwise, there are some SketchUp plugins for\nexporting Radiance geometry,  which is a tool that allows importing several\n3D formats. Finally, I have read several times about Radiance using .OBJ\nthrough obj2rad program. I understand that this format is also common, but\nnot suited to model physically realistic materials.\n\n\nSo... I think you have several choices. I am pretty sure all these formats\nare able to model any required geometry, and that the choice you make will\nbe a matter of how easy is to \"draw\" it.\n\n\nRegarding how to input this geometry into genBSDF, you have to place the\nwidth of your \"window\" along the X axis, Height along the Y axis and inside\nis towards Z axis (i.e. Up). Any geometry over the Z axis is inside the\nspace and will emit a warning. Read the tutorials for more information on\nthis!\n\n\nI hope it helps\n\n\nbest,\n\n\nGermán\n\n\nEl 6 feb. 2017 23:07, \"Stephanie Truong\" <stephanie at dosu-arch.com> escribió:\n\n\nHi,\n\n\nI am attempting to run genBSDF, and was wondering if there is a workflow\nthat allows the use of Rhino/NURBs geometry to convert into MGF format?\nUltimately, I am trying to create a BSDF.xml file of a complex shading\nsystem. The system is made up of small units which are doubly curved,\ngradated (depending on orientation to the sun), and symmetrical on one\naxis. I am unsure if the MGF format is able to model that type of geometry,\nso it would be helpful to understand how to model geometry to input into\nthe genBSDF command. Let me know if I need to clarify or provide more\ninformation. I'm relatively new at this, and any help would be appreciated!\n\n\n\n\nThank you in advance,\nStephanie Truong\nDOSU | studio architecture\n\n\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2017-February/012035.html).</sup>", "attachments": [], "created_by_name": "Germán Molina Larrain", "created_at": "February 06, 2017 at 07:21PM", "created_by": "Germán_Molina_Larrain", "parent_id": "radiance-general_012034", "id": "radiance-general_012035"}