{"body": "Hi,\n\n\nI remember it, I was at this point, too, some years ago in my life. Its \none of the oddities of Radiance, having a powerful rendering engine but \n- at the first glance - no 'convenient' way to set up / put in a model. \nThis is no complaint, consider that the stuff is for free, and you \nalready get a rendering engine more or less surpassing many commercial \npackages in terms of quality and being currently accepted as the de \nfacto standard for accuracy in terms of lighting analysis.\n\n\nI once thought about writing some import module for Radiance geometry, \nbut soon made up my mind. It probably is not very difficult, but it \nneeds a lot of time and tedious work, and after all you'll end up \nreinventing another CAD program, although there are lots of them already \non the market.. Additionally, with modern PC equipment and their high \namount of RAM, treating geometry as polygon-meshes is not so much a \nlimitation as it has been before (I remember that POV ray uses lots of \ndifferent primitive types, for the more complex ones you need \nsophisticated root solvers to determine ray intersections, meaning \nlonger calculation time)\n\n\nNevertheless, so far I worked exclusively with an editor and the \nRadiance native formats (Hi Rob, you're absolutely right, with one \nexception of course, I'm insane, but I'm not masochistic, so I don't use \nvi.... :-) . But even when working with CAD programs, its good to rely \non exact coordinate specification rather than on mouse-drawing, to avoid \ninaccuracies like accidental small gaps between edges resulting in light \nleaks or other artifacts which need a lot of time to get tracked down \nlater.\n\n\nAnother Tip: decompose your model in separate items as much as possible, \nand let the Radiance input engine put them together when calling oconv, \nthe simplest means are often the most effective ones.\n\n\n-cb\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-October/001107.html).</sup>", "attachments": [], "created_by_name": "Carsten Bauer", "created_at": "October 22, 2003 at 12:02PM", "created_by": "Carsten_Bauer", "parent_id": "radiance-general_001102", "id": "radiance-general_001107"}