{"body": "Hi German!\n\n\n> I am thinking on implementing a hybrid methodology between Radiosity\n> method and Ray-tracing, for accelerating some calculations (by giving up\n> accuracy, maybe)\n\n\nDid you think about in what use cases radiosity may be faster, and in\nwhich it wouldn't? And are you aware of the \"hybrid\" rendering approach\nused by Radiance? Especially the way that the ambient cache is working\nas a means to accelerate the stochastic diffuse-indirect calculation\nthat a radiosity renderer aims at?\n\n\n> I think I can make algorythms to subdivide polygons into meshes,\n> however, what I do not know how to do is:\n\n\nI think most of this is already happening when you are using the ambient\ncache.\n\n\n> *1.- Calculation of View (Form) Factors:* I guess a straitforward way is\n> to calculate them by randomly sending rays from one surface to the rest\n> of them, but I do not know how to do that (or use octrees). (k/N would\n> be the view factor Fij... where k is the number of rays that falled into\n> j from i, and N the total number of rays sent)\n\n\nIf you want to do this using scripts and the available tools, you could\nstep through all surfaces in a scene file. There are tools to do the\nsampling available.\n\n\n> *2.- Render:* After I have the Radiosities of every polygon. How can I\n> make a render? I guess I can use *vwrays *somehow, but I am not sure how\n> to check which polygon am I \"seeing\", in order to use the calculated values.\n\n\nYou can tell rtrace to output object names instead of radiance or\nirradiance values. You can also get both the name of the object and its\nradiance. This would even allow to add the radiance value of a scene\nwith -ab 0 and the precalculated \"radiosity\" value. Somehow what most\nradiosity renderers do to achieve sharp shadows (they add a\nraytracing-step for direct calculation).\n\n\nStill I have doubts that this can be faster than the current\nimplementation.... :)\n\n\nCheers, Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2013-June/009564.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "June 21, 2013 at 06:57AM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_009554", "id": "radiance-general_009564"}