{"body": "John,\n\n\nA very timely and useful response thank you.  As you know the EFA (Education Funding Agency) in the UK has released its FOS (Facilities Output Specification) for the next generation of schools.  The directive from the government was a higher standard of space for lower cost / m2.\n\n\nWe made the decision to drop daylight factors and move to CBDM for the next generation of schools and the topic of the UDI exceed level came up during the writing and testing of the baseline design and indeed it has come up again since as people try and create standard designs.  As it stands the UDI autonomous was set at 100-2000 in the FOS.  What this means for designers when you look at a balanced design, (thermal and lighting), you need to control heat gain with smaller external windows and therefore supplement the daylight from a secondary source.  However, this costs money.  E.g. Atria, lightwells, lightpipes etc.\n\n\nWhat is interesting when you raise the UDI exceed from 2000 to 3000 then you can start again to design single sided lit spaces just as we had with DF's (indeed the type of rooms we are trying to stop building as the blinds are typically pulled down and the lights are turned on).  My thought therefore is whether in raising UDIe to 3000 because say a person can typically accept that level of light, then means we have significantly increased the contrast in a single sided lit space.  If we have, have we increased it to a level where parts of the space feel gloomy?   Is the answer to move UDIa to 300-3000, does that matter much?\n\n\nRegards\n\n\nAndrew\n__________________________\nAndrew Bissell\nB.Eng(Hons) C.Eng MSLL MCIBSE MIET\nLighting Design Director\nCundall Light4\nDirect: +44 (0)161 200 1235\nMobile: +44 (0)7899 907 978\nOffice: +44 (0)161 244 5660\nP Please consider the environment before printing this e-mail\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2012-December/009114.html).</sup>", "attachments": [], "created_by_name": "Andrew Bissell", "created_at": "December 11, 2012 at 01:57PM", "created_by": "Andrew_Bissell", "parent_id": "radiance-general_009107", "id": "radiance-general_009114"}