{"body": "Hi,\n\n\n1) Perhaps your use of the \"glow\" material for the environment box stops\n> the direct calculation from reaching the light source? Can you post the\n> definition of your light source? I know a combination of HDR mapped to a\n> sky dome and other light sources can be done but I'm not sure if this works\n> with a box, too.\n>\n\n\n# Direct source\nvoid light lt\n0\n0\n3 1 1 0  # The light colour is yellow, so if my white ball is lit yellow, I\nknow that this light has an effect.\n             # I've also tried varying the intensity of the RGB values here\nwith respect to the RGB values of the environment map.\n\n\nlt source ltsource\n0\n0\n4 0 -1 1 1\n\n\n# Environment map\nvoid colorpict uff\n9 red green blue uffizi_probe.hdr angmap.cal sb_u sb_v -rx 90\n0\n0\n\n\nuff glow uff_glow\n0\n0\n4    1    1    1    0\n\n\n!genbox uff_glow boxenv 100 100 100 -i | xform -t -50 -50 -50\n\n\n\n\n\n\n>\n> 2a) You can render the image of the environment map on the reflecting\n> sphere separately from the main scene and then just combine the two images.\n> You won't have the lighting pattern on the mirrored object, though. Perhaps\n> there is a way to capture the lighting pattern with a lambertian material\n> and multiply the values from both images? You'd have to make sure that your\n> environment texture captures accurate lighting data.\n>\n> 2b) Instead of reflecting a texture in the mirror ball you could just\n> apply the texture directly to the mirror. What real-world physical effect\n> do you want to simulate?\n>\n\n\nMy goal is to be able to render a completely specular object in different\nscenes (\"worlds,\" let's say), e.g., white noise, 1/f noise, polka dots, &c.\nNormally, I would set up a scene thus:\n\n\n- put the object in the world origin\n- place a light source or light sources\n- place a giant box around the scene, and texture the inside of the box\nwith the desired world (e.g., white noise)\n\n\nBut what I actually want to do is use naturalistic lighting, captured from\nlight probes, hence my question. But maybe this is a nonsensical thing to\ndo, since the light probes contain scene structure in there? I'm not sure.\n\n\nThanks so much for your help!\n\n\nRegards,\n\n\nMJ\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-July/011140.html).</sup>", "attachments": [], "created_by_name": "Minjung Kim", "created_at": "July 22, 2015 at 02:42PM", "created_by": "Minjung_Kim", "parent_id": "radiance-general_011131", "id": "radiance-general_011140"}