{"body": "Dear Séverine,\n\n\n\n\n\n\nfrom my point of view, if your interest lies with solar >energy< gain, then\nRadiance is not really best suited. Typically, what you describe is covered\nby thermal building simulation tools to a quite high degree of detail\n(ESP-r, EnergyPlus, IDA-ICE, TRNSYS to name a few). It would likely be quite\ndifficult or probably even impossible e.g. to model the secondary heat gain\nthrough windows / glazed facades (or opaque facades, for that matter). Also,\n\u0093what goes through\u0094 is not the whole story. What happens in the building is\nalso of major interest to be able to decide if the gains are \u0093useful\u0094 or\n\u0093harmful\u0094.\n\n\n\n\n\n\nWhy do you think you need the ray tracing approach?\n\n\n\n\n\n\nBest\n\n\nAchim\n\n\n\n\n\n\n\n\n\n\nVon: Séverine HUET [mailto:S.HUET at vs-a.eu] \nGesendet: Mittwoch, 6. April 2016 15:35\nAn: radiance-general at radiance-online.org\nBetreff: [Radiance-general] Asking for informations\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nVS-A.jpg\n\n\nVS-A\n\n\n\n\n\n\n\n\narchitectes d.p.l.g / ingénierie de l\u0092enveloppe\n\n\n\n\n\n\n\n\n\n\n\n\nHi Radiance team,\n\n\n\n\n\n\nI am a student in an engineering school and I am currently doing an\ninternship in a design office specialized in building envelope studies. \n\n\n\n\n\n\nMy work consist in developing a tool to determine precisely the solar factor\nof a facade, taking into account its shading devices and its geometry which\ncan be complex sometimes.\n\n\n\n\n\n\nMy idea is to use the software Grasshopper to:\n\n\n1.    Import a geometry\n\n\n2.    Define the materials of the scene\n\n\n3.    Create the Radiance geometry \n\n\n4.    Create two analysis grid (vertical): one before the system\n\u0093shading+facade\u0094 to determine the incident solar energy, and one inside my\nbuilding to determine the transmitted solar energy.\n\n\n5.    Then, use the Ray Tracing method to calculate the solar energy on each\npoint\n\n\n\n\nThis method seems interesting for my problematic but the calculations under\nthe hood may be not relevant for solar energy, insofar as it is designed for\nlight calculations and realistic rendering.\n\n\n\n\n\n\nQuestions :\n\n\n1)    I apology if I am missing something obvious, I have done some\nresearches about the \u0093Ray tracing\u0094 method used by Radiance but I still have\nsome interrogations about how it works\n Is the ray divided in many rays when\nit punch a surface ? What is the different between the direct light and the\ndiffuse light (in terms of modeling) ? Is there a way to convert R G B\nradiance provided by Radiance in solar energy for instance (like it is done\nfor luminance) ?\n\n\n\n\n\n\n2)    I must not be the first to process this kind of problematic, so I am\nwondering if it exists a calculation engine derived from Radiance which can\nprovide the solar energy using a kind of \u0093ray tracing\u0094 method? \n\n\n\n\n\n\nFor me, in principle, it is not that complicated, I mean it is possible. The\nproblematic is purely geometric and mathematic. I imagine: the ray launched\nis define by a wave length, an intensity and a direction (to model the\ndirect radiation). When it reaches a surface, the intensity took into\naccount is the intensity of the surface\u0092s normal projection of the ray. Then\nthe ray is divided in 3 rays: one transmitted, one reflected and one\nabsorbed, whose proportions (in terms of intensity) and directions depend on\nthe material definition of the surface reached. This last can react\ndifferently according to wavelength domain of the ray. Do the same with\ndiffuse rays, to model the diffuse radiation. The absorbed part of the\nincident energy could be transformed in heat (Infrared radiation) according\nto the emissivity of the surface.\n\n\n\n\n\n\nI am sorry about the lenth of the message. I really need to understand how I\ncan do to determine solar energy through different kind of materials\n(translucent, transparent, opaque\n). I would be really thankful if you help\nme! This project constitute my graduation project, it is quite ambitious\nthat\u0092s why I need some guidelines.\n\n\n\n\n\n\nThank you in advance, \n\n\nYours sincerely\n\n\n\n\n\n\nSeverine Huet\n\n\n\n\n\n\n\n\n\n\nVS-A, architectes d.p.l.g / ingénierie de l\u0092enveloppe\n\n\n\n\n\n\n\n\n41 place Rihour / F-59000 LILLE \u0096 France\n\n\nTél : +33 (0)3.20.52.11.44 ; Ligne directe : +33 (0)3.20.52.xx.xx / Fax :\n+33 (0)3.20.52.05.15\n\n\nemail :  <mailto:courrier at vs-a.eu> courrier at vs-a.eu  / email direct :\n<mailto:S.HUET at vs-a.eu> S.HUET at vs-a.eu /  <http://www.vs-a.eu> www.vs-a.eu\n\n\n\n\n\n\n\n\n\n\nCe courriel (et ses pièces jointes) est adressé exclusivement à son\ndestinataire ; il n\u0092a pas de valeur hors de ce contexte précis et peut être\nconfidentiel. Nous remercions d\u0092avance les destinataires involontaires de\ns\u0092abstenir de le dupliquer de quelque manière que ce soit, et de le\ndétruire. Merci également de bien vouloir en avertir l\u0092expéditeur.\n\n\n\n\n\n\nThis e-mail (and its attachments) is intended to be for the only use of its\nrecipient; the message is worthless out of this specific context and may\ncontain confidential information. If you have received this e-mail by\nmistake, please do not duplicate it in any possible way. Thank you as well\nfor notifying us immediately and deleting this e-mail.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-April/011667.html).</sup>", "attachments": [], "created_by_name": "Achim Geissler", "created_at": "April 06, 2016 at 11:18PM", "created_by": "Achim_Geissler", "parent_id": "radiance-general_011666", "id": "radiance-general_011667"}