{"body": "Hi\n\n\nI am (finally) back from summer holidays and cannot help but add my twopence worth - as the supervisor Peony refers to.\n\n\nPeony seems to have narrowed down the problem to a jpeg format issue that makes the image unreadable, nothing to do with the phone itself.\n\n\nFor example, she is able - using the same HDR software on her tablet to generate a camera response curve.\n\n\nThe software for the phone that she is using to generate the HDR images allows the turning of off auto white balance and allows the setting up of 3, 5 or 7 images at separate exposure values.\n\n\nShe can clearly create the camera response curve for the $2000 Nikon camera with its $2000 fish eye lens\n\n\nWith her $300 phone and $50 fish eye lens, and the same software as the tablet she cannot create a curve. \n\n\nThe software saves the original jpg images as well as the combined HDR image on each machine.\n\n\nAt first we thought it was inadequate EXIF data in the original jpeg images. However, it is not the EXIF data because the Nikon camera images with the phone image EXIF data replacing the Nikon's EXIF data still produce a camera response curve.\n\n\nShe has eliminated the jpg image compression from the question because she has opened each jpg original in photoshop and re-saved it in a standard jpg format - the Nikon images still work, the phone not.\n\n\nPersonally, I'd like this to work because first year and second year building science student measurement exercises could be so much more interesting if we were measuring a whole space, not a simple grid... Also: We can calibrate the sound level meters on the phones. They can use a simple app on the phones to photograph the horizon line with overlaid sun path diagrams in Augmented Reality mode. The phone as general survey instrument, not just site camera is becoming a reality.  Calibration / trust of each phone, and how to test it  is the issue\n\n\nAt another level, I feel responsible for understanding what the issue might be to try to explain what might be going wrong so a) Peony can understand, and document this process properly in her thesis Appendix and b) some recommendations can be formulated as to what camera-phone characteristics to look for.\n\n\nThus I return to the question: what might we be unable to control with the phone, but is controlled on the tablet, that would cause this kind of Photosphere error message? And how might we further  test what we are doing?\n\n\nThanks in anticipation of any help.\n\n\nM\n\n\n\n\nVictoria University of Wellington School of Architecture\nMichael Donn\nmichael.donn at vuw.ac.nz\nPO Box 600\n139 Vivian St\nWellington\nNew Zealand\ntel: +64 4 463 6221\nfax: +64 4 463 6204\nmobile: +64 21 611 280\nSkype ID:the_donn\n\n\n\n\nToday's Topics:\n\n\n   1. Re: Photosphere \"Cannot solve for response function\"\n      (Gregory J. Ward)\n\n\n\n\n\n\n\n\nMessage: 1\nDate: Mon, 24 Dec 2012 08:56:34 -0800\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2013-February/000452.html).</sup>", "attachments": [], "created_by_name": "Michael Donn", "created_at": "February 20, 2013 at 03:28PM", "created_by": "Michael_Donn", "parent_id": "hdri_000418", "id": "hdri_000452"}