{"body": "Dear Greg,\n\n\nMany thanks for for quick response. I am trying to use a modified\nmirror like the one posted on 17 March 2008 in order to emulate the\nangular-dependent reflections from a glass:\n\n\nvoid glass glass_alt_mat\n0\n0\n3 0.96 0.96 0.96\n\n\nvoid brightfunc glass_angular_effect\n2 A1+(1-A1)*(exp(-5.85*Rdot)-0.00287989916) .\n0\n1 0.08\n\n\nglass_angular_effect mirror glass_mat\n1 glass_alt_mat\n0\n3 1 1 1\n\n\nI use this material to quantify in a top view the illuminance on the\nground due to reflected light from vertical windows (therefore not\nlooking at the glass, but just at the reflections). The calculation is\nbeen done with rpict -i -ab 0 -dr 1. I have also tried other values\nfor the parameters but the results are the same.\n\n\n\n\nI would expect the reflections to vary in value depending on the angle\nof incidence on the glass. However, all reflections seem to be of the\nsame intensity, actually 100% reflective like in an ideal mirror.\nI wonder if the issues I am having may have to do with the way I am\nusing rpict or if there is a more fundamental error. I have tried\ntesting this issue in Radiance 4.2 for Windows to see if could have to\ndo with the platform or with recent issues with the m_mirror routine,\nas posted a few days ago, but the results are again the same.\n\n\nThanks and best regards,\n\n\nRioboo\n\n\nHi Rioboo,\n\n\nIt helps when you give a specific example.  What is your material\ndefinition, and what is it doing that disagrees with your\nexpectations?\n\n\nThe mirror material will ignore its modifiers in the case when you\nhave given an alternate material type.  This will be called instead\nwhen viewed directly.  The modifiers to the mirror itself will only be\nused for calculating the virtual source contributions.\n\n\nBest,\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-June/011791.html).</sup>", "attachments": [], "created_by_name": "goodriver laurus", "created_at": "June 13, 2016 at 02:29AM", "created_by": "goodriver_laurus", "parent_id": "radiance-general_011789", "id": "radiance-general_011791"}