{"body": "Hi Lars,\n\n\nHere is what I understood as the problem from your first message:\n\n\n> The background: I try to use exact data for material definitions, but \n> the image maps can't all be color corrected. So I want the overall \n> color and brightness from defined materials, e.g. from the plastic \n> material, and use the map only for what I would call \"local color \n> variation\". The reason is that I have e.g. red marble, got its color, \n> brightness and all that defined as plastic marble. But the marble has \n> blue particles which won't appear if I use a grayscale imagemap. So I \n> want to use a normpat'ed (NOT colorcorrected e.g. by macbethcal!) to \n> bring these blue parts onto the surface. The whole surface however \n> must still have the average color of my plastic marble material. \n\n\nYou want to take an image of a material (that has multiple colors in the \nimage) and map this to geometry in some calibrated manner. But the \nproblem is how to do this with a material/image that has multiple colors \nin it, such as red marble with blue flecks. Because the image has \nmultiple colors you do not want to use the average color of the material \nfor the definition instead you want to use the photopic reflectance \nvalue. You want to let the colorpict convey the color information of the \nimage and the plastic to govern the overall reflectance of the material. \nThus you should calibrate (macbethcal) the material and normalize \n(normpat) it.\n\n\nSo I think that you example should be as follows:\n\n\n# porphyry red 1: values from ximage and macbethcal'ed pic\n# rgb  = .09 .06 .05\n# photopic reflectance =  .0673 as determined with grey(.09,.06,.05)  in \ncalc\nvoid plastic porphyry_red_1_reflectance\n0\n0\n5 .0673 .0673 .0673 .02 0\n\n\n# calibrate the image with macbethcal to get the colors \"corrected\"\n# normpat the image to make its average 1.0\n# not sure about the use of noop?\nvoid colorpict sophia_porphyry_red_1_pattern\n13 red green blue sophia_porphyry_red_1.pic picture.cal tile_u tile_v -s \n.2 -rx 90 -rz 90\n0\n0\n\n\n# apply the material\n# give alias the modifier as output from dxf2rad\nsophia_porphyry_red_1_pattern alias l_porphyry_red_1 porphyry_red_1\n\n\nThus you have a base material that is a grey plastic. The reflectance of \nthis material is equal to the photopic reflectance of your sampled \nmaterial. The rgb color properties are multiplied by the color picture \nsupplied in colorpict. Since the picture is corrected the colors should \nhave a stronger basis in reality (assuming the sampling method is \ncorrect). Since the picture is normalized to an average of 1.0, the \nmultiplication  of the image by the plastic still equals the reflectance \nof the material. Since the base material is neutral (eg grey/white) the \ncolors of the image pattern will be what you want.\n\n\nI hope this is right and if not some one should jump in and correct me.\n\n\n-Jack\n\n\nLars O. Grobe wrote:\n\n\n> Hi Jack,\n>\n> thank You for the reply.\n>\n>> 2.    final reflectance set by base material - colorpict is used to \n>> modify reflectance set by material, that is normpat image colorpict \n>> modifier is used to modify reflectance set by material\n>\n>\n> I want to do this, I have the material values, the colorpict is just \n> to add some visual credibility ;-) But I also want to have the final \n> overall (that means the average over the whole surface, like selecting \n> an area in ximage vs. a point) color from the base material.\n>\n>> So steps as follows:\n>>\n>> 1.    acquire sample material image by photography, scan....\n>> 2.    callibrate sample image with macbethcal\n>> 3.    use callibrated sample image to estimate average color\n>> 4.    calculate reflectance based on average color values, grey(r,g,b)\n>> 5.    normpat the callibrated image\n>\n>\n> So, if I already have the rgb for the base material (which is \n> plastic), do I really have to calibrate (macbethcal) the picture map?\n>\n> Maybe I show you an example:\n> -- \n> # porphyry red 1: values from ximage and macbethcal'ed pic\n> void plastic porphyry_red_1\n> 0\n> 0\n> 5 .09 .06 .05 .02 0\n>\n> # non-calibrated normpat'ed pic\n> void colorpict sophia_porphyry_red_1_pattern\n> 13 noop noop noop sophia_porphyry_red_1.pic picture.cal tile_u tile_v \n> -s .2 -rx 90 -rz 90\n> 0\n> 0\n>\n> # give alias the modifier as output from dxf2rad\n> sophia_porphyry_red_1_pattern alias l_porphyry_red_1 porphyry_red_1\n> -- \n> Will this be correct?\n>\n> TIA, CU Lars.\n> -- \n> Lars O. Grobe\n> grobe at gmx.net\n>\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n\n\n\n\n#\tJohn E. de Valpine\n#\tpresident\n#\n#\tvisarc incorporated\n#\thttp://www.visarc.com\n#\n#\tchanneling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-June/001866.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "June 30, 2004 at 11:21PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_001837", "id": "radiance-general_001866"}