{"body": "Rob Guglielmetti wrote:\n> \n> On Wednesday, September 24, 2003, at 05:40 AM, Weismann Stephan wrote:\n> \n>> Hi all,\n>>\n>> wich is the status of the photon map tool, developed by Roland Schregle?\n>> At the ISE website i only found a beta version. Will there anywhen \n>> come up a\n>> 'stable' version?\n>> Will there anywhen come up a more comfortable integration into \n>> Radiance, or will\n>> it be compiled anywhen in the Radiance source?\n> \n> \n> Hi Stephan,\n> \n> Forgive me if this had been answered already I am \"disconnected\" at the \n> moment, have not checked my email in several hours and am just sitting \n> down now to reply to some others, and will not send this till tomorrow, \n> so the info may be a bit stale by then.  The photon map tool was part of \n> Roland's PhD, and AFAIK it's sort-of \"stalled\" right now, he's doing \n> some validations and the like.  Also, I believe it *is* stable.  You \n> might also wanna check out Francesco Anselmo's compiled source packages; \n> you have the option of downloading the Radiance release with the photon \n> map module, precompiled, in a variety of formats (.rpm, etc...)  As far \n> as future development, you'll have to talk to Roland...\n\n\nI've all but ceased maintenance on the code and will release another \npatch revision in the coming weeks. That will probably be the final \nupdate for the foreseeable future, and it will mostly just fix a few \nbugs. I may include stuff to sample arbitrary BRDFs (simply because the \ncode's already available and some people need that functionality), but \nit's insanely slow and thus of virtually no practical use. I now \nconsider the code pretty much as stable as it can get -- of course I'm \nnot ruling out minor bugs which only manifest themselves under rare \ncircumstances, mainly because I never had a comprehensive suite of test \nscenes (that's why I rely on user feedback, and I acknowledge those who \nhelped here).\n\n\nAs for the future, that decision lies in the ISE's hands. As I \nunderstand it, it's their code. I won't maintain it any longer after the \nnext release (not for free anyway), and I'm not aware of any plans to \ncontinue its development at ISE, either. Plus this \npatching-to-by-now-outdated-official-release stuff is cumbersome and \nleaves us with a parallel code branch which is incompatible with the \ncurrent HEAD release. Since there appear to be a number of fellas out \nthere who actually *use* this thing (I'll be damned!), a long term \nsolution must be found. In an ideal world, I'd like to see ISE hand the \ncode over to the Berkeley crew so they can merge it with the official \ndistribution and continue maintenance. I'm not sure what ISE's \nstandpoint is on that, but they should seriously consider it. Maybe they \ncan work something out with Berkeley. This world being anything but \nideal however, I don't expect to see this anytime soon, and the pmap may \nultimately fade into oblivion. Interested parties might want to get in \ntouch with my project manager at ISE, Sebastian Herkel \n(herkel@ise.fhg.de), to inquire what's in store for the pmap.\n\n\nSee ya!\n\n\n--Roland\n\n\n\n\n\n\nEND OF LINE. (MCP)\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-September/000994.html).</sup>", "attachments": [], "created_by_name": "Roland Schregle", "created_at": "September 25, 2003 at 01:17PM", "created_by": "Roland_Schregle", "parent_id": "radiance-general_000990", "id": "radiance-general_000994"}