{"body": "Hi John,\n\n\nYou make a very good point, reviewing the LEED docs again it does not\nclarify the \"clear\" sky model to use.  I have always assumed it was the\nIESNA recommended clear sky definition which does give consistent and\npredictable horizontal illuminance.  In my practice, I have found measured\nclear skies to match up very well with these guidelines. I live in sunny\nBoulder, true, but last fall we measured 32 mostly clear skies in South\nCarolina which all matched up very well with the IESNA predicted horizontal\nilluminance.  The luminance distributions were not far off either.\n\n\n>From what I understand, IESNA Handbook 9 adopted the same clear, partly\ncloudy, and cloudy luminance distributions created by Kittler and also\nadopted by the CIE at the time (I believe CIE has now adopted a broader set\nof 15 skies or so  covering more intermediate conditions).  In addition to\nthis, the IESNA handbook 9 offers a series of tables and equations for\ncalculating the Zenith Luminance allowing one to predict the magnitude of\nthese skies under different conditions.  Does the CIE not have a similar\nrecommendation for calculating the zenith luminance?  From what I\nunderstand, the CIE sky models rely on input of either zenith luminance or\nhorizontal illuminance from weather data.\n\n\nBTW - the latest public review draft of LEED 2012 goes away from this\nstandard clear sky and requires the user to find the average hourly values\nbetween the clearest and cloudiest days within 15days of Sept 21 and Mar\n21st.  Someone must have been listening to your concerns!\n\n\nCheers,\nZack\n\n\nPS.  I have a python \"IES_gensky.py\" script and a \"IES_skybright.cal\" that\ngenerates the IESNA sky definitions.  I have been using this solely for\n\"design day\" daylight illuminance calculations for the past 8 years in lieu\nof gensky.  It is used and available in the SPOT program.  I'd be happy to\nshare with anyone, e-mail me directly and I will respond with it.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2011-April/007760.html).</sup>", "attachments": [], "created_by_name": "Zack Rogers", "created_at": "April 14, 2011 at 03:11PM", "created_by": "Zack_Rogers", "parent_id": "radiance-general_007750", "id": "radiance-general_007760"}