{"body": "--------------040704070607010508090408\nContent-Type: text/plain; charset=us-ascii; format=flowed\nContent-Transfer-Encoding: 7bit\n\n\nGeorg's response\n\n\n>You may also want to set the exposure to a fixed value, resp. one\n>for exterior and one for interior shots.\n>\n>  \n>\nYeah, I need to work on how I set the exposure or human sensitivity.  I \ncompile a pre-final animation for my deadline today and its posted here.\n\n\nhttp://www.archenergy.com/downloads/pub/images/Radiance/walkthrough_final.mov\n\n\nMy last frames just finished overnight (they had been running on 4 NT \nmachines since thurs. - i way overestimated the efficiencies an ambient \nfile would add) and I had to quickly compile them this morning.  Hence, \nI just applied human sensitivity to the frames.  As you can see in the \nanimation there are some erratic frames.  I am not sure why this \nhappened.  Besides the couple of frames that stick out, the other frames \nseem to flow pretty well.  Some of the erratic frames are just due to \nthe instant eye adjustment that the human sensitivity function gives as \nthey happen when bright objects come into or out of view.  One of the \nreasons I used human sensitivity rather than just setting an exposure is \nthat I have quite a range of brightness, especially in my lobby, and I \nwant to be able to see the floor tiles in the direct sun patches rather \nthan just a white patch while keeping the darker corners visible.  I'm \nall ears for other ways to approach this. Seems like you need a time \ndependant human sensitivity adjustment for better accuracy, although \nthis seems very tough as it depends on frames/sec.   Also, I don't like \nthe way human sensitivity sometimes makes my red doors and mullions look \nalmost black.  I'm guessing this is due to the mesopic adjustments done \nby human sensitivity.  I thought maybe I should just rerun pcond with \n-a+ -v+ and -s+ instead.  Any other suggestions are certainly welcomed. \n I offered to run a higher quality simulation over my Christmas break \nand so I will probably have one more pass at this animation.\n\n\n>Should be there. Are you sure you installed the additional\n>support package before building? Because otherwise you're missing\n>out on the tifflib, which will cause other stuff in the same\n>directory not to get built (even if it doesn't actually use the\n>tifflib).\n>\n>  \n>\nI did not pass information onto our IT guy very well....we did not \ninstall the support package first.  Thanks! and we will just use the \nHEAD version.\n\n\n>> BTW - pinterp does not seem to work in the\n>>windows version either.\n>>    \n>>\n>Try to make sure that the file paths you feed to pinterp are as\n>short as possible (ie. use relative paths). This is fixed in\n>HEAD, but many of the picture manipulation programs used to\n>suffer from buffer overflows when comand lines got too long.\n>  \n>\nI tried this again with a very short path (z:\\tmp\\) and it still gave me \nthe same error...or actually \"no error\" :-).  The output is:\n\"read: no error\"\nOnce I get our linux Radiance up and running I plan on using linux for \nmy next round of simulations anyways.\n\n\n>Some future versions of Radout and dxf2rad may do this (with the\n>new mesh primitive), but it's not an urgent issue for me as long\n>as Rayfront still uses Radiance 3.1/3.2.\n>\n>  \n>\nThis would be great added feature!\n\n\n>You'd need to do oversized renderings and filter them down to\n>avoid the particle look in distant patterns. On the other hand,\n>there's no real point in mapping a wood grain pattern to surfaces\n>that you never look at from up close.\n>\n>  \n>\nYeah, I ended up taking off the wood grain on most surfaces except the \nhandrails.  The problem with an animation is that the distance to these \nsurfaces is always changing.  I am planning on exploring the fade \nfunction approach in rayinit.cal.\n\n\n>There's an \"arbmap.cal\" included with Rayfront for that (and it\n>should also be in the archives here somewhere for those who don't\n>have that).\n>\nI've tried to use arbmap.cal before and was having some problems - but \nthat wouldn't be necessary for a solid texture anyways, correct??  I \ncan't remember the errors I was getting, i will try again and report \nback if i have any problems.\n\n\nGreg's response\n\n\n>\n>I posted something to the list about a year ago on generating animation  \n>paths, which I've attached to this message.  Perhaps this can help.\n\n\nThanks Greg.  I remember seeing this and had forgotten about the \nspline.cal function.  I was hoping for something more visual, but this \nmethod would definitly be easier than the way I did it (essentially with \nan exported spline from CAD and a spreadsheet)\n\n\n>\n>The time reduction after the first frame isn't noticeable as it doesn't  \n>progress much from there -- each new frame adds incrementally to the  \n>ambient file.  You are still much better off than not using one (MUCH),  \n>but don't expect your rendering times to continue decreasing as the  \n>animation progresses.\n>\n>  \n>\nI was thinking that since each frame is so similar (6 inches - 15cm - \napart) that there would be alot of ambient data that could be shared \nfrom one frame to the next.  Is it because the incident angle to each \nsurface changes enough that the previous ambient data cannot be used.  I \ndon't have to great of a grasp on how the ambient file works, so I \napologize.\n\n\n>\n>Looks pretty good to my eyes.  You could improve rendering times by  \n>removing some of the fussy details from the ambient calcultion with an  \n>ambient exclude file (-aE mat_excl.txt option).  I would remove the  \n>window frames in particular.  \n>\nI shied away from using an ambient exclude file because I use the same \nmaterial on many objects.  I think for my next pass though I will take \nthis advice, and either name the materials differently or use an alias.\n\n\n>You might also increase your -ar value,  \n>as 45 seems very low for a model of this size, especially with all the  \n>exterior geometry.  I think you're losing resolution on the  \n>interreflection calculation as a result.  Divide the octree cube size  \n>(getinfo -d octree) by the length of your arm in your world  \n>coordinates, and that should give you a reasonable number.\n>\nOops, I had set my -ar value before I added in the the extensive parking \nlot.  Getinfo -d gives me this:\n\n\nbc.oct: -214.5790355 -249.1505 -170.126913 352.68657\n\n\nMy model is in meters.  I don't quite understand this.  My xmin and ymin \nmay be as stated but I know my zmin is not much more than -1 meter.  Am \nI misunderstanding this output.  And so my arm is about a meter so would \na good -ar setting be 352/1 = 352?  This would make my calculation time \nmuch longer.  I've been setting this in Rayfront where you input xsize, \nysize, zsize and octree size (which is longest of the 3 sizes).\n\n\nThis isn't the cause of some the splotches i am still seeing, is it?  I \nhave my -ad and -as parameters really high, but perhaps too high??  Here \nis a panoramic animation I also created for this model that is even more \nsplotchy:\n\n\nhttp://www.archenergy.com/downloads/pub/images/Radiance/panoramic_walkthrough.exe\n\n\nI had these running on some XP machines (since they couldn't handle \nranimate) and with a separately generated ambfile.  These were the \nsettings from my .rif file\n\n\nQUALITY     = medium\nDETAIL      = high\nVARIABILITY = high\nINDIRECT    = 1\noconv       = -r 4096\nrender      = -ad 4096\nrender      = -st 0.01\nrender      = -dp 512\nrender      = -av 2.5 2.5 2.5\nrender      = -as 2048\nrender      = -sj 0.1\nrender      = -dt 0.1\nrender      = -aa 0.08\nrender      = -ar 60\n\n\nThere are some pretty significant splotches - I am not sure why these \nare so much worse than my walkthrough - both ambfiles were about 7MB by \nthe end.\n\n\nPeter's response\n\n\n>\n>For the long ISE outside animation, I had to pre-run along the path \n>mulitple times at low res to fill up the ambient file. Be sure that it \n>is fairly \"stable\" and has enough ambient points, otherwise it \n>\"discovers\" more light during the main animation, leading to brightness \n>jumps or flicker (depends on the sequence of generation of the image \n>frames).\n>  \n>\nGood suggestion.  I will try this on my next round of simulations.  I \ndon't think this is why I had so many flickers in my final animation \nthough, is it???  I thought my flicker was more due to pcond issues.\n\n\nGeorgs response 2\n\n\n>In your animation, the most obvious places where I noticed any\n>lack of smoothness in supposedly curved surfaces were the\n>handrails, and possibly the roof of the entrance pavillion. Those\n>effects *won't* go away with normal vector interpolation, because\n>it's not primarily the shading that gives them away, but the\n>segmented outlines. You'll have to make shorter segments for that\n>to improve. For some entity types (extruded arcs and arc segments\n>in polylines), you can reduce the angle and distance tolerances\n>in Radout to improve their appearance.\n>\nI almost did reduce the tolerances but wasn't sure the effect this would \nhave on octree size, or more importantly, rendering times.  In general, \nwould phong smoothing or increased number of facets be more expensive?\n\n\nHey, thanks everyone for all the input.  This group is such an essential \nRadiance resource!  Sorry for such lengthy emails.\n\n\nZack\n\n\n\n\nZack Rogers\nStaff Engineer\nArchitectural Energy Corporation\n2540 Frontier Avenue, Suite 201\nBoulder, CO 80301 USA\n\n\ntel (303)444-4149 ext.235\nfax (303)444-4304\nhttp://www.archenergy.com\n\n\n\n\n\n\n\n\n--------------040704070607010508090408\nContent-Type: text/html; charset=us-ascii\nContent-Transfer-Encoding: 7bit\n\n\n<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\n<html>\n<head>\n  <meta http-equiv=\"Content-Type\" content=\"text/html;charset=ISO-8859-1\">\n  <title></title>\n</head>\n<body>\nGeorg's response<br>\n<blockquote type=\"cite\"\n cite=\"mid20031217110002.10087.79123.Mailman@radiance-on-linux.org\">\n  <pre wrap=\"\">You may also want to set the exposure to a fixed value, resp. one\nfor exterior and one for interior shots.\n\n\n  </pre>\n</blockquote>\nYeah, I need to work on how I set the exposure or human sensitivity. &nbsp;I compile\na pre-final animation for my deadline today and its posted here.<br>\n<br>\n<a class=\"moz-txt-link-freetext\" href=\"http://www.archenergy.com/downloads/pub/images/Radiance/walkthrough_final.mov\">http://www.archenergy.com/downloads/pub/images/Radiance/walkthrough_final.mov</a><br>\n<br>\nMy last frames just finished overnight (they had been running on 4 NT machines\nsince thurs. - i way overestimated the efficiencies an ambient file would\nadd) and I had to quickly compile them this morning. &nbsp;Hence, I just applied\nhuman sensitivity to the frames. &nbsp;As you can see in the animation there are\nsome erratic frames. &nbsp;I am not sure why this happened. &nbsp;Besides the couple\nof frames that stick out, the other frames seem to flow pretty well. &nbsp;Some\nof the erratic frames are just due to the instant eye adjustment that the\nhuman sensitivity function gives as they happen when bright objects come\ninto or out of view. &nbsp;One of the reasons I used human sensitivity rather\nthan just setting an exposure is that I have quite a range of brightness,\nespecially in my lobby, and I want to be able to see the floor tiles in the\ndirect sun patches rather than just a white patch while keeping the darker\ncorners visible. &nbsp;I'm all ears for other ways to approach this. Seems like\nyou need a time dependant human sensitivity adjustment for better accuracy,\nalthough this seems very tough as it depends on frames/sec. &nbsp; Also, I don't\nlike the way human sensitivity sometimes makes my red doors and mullions\nlook almost black. &nbsp;I'm guessing this is due to the mesopic adjustments done\nby human sensitivity. &nbsp;I thought maybe I should just rerun pcond with -a+\n-v+ and -s+ instead. &nbsp;Any other suggestions are certainly welcomed. &nbsp;I offered\nto run a higher quality simulation over my Christmas break and so I will\nprobably have one more pass at this animation.\n<blockquote type=\"cite\"\n cite=\"mid20031217110002.10087.79123.Mailman@radiance-on-linux.org\">\n  <pre wrap=\"\">\nShould be there. Are you sure you installed the additional\nsupport package before building? Because otherwise you're missing\nout on the tifflib, which will cause other stuff in the same\ndirectory not to get built (even if it doesn't actually use the\ntifflib).\n\n\n  </pre>\n</blockquote>\nI did not pass information onto our IT guy very well....we did not install\nthe support package first. &nbsp;Thanks! and we will just use the HEAD version.<br>\n<blockquote type=\"cite\"\n cite=\"mid20031217110002.10087.79123.Mailman@radiance-on-linux.org\">\n  <blockquote type=\"cite\">\n    <pre wrap=\"\"> BTW - pinterp does not seem to work in the\nwindows version either.\n    </pre>\n  </blockquote>\n  <pre wrap=\"\"><!----></pre>\n</blockquote>\n<blockquote type=\"cite\"\n cite=\"mid20031217110002.10087.79123.Mailman@radiance-on-linux.org\">\n  <pre wrap=\"\">\nTry to make sure that the file paths you feed to pinterp are as\nshort as possible (ie. use relative paths). This is fixed in\nHEAD, but many of the picture manipulation programs used to\nsuffer from buffer overflows when comand lines got too long.\n  </pre>\n</blockquote>\nI tried this again with a very short path (z:\\tmp\\) and it still gave me\nthe same error...or actually \"no error\" :-). &nbsp;The output is:<br>\n\"read: no error\"<br>\nOnce I get our linux Radiance up and running I plan on using linux for my\nnext round of simulations anyways.<br>\n<blockquote type=\"cite\"\n cite=\"mid20031217110002.10087.79123.Mailman@radiance-on-linux.org\">\n  <pre wrap=\"\">\nSome future versions of Radout and dxf2rad may do this (with the\nnew mesh primitive), but it's not an urgent issue for me as long\nas Rayfront still uses Radiance 3.1/3.2.\n\n\n  </pre>\n</blockquote>\nThis would be great added feature!<br>\n<blockquote type=\"cite\"\n cite=\"mid20031217110002.10087.79123.Mailman@radiance-on-linux.org\">\n  <pre wrap=\"\">\nYou'd need to do oversized renderings and filter them down to\navoid the particle look in distant patterns. On the other hand,\nthere's no real point in mapping a wood grain pattern to surfaces\nthat you never look at from up close.\n\n\n  </pre>\n</blockquote>\nYeah, I ended up taking off the wood grain on most surfaces except the handrails.\n&nbsp;The problem with an animation is that the distance to these surfaces is\nalways changing. &nbsp;I am planning on exploring the fade function approach in\nrayinit.cal.<br>\n<blockquote type=\"cite\"\n cite=\"mid20031217110002.10087.79123.Mailman@radiance-on-linux.org\">\n  <pre wrap=\"\">\nThere's an \"arbmap.cal\" included with Rayfront for that (and it\nshould also be in the archives here somewhere for those who don't\nhave that).</pre>\n</blockquote>\nI've tried to use arbmap.cal before and was having some problems - but that\nwouldn't be necessary for a solid texture anyways, correct?? &nbsp;I can't remember\nthe errors I was getting, i will try again and report back if i have any\nproblems.<br>\n<br>\nGreg's response<br>\n<pre wrap=\"\"><!----><blockquote type=\"cite\"><pre wrap=\"\"><!---->\nI posted something to the list about a year ago on generating animation  \npaths, which I've attached to this message.  Perhaps this can help.</pre></blockquote></pre>\nThanks Greg. &nbsp;I remember seeing this and had forgotten about the spline.cal\nfunction. &nbsp;I was hoping for something more visual, but this method would\ndefinitly be easier than the way I did it (essentially with an exported spline\nfrom CAD and a spreadsheet)<br>\n<br>\n<blockquote type=\"cite\">\n  <pre wrap=\"\"><!---->\nThe time reduction after the first frame isn't noticeable as it doesn't  \nprogress much from there -- each new frame adds incrementally to the  \nambient file.  You are still much better off than not using one (MUCH),  \nbut don't expect your rendering times to continue decreasing as the  \nanimation progresses.\n\n\n  </pre>\n</blockquote>\nI was thinking that since each frame is so similar (6 inches - 15cm - apart)\nthat there would be alot of ambient data that could be shared from one frame\nto the next. &nbsp;Is it because the incident angle to each surface changes enough\nthat the previous ambient data cannot be used. &nbsp;I don't have to great of\na grasp on how the ambient file works, so I apologize.<br>\n<br>\n<blockquote type=\"cite\">\n  <pre wrap=\"\"><!---->\nLooks pretty good to my eyes.  You could improve rendering times by  \nremoving some of the fussy details from the ambient calcultion with an  \nambient exclude file (-aE mat_excl.txt option).  I would remove the  \nwindow frames in particular.  </pre>\n</blockquote>\nI shied away from using an ambient exclude file because I use the same material \non many objects. &nbsp;I think for my next pass though I will take this advice, \nand either name the materials differently or use an alias.<br>\n<blockquote type=\"cite\">\n  <pre wrap=\"\">You might also increase your -ar value,  \nas 45 seems very low for a model of this size, especially with all the  \nexterior geometry.  I think you're losing resolution on the  \ninterreflection calculation as a result.  Divide the octree cube size  \n(getinfo -d octree) by the length of your arm in your world  \ncoordinates, and that should give you a reasonable number.</pre>\n</blockquote>\nOops, I had set my -ar value before I added in the the extensive parking\nlot. &nbsp;Getinfo -d gives me this:<br>\n<br>\nbc.oct: -214.5790355 -249.1505 -170.126913 352.68657<br>\n<br>\nMy model is in meters. &nbsp;I don't quite understand this. &nbsp;My xmin and ymin\nmay be as stated but I know my zmin is not much more than -1 meter. &nbsp;Am I\nmisunderstanding this output. &nbsp;And so my arm is about a meter so would a\ngood -ar setting be 352/1 = 352? &nbsp;This would make my calculation time much\nlonger. &nbsp;I've been setting this in Rayfront where you input xsize, ysize,\nzsize and octree size (which is longest of the 3 sizes).<br>\n<br>\nThis isn't the cause of some the splotches i am still seeing, is it? &nbsp;I have\nmy -ad and -as parameters really high, but perhaps too high?? &nbsp;Here is a\npanoramic animation I also created for this model that is even more splotchy:<br>\n<br>\n<a class=\"moz-txt-link-freetext\" href=\"http://www.archenergy.com/downloads/pub/images/Radiance/panoramic_walkthrough.exe\">http://www.archenergy.com/downloads/pub/images/Radiance/panoramic_walkthrough.exe</a><br>\n<br>\nI had these running on some XP machines (since they couldn't handle ranimate)\nand with a separately generated ambfile. &nbsp;These were the settings from my\n.rif file<br>\n<br>\nQUALITY&nbsp;&nbsp;&nbsp;&nbsp; = medium<br>\nDETAIL&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; = high<br>\nVARIABILITY = high<br>\nINDIRECT&nbsp;&nbsp;&nbsp; = 1<br>\noconv&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; = -r 4096<br>\nrender&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; = -ad 4096<br>\nrender&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; = -st 0.01<br>\nrender&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; = -dp 512<br>\nrender&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; = -av 2.5 2.5 2.5<br>\nrender&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; = -as 2048<br>\nrender&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; = -sj 0.1<br>\nrender&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; = -dt 0.1<br>\nrender&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; = -aa 0.08<br>\nrender&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; = -ar 60<br>\n<br>\nThere are some pretty significant splotches - I am not sure why these are\nso much worse than my walkthrough - both ambfiles were about 7MB by the end.<br>\n<br>\nPeter's response<br>\n<blockquote type=\"cite\">\n  <pre wrap=\"\"><!---->\nFor the long ISE outside animation, I had to pre-run along the path \nmulitple times at low res to fill up the ambient file. Be sure that it \nis fairly \"stable\" and has enough ambient points, otherwise it \n\"discovers\" more light during the main animation, leading to brightness \njumps or flicker (depends on the sequence of generation of the image \nframes).\n  </pre>\n</blockquote>\nGood suggestion. &nbsp;I will try this on my next round of simulations. &nbsp;I don't\nthink this is why I had so many flickers in my final animation though, is\nit??? &nbsp;I thought my flicker was more due to pcond issues.<br>\n<br>\nGeorgs response 2<br>\n<blockquote type=\"cite\">\n  <pre>In your animation, the most obvious places where I noticed any\nlack of smoothness in supposedly curved surfaces were the\nhandrails, and possibly the roof of the entrance pavillion. Those\neffects *won't* go away with normal vector interpolation, because\nit's not primarily the shading that gives them away, but the\nsegmented outlines. You'll have to make shorter segments for that\nto improve. For some entity types (extruded arcs and arc segments\nin polylines), you can reduce the angle and distance tolerances\nin Radout to improve their appearance.</pre>\n</blockquote>\nI almost did reduce the tolerances but wasn't sure the effect this would\nhave on octree size, or more importantly, rendering times. &nbsp;In general, would\nphong smoothing or increased number of facets be more expensive?<br>\n<br>\nHey, thanks everyone for all the input. &nbsp;This group is such an essential\nRadiance resource! &nbsp;Sorry for such lengthy emails.<br>\n<br>\nZack<br>\n<pre class=\"moz-signature\" cols=\"$mailwrapcol\">--\nZack Rogers\nStaff Engineer\nArchitectural Energy Corporation\n2540 Frontier Avenue, Suite 201\nBoulder, CO 80301 USA\n\n\ntel (303)444-4149 ext.235\nfax (303)444-4304\n<a class=\"moz-txt-link-freetext\" href=\"http://www.archenergy.com\">http://www.archenergy.com</a>\n</pre>\n<br>\n<br>\n</body>\n</html>\n\n\n--------------040704070607010508090408--\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-December/001347.html).</sup>", "attachments": [], "created_by_name": "Zack Rogers", "created_at": "December 17, 2003 at 04:07PM", "created_by": "Zack_Rogers", "parent_id": "radiance-general_001335", "id": "radiance-general_001347"}