{"body": "Hi everyone,\n\n\nAfter much development on my thesis, I have a few queries I am hoping some \nof you will be able to help me out on.\n\n\nFirst of, my supervisor pointed out an application on the iPhone called \niPhotoLux which maps the luminance measurement of an HDR image taken by the \niPhone camera. So I am hoping what I am trying to produce in my thesis does \nwork.\n\n\nSecondly, I have been using a Nikon DSLR camera to create HDR images in the \nlighting laboratory using a scale model, so that my skills in creating a \naccurate HDR image. I have also used both luminance and illuminance meters \nto ensure the photos are accurate.\n\n\nTherefore, after experimenting in the lighting laboratory, I got my \nSmartphone camera back out and using a HDR Camera application available in \nthe Android market. I put both cameras side by side and took images of the \nsame scene on a tripod. However, I am still receiving the same error message \nas before, then I found out that the HDR Camera application does not write \nthe EXIF data required to create a camera response curve. Therefore, just to \ntry the images produced by the Smartphone out, I coped the EXIF data from \nthe DSLR camera and inserted into the images produced by the Smartphone \ncamera ensuring that all the exposure value information are the same. I then \ntry and fuse these Smartphone camera produced images together, but the same \nerror message reappears.\n\n\nTherefore, I was just wondering if anyone knows why the camera response \ncurve cannot be created even with the comparison done between the DSLR \ncamera and the Smartphone camera.\n\n\nThank you for all your help.\n\n\nKind regards,\nPeony\n\n\n\n\n\n\n\n\nPeony Au\nMasters of Building Science Candidate\nVictoria University of Wellington\nNew Zealand\n\n\nMobile (+64) (0)277514389\n\n\n\n\n-----Original Message-----\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2012-November/000443.html).</sup>", "attachments": [], "created_by_name": "Peony Au", "created_at": "November 27, 2012 at 11:13PM", "created_by": "Peony_Au", "parent_id": "hdri_000418", "id": "hdri_000443"}