{"body": "If people are interested, the Labs is offering subversion server space \non one of our servers.  When we get the website update project a bit \nfurther along, we'll be able to give the project a page, too.\n\n\n\n\nRandolph M. Fritz • RFritz at lbl.gov\nEnvironmental Energy Technologies Division • Lawrence Berkeley Labs\n\n\n\n\n\n\n\n\nOn 2010-11-08 08:58:45 -0800, Thomas Bleicher said:\n\n\n> On Mon, Nov 8, 2010 at 11:36 AM, Greg Ward \n> <gregoryjward at gmail.com> wrote:\n>> Well, it sounds like there is significant groundswell around this idea.\n>> I suggest that interested parties/developers organize a host site for\n>> this effort and someone (Dave?) take charge of the project.\n> \n> Google code projects are easy to set up and almost everyone\n> in this thread already has a gmail account. It may be more difficult\n> to find a source control system that everybody agrees on ...\n> \n>> Ongoing maintenance is something to think about as well,\n>> as new Radiance releases will likely continue to have some\n>> minor changes and some major additions.\n> \n> Since everybody is happy with a simple 'subprocess' wrapper\n> around the Radiance binaries there shouldn't be much ongoing\n> maintenance. Python 2 vs 3 is more likely to cause additional\n> work than the Radiance interface.\n> \n> However, I can see that an additional advantage of this project\n> could be that the remaining CSH scripts (and possibly Perl scripts)\n> in the main Radiance distribution get finally pythonized. In that\n> case should the new scripts be kept separately or should they\n> find their way back into the distribution?\n> \n> Thomas\n\n\n\n\n\n\nRandolph M. Fritz • RFritz at lbl.gov\nEnvironmental Energy Technologies Division • Lawrence Berkeley Labs\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-November/007441.html).</sup>", "attachments": [], "created_by_name": "Randolph M. Fritz", "created_at": "November 08, 2010 at 10:33AM", "created_by": "Randolph_M._Fritz", "parent_id": "radiance-general_007431", "id": "radiance-general_007441"}