{"body": "On 23.01.2006, at 06:56, Huangwx wrote:\n\n\n> dear all:\n>\n> I am using a supercomputer which has 128 CPUs, and should be very  \n> fast.\n> But I found the rendering speed is almost the same as my notepad.\n\n\nAs in life, mere size doesn't matter.\n\n\nAs Martin already said, you have to use the programm \"rpiece\" not\n\"rpict\" to use more than one CPU. I don't remember the status of\n\"rpice\" on SMP systems but I don't think it will scale up to 128\nCPUs.\n\n\n> A stuff of the super computer said that most time was not taken by\n> computation, but by outputing data to files. I think writing data\n> to the .unf file must take a lot of time. The supercomputer uses NFS\n> storage, so maybe because it is too slow, the rendering cannot be\n> finished quickly.\n\n\nI tested the settings you give below and on my 2GHz PowerPC\n(\"Core Solo\") the daffodil test scene ran about 3 seconds.\nIf you have similar times on your system, saving image data\non a slow NFS system may indeed have an impact on your process.\nBut that's a problem of your NFS then, not of Radiance.\n\n\nIf you can set up a RAM disc on your nodes you could use that\nto store the image computed on one node and copy the final\nimage to the shared storage space. But I don't think that's\npossible on a managed cluster. (Perhaps there is a /tmp FS\nlocal to each cluster node?) But you still have to share\nyour ambient data (in the day.amb file) across all nodes to\nget the real benefit of multiple cpus.\n\n\nGiven your settings your need for render speed is _not_\nrender quality (pretty low). As well your image dimensions\nare small. What are you trying to render in the end?\nIf it's an animation you could use \"ranimate\" to distribute\nframe rendering to separate nodes explicitly.\n\n\n> If there is any way that radiance do not use the NFS storage\n> during rendering, but only the memory, I think the speed could\n> be greatly improved.\n\n\nYou should share your ambient data (in the \"day.amb\" file)\nbetween all nodes to get the benefit of multiple CPUs and to\navoid variations between frames or image parts. If this slows\ndown your system don't use the \"-af day.amb\" option and\nrpict will use the memory during calculations (on each node\nseparately).\n\n\nThe image data is written to STDOUT by rpict. If you can\nredirect to a local FS on each node you don't have to use NFS\nall the time (like I said \"/tmp\" may be a local FS on each node).\nDon't forget to copy the final image to your NFS area, though.\nI use RAM discs when I have do create a lot of small files\nfor a short time only. Speed has not been a consideration,\nonly HD movements and noise.\n\n\nYour settings for reference. You should provide information\nabout your rendering setup (which commands, control files)\nand what you actually want to do (BIG image vs. animation vs.\nhigh detail rendering) on the cluster, too.\n\n\n> The rendering parameters in .opt file:\n> -dp 256\n> -ar 28\n> -ms 2.6e+02\n> -ds .3\n> -dt .1\n> -dc .5\n> -dr 1\n> -sj .7\n> -st .1\n> -ab 2\n> -af day.amb\n> -ad 329\n> -as 42\n> -av 0.36 0.36 0.36\n> -lr 8\n> -lw .002\n> -st .001\n> -dj .02\n> -aa 0.25\n> The image size: 256x176\n\n\nHTH,\n\n\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-January/003298.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "January 23, 2006 at 11:17AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_003293", "id": "radiance-general_003298"}