{"body": "Kirk Thibault wrote:\n\n\n> From what I read leading up to this release, it was clear that Apple  \n> wanted to finally move its laptops to the next level, hence the Intel  \n> chipset.  I have a feeling that, as with most things Apple, there  \n> will be issues - but the Apple faithful (me included) are willing to  \n> be beta testers and see the bugginess as a badge of honor in some  \n> convoluted way (paying money to be a beta tester will do that to your  \n> rationalizing psyche I suppose).  It is weird to mention Apple and  \n> Intel as complements, but I think all Mac users (again, me included)  \n> realize Apple's shortcomings, even if we tend to defend the brand to  \n> the death. \n\n\nI was a defender (and early-adopter of the PPC with a PowerMac 7600 (33 \nMHz!!)), then a hater for a few years as I grew tired of bomb icons and \nthe like, but it was Greg's statement that he got Radiance compiled on \nOSX that brought me back to the fold.  It is really OSX that I love so \nmuch, more so than Apple, but their product design is quite pretty too \n(altho that magnetic power adapter looks a bit flaky).  Giulio, I hear \nya.  But it's been a long time since I've done the early adopter thing, \nand I've been putting off upgrading my PB for a while as well, so I'm \ngonna make the gamble.  I'll be sure and let you all know how it works \nout; I ordered mine last night!\n\n\n>\n> I imagine that a 17\" version of the Intel dual core laptop can;t be  \n> far behind..\n\n\n\n\nAlthough it seems as if they lost money having three sizes and decided \nto focus on the best seller, slightly increasing the size (15.4\" instead \nof the old 15\").  It just may be the sweet spot.  Who knows?  \nInteresting times ahead...\n\n\n- Rob\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-January/003236.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "January 11, 2006 at 04:50PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_003231", "id": "radiance-general_003236"}