{"body": "Zack Rogers wrote:\n\n\n> Hello group,\n>\n> I am attempting my first full blown Radiance animation and have \n> several related questions.  This link has a rough version of the \n> animation, done with -ab 0.\n>\n> http://www.archenergy.com/downloads/pub/images/Radiance/walkthrough_init3.mov\n>\n> and yes, i seem to trip up the curb, have several neck spasms, and \n> stare at a wall at one point....all have since been fixed but this \n> leads to my first question.\n>\n> 1.) What programs do people use to produce animation paths?  I \n> initially wanted to use rshow but couldn't get it working on our Suse \n> 8.2.  I understand programs like maya, studio vis, form-z?? have the \n> ability to generate these animations paths but are too much \n> (expensive) for what I need.  It would be nice to be able to just \n> export my spline path from autoCAD and then have the ability to adjust \n> frames/sec, slow down portions of the path, and adjust the view \n> direction throughout. \n\n\nrshow is high on my todo list, but I can't promise any deadlines, - up \nto my neck in other things . The Open-GL version doesn't offer animation \npaths (apart from it not being ported to R3.5- shame!), but will \n(promises....).\n\n\n> 2.) There are portions of this path that I want to slow down and I \n> wanted to use pinterp to interpolate some extra frames.  How can I \n> generate a z-buffer file for a view without recreating the picture?  I \n> thought I could just run it at very low settings if nothing else.  And \n> yes, I am running ranimate using the windows version (our linux \n> machines were filled up with CFD calcs at go time and I was forced to \n> use our NT machines - btw: ranimate does not work on XP - error \n> \"Windows socket operations not supported\") and it is giving errors \n> using INTERPOLATE and MBLUR which would have created the zbf files \n> automatically.  Hence, I was planning on using pinterp afterwards to \n> achieve interpolation but now I have no z-buffer files.  which leads \n> to my next questions.... \n\n\npinterp is great, but fails at reflections or refractions (which is \nprobably why you thought of using it piecewise anyway)\n\n\n> 3.) Where is pinterp?  I just installed the HEAD version on our linux \n> machines (yes, its been a while since I last dabbled in the linux \n> release) and i can't find pinterp.  It shows up in the man pages but \n> not in the bin directory.  BTW - pinterp does not seem to work in the \n> windows version either.\n>\n> 4.) So, we then tried to install the last official release 3.5 and it \n> gave us a bunch of errors.  The error log is here.  Help!\n>\n> http://www.archenergy.com/downloads/pub/images/Radiance/installLog.txt\n>\n> 5.) Using an ambfile does not seem to be doing much for my animation \n> times?  I was expecting a big decrease in calc time the further i got \n> into my animation but at about 5/6 through it has not sped up much.  \n> It has been building the ambient file the whole time, although it is \n> only 7MB after roughly 1000 frames, which seems too small (10 \n> panoramic views I've been running on a different machine already has \n> an ambient file of 7MB).  Here is what one of my ranfiles looks like: \n\n\nFor the long ISE outside animation, I had to pre-run along the path \nmulitple times at low res to fill up the ambient file. Be sure that it \nis fairly \"stable\" and has enough ambient points, otherwise it \n\"discovers\" more light during the main animation, leading to brightness \njumps or flicker (depends on the sequence of generation of the image \nframes).\n\n\n> ....\n>\n> 6.) Any suggestions on the parameters used?  I am no expert on \n> optimizing parameters.\n\n\nWhich you probably will be, after you finished the animation on time ....\n\n\n> ...\n>\n> 7.) As can be seen, I have many curved surfaces in this model most of \n> which have been faceted.  I would like to use a function to smooth the \n> shading on these.\n\n\nNop - the info is lost. Theoretecally one could fit a spline surface to \nthe polygons and approximate the surface normal by this, but the better \nsolutions is to export the surface normals from the CAD too. Some CAD \nexport VRML format, which may contain normals.\n\n\n> ...\n>\n> 8.) I was initially mapping wood grain onto a lot of the interior wood \n> surfaces but given the varying distances of the wood I could never get \n> it to look very good.\n\n\nRenderMan (and probably others) use different textures/patterns \ndepending on distance (more exactly on the solid angle the pixel \ncovers).  This angle is not supplied in the function files (at least it \nwasn't when I discussed that with Greg two years ago), so view dependent \ntextures are a bit tricky to do. One reason for not making it available \nwas that it is known in rvu/rpict, but not rtrace. If we agree (on \nradiance-dev) it would be useful, I'd be happy to see this variable.\n\n\n>   When it looked good up close, it looks like particle board far away.  \n\n\nYour spatial resolution has to be very high to avoid aliasing.\n\n\n> ...\n\n\n\n\ncheers\nPeter\n\n\n\n\n\n\n pab-opto, Freiburg, Germany, www.pab-opto.de\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-December/001339.html).</sup>", "attachments": [], "created_by_name": "Peter Apian-Bennewitz", "created_at": "December 17, 2003 at 07:30AM", "created_by": "Peter_Apian-Bennewitz", "parent_id": "radiance-general_001335", "id": "radiance-general_001339"}