{"body": "Dear Alexa,\n\n\n>>..., I was wondering how the architectual & lighting community (obviously\nI'm not a member of it) uses RADIANCE.\n\n\nWithin the framewor of IEA Task 31, Daylighting Buildings in the 21st\ncentury NRC carried out an online survey last year on \"the current use of\ndaylight simulations during building design\". You can download a copy of the\nreport from http://irc.nrc-cnrc.gc.ca/ie/light/survey. Key information from\nthe abstract are: \n\n\n\"... Survey participants worked predominantly on offices and schools...\nTools' complexity and insufficient documentation were identified as\nweaknesses of existing programs. Self-training was the most common training\nmethod. Tool usage was significantly higher during design development than\nduring schematic design. Most survey participants used daylighting software\nfor parameter studies and presented the results to their clients as a basis\nfor design decisions. While daylight factor and interior illuminances were\nthe most common simulation outputs, shading type and control were the most\ncommon design aspects influenced by daylighting analysis... While\nparticipants used a total of 42 different daylight simulation programs, over\n50% of program selections were for tools that use RADIANCE... \" (In case you\nneed a more detailed version of the repor, let me know.)\n\n\n>>Ian Ashdown says it better than I can, in his (excellent) \"Thinking\nPhotometrically\" coursenotes: \"As for daylighting calculations, it is likely\nthat Jongewaard (1993) is correct - the results are only as accurate as the\naccuracy of the input data. Done with care, it should be possible to obtain\n±20 percent accuracy in the photometric predictions. However, this requires\ndetailed knowledge and accurate modeling of both the indoor and outdoor\nenvironments. If this cannot be done, it may be advisable to walk softly and\ncarry a calibrated photometer.\"\n\n\nI completely agree with this estimate. It reflects the results from John's\nvalidation study on a façade with a clear glazing and our validation study\nfor a facade with venetian blinds. Finally, I am doing a validation study\nright now for a translucent façade using \"trans\" and \"transdata\" (with a lot\nof help from maitre Greg) and again I find comparable numbers. \n\n\nChristoph\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-January/002312.html).</sup>", "attachments": [], "created_by_name": "Christoph Reinhart", "created_at": "January 20, 2005 at 07:59PM", "created_by": "Christoph_Reinhart", "parent_id": "radiance-general_002307", "id": "radiance-general_002312"}