{"body": "Thank you very much jack, very kind of you ! \n\n\nIt wasn't directly radiance breaking my system. \n\n\nIm running Ubuntu Gutsy.\n\n\nAt home I don't have problems, but in my laboratory I do. \n\n\nAccording to someone who tried to help me, I was missing some libraries . And it was trying to install those library that I messed up too much with gcc components installing 'till my system broke. \n\n\nI later spoke with a friend of mine, who is using Linux since more than me, and he told me that sometimes happen changing compilers version that programs don't run good anymore. My system actually deinstalled X11 and many basilar components. I tried reinstalling them later on to fix the problem, but no way to solve it fastly. In the meanwhile someone elses told me : why don't yuo use binaries? :-P So, I preferred that very fast way ;o) \n\n\nAnyway, if you wanna have a look, this is the first error reported.. but MANY MANY other are following.. \n\n\n\" Making programs...\n~/Scrivania/ray/src/common ~/Scrivania/ray/src \nIn directory common...\ngcc -Dlinux -D_FILE_OFFSET_BITS=64 -Dfseeko=fseek -L/usr/X11R6/lib -I/usr/include/X11 -DNOSTEREO -O2   -c -o cone.o cone.c\nIn file included from rtio.h:9,\n                 from standard.h:10,\n                 from cone.c:10:\n/usr/include/stdio.h:686: error: conflicting types for \u0091fseek\u0092\n/usr/include/stdio.h:654: error: previous declaration of \u0091fseek\u0092 was here\nmake: *** [cone.o] Error 1 \" \n\n\nIf you patience to read this mail thank you and let me know, else thank you anyway and don't mind. \n\n\nLucio\n\n\n\n\n.Hi Lucio,\n.\n.Compiling Radiance should not results in general operating system \n.instabilities. It has nothing to do with the operation of the OS. I run \n.a few different linux distributions, fedora core, ubuntu and caos. If \n.you can tell me what compilation problems you ran into and what version \n.of linux  then I can try to offer some input.\n.\n.-Jack\n.\n.loscotec at libero.it wrote:\n.> Thank you very much Greg for explanation about HEAD. \n.>\n.> Luckily I'm linux user, but unluckily for head to be installed, if I read right, compiling is required. \n.>\n.> Compiling gives me much problems .. I tried to solve them (it seemed it was gcc problems) but the only result was that my system became very unstable and finally didn't even boot, so I had to reinstall the system and feel satisfied of binaries.. !\n.>\n.> Lucio\n.>\n.>\n.> .Hi Lucio,\n.> .\n.> .The lamp color data also includes depreciation factors, which  \n.> .probably account for the 10% difference.  I assume the \"white\" value  \n.> .is larger.\n.> .\n.> .A long-standing bug has been recently pointed out by Zack Rogers  \n.> .related to the orientation of full photometric distributions, and has  \n.> .been included in the latest HEAD available from radiance-online.org.   \n.> .A statement has also been added to clarify the assignment of the  \n.> .width (along y) and length (along x) axes.\n.> .\n.> .Hope this helps.\n.> .-Greg\n.> .\n.> .>\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-February/004760.html).</sup>", "attachments": [], "created_by_name": "Stefano Ponzetti", "created_at": "February 07, 2008 at 10:06AM", "created_by": "Stefano_Ponzetti", "parent_id": "radiance-general_004758", "id": "radiance-general_004760"}