{"body": "Hi Christoph,\n\n\nI think that there are a lot of things that need to be considered here. \nBased on some work that Greg has consulted with us on, the basic \nradiance material definitions output from Optics 5 are perhaps too \nsimplistic to fully account for a variety of glazing related behaviors. \nNevertheless let me make a couple of points that may be obvious to many:\n\n\n   1. There are many types of glazing that will have front and back side\n      reflectances that are different and the \"glass\" material type is\n      probably not suitable for these materials.\n   2. If you want, it is possible to combine the front and back side\n      definitions to one material definition and thus surface geometry\n      (one polygon) with uniform normal orientation into our out of the\n      space as follows\n\n\n        void BRTDfunc TestSystem_front_and_back\n        10\n            if(Rdot, 0.230, 0.289) if(Rdot, 0.263, 0.336) if(Rdot,\n        0.326, 0.371)\n            0.585 0.594 0.521\n            0   0   0\n            .\n        0\n        9 0 0 0 0 0 0 0 0 0\n\n\n    The \"if(Rdot, ReflFront, ReflBack)\" will apply the relevant\n    reflectance depend upon which side of the polygon is being\n    evaluated. This may be suitable depending on the needs (and\n    information available) at hand. However this material does not\n    suitably account for angular dependencies that may impact\n    reflectance and transmittance.\n\n\n    Note also that if you were to use two pieces of geometry, then you\n    would need to be very careful of what you think you are applying\n    material wise. For example if you developed an insulating glass in\n    Optics 5 made up of 2 glass layers and export this then this needs\n    to be applied to \"one\" polygon not \"two.\"\n\n\nThere is a shell script called \"glaze\" that is in the current release of \nRadiance (probably need to get the latest HEAD release for some \nupdates). This script works by enabling the user to specify the makeup \nof the glazing (currently allowing for single and double pane glazing as \nwell as frit coverage). The makeup is based on a small database that \nincludes front and back reflectances as well as transmittances for a few \nglass materials. Some of these have been taken directly from the \nRadiance output provided by Optics 5. We have also added a feature \nrecently that allows a separate file to be specified with additional \nglazing types (eg build your own). The material definitions (BRTDfunc) \nthat the script outputs have a more robust model for single and double \npane glazing systems. Probably, the best thing to do is try it out to \nsee how it works.\n\n\nOne last note/thought. I think that as far as things go, Optics 5, is an \nexcellent resource. The issue is really how to effectively use the data \nin a useful Radiance material definition.\n\n\nRegards,\n\n\n-Jack de Valpine\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-September/002008.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "September 08, 2004 at 05:15PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_002003", "id": "radiance-general_002008"}