{"body": "First of all it is important to explain total reflectance term. Total reflectance ( R ) depends on the spectral reflectance ( Rl ) of the material and spectral distribution of radiant flux ( Pl) in [W/m]. There is equation as follows:\n\n\nR = INTEGRAL( Rl * P1 * Vl * dl) / INTEGRAL( P1 * Vl * dl)\n\n\n\n\n\n\nWhere Vl - is spectral luminous efficiency (simply this is spectral efficiency of our eyes) , dl - is interval of wavelength of electromagnetic radiation. The range of the INTEGRAL is visible radiation (380 nm - 780 nm).\n\n\n\n\n\n\nThe next point is that when we have non gray (coloured) materials and the radiation interreflect many times between surfaces of materials that this interreflection changes its spectral distribution. The simple example: red wall and white light. When the light is reflected in this wall that after reflection light will not be white but will be red. What does it mean? During the second reflection total reflectance ( R ) of the wall is different than during the first reflection because spectral distribution of radiant flux ( Pl) is changed. \n\n\n\n\n\n\nThe very important question is how it influence on total reflectance ( R ). When we have commonly used decorative materials (not so coloured: reddish but not deep red) and popular white lamps (neutral white, warm white, cool white etc.) this influence is not so important. This is the reason that most popular lighting software use only total reflectance ( R ) but not spectral reflectance ( Rl ). \n\n\n\n\n\n\nRADIANCE has its own system of colour representation based on three band R G and B and in most cases it is enough.\n\n\n\n\n\n\n\n\n\n\nBest regards,\n\n\n\n\n\n\nKrzysztof Wandachowicz\n\n\n\n\n\n\n  ----- Original Message -----\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-July/001913.html).</sup>", "attachments": [], "created_by_name": "Krzysztof Wandachowicz", "created_at": "July 14, 2004 at 09:51AM", "created_by": "Krzysztof_Wandachowicz", "parent_id": "radiance-general_001911", "id": "radiance-general_001913"}