{"body": "Hi Rob,\n\n\nmore results, so, well, ... lets give some more sadistical, ehm, sorry, \nstatistical remarks.\n\n\nHmm, errors with the rtrace runs are still considerable. Just for comparison, \nthe rpict run gave deviations from the ideal relationship around 11% for the \nlow level regime (down to 0.05 %  transmission), one \"escape\" value with 26%, \nthe rest between 1 and 5% \nThis with -ab only 2, and, by the way, direct caching active with a rather \ncrude resolution. (not that any time gain is to be expected from it for this \nscene with only one source, I have it always active by default. So much for \nthose who still fear strong accuracy compromising form the direct cache...)\n\n\nBut back to the topic:\nThe key point certainly is the thorough sampling of the room, so one more tip \nfor the Power-rtracer: crank up the ambient divisions (-ad) considerably. Set \nit up to 1200 or even higher. \n\n\nAnd finally, ...\nDon't get confused by the double logarithmic plots :-). In this occasion I \nchose logarithmic scales simply to get several orders of magnitude into one \nplot. (and it was possible to do so because of the completely linear \nrelationship in question, which assured that the straight line remains \nstraight in logarithmic coordinates.  Easy to imagine that this is not always \nthe case. Another reason, e.g, for using semilogarithmic scales are power- or \nexponential laws, which then become straight lines in the plot, additionally \nfacilitating the calculation of a fit curve). So no magic behind this, just a \n\"presentation\" issue, and especially no connection to the lighting or the \nintensity sensitivity of the eye.\n\n\n-Carsten\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000775.html).</sup>", "attachments": [], "created_by_name": "Carsten Bauer", "created_at": "May 17, 2003 at 09:20PM", "created_by": "Carsten_Bauer", "parent_id": "radiance-general_000772", "id": "radiance-general_000775"}