{"body": "Peter Apian-Bennewitz wrote:\n> \n> Georg Mischler wrote:\n> >\n> > Randolph Fritz wrote:\n> >\n> > > On Fri, Jun 07, 2002 at 12:19:58PM -0400, Georg Mischler wrote:\n> > > >\n> > > > Speaking more generally, I'd like to put in a strong vote for\n> > > > ansifying Radiance completely. Even though this might look like a\n> > > > highly tedious task (and probably is), I'd expect it to uncover\n> > > > and eliminate at least a one or two dozen subtle bugs throughout\n> > > > the code. In the long run, it would make all future development a\n> > > > lot easier. Of course, if Radiance were to be put on public CVS\n> > > > later this year, there's no reason why you would have to make\n> > > > this conversion yourself...\n> > > >\n> > >\n> > > Are there formal plans to do this at this point, do you know?  Is\n> > > LBL going to continue to maintain radsite?\n> >\n> > >From my side, that was more like a hidden suggestion... ;)\n> > It certainly would make a lot of sense though.\n> \n> positively a good idea. IMHO a full rewrite would be a better\n> investment, timewise, than an ANSIfication, at least for the existing\n> core rendering. I'm not saying the core is badly written or\n> malfunctioning. Just that any code tends to grow over the years and\n> accumulated insights are sometimes best served when starting freshly\n> with a blank sheet. - Greg ?\n\n\nI second that. Additionally we might consider stepping up to C++. A\npackage the size of RADIANCE screams for modularity. I'm not saying we\nshould make liberal use of those mindbending abstractions OOP has to\noffer, but simply *organise* the code and facilitate extensions. Of\ncourse this has to be weighed against  potential portability problems.\nCan C++ compilers be taken for granted on all platforms nowadays?\n\n\n--Roland\n\n\n\n\n\"Life is too short for core dumps\"\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-June/000293.html).</sup>", "attachments": [], "created_by_name": "Roland Schregle", "created_at": "June 09, 2002 at 01:21AM", "created_by": "Roland_Schregle", "parent_id": "radiance-general_000287", "id": "radiance-general_000293"}