{"body": "Hi Mark,\n\n\nThere are a few ways to run mksource in order to control the number of \nsources produced. I believe that there is a switch for a radiance \nthreshold as well as the diameter of the resulting sources. With these \nyou should be able to control how the hdr is sampled and thus the \nresulting number of sources produced, so perhaps you could sample things \nin order to end up with just a handful of sources covering the \nhemisphere.... which would be similar to using a low res version of the \nimage to \"smear\" the light distribution.\n\n\nI believe source sampling is affected by -ds (this is an issue relating \nto the geometry primitive such as source, polygon, ring rather than the \nmaterial type such as light, illum or glow). You will also probably need \nto set -dj to something useful and perhaps most importantly use -u for \nuncorrelated monte carlo. This last will require greater sampling (eg \nlarger image) in order to reduce noise in image by downsampling. Not \nsure but you might have a sampling related problem anyway if you were \nable to find a solution with simple glow source hemisphere.\n\n\nI am trying to thing if there is some interesting trick with \nmixfunc/mixpict that could be applied, but nothing comes to mind at the \nmoment.\n\n\n-Jack\n\n\nMark Stock wrote:\n> The star map that I have now is LDR, but I intend to create a new HDR \n> version using the raw star data from Tycho-2. Unfortunately, there are \n> stars everywhere, so I'd need illums to cover pretty much the whole \n> hemisphere. Since that'll wind up being 50-200 of them, it will cost a \n> lot in render-time, and add some complexity to the preprocessing. This \n> is disappointing because a single glow source would have sufficed, and \n> accomplished almost the same thing.\n>\n> Do \"illum\" surfaces respond to \"rpict -ds\" ? I'll want smooth \n> penumbras. If so, I can get by with fewer illums.\n>\n> Mark\n>\n> On Mon, 14 Sep 2009, Jack de Valpine wrote:\n>\n>> Hi Mark,\n>>\n>> Is your high-res image an hdr? If so would it be worth looking into \n>> mksource to recover broad areas of the sky (clusters of star) as \n>> illum sources? Then your high res image can be mapped onto a glow \n>> source with the lighting provided by a set of illum sources (multiple \n>> ones with varying solid angles), derived from the hdr.\n>>\n>> -Jack de Valpine\n>>\n>>\n>> Mark Stock wrote:\n>>> Hello,\n>>>\n>>> I am working on a star map for use with night renderings, and it \n>>> seems like it should be decomposed into two layers: one is a \n>>> high-resolution imagemap showing the stars themselves, the other is \n>>> a low-resolution \"light map\" that should be used to actually \n>>> illuminate the scene.\n>>>\n>>> The problem is that I want the \"light map\" layer to do the \n>>> illumination, but I don't want it to be visible. I want the image \n>>> map to appear in the sky in the final rendering.\n>>>\n>>> I know that I can use maxrad=-1 in the image map glow source to \n>>> prevent it from contributing to scene illumination, and maxrad=0 to \n>>> allow the light map to illuminate. But mixfunc must be placed \n>>> between the colorpict and the glow source, forcing me to either \n>>> allow both to illuminate, or neither. But when the imagemap \n>>> contributes to illumination, the result is very noisy (obviously).\n>>>\n>>> This wouldn't be a problem if I could use two sky-dome sized glow \n>>> sources in the same scene: \"skyglow source skydome 0 0 4 0 0 1 360\". \n>>> But Radiance only sees the last one to be defined.\n>>>\n>>> And I can't make the light map into an \"illum\" because it then gets \n>>> treated as a point source at the zenith of my \"source\" description \n>>> (ignoring the 180-degree size of the source disc).\n>>>\n>>> Do I need to add transparency to the imagemap before making it into \n>>> a rad=-1 glow source, so that when a ray is traced between the \n>>> stars, it hits the illuminating light map rad=0 glow source? I am \n>>> reluctant to include another circa-gigabyte imagemap to the scene \n>>> just for that.\n>>>\n>>> Am I missing something else or is this impossible?\n>>>\n>>> Mark\n>>>\n>>> PS. Shouldn't the file size limit for colorpict images be raised? I \n>>> get a warning for using even a 134MB picture file. I intend to go \n>>> much larger.\n>>>\n>>> _______________________________________________\n>>> Radiance-general mailing list\n>>> Radiance-general at radiance-online.org\n>>> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>>\n>>\n>> -- \n>> # Jack de Valpine\n>> # president\n>> #\n>> # visarc incorporated\n>> # http://www.visarc.com\n>> #\n>> # channeling technology for superior design and construction\n>>\n>>\n>> _______________________________________________\n>> Radiance-general mailing list\n>> Radiance-general at radiance-online.org\n>> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>>\n>>\n>>\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\n\n\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-September/006223.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "September 15, 2009 at 09:21AM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_006216", "id": "radiance-general_006223"}