{"body": "Greg Ward wrote:\n\n\n> I just got back from NYC, and didn't read through all the other \n> responses (and \"vacation\" messages) before sending my reply.\n\n\nI figured as much, just givin' credit where it's due. =8-)\n\n\n> For the GL stuff, sounds like you need to download the developer's \n> option for the X11 server to get the correct headers.  At least I'm \n> hoping.  Check the Apple website and see if you can find some libraries \n> and headers for X11.\n\n\nHmmm.  Panther comes with this new \"Xcode\", which are the developer's \ntools now.  The Apple X11 server is an optional install with the main \n10.3 distribution, which I of course installed, along with X tools \nstuff.  From your email, I assumed I'm still missing something, so I \nwent to the apple website and found this:\n\n\n\"X11 for Mac OS X SDK -- The software developer’s kit contains headers \nand other support files for X11, and is only needed if you want to \ncompile your own X11 applications on Mac OS X v10.3. It is available on \nthe Panther Developer CD as an optional package.\"\n\n\nI'm assuming that \"Panther Developer CD\" means \"Xcode CD\".  Of course I \nleft the install CDs at home, so I won't be abe to try this out 'till \ntonite, but I have a lead now.  Thanks.  I thought I installed \n\"everything\", but I guess not.\n\n\nP.S.\nWhen I got my Powerbook two years ago, I thought the little status \nlights on the battery were cool.  Now that my battery doesn't last more \nthan 45 mins on a full charge, it's time to replace it -- one hundred \nand thirty bucks!  Maybe the lights aren't so cool after all...  =8-\\\n\n\n\n\n\n\n      Rob Guglielmetti\n\n\ne. rpg@rumblestrip.org\nw. www.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-October/001162.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "October 30, 2003 at 11:44AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_001123", "id": "radiance-general_001162"}