{"body": "Hi All,\n\n\nQuick note on ranimate. It should be possible to use ssh instead of rsh \nby specifying it to ranimate. Ssh does take a little work to set up \ncorrectly for trusted logins (ie logins that do not require a password \nwhich is what ranimate needs) but it is possible to do and seems to work \nfine. I have done so in the past for ranimate, but it has been a while. \nI will forego all the arguments about why you should be using ssh anyway \nin place of rsh, they are readily available elsewhere...;->\n\n\nRegards,\n\n\n-Jack\n\n\nGreg Ward wrote:\n\n\n> Hi Lars,\n>\n> Rob has some good tips about using rad to generate rendering options \n> using the OPTFILE setting, and I use this feature a lot, myself.  \n> There are many ways to run the rad command, and the man page is the \n> best place to look for understanding these.  In its most basic form, \n> it acts like a simple makefile to build an octree, optionally running \n> mkillum, and maintain a set of rendered and filtered pictures.\n>\n> However, if you're doing a set of runs over different lighting \n> configurations, scene alternatives, etc., you often need a lot more \n> than rad can offer in terms of scene building.  I sometimes use a \n> makefile to maintain the various octrees I use based on scene input, \n> then employ a rad input file that specifies only the OCTREE setting -- \n> no explicit scene files.  This can also be specified on the rad \n> command line, so a single rad input file can suffice for many scene \n> alternatives.\n>\n> For generating animations, the ranimate program does a reasonable job, \n> though it really needs updating for running animations over a network \n> now that rsh no longer exists....\n>\n> With regard to fisheye projections, the -vta option can go up to a 360 \n> degree field of view, where you get a circular image whose \n> circumference is essentially a single value corresponding to the \n> direction opposite the -vd parameter.  I don't know anything about \n> ptviewer, or the kinds of projections it uses.  You may need to write \n> a script and pass it to rtrace with the -fac (and -x & -y) options to \n> take ray origin and direction on the input and produce a color picture \n> on the output.  Using this method, you can get any projection onto a \n> rectangular image that you can describe mathematically.\n>\n> -Greg\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general@radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n>\n\n\n\n\n#\tJohn E. de Valpine\n#\tpresident\n#\n#\tvisarc incorporated\n#\thttp://www.visarc.com\n#\n#\tchanneling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-November/000497.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "November 27, 2002 at 01:12PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_000493", "id": "radiance-general_000497"}