{"body": "On May 25, 2004, at 8:18 PM, Mark de la Fuente wrote:\n> Are ambient files really independent of the viewfile?  Somewhere in \n> Rendering with Radiance (where it talks about ambient files) I had the \n> impression different views required different ambient files, and thus \n> I stopped using ambient files the way other people seem to and started \n> using view dependent ambient files.  Meaning I would use one ambient \n> file per view regardless of the fact that scene was the same.  If this \n> is not right, and one file will work for any view, someone please let \n> me know.  I noticed Rob Guglielmetti also \"generates multiple fisheye \n> views for ambient cache, prior to running calcs\".  (Sounds like \n> ambient files are not view dependent).\n\n\nYes, ambient files are definitely independent of the view.  As long as \nthe scene does not change (materials, lights, sky conditions, TOD), you \ncan use the same ambient file to assist thousands of image files.  \nAnimations are where the reuse of computational time that ambient files \nallow really benefit, I think.\n\n\nYeah, I was doing that multiple fisheye thing for one project, but Greg \nlater straightened me out.  That was not entirely necessary, because I \nwas then using rtrace to calculate values at specific points, and that \nwas the main goal, opposed to renderings.  That overture calc business \nis more helpful for renderings, I think.  But the fisheye views *were* \nstill helpful for troubleshooting purposes.\n\n\n> ..  I was blown away considering I've been running some ab=2 \n> simulations on a 2.66GHz computer and taking 24 hours each.  Were all \n> the other values minimized (except for ad=16,000?).  Well it's got me \n> thinking about being more careful about how parameters are assigned.\n\n\nUnderstatement of the year.  Mastering Radiance is all about learning \nthe nuances of parameterization, learning how to trade speed for \naccuracy.  The good ones can gain accuracy without sacrificing speed.  \nI'm not a good one. I still rely on brute force quite a bit.  =8-)\n\n\n> Then, something I always thought was a hole missing from Radiance, and \n> perhaps is really just a limitation in my own radiance knowledge is \n> this.  All other lighting programs that I am aware of allow you to \n> place calculation grids, run calcs, and then display the grid point \n> results in relation to the calculation model (though most can't \n> do false color images).  Most programs will even export the results to \n> DXF for incorporation into CAD programs.  It seems rshow can do some \n> of this?\n\n\nAgreed, it's a missing link.  There are a few examples of using the cnt \nutility to create a grid, but it's not point and click.  rshow is \nsupposed to have this functionality but I have not been able to compile \nthat on my machines yet.  Certainly anyone with programming savvy could \nrwite something to place the calculated values (derived from rtrace and \na supplied, cnt-generated grid of points) on a Radiance image, but it \nwould have to be written.  That PAB paper sums it up the best, \nsomething about Radiance's greatest strength is also its greatest \nhindrance.  The open, unix toolbox approach to the suite allows for \nincredible flexibility, but you gotta roll up your sleeves and build \nthe tools yourself.\n\n\n>  \n> And last but not least, what is the trick on page 55?  Replicating \n> image maps in a way that their pattern does not become repetitive.  \n> Are we talking about making sure the edges match-up and that the image \n> is generally uniform?\n\n\nPage 55 of the PAB paper?  If I understand you correctly, I think \nyou're referring to the comparison Peter makes between function files \nand image maps.  His point is that image maps, tiled all over the \nplace, will inevitably suffer from a detectable \"edge-repeat\" at some \nscale, whereas function files are mathematical representations of \nsurface normal/color variations and are therefore less susceptible to \nthis effect.\n\n\n\n\n    Rob Guglielmetti\nwww.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-May/001737.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "May 27, 2004 at 12:54AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_001733", "id": "radiance-general_001737"}