{"body": "Hi Rob,\n\n\nTo elaborate on Polytrans a bit. A problem with the dwg import is that \nit is based on OpenDWG, which is perfectly fine for non-solid entities. \nHowever ACIS is proprietary, so the reverse engineering in the dwg \nimport option is far from perfect in my trials. I have corresponded with \nRobert Landsdale at Okino, he is of the mind that the \"right\" way to do \nconversion of solid geometry is by exporting ACIS data from Autocad and \nthen importing with one of their special modules (additional cost), one \nof which is reverse engineered and the other uses a fully licensed ACIS \nlibrary. I have no clue though whether surface geometry would get \nexported via the acis option in Autocad. And further I do not have a \nsense for what resulting geometry grouping/organization would be. I know \nthat we depend on Autocad layering as a material/organizational strategy.\n\n\nSome additional food for thought. The folks who sell OBJ Export have a \nwhole slew of cad geometry import export tools. They are based out of \nIndia and I believe are quite able to develop custom applications if \nneeded....\n\n\n-Jack\n\n\nRob Guglielmetti wrote:\n> Jack de Valpine wrote:\n>\n> Hi Jack, Hi List:\n> My name is Rob, and I'm an AutoCAD User.  (Hi Rob!)\n>\n> Jack, you posted some good info there, glad to hear Polytrans is \n> working (sort of) for you.  I'm looking for a DWG --> OBJ translator \n> myself, as I'm building an object library here and would like to start \n> using the mesh primitive for more drapey surfaces like sofa cushions \n> and the like.\n> I've been using AutoCAD for 13 years now, and I love it, but I hate \n> the forced upgrades and the extra translation hoops we have to go \n> through, especially as the smaller developers cannot keep up with the \n> changes.  Rayfront is in this unfortunate situation now.  We still \n> have a couple of licenses for ACAD2000 (the most recent version that \n> Rayfront and radout work with), but the daylighting team has grown in \n> size here and so now we are forced to compete for licenses as we try \n> to get our models into Rayfront.  Maybe we'll look at some of the \n> programs you've mentioned as alternatives.  Thanks, Jack!\n>\n> - Rob\n>\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n>\n\n\n\n\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-September/003975.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "September 07, 2006 at 06:35PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_003959", "id": "radiance-general_003975"}