{"body": "On Friday, May 9, 2003, at 05:31 PM, Carsten Bauer wrote:\n\n\n> On Friday 09 May 2003 16:28, Rob Guglielmetti wrote:\n>\n>>\n>> (I'm using rad with Q=M D=M V=H and -ab 3 for these tests, and it's a\n>\n> Hi Rob,\n>\n> probably this might have an effect: rad uses some default value for \n> the -av\n> parameter, which specifies the constant ambient background, accounting \n> for\n> the fact that only a finite number of ambient bounces are followed\n> (theoretically, in an absolute sense, an infinite number would be \n> necessary)\n>\n> For very low values of illumination the error of the -av approximation \n> may of\n> course become obvious, the default -av certainly is some value correct \n> for an\n> average scene with average conditions, this all is, as you might \n> imagine, a\n> bit heuristic anyway. (In the RWR book, there's a short section about \n> how to\n> determin the correct -av for a specific scene)\n\n\nHmmm.  I have not been specifying an -av.  Before you all load your \nguns for the firing squad, her me out.  What I am doing is a series of \nfull-day sun study calculations, for several says of the year under \nvarious building configurations.  It amounts to hundreds of individual \nrtrace calculations.  Determining an -av for each one would be time \nprohibitive.  Besides, since I'm using a lot of ambient bounces, I \nthought I could get away with this.  Early tests bore this out; I \ncompared some early tests where I had  not set an -av, to the same \nmodel run with an -av calculated using compamb, and they were very \nclose.  I assumed that by specifying four ambient bounces and waiting, \nthat I was still getting valid results.  Sort of a brute-force method.\n\n\nPerhaps that works -- to a point?  Maybe I'm getting to such low light \nlevels that four is not enough.  Maybe it's time to finally implement \nthe trick Greg thought of for me in this case, where you use compamb to \nfind a valid -av for mid afternoon, and then use the ground ambient \nvalue from gensky to weight that -av for the other times of the day.  \nThat way I can still put the whole thing into a script.\n\n\nDoes anyone have any guidelines for parameterization as it relates to \ndaylight filtration?  IOW, if I'm trying to measure what will likely be \n.001% of the available exterior daylight, is there some minimum number \nof ambient bounces I need to use, or am I trying to find too small a \nnumber now?  Like I said, everything has tracked pretty logically so \nfar, it's just these certain galleries where we are trying to get down \nto very low light levels that I'm getting these strange results...\n\n\n> But for your extraordinary conditions try again with setting -av 0 0 \n> 0.(BTW: I\n> I do that often, the pictures look better...) You'll introduce some \n> error\n> then, too, of course, but in your example with only 1% transmittance \n> and sun\n> direcly overhead most light will stem from direct contribution, so \n> completely\n> neglecting ambient light from the third bounce level onwards should \n> produce\n> no significant error anymore.\n\n\nWell, right now all I'm doing is rtraces, I care more about the numbers \nthan the look of the pictures, but that's a useful tip for the future.  \nTrue in your example the -av 0 0 0 will probably not make a difference \nbecause I'm calculating direct contribution primarily, but in the real \nmodel I am computing values that are all about the indirect.\n\n\nRob Guglielmetti\nrpg@rumblestrip.org\nwww.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000721.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "May 10, 2003 at 09:47AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_000719", "id": "radiance-general_000721"}