{"body": "Anthony J. Farrell wrote:\n> Thanks Roland, Martin for input,\n> \n> I meant to make to reference to the Prism1 and Prism2 commands in the 3.5\n> release of Radiance. I am uncertain of the function file command line\n> \n> mod prism1 id\n> 5+ coef dx dy dz funcfile transform\n> 0\n> n A1 A2...An where the new direction variables\n> \n> So if I wanted to redirect light from a vertical glazed window down at an\n> angle of 45 degrees onto the working plane what values would I substitute in\n> for A1 etc?\n\n\nAccording to the manual, dx, dy, dz are the redirection coefficients, \npresumably applied to the incident ray's local coords. A1.. An are \noptional variables passed to the funcfile. However, having never used \nthe PRISM material, I dunno for sure -- better check with Raphael Compagnon.\n\n\n> Roland, Is it possible to use Prism1 or Prism2 commands in the PMAP version\n> of Radiance to forward raytrace from the photon port (the target light\n> (*luminance* source?)to the target illuminance source (the working plane)?\n\n\nBeats me. :^)\nSeriously, I never tried. I only included support for the more common \nmaterials. Looking at the code, it would appear that the PRISM material \nsimply acts as a secondary light source -- a concept that is invalidated \nby the photon map anyway. Furthermore, the source vector [DxA, DyA, DzA] \nwould be undefined, since it's only available specifically for this \nmaterial. My guess is it simply won't work and immediately bail out \nsince there's no scattering routine for this specific material.\n\n\nYou'll probably have to go the hard way and model the prism explicitly \nusing instances, like the Y-glass example on the pmap webpage. This is \nextremely ugly, but it's the only solution I can envisage in your case.\n\n\n--Roland\n\n\n\n\n\n\nRoland Schregle\nPhD candidate, Fraunhofer Institute for Solar Energy Systems\nRADIANCE Photon Map page: www.ise.fhg.de/radiance/photon-map\n\n\nEND OF LINE. (MCP)\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-June/001817.html).</sup>", "attachments": [], "created_by_name": "Roland Schregle", "created_at": "June 14, 2004 at 08:56PM", "created_by": "Roland_Schregle", "parent_id": "radiance-general_001814", "id": "radiance-general_001817"}