{"body": "Hi,\n\n\nnice that someone still stumbles upon my images and render comparisons ;-)\n\n\n> I also stumbled upon this comparison website:\n> https://www.janwalter.org/RadianceVsYouNameIt/radiance_vs_younameit.html\n\n\nTo compare renderers is a really time consuming task and each renderer\nis changing\nover time, so one picture rendered today might look different in a 1/2\nyears time.\nAnd to really be able to compare those renderers with some confidence\nyou must know\nabout all their parameters etc. A task which I like to spend my time\non, but still after all\nthose years doing it, I don't want to publish too many details, but\nrather make people\ndownload some files, install renderers and try for themselves.\n\n\nBut here are some thoughts:\n\n\n- Radiance did have a huge impact on other renderers (and that we have\nHDR and OpenEXR).\n  That's why I called that comparison somewhat ironically Radiance vs.\nYouNameIt. Some people\n   got all the fame, but me and some others are old enough to remember\nwhere things came from ...\n- Other things which slowely made it into other renderers: Sun & sky\nsimulations, suddenly with HDR\n  you could end up with over- or underexposed images -> exposure\ncontrol -> camera controls/settings\n  which mimick real cameras etc. In the film world you had LUTs, now\neverybody somehow/somewhat\n  deals with color correction. All of this makes it hard to end up\nwith a \"similar\" image.\n- Sure, other renderers are more user friendly, and there is/was some\nmoney to make. I would say\n   that integration into a DCC tool is sometimes more important for\nthe success of a renderer than\n   the quality of the resulting images. For my tests I was using\nBlender (most of the time):\n   https://bitbucket.org/wahn/blender-add-ons (the io_scene_multi\ncontains Python scripts for\n   Arnold, Indigo, Luxrender/PBRT, mental ray, Maxwell, Radiance, and\nRenderMan compliant).\n   None of this is production ready, I add only things I need\npersonally to do the next step and render\n   the next comparison images ... and Blender has Cycles now, which\nchanges a lot:\n   https://www.cycles-renderer.org/\n- I started to collect Blender scenes (and scene descriptions for\nvarious renderers) here:\n  https://github.com/wahn/export_multi ... as you may notice some of\nthose scenes come from\n  Radiance. I had to write an importer first, parse Radiance files,\nstore them in some renderer\n  independent format which does not loose the provided information,\nbring that into Blender and find\n  tricks to e.g. keep primitives like spheres as those in case the\nrenderer in question can handle those\n  directly. Use someheuristics to mimic material settings etc. ...\n- After a while the git repository got too big, the files too large,\nthe scenes/textures too big/many ...\n  So now I provide download links for scenes in various formats:\nhttps://www.janwalter.org/download/\n  All of them originate from a Blender scene, but I update them from\ntime to time and all of this is meant\n  to make it easier for somebody else to just download the files for a\nparticular renderer without having\n  to deal with Blender etc.\n- Finally I started converting PBRT's C++ code to Rust (\nhttps://www.rust-lang.org/en-US/ ) as a\n  learning experience. Maybe someone wants to do that for Radiance one\nday. Rust seems to be a fun language\n  with safe multi-threading etc. Here is the current state (and a bit\nof history about last year's development):\n  https://www.janwalter.org/jekyll/review/2017/2018/01/01/happy-new-year-2018.html\n\n\nAnyway, comparing renderers is really hard. Radiance is about being\naccurate, others might look good and might be easier to play with. My\ninterest is in using Radiance (and others) for reference and try to\ncreate similar looking images. Compare rendering times etc. An ever\nchanging world ... Here I was playing with false colors etc.:\nhttps://www.janwalter.org/jekyll/rendering/radiance/2015/10/02/classroom-radiance_falsecolor.html\nBut I'm not an expert user of Radiance. Most of the people on this\nlist know much more about it.\n\n\nI just wanted to give Radiance some credit for all the things which\nmade it into other renderers.\n\n\nMy 2 cents,\n\n\nJan\n\n\nOn Mon, Jan 29, 2018 at 8:52 AM, Dion Moult <dion at thinkmoult.com> wrote:\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2018-January/012433.html).</sup>", "attachments": [], "created_by_name": "Jan Walter", "created_at": "January 30, 2018 at 01:56AM", "created_by": "Jan_Walter", "parent_id": "radiance-general_012428", "id": "radiance-general_012433"}