{"body": "On 28 Nov 2008, at 19:23, G V DEEPAK wrote:\n\n\n> Hello Everyone,\n>\n> Thanx again Dr Bleicher, Assuming that the blinds are used to block\n> the sunlight coming inside, then why is it that the blinds in my model\n> are not blocking the sunlight coming in ?\n\n\nIt's just Mr me.\n\n\nYour blinds are fine but the bright material reflects a lot of the\nsun light (direct, very bright) to the ceiling. I've rendered an\nimage of the scene here:\n\n\nhttp://sites.google.com/site/tbleicher/radiance\n\n\nThe additional illumination is - I think - caused by the light\nreflected from the blinds to your sensor point. Without blinds\nthere is just the part of the sky you can see from the sample\npoint (no sun for the sky condition shown). With blinds the\nsunlight is reflected diffusely at the blinds and a lot of sun light\nis redirected to the sensor point that has not been there before.\nBecause the blinds are bright white this exceeds the light of\nthe sky dome so you get higher illumination values.\n\n\nI haven't had time yet to do a renderings without blinds to\nconfirm this.\n\n\nThis might also explain why you get negative values for your\nglare index. I'm no expert but AFAIK the glare index is calculated\nfrom local hot spots. With your blinds there are no hot spots because\nthe whole window is uniformly bright. You can look into this year's\nworkshop presentations on glare from daylight by Jan Wienold:\n\n\nhttp://www.radiance-online.org/radiance-workshop7/\n\n\nYou have to contact him directly about a copy of 'evalglare'. The\nlink in the presentation still does not work ...\n\n\n\n\nRegards,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-November/005544.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "November 29, 2008 at 02:18AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_005533", "id": "radiance-general_005544"}