{"body": "Hi Christoph!\n> I'm doing a glare analysis using Radiance in IES Virtual Environments.\n>   \nI do not know that environment, however it seams that it simply calls \nrad on a scene?\n\n\n> For some reason, the components in the room sometimes don't show up and\n> I get the following error:\n> 0.00 %, oconv started processing    0.0000 hrs.\n>\n> xform2: cannot find file\n> \"\\CHRIST~1\\100501~1\\MELBOU~1\\Radiance\\Laptop13.rad\"\n>   \n(...)\n>  99.00 %, oconv finished      after   0.0000 hrs.\n>   \nHm, it looks like you have a modified version of oconv, never seen the \ntime output for it before. I also do not know xform2. However the \nmessage is clear - the files are not found. Either this is a mistake by \nxform2 or by the tool that was supposed to generate these files. So the \nfirst thing to do is to check whether the listed files are at the given \nlocations. I guess the weird directory name have to do with some windows \nfile-system limitations? What surprises me is that xform2 uses \nbackslashes for directories - is this the modification against xform \nthat led to the name change?\n> This error came up after I changed the sky file, but it happened quite\n> randomly before, so I'm not sure whether this has anything to do with\n> it. Sometimes the same simulation worked fine when I ran it on a\n> different PC. However, the problem seems to spread.\n>   \nIf it happened randomly before there seam to be other reasons.\n\n\nSo as mentioned before, it seams that the commands involved are not \nreally part of radiance but some derived, modified binaries. Start \ndebugging by finding out whether the error messages correctly detect \nthese missing files. Then one could start to find out how this IES \nVirtual Environment works and creates / names / writes the files. In \nradiance, one would also typically have a variable RAYPATH set including \nall file system paths where scene files are to be found.\n\n\nCheers\n\n\nLars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-May/006853.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "May 09, 2010 at 06:21PM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_006852", "id": "radiance-general_006853"}