{"body": "On 04/05/06, 22:31:40, Lars \"O.\" Grobe <grobe at gmx.net> wrote regarding Re:\n[Radiance-general] compiling Radiance 64-bit?:\n\n\n> >> Correct and radiance gets no where near 2GB. (At least I run out of\n> >> CPU long before the model is that big.)\n> >\n> > I totally agree there: It's still the CPU speed that's limiting.\n\n\n> I have a model that is getting close to 2GB here.\n\n\nAnd when it does you will have to use 64bit, a decision not base\non speed.\n\n\n\n\n> > I am not sure how 'bitty' the floating point values are that RADIANCE\n> > calculates. If they are 64-bit long, then you can actually expect a speed\n> > improvement, me thinks.\n\n\n> Most floating point values are doubles, thus 64bit. Still, the whole\n> 64bit-point is about address pointers. All the old \"32-bit\" cpus support\n> calculations on 64bit values - double floats are not that new (a SSE2\n> unit as found in recent 32bit intel cpus can even perform calculations\n> on 2 64bit values at once). So we are only talking about increasing the\n> amount of addressable memory here.\n\n\nYes, yes, a 64bit CPU is not cobbled by a 32bit pointer any more than\nusing a short int turns a Pentium 3 in to a 80286.\n\n\n\n\n> Correct me if I am wrong. I am not a cpu expert. But do not compile\n> Radiance in 64 bit if you do not need memory. If you do, take a look at\n> compilers. E.g. Sun has a free compiler that is known to produce 64 bit\n> code that can compete with 32 bit in speed.\n\n\nOn Sparc most programs run slower 64bit (lame is the only one I know\nthat runs quicker), on the AMD64 chip the gap was much smaller.  Lars,\nyou use Solaris?  My test were done on Solaris 10 with the Sun Studio\n10 compiler.  Studio 11 is now free.\n\n\nOn Sparc it's clear what is happening because the vis extensions can\nbe used in 32bit mode: sparcv8plus+vis and sparcv8plus+vis2.  I assume\nsomething similar is happening on the AMD64s although the compiler\nflags aren't as explicit and there is no isalist entry.\n\n\n\n\n\n\n\n\nJames.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-May/003650.html).</sup>", "attachments": [], "created_by_name": "James Lee", "created_at": "May 06, 2006 at 06:13PM", "created_by": "James_Lee", "parent_id": "radiance-general_003634", "id": "radiance-general_003650"}