{"body": "Hello Yulia,\n\n\nSeems your question has spawned quite a bit of interesting discussion...\n\n\nMy main recommendation is to use camera RAW images for critical photometry, especially when there are saturated colors involved.  It is impossible to correct the color of JPEG images and undo what the camera maker has done, so you need to start from the sensor data.\n\n\nPhotosphere does not accept camera RAW as input, but I have written a Perl script that uses dcraw with the command-line HDR image builder hdrgen to overcome this limitation.  It also requires the use of another third-party program, exiftool, which I have packaged together for you at:\n\n\n\thttp://www.anyhere.com/gward/pickup/raw2hdr.tgz\n\n\nUnfortunately, I don't have a good set of documentation to go with it.  Typing \"raw2hdr\" by itself shows the basic syntax:\n\n\n\tUsage: raw2hdr [hdrgen opts][-h][-w][-C calib][-c cspace] -o output.hdr input1.raw ..\n\n\nIf your images are taken on a tripod (aligned exposures), you can use the default settings:\n\n\n\traw2hdr -o output.hdr expos1.cr2 expos2.cr2 expos3.cr2 ...\n\n\nThe hdrgen settings can be found in the included HTML man page, and so can the -h and -w option meanings in the included dcraw man page.  The -C option is to provide a linear factor to correct the overall exposure based on previous calibrations.  The -c option is to specify an output color space.  The default is \"sRGB\" which is actually linear CCIR-709 primaries.  The only other output color space I would recommend is AdobeRGB.  There is a CIE XYZ space supported by dcraw, but I have found it to be somewhat unreliable, and I don't know where the fault lies in this.\n\n\nRegarding Axel's mention of camera flare, this is less of an issue for sources that are brighter than the rest of the scene.  It mostly affects darker, surrounding regions.  The -f option will attempt to estimate the camera/lens PSF and remove it, but it cannot be relied upon to remove this source of error completely.  Your problem with the accuracy of the LED sources is due no doubt (as others have said) to limitations in your short exposures combined with the color issues inherent to JPEG processing.\n\n\nOther responses inline....\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2012-February/000363.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "February 20, 2012 at 10:10AM", "created_by": "Greg_Ward", "parent_id": "hdri_000401", "id": "hdri_000363"}