{"body": "John An wrote:\n> Let me begin by apologizing for the format of my emails.  I only subscribe to \n> the digest of the list, so I don't have the original emails to reply to, so I \n> kind of have to haphazardly cut and paste it together.  So, here I go...\n\n\nWhy not switch over to \"real time mode\"?  Despite the traffic lately, \nit's usually pretty reasonable, traffic-wise.\n\n\n> You note that mkillum will speed things up, but I also recall reading in \n> Rendering with Radiance that using illum is not as accurate as just letting \n> the computer calculate the direct and indirect lighting.  Is the difference \n> so negligible that using illum would be ok for accuracy?  I am trying to \n> produce renderings for analysis that are as defensible in terms of accuracy \n> as possible.\n\n\nActually, when used properly there is potential for mkillum to be more \naccurate, as I understand it.  Its primary limitation is with specular \nlouvers in daylight redirection systems, but Georg Mischler's Raydirect \nproduct can help with those types of systems.  Presumably so could \nRoland Schregle's photon map plug-in to Radiance. Others on the list can \nexplain it better than I.\n\n\n> I initially used rad to control everything, but I noticed that the -av \n> parameter when I chose High for Quality, Variability, and Detail was .01 .01 \n> .01.  While that's close enough to 0 0 0, I wanted to be absolutely sure that \n> the light levels were the result of the calculations, and not some a priori \n> assumption.  Thus, the rpict parameters I chose were based on the output of \n> my rad file with some slight modifications.  Is there a way to overide some \n> of rad's intelligent guesses within the .rif file itself (specifically, the \n> ambient value and ambient weight)?\n\n\nThere sure is.  Simply add a line like this:\n\n\nrender= -av 0 0 0\n\n\n... to your .rif file.  This adjusted parameter is then appended to the \nend of the @options file I mentioned the other day, overriding what rad \nput in there.\n\n\n\n\n\n\n      Rob Guglielmetti\n\n\ne. rpg@rumblestrip.org\nw. www.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000748.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "May 14, 2003 at 02:55PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_000724", "id": "radiance-general_000748"}