{"body": "Roland Schregle wrote:\n\n\n> WOW!!! A predator rack!!! Somebody around here still uses *REAL*\n> hardware! To hell with dual pentium boards! :^)\n\n\nYes to hell with them.  Real (financially challenged) men run their \nsimulations on Athlon systems.  =8-)\n\n\n> I'll leave it to Greg to eggs-plain what avlmemi does wrong. Possibly a\n> portability bug, but not peculiar to IRIX. Also pops up under Linux.\n> Nuthin' wrong with your Onyx, that's for sure.\n\n\nSometimes it pays to be an email pack-rat.  Here's a snippet from an old \nemail exchange between Greg & I:\n\n\n\" ... I got very annoyed about the avlmemi bug after the workshop, \nthinking about these things that have been dogging me for so many years, \nso I did a little investigation on the OS X version, where to my horror \nthe same problem had come up, again.  Fortunately, I had an easily \nreproduced error, so I was able to do a little experimentation.  All \nthese years, I thought it was a bug in the qsort(3) library routine, but \non further testing, I couldn't get it to fail, so I started to look \nelsewhere.  As it turned out, it wasn't the qsort() function itself, \nrather it was the comparison function I was giving it in ambient.c.  I \nwas comparing two pointers using pointer arithmetic, using an expression \nthat works with most compilers, but apparently not GNU-C!  In the end, \nit was a single word that needed to be changed to rid me of this bug \nthat's been hanging on for at least 6 years, since the first Linux \nsystems came into widespread use.\"\n\n\nThere you go.  Maybe I saved Greg some typing.\n\n\n\n\n\n\n      Rob Guglielmetti\n\n\ne. rpg@rumblestrip.org\nw. www.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-January/000540.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "January 29, 2003 at 12:54PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_000538", "id": "radiance-general_000540"}