{"body": "greg - forgive me if im being a bit slow with this, but i've a few more \nquestions!\n\n\nso i think i understand the conversion to sharp RGB now. though i was \nunder the impression that the sharp RGB colour space used the D65 white \npoint, not the equal energy 1/3, 1/3 point (which is D50 i think?). \nguess i was wrong!\n\n\nwhere i'm getting stuck is with specifying the sources.\n\n\n1. using blackbody.cal:\n-should i use this to calculate the emitted power for a selection of \nlambda values (presumeably using a separate script to input the lamda \nvalues)? if so, how do i then go about converting the results into XYZ \nvalues, so that i can then convert to the sharp rgb colour space? \n(presumably illumcal.csh uses the power vs. lamda data and CIE standard \nobservers, but i dont follow how to use it! also, does it produce RGB or \nXYZ values?)\n-or should i use it to calculate the cromaticity (x,y) coordinates? if \nso, can i  then simply use rgb.cal (if this is what its equations do!) \nto convert the (x,y) cromaticity results to RGB values, ignoring the Y, \n\"brightness\", value?\n-currently (ie before i apply any colour filters) my sources are simply \nwhite, i have ignored their colour temperature. when i applied the \ncolour filteers i was going to use the XYZ data given for a 3200K \nsource, rather than that measured with the C source. i was hoping that \nthis would mean i do not have to add the effect of the colour of the \nsource as well, is that correct? if not, then how do i model both the \neffect of the lamps colour temperature and the colour filter in my scene \nfile, while maintaining the correct physical light output of the \nfixture? do i simply multiply the 3 (corrected intensity) output values \nby the colour temperature values, and then again by the colour filter \nvalues? and should i just worry about the R:G:B ratio for each of these, \n  or do i need to multiply by the actual, calculated values?\nwould it be better to use several primitives (ie one for the colour \ntemperature, one for the colour filter) to modify the colour of the \nsource, rather than doing lots of multiplications before hand?\n\n\n2.using neutral light sources\n-i think i understand the principles of what you said in your paper, but \ni dont really follow how to implement this!\nmy scene has only one source in it, so this is what i understand i \nshould do:\nonce i have calculated the sharp RGB values of the output of my source i \nshould divide every material colour by the source colour (individually \nfor r, g, b) and replace the source with a white one. should this white \nsource be normalised to a value of 1 1 1, and the intensity of the \nsource be taken into account in the premultiplication above, or should \nthe intensity of the source left out of these premultiplications?\nhow do i then regain the colour information after the rendering? is it \nas simple as postmultiplying every pixel in the pixel by the inverse of \nthe appropriate r, g or b value used in the pre-multiplication?\n\n\nthanks again, and sorry for the barrage of questions!\nwill\n\n\n\n\n\n\n\n\nGregory J. Ward wrote:\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-March/003529.html).</sup>", "attachments": [], "created_by_name": "william reynolds", "created_at": "March 27, 2006 at 09:35PM", "created_by": "william_reynolds", "parent_id": "radiance-general_003524", "id": "radiance-general_003529"}