{"body": "Axel Jacobs wrote:\n> f) If you compile with SPECIAL=\"ogl\", you'll get OpenGL drivers for\n> the holodeck stuff. This makes it much faster and nicer. There will be\n> additional device files. Here are mine:\n\n\nbroken on linux, at least with the current xorg. It builds, but the\noutput is distorted. Probably this depends on the graphic hardware,\nthough. Something to look a bit deeper into.\n\n\n\n\n> b) (again). I did not mean to suggest that Radiance is not Free. What\n> I simply do not know is whether it's Free Enough to be included in\n> Debian proper. It certainly is free enough for me.\n\n\nYou can be sure the license is free enough to be included in Debian,\notherwise\n- it would have been rejected by the ftp masters. They take such things\n_serious_.\n- there wouldn't be php in Debian.\n\n\n\n\n> I already pointed out the potential click-wrap problem, which you\n> simply patched away.\n\n\nThe license does not require any kinds of click-wrap, it is the build\nsystem which asks me to accept the license. As the build system is\nshipped under that license I'm free to change it (I'm not using it at\nall btw, much more easy to do build without the build-system).\n\n\n\n\n> \n> If the click-wrap is there for no reason at all, then a better\n> solution would be to get it removed up-stream. Since I don't know what\n> Greg has to say about this, I shall make no further assumptions.\n\n\nStill don;t see the problem here, as the click-wrap is not in the\nlicense but in the build system - but it would probably make people's\nlife more easy if they wouldn't have to accept the license while using\nthat build system.\n\n\n> Another interesting phrase is para 5 of the Radiance Software License:\n> \n> \"5. Products derived from this software may not be called \"Radiance\",\n> nor may \"Radiance\" appear in their name, without prior written\n> permission of Lawrence Berkeley National Laboratory.\"\n\n\nugly, but ok.\nhttp://www.debian.org/social_contract#guidelines (4)\n\n\n> I trust that you as a seasoned Debian developer with >30 packages\n\n\n... still working on becoming an official Developer :)\n\n\n> under your belt know all the ins and outs of all sorts licenses and\n> Social Contracts, so having your assurance that Radiance is\n> Free-as-in-Debian will make me sleep comfortably at night.\n\n\neven if you couldn't trust me, you can trust the ftp master who checks\nthe packages. He reads _every_ file and would simply reject a package if\n- debian/copyright (== /usr/share/doc/radiance/copyright) is not\ncomplete or if there're any problems with a license of a single file. Or\nbecause there're two pdfs without source included, which happened to me\n- I just missed to look for their source.\n\n\n\n\nCheers,\n\n\nBernd\n\n\nBernd Zeimetz\n<bernd at bzed.de>                         <http://bzed.de/>\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2007-October/004465.html).</sup>", "attachments": [], "created_by_name": "Bernd Zeimetz", "created_at": "October 14, 2007 at 12:48PM", "created_by": "Bernd_Zeimetz", "parent_id": "radiance-general_004452", "id": "radiance-general_004465"}