{"body": "Hi Ben and Greg,\n\n\nI am by no means a glazing expert but I think that the best bet so far \nfor glazing color based on measured data is to use Optics 5 from LBNL. \nThis is a sister product to Window 5 and in fact Window 5 relies on the \noptical property data produced by Optics 5 for its glazing database and \ncalculations. With Optics 5 you can build up your glazing system and \nthen export it in a number of formats including to Radiance. The \nunderlying data for the program is measured spectral transmittance and \nreflectance. For Radiance it will export 3 material definitions, which \nyou need to choose from when assigning to geometry. There is the simple \nglass type and then there is a front and back BRTDfunc that gets \nexported. The latter specifically assigns the specular reflectance and \ntransmittance for the material (although I do not know if this is \ncalculated based on normal incidence or over the hemisphere). I think \nthe BRDTfunc is probably the way to go for looking at glass on the \noutside of a building. But this is a very simple use of this very \npowerful material type and as Greg can much more ably explain it still \ndoes not account for any angular dependance/interaction in the material.\n\n\nPerhaps some others with Optics 5 and Radiance experience would like to \nchip in their two cents as well? Also depending on how dirty you want to \nget your hands, there is something called glaze.csh which Greg put \ntogether for us a while ago. I believe this was released in the Radiance \n3.5. This computes a more sophisticated BRTDfunc glazing material. But \nit would need to be modified for the relevant reflectance/transmittance \ndata that you are interested in, which would still need to be derived \nfrom Optics 5 as I recall.\n\n\nRegards,\n\n\n-Jack de Valpine\n\n\nPS: Apologies to the Window 5 and Optics 5 team, I have not really done \na great job explaining the relation of the tools to each other and there \nrespective features. Again if someone wants to chip in a more robust \nexplanation this would be great!\n\n\nGreg Ward wrote:\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-October/001039.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "October 09, 2003 at 05:24PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_001038", "id": "radiance-general_001039"}