{"body": "Hi Qing,\n\n\n> For this moment, I think I should tell you my real situation. From the requirement\n> of our project, I could not use the Radiance in the form of command line and I\n> must change some codes to form our own APIs (making use of static library).\n\n\nSo, I guess you're developing an interactive, graphical program that\ndisplays an image that uses values calculated by some routines of\nRadiance. Which would be most easily done using one of\nfork&exec/system/popen on Posix (e.g. Linux/UNIX) systems, Windows may\nhave similar means of communicating with external programs. But you\nsaid, you can't do 'system' calls. Does that mean you can't read from an\nexternally started program ?\n\n\n> I couldn't use system calls. We can get the required image using API altered from\n> \"rpict\", \n\n\nWhat do you mean by \"API altered from rpict\" ? Using the rendering\nroutines from rtrace/rpict would be feasible, but it doesn't explain why\nyou have trouble with rtrace output.\n\n\nand then our real problem is to specify a region (or even a single\npixel)\n> on the image plane to get the radiance value and the picture of that region. In my\n> opinion, \"rpict\" can specify the exact position on an image plane.\n?? \n\n\n> So, I use the changed \"rtrace\" to render the region to obtain their radiance values (r, g, b)\n> and then I want to transform them into a suitable file form to obtain the picture.\n> I know I can get the answer through looking into the source codes, but I do not\n> have so much time for that. I have tried the method Dr. Peter told me. However,\n> that method sometimes works well and sometimes not.\n?? It fails if and how ?\n\n\n> Now, I want to take advantage the Radiance picture directly.\n??\n\n\n> opinion, what is the better solution for my problem?\nI'm still not quite sure I understand what you problem is-\n\n\n-Peter\n\n\n pab-opto, Freiburg, Germany, www.pab-opto.de\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-October/000434.html).</sup>", "attachments": [], "created_by_name": "Peter Apian-Bennewitz", "created_at": "October 11, 2002 at 01:19AM", "created_by": "Peter_Apian-Bennewitz", "parent_id": "radiance-general_000433", "id": "radiance-general_000434"}