{"body": "Thomas Bleicher wrote:\n\n\n> For the PowerPC version I started with the \"-fast\" option the Apple\n> gcc provides. Didn't work but it would have been a nice shortcut for\n> maximum performance settings. Does your Intel gcc have a similar\n> option (see man page)?\n\n\n\n\nIt does, thanks Thomas.  I just recompiled with -fast instead of -O3, \nand got no errors at all (thanks again for the \"tee tip\").  I will try \nto run the Stock benchmark today.  All the test scenes in the obj \ndirectory really fly!  The cabin holodeck scene is a lot more fun to \nplay with on this thing. =8-)\n\n\n\n\n> Q1: Did you have the X11 development stuff installed when you compiled\n>     Radiance? IIRC it has to be selected manually.\n\n\n\n\nYeah, it was installed when I installed xcode.  I don't recall having to \nspecifically tell the installer to install the X11 devel stuff, but it \nwas certainly there when I compiled Radiance.  No errors, and I have \nximage and rvu, etc. \n\n\n>> PATH=/usr/local/bin:$PATH\n>\n>\n> Word of warning: It is common on Unix systems to place the non-system\n> path (\"/usr/local\", \"/opt\" etc.) in front of the system path....\n\n\n\n\nThanks for the heads up.  Believe it or not, I haven't had a need for \nfink on the old computer, but I thought I may install it on the new one, \nso I'll keep your warning in mind.\n\n\n>\n> Any reason why you don't use\n>\n> if [ ! ${DISPLAY} ]; then\n>\n> as you did with SSH_TTY?\n\n\n\n\nthe reason it's written the way it is, is that's the way it was written \non the tip website that I copied the code from.  =)\n\n\n> My cat recently peed on my laptop which is the reason I have to look\n> for a new one now. Furry beasts!\n\n\nYikes!!  Guess you were spending too much time on the computer and not \nenough time petting the cat.  They get jealous.  =8-)  I think we'd have \na serious problem if Emma peed on my new computer though...\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-February/003448.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "February 28, 2006 at 06:06PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_003446", "id": "radiance-general_003448"}