{"body": "Hi Marta,\n\n\nSorry this is all so confusing! Sounds like you grabbed the pre-built binaries from the NREL site. Let’s see if we can get you the rest of the way. \n\n\n1. Make sure you have the right installer. If you’re on MacOS, you want this one:\n\n\nhttps://github.com/NREL/Radiance/releases/download/5.0/radiance-5.0.0-Darwin.dmg\n\n\n2. Double-click the installer (\"radiance-5.0.0-Darwin.dmg”), and then double-click the file inside (\"radiance-5.0.0-Darwin.pkg”). Click “continue”, three times. Finally, click “install” to run the installer accepting the default location(s) for everything. \n\n\nYou now have Radiance installed on your mac. What this really means is that you have a while bunch of files installed to the following locations:\n\n\n/usr/local/radiance/bin (the Radiance executables — of which there are many, and ironically none of which are called “Radiance”)\n/usr/local/radiance/lib (the Radiance “library folder” which contains loads of other important files used by Radiance)\n/usr/local/radiance/man (the Radiance “man pages”, or manual pages — the main documentation to the Radiance programs\n\n\nAt this point, nothing actually works yet. =/  But, you’re close...\n\n\n3. Next you need to add \"/usr/local/radiance/bin” to your system path, and you need to create a new system variable called “RAYPATH” and set it to \"/usr/local/radiance/lib”. You can/should also add \"/usr/local/radiance/man” to your MANPATH system variable. You can see Andy McNeil demonstrate using “pico” to do this, starting at 7:38 in the video here:\n\n\nhttps://www.youtube.com/watch?v=ptTmdKSfK68&feature=youtu.be&t=7m38s\n\n\nNOTE: Be sure to use the paths I mention in this email and not the ones in Andy’s video.\n\n\nAfter you do these three steps, you will have Radiance installed and functional. Then the fun really begins. =) Be sure to check out the tutorials here:\n\n\nhttp://www.radiance-online.org/learning/tutorials\n\n\n…and post any questions either here on this list, or over on Unmet Hours (https://unmethours.com/questions/). There are plenty of folks who are still here answering questions and offering advice, long after getting Ph.D.s. Matter of fact, some of us never even got Masters degrees. Still here. \n\n\n-Rob\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-September/011264.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "September 27, 2015 at 06:04PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_011255", "id": "radiance-general_011264"}