{"body": "Hi Christiano,\n\n\nits interesting to read that there is at least one person out there who\nactually uses some of the stuff I've published on my site :-)\n\n\nConcerning the pattern files, I think I cannot repeat it often enough\nthat they where made in an 'experimental' phase, when I started to get\naquainted with the radiance functional language.\nSo they are everything else but well worked out (this applies\nunfortunately also to editing and handling), and they are not supported\nby me in this form anymore.\n\n\nTo answer your two questions:\n\n\ncolor:\nIn many pattern files (not only in marble) the color pattern is produced\nwith a 'color map' and random noise functions. Means, a random noise\nfunction gives you a value between 0 and 1 (or -1 and 1),and dependent\non that a color is drawn / interpolated from a handful of values.\n\n\nOften I use 5 color-maps, so you have 4 'division' values, between 0 and\n1 (the fifth is always 1.0, so it is left out), and of course a color\nrgb tripel for each division)\nChanging the color of a pattern thus means the tedious job of changing\nall the 5 color values. As a first start, simply leave the division\nvalues as the are (i.e. arg 1,5,9,13) and just change the color tripels.\nAs an additional awkwardness, some patterns are set up as a mixture of\ntwo layers, so you have to do this color-editing twice, once for each\nlayer..\n\n\ntiles:\nThe problem with the whole pattern file business is that you need lots\nof calculations files for each different pattern or variant of a it,\nand, well, that small collection I've produced covers only a few cases.\nIn the tiles/no tiles case, however, there is a trick:\njust make the tile x and y step (arg(40) and arg(41) for the marble\npattern) very large, larger than the object made out of that material,\n(and maybe use a translation transformation also),\nso that no tile grouts appear on your object.\n\n\nHope this helps\n-Carsten\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"Der Deckel muß zugehen.\"    (P.Kölsch)\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-September/003938.html).</sup>", "attachments": [], "created_by_name": "Carsten Bauer", "created_at": "September 01, 2006 at 09:50AM", "created_by": "Carsten_Bauer", "parent_id": "radiance-general_003932", "id": "radiance-general_003938"}