{"body": "Some really good glazing types, including highly diffuse museum glazings (one of the best being Opalika from Schott at http://www.us.schott.com/architecture/english/references.html) have no Radiance descriptions or are often not archived in the Window database. You can model those in different ways. The easiest way is to start out with the radiance material trans. \n\n\nExample:\n1) http://www.us.schott.com/architecture/english/products/colored-glass/opalika/index.html\n2) Download the pdf file on the link below\n3) See http://www.us.schott.com/architecture/english/download/schott_farbglas_us_kl.pdf and take a look at Opalika\n4) Go to the product information which contains technical data:\nhttp://www.us.schott.com/architecture/english/download/\n5) Select the technical information at the bottom: \nTechnical Information\nOPALIKA®-Physical and chemical properties\nhttp://www.us.schott.com/architecture/english/download/opalikae.pdf\n6) This product sheet tells you all optical properties, including a nice intensity distribution plot on p. 6. \n7) The total transmittance is around 30%. Nevertheless, the material has a spike caused by the Radiance trans parameter number 7, which is the transmitted specular component. \n\n\nLet's define this material. The general format of trans is:\nvoid trans opalika\n0 0 7\na1 a2 a3 a4 a5 a6 a7\n\n\nWe need additional parameters from the datasheet:\n\n\nrd = diffuse reflectance of opalika, say 0.2 \nrs = specular reflectance of opalika, say 0.02\ntd = diffuse transmittance of opalika, say 0.28\nts = specular transmittance. Play with this value and see how close you can get to the intensity distribution displayed on the data sheet. \n\n\nLet's start with ts = 0.01\n\n\na7=ts/(td+ts)\na6=(td+ts)/(rd+td+ts)\na5=0 (roughness - lets just assume 0 for convenience)\na4 = rs = 0.02 let's say (specular reflectance of Opalika)\na3 = a2 = a1 = rd/ ( (1-rs) *(1-a6) )\n\n\nIf you do the calculations, you will find the following:\nvoid trans opalika\n0 \n0\n7    0.5   0.5   0.5   0.02   0.0   0.592   0.0345\n\n\nDefine this material in radiance as a polygon, and put a light source/horizontal sun rays behind it. Determine the luminance at nadir. Determine the luminance at 1, 2, 3 ... 20 degrees off nadir. See if you can get the plot listed in the data sheet. If not, change the ts parameter.\n\n\nThis is a good exercise since you should use data that are verifiable. Create your own values, verify them and don't rely too much on others :)  I have found substantial transmittance mistakes in manufacturers published data. We discussed some concerns about the windows database before in this group. \n\n\nMartin Moeck\n\n\n\n\n\n\n\n\n\n\n\n\n________________________________\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-May/003674.html).</sup>", "attachments": [], "created_by_name": "Martin Moeck", "created_at": "May 12, 2006 at 10:58PM", "created_by": "Martin_Moeck", "parent_id": "radiance-general_003673", "id": "radiance-general_003674"}