{"body": "Hi Claus\n\n\nWhich version of the su2rad plugin did you install?\n\n\nSince you can export geometry created in SketchUp I would\nassume that the import from 3DMax creates an odd scene\nstructure that su2rad can't handle properly. You can send me\nthe *.skp file with the imported geometry and I'll poke around\na bit.\n\n\n2011/1/17 Claus Brøndgaard Madsen <cbm at create.aau.dk>:\n> The import works although there is a scale issue …\n> once imported the box is 0.025x0.025x0.05 meters,\n> but that is easy to fix.\n\n\nThe basic SketchUp unit is 1 inch. So if you import something\nwith 1x1 units size it turns into roughly 0.025 meters.\n\n\n> When I use the su2rad plugin to export to radiance files I get an xform\n> error unless I use the “by group” mode and tick the “global coords” option.\n\n\n[...]\n\n\n> (those are all directories, of which Views contain a valid .vf file with\n> correct info, and luminaires contain a .ies file which I am not going to\n> need … all other directories are empty)\n\n\nMost directories are empty at this stage because they are used\nfor the rendering process. However, you are missing a *.rif file\nand an \"objects\" directory, which tells me that there must have\nbeen a problem during the export.\n\n\nYou can open the Ruby console window before you start the\nexport. This will show any script errors in the console and\nhelps to see if the export finishes successfully.\n\n\nI am very surprised that the \"luminaires\" directory is created\nand that there is an *.ies file that's supposed to be converted.\nI thought I had disabled this feature in the official versions\nso far.\n\n\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2011-January/007636.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "January 17, 2011 at 01:26PM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_007635", "id": "radiance-general_007636"}