{"body": "Hi Ji,\n\n\nIs your approach of generating cumulative sky described in your PhD thesis?\n\n\nNo, it came a little later -- though the sky model mixing function used is the one in the thesis.  Also, the brightdata format used for the cumulative sky is very similar to the one used to get the sky luminance scans into Radiance for the validation.\n\n\nThere's a number of ways that a cumulative sky can be fashioned.\n\n\n1. Single 'glow' source with associated brightdata file containing the cumulative radiance of the diffuse sky and all the suns, i.e. the sun radiance is 'smeared' over the brightdata patch.\n\n\n2. A 'glow' source as above, but now only for the cumulative diffuse sky component.  Additionally, you must add a number of direct 'light' sources where each one is set to have the cumulative radiance of all the suns that occur in the occupied bins for a gridded distribution in altitude and azimuth.  An 8deg bin width for both altitude and azimuth results in about 200 'light' sources depending on the latitude.  Now, rather than being smeared, the suns are slightly displaced to the bin-mean alt-azi position.\n\n\nI use option #2, i.e. 'glow' source for the sky and multiple 'light' sources for all the suns.  It's more computationally expensive than #1, however the 'light' sources will get illumination deep into a model (i.e. through windows etc) without having to rely on cranking-up the resolution of the ambient parameters.  Both types have their attractions; I don't know which one GenCumulativeSky uses.\n\n\nThe method used in #2 to aggregate the sun radiance is (mostly) described in this paper: J. Mardaljevic and M. Rylatt. Irradiation mapping of complex urban environments: an image-based approach. Energy and Buildings, 35(1):27–35, 1 2003. Send me an email if you have trouble getting hold of it.\n\n\nCheers\nJohn\n\n\nJohn Mardaljevic\nProfessor of Building Daylight Modelling\nSchool of Civil & Building Engineering\nLoughborough University\nLoughborough\nLeicestershire\nLE11 3TU, UK\n\n\nTel: +44 1509 222630 (Direct)\nTel: +44 1509 228529 (Pam Allen, secretary)\n\n\nj.mardaljevic at lboro.ac.uk<mailto:j.mardaljevic at lboro.ac.uk>\nhttp://www.lboro.ac.uk/departments/cv/staff/profile/367.html<http://www.lboro.ac.uk/departments/cv/>\n\n\nPersonal daylighting website:\nhttp://climate-based-daylighting.com<http://climate-based-daylighting.com/>\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2012-December/009128.html).</sup>", "attachments": [], "created_by_name": "John Mardaljevic", "created_at": "December 16, 2012 at 09:32AM", "created_by": "John_Mardaljevic", "parent_id": "radiance-general_009116", "id": "radiance-general_009128"}