{"body": "Hi Axel, et al.,\n\n\nI have not poured over your script here, and maybe I'm just confused, but I\nthink what you describe is similar to what can be done in the current\nDAYSIM.  DAYSIM creates one set of daylight coefficients for the sky\npatches and ground (145+3ground) and one set of daylight coefficients for\nthe direct sunlight positions which typically ends up being anywhere from\n60-65 coefficients.  The solar coefficients are for every hour for 5 sample\ndays thoughout the year: the solstices, equinox, and an apr/aug 21 and\nfeb/oct 21.  For orientation or latitude freedom, these could be run for\nthe broader set of solar locations described in the DDS documents by Denis\nBourgeois (A Standard Daylight Coefficient Model for Dynamic Daylighting\nSimulations) but not sure if DAYSIM has this implemented or not.  My\nprojects never seem to have such freedoms ;-)\n\n\nI still use this method, even with BSDF files, as I feel it better\naddresses the sun and is more accurate than spreading that flux over 3\npatches as the '3-phase' method does.  I have found that using \"proper\nreal\" suns can but not always make a difference on results.  Even with\ndynamic BSDF or other elements, if there are only two-positions (which is\ncommon for me - up or down), I will just run this method for the two\npositions rather than resorting to the 3-phase method and the sun smearing\nissues.\n\n\nPerhaps it would be good to really clarify, and define as a community, what\nis meant by all these \"phases\".  Here's my two cents.  I had always thought\nof it as basically \"phases of flux transer\", not phases of calculation or\nnumber of matrices.  I was surprised to hear at the last conference that\n\"3-phase\" came from phases of calculation I think.  Although we never count\nthe final perez sky iteration step as a phase, I don't think.  Anyways, I\nhave always thought about and referred to the different Daylight\nCoefficient (DC) methods this way:\n\n\n1-phase:  Original method (maybe implemented in early versions of DAYSIM?)\nthat simulataes one phase of flux transfer: a set of skypatch-to-calc point\nDC's.  The sky and solar flux are then both assigned to the patches in an\nannual perez sky iteration step.\n\n\n2-phase:  What is currently in DAYSIM.  Two phases of flux transfer: one\nset of skypatch-to-calculation point DC's and one set of solardisc-to-calc\npoint DC's.  The annual perez sky iterations step then assigns the sky flux\nto the patches and the solar flux to the closest 4 sun locations as\ndescribed in DAYSIM docs.\n\n\n3-phase:  Method to allow for dynamic facade elements breaking up the\nsimulation into 3 phases of flux transfer: a skypatch-to-facade element set\nof DC's (the daylight matrix), a BSDF file describing the facade element\n(the transfer matrix), and a facade element-to-calcpoint set of\ncoefficients (the view matrix).  Like the 1-phase method, the annual perez\nsky iteration step assigns all flux to the sky patches including the solar\ndisc to the surrounding 3.  This method is very useful when orientation\nfreedom is needed and when there are numerous dynamic facade positions to\nanalyze but is subject to the errors of smearing solar flux into 3 patches\neach ~10deg wide.  For non-dynamic or even 2 position dynamic and non-BSDF\nwindows I have always thought of this as a downgrade from the 2-phase\nDAYSIM method.\n\n\n4-phase:  When I first heard about a new \"5-phase\" method being developed -\nI thought it would be something like this:  basically the 3-phase but with\n2 daylight matrices, one for the sky patches and one for the sun locations\n(either using the 60-65 sun method or the DDS method).  So there would be\none phase from skypatches-to-facade element, another phase of\nsolardisc-to-facade element, a transfer phase (BSDF files), and a facade\nelement-to-calcpoint phase.  I still think there is potential here,\nespecially when a dynamic facade is needed but there is no\norientation,latitude freedom to the project.  The perez iteration would\nthen assign sky flux to the sky coefficients and solar flux to the closest\n4 positions like in the 2-phase method.\n\n\n5-phase:  What was presented at the last workshop that I am not totally\nclear on.  From what I understand it is best for fully dynamic facade\nelements and full orientation and latitude freedom - best for large\nresearch efforts.  A more complete set of solar locations (like the DDS\nmethod) are used but to avoid problems with calculating these many\nlocations there is a subtraction process to derive them?  Sorry, my\nunderstanding of this effort is not extremely clear and I don't have time\nat the moment to read up on it.  I am sure someone here can clarify.\n\n\nAnyways, I think it would be nice for me, and the daylight simulation\ncommunity, to have a clear understanding of these different annual daylight\nsimulation methods, their names, and which method is appropriate for which\ndesign problems.  On a side note, SPOT implements another climate-based\nannual daylight simulation method, coined a Design-Day Interpolation\nmethod, that matches the 2-phase DAYSIM approach very closely and I have\nseen less eratic results deeper in spaces with it ( I think because they\nare more reliant on the single sky patch they see out a window).  This is\nwhat SPOT uses for dynamic shading analysis which is limited to 2-positions.\n\n\nSorry, this ran away from me but has been something on my mind for a while\nthat your question triggered.  I would love to hear others take on this and\nplease correct anything I have misunderstood or mis-stated here.  I have\nthought about starting an IESNA Daylighting Simulation Sub-committee to\nauthor an LM that nails down all these issues with climate-based annual\ndaylight simulation, anyone else interested in participating in such a\ngroup?  I could write-up a draft PIF (Project Initiation Form) to get the\nball rolling.  Or maybe this is just a new effort for the IESNA Daylight\nComittee since the RP-5 is all wrapped up?\n\n\nRegards,\nZack\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2014-February/010043.html).</sup>", "attachments": [], "created_by_name": "Zack Rogers", "created_at": "February 06, 2014 at 12:01PM", "created_by": "Zack_Rogers", "parent_id": "radiance-general_010037", "id": "radiance-general_010043"}