{"body": "Hi Anthony,\n\n\nI believe that this is the paper that Greg is referring to:\n\n\nhttp://www.anyhere.com/gward/papers/egwr02/index.html\n\n\n-Jack\n\n\nAnthony J. Farrell wrote:\n\n\n>Greg,\n>\n>Thanks for the very helpful advice. Unfortunately I cannot access the link\n>you gave me as it says 'object not found', what's the name of the paper?\n>\n>Apologies if my email was confusing, to simplify, I wish to illustrate to an\n>audience the dynamics of artificial light in providing a warm and cool\n>environment relative to mixing light from 2000 to 6000K as is presented by\n>Philips\n>(http://www.lighting.philips.com/gl_en/index.php?main=global&parent=global&i\n>d=global&lang=en under' a new concept in office lighting ' and then to\n>compare that with actual warm (morning or evening) and cool (midday) light\n>from a window.\n>\n>The lamp colour defaults are 0.907 0.863 0.4762\n>\n>I wish to model the same lamp but with a colour of 2200 and 6000K resp.\n>\n>I now understand that the ies2rad program translates the colour from the -t\n>and -c options into the .dat file which is used in generating the\n>distributions. The .fmt file must be one just used by DRAD, so not to worry\n>bout that.\n>\n>Now when I consider the human eye things get complicated. There is no\n>spectral power distribution of the fluorescent illuminant and the spectral\n>reflectances of your objects are also not available. It is a very simple\n>office scene with angled desks, yellow chair, and light coloured partition\n>dividers. Can you suggest where I can get generic data of this kind? Or can\n>you suggest the best way to approach what I am trying to simulate?\n>\n>Thanks,\n>\n>Anthony\n>\n>P.S. Apologies for attaching the mailing list, hope this one gets through in\n>proper format.\n>\n>\n>\n>\n>  \n>\n\n\n\n\n#\tJohn E. de Valpine\n#\tpresident\n#\n#\tvisarc incorporated\n#\thttp://www.visarc.com\n#\n#\tchanneling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-May/002698.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "May 24, 2005 at 06:40PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_002693", "id": "radiance-general_002698"}