{"body": "Hi Grigori,\n\n\nThis is an interesting test.  Essentially, what you are seeing is light leaking via the ambient file from one zone to another.  It also points out the fact that the -ab setting is not the only one that matters.\n\n\nYou have left all the other rtrace parameters to their defaults.  Running rtrace [your options] -defaults, we can look at what these are.  I am including all those that are relevant to your calculation, below:\n\n\n-dt 0.030000\t\t\t# direct threshold\n-dc 0.750000\t\t\t# direct certainty\n-dj 0.000000\t\t\t# direct jitter\n-ds 0.200000\t\t\t# direct sampling\n-av 0.000000 0.000000 0.000000\t# ambient value\n-aw 0        \t\t\t# ambient value weight\n-aa 0.100000\t\t\t# ambient accuracy\n-ar 256      \t\t\t# ambient resolution\n-ad 1024     \t\t\t# ambient divisions\n-as 512      \t\t\t# ambient super-samples\n-lr -10      \t\t\t# limit reflection (Russian roulette)\n-lw 2.00e-03\t\t\t# limit weight\n\n\nIn this case, you have a large ground plane and a shading plane behind the building, which means that the default -ar of 256 is on the low side.  I would increase this to -ar 400 (divide scene size by desired detail scale).\n\n\nThe -aa setting of 0.1 means that you're shooting for roughly 10% error in your indirect calculations, which is what you are seeing in your results.  Reducing this setting to -aa 0.05 increases calculation time substantially, but cuts your error roughly in half.\n\n\nI determined these changes improve the result primarily by *visualizing* your calculation, rather than simply relying on the output.  I always tell users that there's nothing more important than actually looking at your model.  In this case, it's easy enough to visualize the point of view of your points:\n\n\np1:\t0.5 0.5 0.1 0 0 1\t->\t-vth -vp .5 .5 .1 -vd 0 0 1 -vu 0 1 0 -vh 180 -vv 180\n\n\np2:\t-0.5 0.5 0.1 0 0 1\t->\t-vth -vp -.5 .5 .1 -vd 0 0 1 -vu 0 1 0 -vh 180 -vv 180\n\n\nIf you run rvu, you have to explicitly set the options (even the default ones) to match your rtrace calculation.  That way, you can truly see what's going on and get a better idea of where errors may be creeping in.\n\n\nCheers,\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-March/011585.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "March 15, 2016 at 11:40AM", "created_by": "Greg_Ward", "parent_id": "radiance-general_011581", "id": "radiance-general_011585"}