{"body": "Hi Lars,\n\n\nSince I work for Dolby and helped develop the BrightSide display, I suppose I should offer something here.  The Dolby professional reference monitor offers sequential contrast that is at least 200,000:1, but simultaneous contrast is less than this.  As you say, this display is more targeted at markets more concerned with accurate color reproduction and wide gamut, such as the film post-production industry.\n\n\nI don't know if they sell it anymore, but Sim2 also had a display based on BrightSide's technology:\n\n\n\thttp://www.engadget.com/2009/02/03/sim2-solar-series-infinite-contrast-hdr-lcd-ships-in-q2/\n\n\nI believe Toshiba and Samsung also used the technology (though illegally) in their locally dimmed LED+LCD displays.  I don't know which models or how capable the inputs are.\n\n\nUnfortunately, it's a bit of a waiting game right now for this technology to reach the consumer market.  We have some things in the works, as do others, but I couldn't tell you any details even if I had them.\n\n\nVarious researchers have built their own systems by combining a DLP projector with an LCD display with it's backlight \"hinged\" out of the way, a la the original paper by Seetzen et al:\n\n\nSeetzen, Helge, W. Heidrich, W. Stuezlinger, G. Ward, L. Whitehead, M. Trentacoste, A. Ghosh, A. Vorozcovs, \"High Dynamic Range Display Systems,\" ACM Trans. Graph. (special issue SIGGRAPH 2004), August 2004.\n\n\nFor my own use, I still have the HDR viewer I made over a decade ago:\n\n\nWard, Greg, \"A Wide Field, High Dynamic Range, Stereographic Viewer,\" Proceedings of PICS 2002, April 2002.\n\n\nBy far the easiest (and cheapest) solution for still images is to print out a grayscale version of the square root of your image (with maximum normalized to 1.0) as described in the above paper, but as a large-format print.  I would make this one the image with exaggerated contrast, since you can print it at high-resolution.  Then, project the original image divided by this grayscale image using a standard DLP or LCD projector -- preferably a bright one although it doesn't need to be high-resolution, onto this print.  Line it up, and violá!  You have a high-resolution, high dynamic range still image.  There's no way to make it move, sadly.\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2012-June/000415.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "June 01, 2012 at 07:54AM", "created_by": "Greg_Ward", "parent_id": "hdri_000414", "id": "hdri_000415"}