{"body": "Jeffrey McGrew wrote:\n\n\n> Rob Guglielmetti wrote:\n>\n> > And, yes, Linux is more fun (or any other kind of ix-like os), but you\n> > won't have AutoCad on Linux (if you don't start using AutoCad on Linux\n> > with Wine, which is afaik possible).\n>\n> Somewhat possible. It's a challenge from the research I've done, and\n> might not really work with the newer versions of AutoCAD. I know that\n> it doesn't work for Revit :'(\n\n\nIf in doubt, I'd rather recommend VMware (www.vmware.com).\nYou'll get a full Windows system of your choice running inside\nLinux, and the performance penalty is hardly noticeable. It's not\nfree, but after you paid $$$$$ for Autocad, the cost should be\nnegligible in coparison.\n\n\n\n\n> Hey, on another note, I can't get TORAD or RADOUT to work under\n> AutoCAD 2004/2005.\n\n\nI don't see why Torad wouldn't work, but I haven't tried that\nfor a very long time. If you're really that desperate, it will\nprobably only require minor changes.\nBtw. Rob: Torad is most likely the \"nifty LISP routine\" doing\nthe nested block unrolling. It's more than 10 years old.\nRadout is basically a rewrite of that functionality in C/C++.\n\n\nThe current Radout binaries won't work. The binary API has\nchanged between 2002 and 2004, which means that ObjectARX\napplications need to be recompiled against the new libraries.\nAlthough Autodesk recently forced me to upgrade (which brought my\nbudget into serious danger), I haven't yet found the time to do\nthat. Actually, after I had to replace my computer last month,\nI still need to get Vmware running again. Besides that, I'm not\nsure if I also need to get a current version of VC++, and there\nmay be a few other dependencies. In short, anyone buying a copy\nor Rayfront will help accelerate the process... ;)\n\n\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-May/001650.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "May 04, 2004 at 07:38PM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_001644", "id": "radiance-general_001650"}