{"body": "Mark de la Fuente wrote:\n\n\n> I'm after both.  (Renderings and falsecolor images mostly, but rtrace\n> calcs as well).  Not sure I understand why it's such a bad idea to place\n> an illum plane on the outside of a window.\n\n\nNeither do I... ;)\n\n\nIf you have windows with lots of subdividing geometry, then in\nmost cases the optimal solution is to turn each subpane into an\nillum. In cases where this would create too many illums, or\nillums with very non-rectangular shapes, it may be better to\nplace a big illum on the inside *or* the outside of the windows.\nNone of the two positions is inherently better or worse than the\nother.\n\n\nAdvantages inside:\n- Internal rays will hit the illum directly, which improves speed\n  and smoothness of the rendering.\n- You can make one or several illums per opening, depending on\n  how close it is to any other geometry (the farther away the\n  other geometry is, the larger the illum can be)\nDisadvantages inside:\n- Some of the rays cast by mkillum will hit your window geometry.\n  Depending on the number of sampling positions (s=) and the type\n  of geometry, this may negatively affect the accuracy (more or\n  less rays may hit window geometry than statistically justified).\n  Since the sampling positions are determined at random, this\n  effect is hard to predict, let alone to correct. The need to go\n  through the window geometry will also slow down mkillum to some\n  degree.\n\n\nAdvantages outside:\n- Since there is no obstruction by the window geometry, the\n  values generated by mkillum will be very accurate, and the\n  speed of the mkillum runs will only be determined by the\n  complexity of your exterior scene.\n- You can make one or several illums per opening, depending on\n  external obstruction. If one part of an opening is shaded eg.\n  by a tree, you can make that part an extra illum, which avoids\n  averaging between areas of different illuminance.\nDisadvantages outside:\n- Direct sampling from the inside will have to get past the\n  window geometry to hit the illums. This can affect both\n  rendering speed and accuracy. You can improve the accuracy by\n  suitable values for -ds and -dj (you should set those anyway\n  when using illums). You can also subdivide your illums in a way\n  that makes it more likely that their centers will be close to a\n  clear part of your window geometry.\n\n\nConsidering all that, I wouldn't hesitate at all to place your\nillum surfaces outside in your situation.\n\n\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-July/001959.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "July 31, 2004 at 01:35PM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_001957", "id": "radiance-general_001959"}