{"body": "Hi Tim,\n\n\nI think your answer is transmittance all the way.\n\n\nIf you take a look at the reflection equation, there's a term there for the transmitted indirect component, Tau(a)/pi*A(t).  A(t) is the indirect irradiance on the opposite side of the material (W/m2).  It's a similar story for diffusely transmitted direct components, except with Tau(d).  So, the luminance of the transmitted component is determined by Tau, with no additional factors relating transmissivity to transmittance.  This is the same Tau (Td) that was referred to in Rob's message from yesterday.\n\n\nI don't know whether this makes any sense for anyone, but the result is that you're looking at transmittance, not transmissivity.\n\n\nPhil.\n\n\n>>> Tim.Hanson at arup.com 10/03/2004 1:26:26 am >>>\nHi Rob - and others,\n\n\nPlease can you clarify the following re- trans material, as myself and my\ncolleagues have been arguing over whether to use transmission or\ntransmissivity for diffuse transmission and/or specular transmission when\nsetting the parameters for the trans material based on radiance tests.\n\n\nDo you consider transmissivity of the diffuse transmittance only, and use\nthe pure transmission of specular component?  The reason I ask is that we\nset up a small test which measures the luminance of a trans material and the\noverall light transmission through a trans material with different settings.\nUsing a specular transmission (Rs) of 0.5 (50%) - i.e. not converting to\ntranmissivity, and NO diffuse transmission/transmissivity, we get exactly\nhalf the source luminance on the side opposite the light source on the trans\nmaterial using rtrace.  i.e. tranmissivity not used for specular component.\n\n\nWorking out the diffuse transmission is a little more tricky, but looking at\nthe maths behind the settings for the trans material, I don't quite\nunderstand whether transmissivity or transmittance should be used - it\ndepends on how the internal workings of radiance interprets the parameters\nand therefore I can't be sure.\n\n\n(As I understand, transmissivity is the proportion of light that travels\nthrough the medium before inter-reflection within the medium).\n\n\nSo - the question could be written :\n\n\nDo I use specular transmission with diffuse transmissivity when setting the\ntrans parameters?\n\n\nAlso - if transmissivity is used for the transmitted light, why is a factor\n(such as transmissivity) not applied to the reflected part also (due to\ninter-reflections)?\n\n\nThanks for any insight - I know there's been many questions and answers on\nthis subject, but I'm still confused!\n\n\nTim\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-March/001509.html).</sup>", "attachments": [], "created_by_name": "Phillip Greenup", "created_at": "March 09, 2004 at 11:57PM", "created_by": "Phillip_Greenup", "parent_id": "radiance-general_001504", "id": "radiance-general_001509"}