{"body": "P.S.\n\n\nThe GitHub mirror is synced with CVS HEAD hourly, and is merged to the \"combined\" branch:\n\n\nhttps://github.com/NREL/Radiance/tree/combined\n\n\nThe releases posted on the NREL GitHub site reflect the release state of LBL's main site. So yes, 4.2.2 is the latest official release\n\n\nhttps://github.com/NREL/Radiance/releases/tag/4.2.2\n\n\nWhen we make new pre-release (HEAD) packages on GitHub, we add an increment to the tail end of the package name, so \"5.0.a.1\" is the first package NREL made with the HEAD release after the source had been bumped to v5.0a. Sometime real soon now (I swear) we'll be able to build HEAD on Windows, and I'll make a 5.0.a.2 release tag, which will include a Windows installer.\n\n\nhttps://github.com/NREL/Radiance/releases/tag/5.0.a.1\n\n\nThere is also a Radiance community page on Facebook...\nhttps://www.facebook.com/RadianceSimulation?fref=ts\n\n\n\n\n\n\nOn 4/23/15, 11:18 AM, \"Guglielmetti, Robert\" <Robert.Guglielmetti at nrel.gov<mailto:Robert.Guglielmetti at nrel.gov>> wrote:\n\n\nHi Rick,\n\n\nradiance-online.org is still the home of Radiance. It's there where you can find all the old links, and the source code repo on CVS (which Dan Fuller just linked to). That is home base. The GitHub thing is simply a mirror of the CVS repo, and from time to time I make Radiance installers and host them there. It's purely out of convenience for the OpenStudio project, so that users have access to recent versions of Radiance on all platforms.\n\n\n- Rob\n\n\n\n\nOn 4/23/15, 11:04 AM, \"Boettger, Richard G. (JSC-SF)[WYLE INTEG. SCI. & ENG.]\" <richard.g.boettger at nasa.gov<mailto:richard.g.boettger at nasa.gov>> wrote:\n\n\nI'm confused about Radiance development. In the past I would go to the radiance-online.org site to get the latest release of Radiance. Has development and access to the latest source code moved to GitHub? Is the latest official release 4.2.2? Sorry I've been out of the loop for a while.\n\n\nThanks,\nRick Boettger\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-April/010851.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "April 23, 2015 at 10:33AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_010848", "id": "radiance-general_010851"}