{"body": "Hello everybody!\n\n\nI appreciate your help and responses.\n\n\nGreg,\n\n\nI've been checking histograms with CANON Digital Photo Professional. I was\nchecking L channel, I guess I need to make sure RGB values are below 200 as\nwell. Are there any suggestions on this issue?\n\n\nMartin,\n\n\nThat is a very interesting suggestion! I guess I can see the difference\nbetween the measurements of two light sources.\n\n\n>> ..the photopic sensitivity curve V(lambda) currently used is incorrect.\nIt underestimates blue wavelengths quite a bit.\n>> You should really use a CCD camera with a photopic filter to get better\nvalues..\n\n\nYou say that V(lambda) underestimates the values. But doesn't CCD camera's\nphotopic filter have the same response curve? So, it would have the same\nmistake.\n\n\nLars,\n\n\n>> Did you derive the response curve of your camera using another setup\n(not the directly visible LED) and reuse that camera response later on your LED\ncaptures? Or do you take the camera response from the same set of images\n(showing the LED in an otherwise dark room) that you are going to assemble\ninto a HDR?\n\n\nI've tried two approaches. The first one is to derive the response curve\nfrom the scene with very dark and bright areas with smooth gradients\nand neutral colors. Then fuse them to obtain RC. And then I've used it in\nphotosphere for subsequent HDRIs. And the second one is to fuse raw images\nwith Greg's script raw2hdr, where you don't have to have response curve.\nGreg: \"The raw2hdr script doesn't need to derive a response curve, since\nthe sensor data is linear.  Instead, it creates an output from dcraw that\nfollows a 2.0 gamma and creates an artificial response curve of x^2 to\ndecode it.  This reduces quantization errors from the 8-bit intermediate\nimages\". And then I can analyse my hdr image in Photosphere.\n\n\n\n\nThank you,\n*Yulia Tyukhova*\n*\n*\nFulbright Scholar, \"Intern LC\"\nArchitectural Engineering Graduate Student, UNL-Omaha, NE, USA\nB.E. and M.E. in Lighting Engineering (MPEI), Moscow, Russia\njtyukhova at yahoo.com\nytyukhova at unomaha.edu\n+1 (402) 996 0910\nPKI 247\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2012-March/000389.html).</sup>", "attachments": [], "created_by_name": "Yulia Tyukhova", "created_at": "March 02, 2012 at 09:14AM", "created_by": "Yulia_Tyukhova", "parent_id": "hdri_000385", "id": "hdri_000389"}