{"body": "Hi Anne,\n\n\nOn my computer the text on your charts show up as black squares.  But I think I can still provide some relevant advice.\n\n\nGenerally speaking, subdivision of the window for the three phase method is only necessary when there are nearby external obstructions or for intermediary blind positions.  But your case is unusual - your sensor point is so very close to the window.\n\n\nWhen generating the view matrix we typically use a light material for the window.  Direct (deterministic) sampling is used to calculate the window's contribution.  The direct sampling algorithm will automatically divide a light source according to the -ds parameter, however the maximum number of divisions is limited to 64 (as determined by the variable MAXSPARTS in source.h).  Given the proximity of your sensor to the window I don't think 64 direct samples will accurately map the window's outgoing klems divisions to illuminance contribution at your sensor.  Manually subdividing the window is one approach.  Though rather than horizontal bands I'd suggest a pattern of squares that is finer near the sensor and corse away from the sensor (see ascii art below).  You also want to set -dt 0 and -dc 1. \n____________________\n|              |__|__|__|              |\n|______|__|__|__|______|\n|              |                |              |\n|______|_______|______|\n\n\nAlternatively you could consider using ambient sampling to sample the window.  You could try using a glow material for the window and set -ad 2000 or higher.  Roughly half the initial ambient sample rays would hit the window (because your sensor is nearly against the window).  -ab can be low and -lw should be less than 1/ad, probably 1/ad^2.   I've never tried this, so I don't know how well (or if) it'll work.\n\n\nIf it were me, I'd give the glow material a try.  It seems much more elegant and now that I think about it, it might be a better approach for some spaces.\n\n\nGood luck,\nAndy\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2011-April/007792.html).</sup>", "attachments": [], "created_by_name": "Andy McNeil", "created_at": "April 28, 2011 at 10:38AM", "created_by": "Andy_McNeil", "parent_id": "radiance-general_007791", "id": "radiance-general_007792"}