{"body": "On Jan 22, 2009, at 9:17 AM, Greg Ward wrote:\n\n\n> Yes, well I was thinking much more along the lines of what Rob has  \n> already done, that is provide a means to graphically confirm a  \n> luminaire's output distribution in a Radiance context.  I.e., it  \n> should take ies2rad output, not reinterpret the IES file, as Zack  \n> and others have noted that ies2rad itself is occasionally suspect.   \n> Also, having the Radiance coordinates as a final check of placement  \n> in the scene is often useful.\n\n\nI agree, it might be nice to simply add a grid to the planes in ltview  \nwith some labels on it.  As long as the user knows the default view  \nit's self-explanatory, but having labeled grids in the view would  \nallow one to create rendering/snapshots of the distributions for  \ndocumentation.  And yes, that is exactly why I made ltview, is to  \nconfirm the ies2rad output.  I wanted to see exactly what radiance was  \ngoing to \"see\".\n\n\n>\n> I don't use IES files that often myself, which is probably why I  \n> have never spent much time on this.  I just thought a false color  \n> fisheye image might be an interesting way to confirm the IES file  \n> was being loaded and interpreted and placed correctly.  Sounds like  \n> there are enough tools out there already, though.\n\n\nAnother cool thing would be to create a 3D mesh from the  \ndistribution.  Several years Erco Lighting did a project where they  \ncreated volume models of their light fixtures' distributions and then  \nrendered them in Lightscape.  It was very cool.  I'd assume vwrays  \ncould somehow be used to do something similar, but I don't know.   \nFalsecolor fisheye could be useful though, too.\n\n\n- Rob\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-January/005702.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "January 22, 2009 at 08:29AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_005690", "id": "radiance-general_005702"}