{"body": "Hello Tom,\n\n\nSince I've been mentioned by name, I thought I'd reply :). As far as I \nknow, no GUI is perfect for your study right now, but since you are \nusing DIVA, here are some thoughts about how you could proceed.\n\n\n  * DIVA does have support for the photon map extension through rendered\n    images. Under Advanced Parameters, just click 'Run Photon Map.' This\n    will turn Radiance into a forward ray tracing mode. I have been\n    meaning to for a while, but have not implemented this on the rtrace\n    / sensor-based calculation side yet. I recommend to set the photon\n    port material to the specular material you are using to reflect rays.\n\n\n\n\n  * Another option is to use a mirror material to track the locations of\n    solar reflections as per this presentation by Stephen Wasilewski\n    <http://radiance-online.org/community/workshops/2015-philadelphia/presentations/day3/150816_radconf_wasilewski.pdf>.\n    The advantage is that standard Radiance can be used, and the method\n    will work in renderings and grid-based calculations in DIVA. The\n    downside is that having many mirror materials in a scene will make\n    the calculations substantially slower. If your glare-causing facade\n    is curved, you will need to turn it into faceted pieces before using\n    this method.\n\n\n  * Finally, Ji references our paper on reflected solar glare\n    <http://asd.sutd.edu.sg/dcc/papers/Jakubiec,Reinhart_2014_AssessingDisabilityGlarePotentialDueToSpecularReflections.pdf>.\n    This was using standard Radiance renderings for a single point of\n    view (you can assign multiple points of view in DIVA and run them\n    with one command). We just rendered images for every 10 minutes of\n    sunlit time in the year and used pcomb to combine them into spatial\n    time maps (see Figures 5 and 6 in the paper). I guess you are\n    primarily a GUI user from your post; however, I'd be happy to share\n    the old scripts with you if they might be useful.\n\n\nBest regards,\n\n\nAlstan\n\n\n\n\nJ. Alstan Jakubiec\nAssistant Professor\nArchitecture and Sustainable Design\nSingapore University of Technology and Design\n8 Somapah Road, Singapore 487372\ntelephone: +65 6499 4530, e-mail: john_jakubiec at sutd.edu.sg\nDesign for Climate and Comfort Lab <http://asd.sutd.edu.sg/dcc/> | \nprofile <http://asd.sutd.edu.sg/faculty/j-alstan-jakubiec/> | DIVA \n<http://diva4rhino.com/> | Opaque Materials Database \n<http://lighting-materials.com/>\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-November/011984.html).</sup>", "attachments": [], "created_by_name": "Alstan Jakubiec", "created_at": "November 12, 2016 at 09:08PM", "created_by": "Alstan_Jakubiec", "parent_id": "radiance-general_011966", "id": "radiance-general_011984"}