{"body": "On 04.02.2006, at 17:44, Christian Fusenig wrote:\n\n\n> Hello @all,\n>\n> 1. Problem\n> I got Auto CAD 2005 files of studio equipment, like video monitors,\n> edit desks etc. from a company. I want to work with them in Radiance.\n\n\nAre they any good? Can you share them? ;)\n\n\n[details about 'radout' snipped]\n\n\n> But now i have a '.rad' file with hundreds of polygons and its\n> impossible to give them the right material, because i don't know\n> where they belong to. If i create one material and apply it to all\n> polygons, i can see the model.\n\n\nI don't know 'radout' but I expect it will set the modifier\n(\"material\") according to the layer of the object. If your\nCAD model had only one layer your exported *.rad will have\nonly one material.\n\n\n> How is it possible to get different 'layers' in the file\n> like the body of a monitor and the screen separately ?\n\n\nThat's a problem of AutoCAD and your model. If you have\n\"color\" in your model when you open it in AutoCAD you can\nselect elements \"by color\" and copy/move them to a new\nlayer.\n\n\n> I have the feeling that even a simple box is subdivided in lots of\n> polygons. Do i have to modify may CAD files in a special way ?\n\n\nPolygons (most likely triangles) are the universal \"currency\"\nof geometry interchange. You can try to export \"solids\" to Radiance\nprimitives (dxf2rad does that iirc) but this is limited to real\nspheres, cylinders etc. which are rarely used in complex objects.\n\n\nYou could try to find \"box\" entities in the CAD file and generate\na \"!genbox\" command for it but that will ulitmately expand to six\npolygons as well (quads in this case). There is little you can do\nin the DXF file.\n\n\n> 2. Problem\n> I tried to import a 'Poser 3D' model of a character with 'dxf2rad'.\n> I followed the instruction of the 'RwR' book on p. 422, but the  \n> command :\n>\n> $ dxf2rad  -i figur.dxf -orad figur\n>\n> doesn't really work. When i execute:\n>\n> $ dxf2rad   figur.dxf   figur.rad\n>\n> i end up like in my first problem. I have hundreds of single polygons\n> with no specific name and the same identifier.\n\n\nYou can find an online version of the man page for dxf2rad here:\n\n\n     http://www.schorsch.com/download/dxf2rad/manual.html\n\n\nPerhaps the two versions are different but according to this man\npage your second command is correct (and works as you describe).\nYou can find examples near the end.\n\n\nAbout the modifiers there is this section right at the start:\n\n\n     Output primitives will have modifiers based on the layer of\n     each entity in the form \"l_<layer>\". Floating layers within\n     blocks are fully supported.\n\n\nThis means that you have to split elements in your CAD model\naccording to the desired material to different layers. If you\nhave a wooden chair with a leather cushion you have to copy all\nelements (\"faces\", triangles, boxes, whatever) of the cushion\nto a layer called \"leather\" and the rest to a layer called \"wood\".\n\n\nSave only these two layers to the DXF file. Use dxf2rad on\nthis file and you will get a *.rad file with two modifiers\n(\"materials\"): \"l_leather\" and \"l_wood\".\n\n\nThe Radiance geometry file format requires a modifier for\neach polygon so 'dxf2rad' has to make one up for the export.\nIt uses the layer name (as most would do if confronted with\nDXF) as replacement for the material. You still have to\nprovide a valid definition for this material:\n\n\n     # bright leather (hornbeam_wood actually ;)\n     void plastic l_leather\n     0\n     0\n     5 0.61 0.47 0.29 0 0\n\n\n     # dark wood: elm_wood\n     void plastic l_wood\n     0\n     0\n     5 0.46 0.27 0.13 0 0\n\n\n\n\nAdd these lines at the top of the file and you should\nhave two materials in the object.\n\n\nYou can find some r,g,b values on this page:\n\n\nhttp://www.learn.londonmet.ac.uk/student/resources/radiance/ \nmaterial_db.shtml\n\n\n\n\nhth,\n\n\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-February/003350.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "February 04, 2006 at 08:52PM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_003349", "id": "radiance-general_003350"}