{"body": "Jack de Valpine wrote:\n\n\n> Hi All,\n>\n> Here are a few more thought to add.\n>\n>    * 3ds - this format has some limitations in data size/allocation. I\n>      have noticed on big models that have a lot of geometry, 3dsout\n>      from Autocad will stop on large entities. One thing to consider\n>      would be writing a script (autolisp) and using 3dsout on a per\n>      layer or per color basis, though this still may not work on large\n>      entities.\n\n\nRevit tends to make models with lots and lots of surfaces and \ninformation. So this could very well be the limitation I'm hitting.\n\n\n>    * Max and objects converted to 3ds - there are lots of objects out\n>      in the 3D marketplace that are sold in multiple formats, some of\n>      these are actually modeled in Max and then converted to other\n>      formats. One problem that I have noticed with models created in\n>      Max is that because of the way Max deals with coordinate systems\n>      on a per object basis, models exported to other formats such as\n>      3ds do not always have things transformed correctly. I think that\n>      this must be a problem with the way Max deals with exporting to\n>      other formats. For example, I bought some nice 3D car models in\n>      3ds format, in a few of them the wheels where not in the right\n>      location when I viewed the model.  PLEASE NOTE - I am not a Max\n>      user, but I have worked with customers who use Max, and it is a\n>      huge @#%$%^#$% pain in the @#%$$#$% to get things converted into\n>      something useful.\n\n\nHuh, that's not good to hear. The only reason Max is even in the mix for \nme is as a overblown file converter, really. I'd much rather prefer \ngoing to Blender, but Blender's DXF import functions seem not-so-good \nand aren't being done via it's Python API, but instead has been written \ninto it's code,\n\n\n>    * Polytrans - my latest effort at find a decent 3D conversion tool\n>      finally lead me to purchase Polytrans from Okino\n>      (http://www.okino.com/conv/conv.htm) along with the cad-pak\n>      module. I have used this for a few different things (though there\n>      are some minor problems with the native autocad dwg as they use\n>      opendwg vs native dwg). The nice things is that I now have a\n>      reliable way to export directly to obj!\n\n\nI wish this was viable option. See, Revit has materials in it already, \nand it's very handy to assign materials therein because then they relate \nparametrically to what materials show up in your Deliverables (for \nexample, drywall looks like drywall in section and elevation), and they \ncan participate in Structural Analysis. It's only that the rendering \nabilities of Revit are grossly limited via Accurender (it's built-in \nrendering engine) that I'm looking to use other tools with it. Now, \nRevit's exporting to DWG/DXF is really intended for sending 2D and 3D \nmodels out to consultants. Revit places things into layers based upon \nwhat they are, not by what material they are, but it does include the \nmaterial information as X-data. 3D Studio knows how to read this data, \nso that when you bring in a model from Revit the materials are intact. \nMost other programs don't read this data, and so you wind up with a nice \nmodel, but one without materials already mapped, meaning you have to \nduplicate work and waste a lot of time. Theoretically you could write \nyour own DXF2RAD converter that understood the x-data as well, that \ncould produce a RAD file, materials intact. But no one has yet, and I \ndon't have the time right now to learn how to take something like the \nPython DWG/DXF routines that are available and edit them for this sort \nof use.\n\n\n>    * 3Dwin4 and Accutrans3d - I have used the former with some success\n>      and heard of the latter. You will have to do a search on where to\n>      find them. These are shareware\n\n\nI will give them a try, but again, I'd like a model with materials if I \ncan get it.\n\n\n>    * Revit - As far as this is concerned, I have always thought that\n>      this must be a pretty great tool. However, I have never used it\n>      for production for the very reason that it seemed extremely\n>      difficult to get geometry out. This being said though, I have\n>      heard from relatively reliable sources that they are working on\n>      this, on the other hand though I think that in the bigger picture\n>      they are trying to determine the best way to fit Revit into their\n>      overall product mix.\n\n\nIt's a fantastic tool for Production, if the majority of what you do is \ntypical Document sets, like Schematics, CD's, that sort of thing. If the \nend result is a PDF or printed paper, Revit is really, really keen. \nHowever, it only exports to DWG, DXF, and SAT. And only the DWG/DXF \noption retains materials (it's a long story) and so you're dead on in \nassuming that it's not the best tool for creating 3D models in whatever \nformat you might want. The pain here is that it does create very nice \nand detailed models very quickly. It's just a pain to get them out into \nsome other format. Now with 3D Studio's new ability to talk to Revit \n(somewhat indirectly, but still) there are a lot more options available, \nand I'm hoping that it might lead to an easy and fast Revit -> Radiance \nbridge of some kind.\n\n\nI got into Radiance a while ago, but because of this difficulty of using \nRevit models with it I haven't gotten the chance to do too much 'real \nwork' with it. I'm just a designer looking for a better rendering \nengine, really, not a lighting or analysis person.\n\n\n>    * Outsource Development of custom exporter - Depending on need and\n>      how much you use Revit it might be worth it to consider\n>      outsourcing the development of a native exporter. I have no idea\n>      what the Revit api is like though so not really sure what would be\n>      involved. You might check out: www.4d-technologies.com,\n>      www.fpsols.com, www.sycode.com\n\n\nI use Revit a lot, however I'm currently just one guy doing his own \nprojects and helping others out with Revit stuff. I might take a job \nwith a huge firm tho, to help them with their transition to Revit, and \nas such might have a lot more resources available to me. The Revit API \nis all .NET based, so any .NET language would work (sadly :P). I've had \nenough time to find out the the API allows for something like a Radiance \nexporter to be made (I think) but not enough time to actually learn how \nto make one (again, just a designer, not a programmer, sadly).\n\n\nThanks for all the great info, I've got some research to do! If I figure \nout a quick way to go from Revit to Radiance I'll definitely post it here.\n\n\nJeffrey McGrew\n\n\nBecause We Can, LLC\n(415) 505-4689\nwww.becausewecan.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-December/003164.html).</sup>", "attachments": [], "created_by_name": "Jeffrey McGrew", "created_at": "December 21, 2005 at 07:06PM", "created_by": "Jeffrey_McGrew", "parent_id": "radiance-general_003151", "id": "radiance-general_003164"}