{"body": "Hi Sandeep,\n\n\nDid you include the falsecolor rendering so as to say, \"I'd like to render something like this?\"  Otherwise, it looks like you already figured it out.  Where did you get the image?\n\n\nIf you want to render a hemispherical fisheye projection but not in false color, you can use the following command to create a set of component images:\n\n\n\tvwrays -vth -vp 0 0 0 -vd 0 0 1 -vu 0 1 0 -vh 180 -vv 180 -x 512 -y 512 | rfluxmtx -fac -x 512 -y 512 - rh4sky.rad\n\n\nwhere \"rh4sky.rad\" contains:\n\n\n###############\n#@rfluxmtx h=u o=rhsky%04d.hdr\n\n\nvoid glow groundglow\n0\n0\n4 1 1 1 0\n\n\ngroundglow source ground\n0\n0\n4 0 0 -1 180\n\n\n# Sky glow inherits previous o= setting\n#@rfluxmtx h=r4 u=+Y\n\n\nvoid glow skyglow\n0\n0\n4 1 1 1 0\n\n\nskyglow source sky\n0\n0\n4 0 0 1 180\n\n\n###############\n\n\nThis will create 2306 uncompressed picture files in the current working directory.  On some machines, you need to increase the number of open files allowed.  Honestly, I don't know how to do this under Windows or if it's a problem.\n\n\nIf you prefer an angular fisheye, which would include visibility of the ground in the corners, change \"-vth\" to \"-vta\" in the vwrays command.\n\n\nTo generate a particular sky, use genskyvec with dctimestep like so:\n\n\n\tgensky 11 2 12:30 [meridian, latitude, etc.] | genskyvec -m 4 | dctimestep rhsky%04d.hdr > sky11_2_1230.hdr\n\n\nIf you then want to convert this to a false color representation, you can use:\n\n\n\tfalsecolor -i sky11_2_1230.hdr -log 5 -s auto | ra_bmp > sky11_2_1230fc.bmp\n\n\nI just want to add that using rfluxmtx to generate 2306 uncompressed pictures, each of which has just a few white pixels, is pretty wasteful of CPU time and disk space.  You can run each of the images through \"ra_rgbe -r\" to reduce their size, but the calculation is still pretty bad.  There are better ways to do it, but none that are very convenient.\n\n\nI should also mention that there was a bug that was recently fixed related to the numbering of output pictures in rcontrib, so you will need to have the latest HEAD release for all this to work.\n\n\nCheers,\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-November/011963.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "November 02, 2016 at 11:03AM", "created_by": "Greg_Ward", "parent_id": "radiance-general_011962", "id": "radiance-general_011963"}