{"body": "Lars O. Grobe wrote:\n>> building.  Applying mkillum avoids this error, besides accounting for\n>> the framing of the window panes and the circular shape of the opening.\n>>\n> \n> Hi,\n> \n> to recall what this is about, Greg suggested to use one illum surface \n> covering the whole of a window made of small panes fixed in stone frames \n> (I sent an URL pointing to a mini-pdf showing that in detail).\n> \n> Now I wonder... afaik the window frames will disappear in the indirect \n> calculation, as the average over the whole covering surface is used as \n> source, right (of course the frames are counted when calculating this \n> average)?\n\n\nYepp, right.\n\n\n\n\n> So shadowing from these frames will only be visible when \n> windows are hit by a dircet source (the sun), while those frames e.g. on \n> the north walls won't cast shadows. The only way to change this would be \n> to use subdivisioning of the illum surface.\n> \n> Am I right here? I have to decide that modeling topic now, and I am \n> still not really sure about it. If I have to use subdivided illum \n> surfaces, I think that manually defining each pane as ONE illum surface \n> (so that subdividing would not be necessary any more) is better than \n> making a subdivision that doesn't exactly fit the panes.\n> \n\n\nThe other way round, if you do the subdivision manually, what reason \nshould there be to deviate from the original window geometry ?\n\n\nThe other question is, if the whole effort pays off. The frames look \nsmall in comparison to the 'window' openings in your sketch, so if this \nstructure is hit by diffuse daylight, you probably won't see any \ndistinct shadowing effect from the frames in RealLife(TM) either, but \nrather a bright, blurry diffuse patch on the floor, except perhaps in \nthe extreme vicinity of the frames. It might suffice to model the bottom \nrow or two rows separately to deliver a bit of the effect a viewer \nexpects to see (regardless if it is really there or not..)\n\n\n-cb\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-July/001907.html).</sup>", "attachments": [], "created_by_name": "Carsten Bauer", "created_at": "July 09, 2004 at 04:37PM", "created_by": "Carsten_Bauer", "parent_id": "radiance-general_001871", "id": "radiance-general_001907"}