{"body": "I'm not a researcher, so pls. take this into account when reading my \nconsiderations:\n>  \n> 2) In some references, it is mentionned that I should always capture \n> LDRs with a Daylight white balance.  Is this the general agreement?  \n> Even if my scene is lit with tungsten lights?\nIn my operating experience, it is easier to control color (workflow) - \neven if there are no \"outside\" image areas.\nThough, you can always correct WB in HDRShop (->Pixels->WB selection)\n>  \n> 3)I found limited explanation on how the camera calibration curve \n> would affect the results in HDR Shop.  I would have to think  that \n> this is to linearize the color values (remove the effect of Gamma + \n> CMOS response) so luminance measurements can be actually applied to \n> the colors later on.\nThis is also my understanding.\n>  \n> 4)HDR Shops refers to Fstops in the UI.  However,  I read that you \n> want to maintain Fstops constant and only change the shutter speed.  \n> The problem I  have is that the interpreted Fstops of HDR Shop turn \n> into some \"arbitrary\" numbers and I can't really type-in the values \n> used by my camera.\nI personally would be interested to see, how far Photomatix would \nsupport you with this task:\nThe new version reads EXIF data, resulting in \"normalized\" HDR images. \nBasic idea behind is to make tone mapping in a panorama workflow easier, \nbut it should also make your task easier reproduceable.\nI didn't invest much time to test this functionality, but as far as i \nfound out, it turned out to be useful when using panos for IBL (i don't \nhave to fiddle that much with exposure correction)...\n\n\nBest regards\nBernhard\n\n\n\n\nBernhard Vogl\nVienna, Austria\nhttp://dativ.at\nhttp://www.austria-360.at\nTutorials: http://www.dffe.at\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2006-September/000137.html).</sup>", "attachments": [], "created_by_name": "Bernhard Vogl", "created_at": "September 26, 2006 at 11:19PM", "created_by": "Bernhard_Vogl", "parent_id": "hdri_000135", "id": "hdri_000137"}