{"body": "On Nov 11, 2006, at 11:14 AM, Mark de la Fuente wrote:\n\n\n> I find people understand the blue - red scale as well.  Since  \n> falsecolor images are usually presented to clients, having \"bloody\"  \n> pictures is often a very effective communication tool.  Probably  \n> some psychological thing that dates back to hunting mammoths saber  \n> tooth tigers!\n\n\nI agree with the red=danger aspect; it's one of the things I like  \nabout the scale.  Blue is calming, red is alarming.  And another  \nthing: clients freak out enough with the few colors we show them  \nsometimes; adding more color to the mix may make things worse.  John,  \nI can see where you are coming from (Greg too), and I think both  \nscales have merits.  THanks Greg for adding the \"-spec\" option.\n\n\n>\n> I suppose in Radiance one could to a pextrem command on a picture  \n> to get the maximum value and then use that to set the scale, but  \n> having it spit out something like the following can be a little  \n> intimidating.  :)\n>\n> 499 499 0.000000e+00 0.000000e+00 0.000000e+00\n> 322 218 2.706250e+01 2.693750e+01 2.706250e+01\n>\n> I've tried to use this before, but have come up with numbers I  \n> don't feel comfortable using.\n\n\n\n\nHmmm, what do you mean, you don't feel comfortable with these  \nnumbers?  I use pextrem all the time in conjunction with falsecolor.   \nIf you simply run 'pextrem -o' on a radiance image and multiply the  \ngreen channel of the high pixel by 179, you have your maximum value  \nfor the -s option.\n\n\n\n\n>\n> Seems like a \"-s max\" setting would be useful.  Where setting the  \n> scale to \"max\" would automatically check the image and set the  \n> scale to the max pixel value automatically.\n\n\nyeah, and this is probably easy for anyone who doesn't suck at  \nprogramming, as I do.  I just spent longer than I care to share  \ntrying to add such an option to falsecolor.  It should be easy, but I  \ncouldn't sort out what values to use for certain variables.  Greg has  \nalready done a lot of the work, since the -e option already has code  \nto run pextrem to find the max (and min) values and assign them to  \nvariables within the script (falsecolor is actually just a shell  \nscript).  But I don't know how the scale option gets applied to the  \nlegend.  (Greg, I can share with you what I have so far, if you wanna  \ntake it the rest of the way. )\n\n\n- Rob\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-November/004098.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "November 12, 2006 at 06:21AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_004091", "id": "radiance-general_004098"}