{"body": "P.S.\nbsdf2rad is built automatically when you use the CMake build system, and is included in the installers we make at NREL. Package updates are LONG overdue, I know, but the current HEAD has all the changes to CMake to build and install bsdf2rad. I suppose another thing that's long overdue is a HOWTO on how to use the CMake build files in the Radiance cvs. :-/\n\n\n- Rob\n\n\nOn 4/8/14, 3:54 PM, \"Chris Coulter\" <Chris.Coulter at BuroHappold.com<mailto:Chris.Coulter at BuroHappold.com>> wrote:\n\n\nIs there any trick to compiling/using bsdf2rad? I’ve compiled from the HEAD as recent as 3/18 and it did not get compiled and/or copied over.\n>From my build, all make did was copy the following files from the ray/src/cv directory: ies2rad nff2rad lampcolor tmesh2rad obj2rad mgf2rad rad2mgf mgf2meta mgfilt mgfinv 3ds2mgf pabopto2bsdf bsdf2ttree bsdf2klems pkgBSDF epw2wea\nI see that bsdf2rad is listed in the Rmakefile under ray/src/cv, but not included in the “PROGS” listing (the files above are). Does this need to get edited to properly install bsdf2rad?\n\n\n\n\nWhat is the usage of bsdf2rad? I don’t see any man page online and didn’t find one with the typical documentation in the build.\n\n\n\n\nAny help/suggestions are greatly appreciated.\n\n\nChris\n\n\nChris Coulter\nSenior Lighting Designer\nBuro Happold Consulting Engineers\n100 Broadway, 23rd Floor\nNew York, NY 10005\nTel: 212.334.2025\nDirect: 212.616.0254\nEmail: chris.coulter at burohappold.com<mailto:chris.coulter at burohappold.com>\nWebsite: www.burohappold.com\n\n\n\n\nThis transmission is confidential and intended solely for the person or organization to whom it is correctly addressed. If you are not the intended recipient of this transmission, you should not take any action in reliance on it. Further, this transmission may contain confidential design and other information owned by Buro Happold LtdConsulting Engineers, P.C. (“Buro Happold”). You should not copy, distribute, use, offer for sale or hire such information or in any way infringe the design and intellectual property rights of Buro Happold Ltd. It is intended that communication by email from Buro Happold .Ltd or its employees is limited to communications connected to the services provided by Buro Happold Ltd. Buro Happold Ltd accepts no liability for any communications not connected to the services it provides. Computer viruses may be transmitted or downloaded onto your computer system via email communication. It is the recipient’s responsibility to take any action necessary to prevent computer viruses being transmitted in this way. Accordingly, Buro Happold Ltd disclaims all responsibility which arises directly or indirectly from such transmission of computer viruses. Buro Happold Consulting Engineers, P.C.Ltd.. Registered in England: 2049511 New York State, USA. Registered Office: 100 Broadway 23rd Floor, New York, NY 10005. If you receive this message in error, please notify the sender by return e-mail immediately and delete this message, any attachments and all copies from your system.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2014-April/010206.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "April 09, 2014 at 07:35AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_010202", "id": "radiance-general_010206"}