{"body": "Hi,\n\n\nChristopher gave you the formulae. To understand the difference, the definitions in RwR are quite useful. To make it easy to understand, the transmittance is what you can measure from a real, physical sample. It is light out / light in. Simple. But as we know, there are more effects then absorption affecting the transmittance, namely it is not only the body but also the surfaces of it (the interface between the solid and, e.g., air) which influence the amount of light traveling through a dielectric object. These surface effects, depending on the index of refraction of the solid and surrounding media, tell you about the light which is reflected. This happens both at the outside of a glass pane (which is what you see when looking at your mirror image in the subway while in a dark tunnel) and at the inside, which is used e.g. for transmitting light through optical fibre. I am sure that you can get a better explanaition from any physics book. So what this means is that while the!\n  transmissivity of a cube of glass would be constant wherever it is, its transmittance would change when surrounded by air, water or oil, due to the different refractive indices of the surrounding media.\n\n\nNow why is it that complicated, why do trans and glass expect different characteristics?\n\n\nRemember that glass is just a handy way to model thin dielectric surfaces for windows. This means that a lot is known that would have to be modeled for a generic material as trans. A window glass has a known refractive index as the surrounding media (air) has, the approximate light transport by in the material can be estimated. So you just give the materials property as what light is NOT absorbed when traveling through it once, the surfaces' influence can be calculated by the software.\n\n\nTrans is generic, it could describe a thick block of material, or a material with any refractive index. So the software needs the information on what happens on the surfaces - so you need to know how much light is reflected. In other words, you are the one measuring or calculating the reflectance, radiance expects the result and thus does not have to care about the refractive properties any more.\n\n\nHowever, I would still refuse to take trans as the counterpart for glass - better look at dielectric. This is actually the more generic type for glass, and it again allows you to define the refractive indices of the object and the surrounding media. Other than trans, it will use these to calculate the surface effects. But other then glass, it HAS to calculate them according to the thickness, and refractive indices as given, and cannot assume a simplified model with a thin object and standard refractive properties. So again, you have to give the transmissivity. Other then for glass, it needs to be defined per unit length - while the surface properties only depend on the refractive indices, the absorption depends on the thickness, or betther on the length that light travels through the material.\n\n\nSo it is all about using the appropriate modifier for the given task. Glass for thin glass surfaces in air, dielectric for thicker dielectric surfaces or objects which are not surrounded by air (then you need the interface modifier and dielectric), and trans when you know from measurements or calcultation the reflective properties and need the additional parameters and do not need the optimizations of the others. The rest can be found in literature on physics and optics. As I surely made some mistakes while typing the above late at night, I would recommend some good book instead as this is not specific to Radiance.\n\n\nCheers,\n\n\nLars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-December/006435.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "December 20, 2009 at 04:59PM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_006380", "id": "radiance-general_006435"}