{"body": "It's a great question, and I think Lars and Germán summarized the differences pretty well.  The bottom line is that you can take almost any renderer and add the needed features and capabilities to make it physically accurate, but there is little economic motivation to do so.  The main, important difference between Radiance and other tools is the dedication of this community to keeping the focus on accuracy every step of the way.\n\n\nThis discussion reminds me of an interesting study performed by Christoph Reinhard and Pierre-Félix Breton, comparing Daysim to Autodesk 3ds Max.  They found that 3ds could in fact simulate the simple side-lighting case they were testing, but figuring out how to set the materials correctly and interpreting the output was tricky.  (The reference is linked below.)\n\n\n\tC F Reinhart and P-F Breton, “Experimental Validation of Autodesk® 3ds Max® Design 2009 and Daysim3.0”.LEUKOS, 6:1, 2009\n\thttp://www.ibpsa.org/proceedings/BS2009/BS09_1514_1521.pdf\n\n\nYou might read this report and decide, \"Hey, I'll go with the big commercial software, since it probably has a smoother workflow,\" and you could be right.  Except, the next release comes out and the features you were relying on are no longer supported, or just don't work as they used to.  This has happened many, many times over the past 30 years or so that I've been paying attention.  \n\n\nThe most tragic trajectory was the one followed by LightScape, which was initially intended as a head-to-head competitor of Radiance, and was quite good at it, taking more of a radiosity approach with some ray-tracing add-ons.  This was eventually bought by Autodesk, and stayed true to its purpose for maybe 5 years before things like photometric files lost support, followed by numeric output, followed by every useful feature for lighting simulation.  (I can't say for sure, but I bet the renderings got nicer-looking in the same period.)  The point is, although there is a small community of people who are keen on accurate results out of their renderer, the money is in good-looking output.\n\n\nIn contrast, Radiance has been plodding along a lonely but very constrained path over its lifetime, where features are added only if they improve accuracy, or add capabilities without compromising accuracy.  There's no money in it, but the reward is that we have at least one tool to which all the others can be compared when you really need to know, \"Is this the right result, or does it just look right?\"\n\n\nCheers,\n-Greg\n\n\nP.S.  To Germán - irradiance caching was originally unique to Radiance, but a lot of ray-tracers have picked it up since then.\n\n\nP.P.S.  I should mention that AGi32 is the one commercial tool that has consistently stayed true to the cause of lighting simulation over the years.  When we get together, Ian Ashdown and I like to joke about what would happen to lighting software if a meteor were to choose that moment to take both of us out.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2018-January/012431.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "January 29, 2018 at 09:10AM", "created_by": "Greg_Ward", "parent_id": "radiance-general_012428", "id": "radiance-general_012431"}