{"body": "On 14.01.2006, at 17:08, william reynolds wrote:\n\n\n> From looking over the past posts it seems that something has been\n> changed in the Tcl/Tk language that means that the trad utility\n> will no longer run with more recent versions. Does anyone know\n> with which version of Tcl/Tk this issue frst raised its head?\n> I've only tried the most recent versions. I also tried to install\n> the version I believe trad is meant to run under (Tcl 7.4, Tk 4)\n> but the source for these no longer under the new gcc!\n\n\nDon't waste your preciouse time with old dead scripts. (Or do\nit right and update the code for current releases if you know\nenough about TCL/TK).\n\n\n> I'm pretty new to the linux system im running (fresh from windows)\n> and I dont really know what I'm doing changing code, so I thought\n> I'd appeal to this list for advice about any other front-ends for\n> Radiance.\n\n\nYou don't need much of a front end for Radiance except if you're\nafraid of the command line. Most documentation you will find on\nthe LNBL homepage will use tipped out commands and a text editor\nto create the scene files.\n\n\nYou can try the Radiance_on_a_Disk LEARNIX distribution by\nAxel Jacobs:\n\n\n     http://luminance.londonmet.ac.uk/learnix/\n\n\nThe documentation (including the \"radcourse\" PDFs I mentioned in\nmy other post) should match this environment so you don't have\nto wrestle with the installation to get examples running.\n\n\nA usefull front-end for the Radiance bundle of tools is the\nprogramm \"rad\" which will controll the creation of octrees etc.\nfor you. It's included in the Radiance distribution. Read the\nman-page about how to use it.\n\n\nAnd start learning bash.\n\n\n> I'm aware of Rayfront, but unfortunately I dont have much budget\n> to spend on this project (it's my 4th year undergraduateEngineering\n> degree final project) and I am hoping for a free version!\n\n\nRayfront is one of the best front ends I know about. Perhaps\nyou can convince your department to invest in an educational licence?\nWould be good for the development of Rayfront, too.\n\n\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-January/003261.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "January 14, 2006 at 08:27PM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_003257", "id": "radiance-general_003261"}