{"body": "Martin:\n\n\nThere is some diagnostic/descriptive information that could be helpful to allow people to better understand what is going on and suggest possible solutions:\n\n\n   * What is the configuration of your cluster? How many nodes? What clustering mechanism (nfs or something more advanced)?\n   * Which version of the Linux kernel are you using? Correct functioning of rpiece is dependent on file locking. So depending on the kernel and cluster configuration this may be part of your problem.\n   * How is the scene configured? What kind of lighting is used? How many lights?\n   * How long does the image take to render (on a single machine at small size vs large size on the cluster)?\n\n\nIt would also be helpful if you could also provide an example of the image as it should \"correctly\" appear (perhaps one of the smaller renderings that you have successfully produced). This way people can better understand what is going on in the scene. In all honesty, while the octree may appear to be large, 570,000 polygons is not a lot of\ngeometry for Radiance.\n\n\nRegards,\n\n\n-Jack de Valpine\n\n\nMartin Klingler wrote:\n\n\n> Hi to all on the list,\n>\n> this is my first message to the list although I have followed for a quite long time. I have the impresson that all the experts are on this list and so I have the hope that someone can help me with my problem.\n> At the moment I am working on a quite big model. I exported it from 3DS to Radiance with the help of ConRad an got about 570000 faces. The octree is 162MB. I use Radiance 3.1.20 on a Linux Cluster.\n> The model runs fine as long as I render small pictures up to about 1000x1000 pixels. But if I try to render larger pictures I get results as the attached one. The dark area on the left of the picture is wrong. Mappings and lighting is lost.\n> This Picture was done on the cluster with the help of rpiece. The renderings starts on the right upper corner and ends on the left lower. It is allways so that this errors happen in areas of the picture which are rendered later. I also have tried to render it on one single engine and got a simmilar effect again more to the end of the picture.\n>\n> Does anybody have any idea what is wrong here?\n>\n> Many thanks and best regards\n> Martin Klingler\n> ----------------------------------------------------------------\n> Lichttechnik Martin Klingler\n> Kaplanstrasse 2\n> A-6063 Rum/Innsbruck\n> Tel ++43-512-206057\n> Fax ++43-512-206047\n> email mkli@netway.at\n>\n>   ------------------------------------------------------------------------\n>                  Name: KL21z3.jpg\n>    KL21z3.jpg    Type: JPEG Image (image/jpeg)\n>              Encoding: base64\n\n\n\n\n#     John E. de Valpine\n#     president\n#\n#     visarc incorporated\n#     http://www.visarc.com\n#\n#     channeling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-April/000213.html).</sup>", "attachments": [], "created_by_name": "John E. de Valpine", "created_at": "April 09, 2002 at 02:40PM", "created_by": "John_E._de_Valpine", "parent_id": "radiance-general_000210", "id": "radiance-general_000213"}