{"body": "On 9 May 2002, at 14:16, Georg Mischler wrote:\n\n\n> Hi Rob,\n> \n> I recommend SuSe as an Linux distribution that is relatively\n> easy to install and configure. Other people seem to get good\n> results with Mandrake. Don't even think about RedHat if\n> you're not very familiar with Linux already.\n\n\nHi Georg, how ya doin'?  Did you get a chance to see that \nmovie \"Pi\" I was telling you about?  \n\n\nYes, I heeded your advice about SuSE a number of years \nago, and that was indeed the closest I got to really doing \nsomething with Radiance on the PC.  That was the first \ndistro that I got installed and was able to compile \nRadiance.  There were some utilities not working correctly \nthough, and I never got a chance to troubleshoot them, \nbecause about a week after my first radiance compile \nsuccess, a fire broke out in my apartment building.  The \ngood news was the fire did not destroy my apartment; \nthe bad news was, mine was was on the top floor and \nthe fire department cut a cole in my ceiling to vent the \nsmoke.  They cut a 4'x4' hole in the ceiling.  Guess what \nwas under it -- my computer!!  Grrr.  Yes, I had countless \nproblems with Red Hat, and no, I'm not familiar with it.  I \nexpect that soon I will need to go out & buy the latest \nSuSE and try installing it on my PC at home.  The Mac has \nbeen a good jump-starter for me though.\n\n\n> This may not be exactly what you wanted, but if you use the\n> -bv- boolean switch, then all faces will become invisible\n> from the back...\n\n\nInteresting.  Well, since you have confirmed that normals \ndon't matter (except for mkillum), I guess I shouldn't \nworry about it.  I can use that switch to confirm that \nmkillum polygons are correct though.  Thanks. \n\n\n> My personal philosophy about this point is (so far anyway),\n> that this is the task of the modeller you're using. Once\n> you're running rview (or any similar program), it's really a\n> bit late to do anything about flipped orientations. The fact\n> that the orientation doesn't matter at all for most material\n> types in Radiance has helped me to stick to this position.\n\n\nI agree with you.  It is a bit late in the game to fix it at the \nrview stage.  You wouldn't happen to know the name of \nthe lisp utility that comes with DR, that shows normals?  I \nsuppose I could use that too...\n\n\n> Of course, there is the rshow program by Peter, which works\n> on most unix systems with OpenGL. I don't know if anyone has\n> tried to port it to OS X though, nor if it can do anything\n> about surface normals.\n\n\nYes, I have heard of rshow and it looks good.  But as \nsoon as I saw that it was OGL, I assumed I'd need Mesa, \nand compiling, and well you know my experience is not \nquite up to that yet.  Maybe that's a good challenge for \nme though, since Greg already took care of compiling Rad \nfor us OS X users.  \n\n\n> Radiance normally does fine with thin boxes. There *may* be\n> light leaks in low quality simulations when the ambient\n> density is too loose. But with tougher settings, you will\n> rarely see this.\n\n\nOK then, my modelling chores are getting easier!  \n\n\n> >   I have seen some\n> > special sky textures available for mapping to a sphere for\n> > more realistic environments.  How do these work? \n\n\n> The latter is the case, as it's a simple colorpict pattern.\n> You will lose the accountability of the CIE sky model when\n> you map a picture onto the sky sphere.\n> \n> Btw: Rayfront has a simple drop-down box in the sky\n> configuration dialog to select sky maps... ;)\n\n\nOK, so validity goes out the window when you map the \npretty pictures.  For serious daylighting analysys I should \nstick to the gensky primitives.  \n\n\nYeah, maybe I need to have a look at your demo.  Since I \ndon't have a Linux system running (yet), what will I be \nmissing by using the NT version?  See, the whole reason \nI'm trying to learn Radiance from the Unix side is because \nI'm amazed by all the scripting possibilities (the time of \nday image sequence in \"Rendering With Radiance\" for \nexample) it affords.  Just wondering if there are things \nthat just aren't possible on the NT side.\n\n\n> In theory, this sounds easy. In practise, it would open a\n> pandora's box of consistency problems, not to mention the\n> questions about how to assign materials to subentities\n> within such blocks that are placed on different layers. I\n> have been pondering those issues for years, and haven't come\n> up with a practical solution yet.\n\n\nHmmm.  I was thinking of only using it for importing \nluminaire layouts and lighting analysis points.  In fact, I do \nthis all the time in Lightscape, using their block \nsubstitution routine.   How do you get your luminaires \nfrom AutoCAD into Radiance scene descriptions?\n\n\n> If you're feeling adventurous and know some Autolisp, then\n> you could try to hack my old torad.lsp translator. If you\n> manage to come up with a fool proof solution, then I'll\n> immediately integrate it into Radout.\n\n\nI know very little AutoLISP.  But maybe I'll have a look.\n\n\n> > Along those lines, is there a way to create a grid or\n> > really any series of points in autocad (via nodes, or\n> > blocks or whatever) and then have the coordinates of those\n> > points be fed to rtrace for lighting analysis?  \n> \n> Both DR and Rayfront can do this for you.\n\n\nI figured, I was just wondering if there was a way to \nscript it with the basic package.  \n\n\n> If you buy DesignWorkshop, then I think you also get a tree\n> generator program, which produces data that can be exported\n> to the Radiance scene file format.\n\n\nYes, I saw on their website that there is a tree generator -\n- you sort-of build your own tree by selecting from a menu \nof choices, and then you download a DW file, which can \nthen be exported to Radiance format from DW.  I had DW \nat my old office but found it very buggy, crash-prone.\n\n\n> There's something wrong either with your machine, or with\n> the OS X port of Radiance. There is no direct relation of\n> processing power and clock speed between different CPU\n> types.  \n\n\n> Does your HD go to sleep when it isn't accessed for a few\n> minutes, or do you have any other power saving features\n> turned on? Were the Radiance binaries compiled with\n> comparable optimization flags? It may also be that a laptop\n> simply has a relatively slow HD installed to preserve\n> energy. If you're low on RAM, then this could stall a\n> Radiance simulation to some degree.\n\n\nHmmm.  I ran it while on battery, and figured the CPU was \nramping down to conserve juice and that that was the \ncause, but I plugged it in and re ran it, and the first three \ncheckpoints were all identical (i.e. same percentage \ncomplete).  It's a small scene and the laptop has 512MB \nof RAM, so I didn't think it could be paging/disk access.  \nI'm still not up on all the tweaks one can do in unix to give \njobs priority; perhaps that's the problem.  Dunno.  That's \nwhy I didn't bother to send the timing to Paul Bourke, \nbecause I suspect it's inaccurate (or unfair).  \n\n\n\n\n Rob Guglielmetti <rpg777@earthlink.net>\n    http://home.earthlink.net/~rpg777\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-May/000234.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "May 09, 2002 at 04:35PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_000230", "id": "radiance-general_000234"}