{"body": "Hi Anthony,\n\n\nfirst of all, I think it's a good idea to read the documentation (which \nis part of the distribution) to have an idea what pmap does. Within that \ndocumentation all parameters are explained.\n\n\nThe quick instruction is:\n\n\n0. You can use the standard radiance description (except user defined \nBRDFs). ->rad and oct\n\n\n1. To distribute photon and store them in files (global and caustic \nphotons separately)\ne.g.\n~/bin/radiance/pmap/mkpmap  -apg f81_z.gp 700000 -apc f81_z.cp 700000 \ntest.oct\n700000 is the number of the photos emitted, gp : global photons, cp \ncaustic photons\n\n\n2. Count the photons, make a density estimate  and generate a picture \nwith the modified rpict:\n\n\n~/bin/radiance/pmap/rpict -apg f81_z.gp 500 -apc f81_z.cp 500  -ab 1 -x \n1200 -y 1200 -vf test.vf -o test.pic  test.oct\n\n\nSimilar to the existing rpict, with additional options to read in the \nphoton files. You can use most of the rpict options of the \nstandard-rpict. Of course, the ambient options don't make really sense \nsince the ambient calculation is replaced by the forward raytracer.\nIn many cases, the use of the photon port mechanism is extremely useful. \nWith photon ports you can define materials, through which the light \nenters the scene. A typical example is an office scene, which is lit by \nthe sky. Using this, you can avoid huge effort, since the photons are \ndistributed mostly in \"relevant\" directions. In your case it could make \nsense to define the entering cross section as \"photon port\". You can use \ne.g. glass material with refraction index 1 (==air!!) without disturbing \nthe simulation.\n\n\nGood luck!\n\n\nJan\n\n\n\n\nAnthony J. Farrell wrote:\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-May/001746.html).</sup>", "attachments": [], "created_by_name": "Jan Wienold", "created_at": "May 27, 2004 at 09:03PM", "created_by": "Jan_Wienold", "parent_id": "radiance-general_001745", "id": "radiance-general_001746"}