{"body": "Dear Thomas and Harshada, \nwe currently have also figured out a light leakage problem that occurs only when working with quite huge models. We did some analysis on that problem and found out the following:\n\n\nIf we measure the daylight factors in a simple box generated with genbox without any openings than rtrace gives us zero values for all measurement points as expected. \n\n\nIf we than add an additional surface that is much bigger than the simple box and do the simulation again (without changing anything else), we receive light in the the completely closed box. We think, we are using appropriate values for -aa and -ar. The result of:  biggest_model_length * aa / ar is much smaller than the distance between the measurement points.\n\n\nMaybe the solution for this problem is using mkillum instead of common windows. We keep on testing...\n\n\nRegard, Kai.\n\n\n\n\n\t-----Ursprüngliche Nachricht-----\n\tVon: radiance-general-bounces at radiance-online.org [mailto:radiance-general-bounces at radiance-online.org] Im Auftrag von EncaseIndia\n\tGesendet: Donnerstag, 24. Juli 2008 15:25\n\tAn: Radiance general discussion\n\tBetreff: Re: [Radiance-general] light leakage problem\n\n\n\n\n\tHi Thomas,\n\n\n\tThanks for the feedback.\n\tI was actually checking my model in radiance without any windows,wherein it showed me light leakage.Its just one corner of the building at which i can see some light ,which is around 250 lux, quite huge amount.\n\tI deleted all my windows in ecotect and then exported the model in radiance, after so much analysis i could just find the corner from where the light is leaking.\n\tI have attached the pictures here.\n\n\n\tand I hope you find my english proper. :)\n\n\n\tHarshada\n\n\n\t\t----- Original Message -----\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-July/005256.html).</sup>", "attachments": [], "created_by_name": "Kai Babetzki", "created_at": "July 24, 2008 at 06:52AM", "created_by": "Kai_Babetzki", "parent_id": "radiance-general_005239", "id": "radiance-general_005256"}