{"body": "On 24 Oct 2007, at 16:19, Greg Ward wrote:\n\n\n> Hi Mark,\n>\n> In general, unless a data representation is published and stable,\n> it doesn't make much sense to support it in a translator, as the\n> next version that comes out will likely break it. If there is a\n> published standard for Sketchup files, or something closely related\n> (a higher-level output from Sketchup), that would be interesting to\n> look at.\n\n\nI don't think the format of the Sketchup files (*.skp) is published\nor would be useful as a converter basis. Sketchup (Pro and free) also\nsupport the Google Earth file format which I believe is actually the\ncurrent everybody's darling Collada - don't remember where I got this\ninformation from, though. Collada is published and documented but not\nexactly easy to understand (at least for me).\n\n\nSketchup's Ruby API is limited, badly documented and not officially\nsupported by Google. Nevertheless I believe it will stay and won't\nbe rewritten completely in the next release because the developers\nappear to test new features in Ruby before they get implemented in C\n('sketchy physics' is one example). Also I don't think Google has\nenough developers working on Sketchup to start a rewrite just for\nthe fun of annoying the users.\n\n\nThe API is sufficient to quickly come up with non-interactive scripts\nto access or manipulate the 3D scene. It takes a while to figure out\nhow things are supposed to work but there are plenty of examples for\ntrivial things like a polygon exporter. If you want a nice looking\ninterface you can use DHTML - but then it gets rather messy.\n\n\nWell then, back to coding ...\n\n\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2007-October/004523.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "October 24, 2007 at 11:02AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_004494", "id": "radiance-general_004523"}