{"body": "Hi Greg,\n\n\nI am in the midst of trying to get Evalglare to accurately process HDR\nimages.  In order to account for light-fall from a Canon + fish-eye\ngenerated HDR, I have tried to multiply by the original HDR image with a\ncorrection factor using the pcomb command.  However, the resulting image\ndoes not maintain similar luminance values as the original (as it should\nparticularly for the center part of the image that is only multiplied by a\nfactor of 1).\n\n\nI am using the following command line and would appreciate any guidance on\nwhy the luminance values are so affected:\npcomb -e \"ro=ri(1)*ri(2);go=gi(1)*gi(2);bo=bi(1)*bi(2);\" vignette_283.pic\nChauhaus3cr.hdr > Chauhaus3Bvg.hdr\n\n\nMy initial attempt actually used the -o function to normalize the values of\nthe image before processing, but the resulting vignetted image was very dark\nand the luminance values had drastically dropped -- pcomb -e\n\"ro=ri(1)*ri(2);go=gi(1)*gi(2);bo=bi(1)*bi(2);\" -o vignette_283.pic\nChauhaus3cr.hdr > Chauhaus3vg.hdr\n\n\n\n\nAs an aside to something Rob mentioned earlier, I do not believe that right\nnow Evalglare automatically only judges the circular view of the fish-eye\nHDR while being processed.  In order to get accurate results, the\nrectangular images should be cropped (using pcompos) and also the view type\nshould be verified before processing.  I have discovered that several of my\nPhotopshere generated HDRs are being judged as a perspective view rather\nthan angular fish-eye as I had assumed it would (vtv instead of vta) and\nthat I had to manually adjust this setting before getting accurate and\nmeaningful Evalglare results.  (Greg -- is there anyway to specify the lens\ntype in Photosphere before compiling the HDR so that it follows through from\nthe beginning?)\n\n\nBest,\nRashida\n\n\n\n\n\n\nRashida Mogri | LEED AP\nHarvard Graduate School of Design\nMDesS, 2011 | Sustainable Design\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2010-September/000278.html).</sup>", "attachments": [], "created_by_name": "Rashida Mogri", "created_at": "September 28, 2010 at 09:37AM", "created_by": "Rashida_Mogri", "parent_id": "hdri_000273", "id": "hdri_000278"}