{"body": "Hi Anna,\n\n\nOther than the source code(!), we just have the Radiance reference manual:\n\n\n\thttp://radsite.lbl.gov/radiance/refer/ray.html#Materials\n\n\nHere's what it says about BRTDfunc:\n\n\nBRTDfunc\nThe material BRTDfunc gives the maximum flexibility over surface reflectance and transmittance, providing for spectrally-dependent specular rays and reflectance and transmittance distribution functions.\n        mod BRTDfunc id\n        10+  rrefl  grefl  brefl\n             rtrns  gtrns  btrns\n             rbrtd  gbrtd  bbrtd\n             funcfile  transform\n        0\n        9+   rfdif gfdif bfdif\n             rbdif gbdif bbdif\n             rtdif gtdif btdif\n             A10 ..\nThe variables rrefl, grefl and brefl specify the color coefficients for the ideal specular (mirror) reflection of the surface. The variables rtrns, gtrns and btrns specify the color coefficients for the ideal specular transmission. The functions rbrtd, gbrtd and bbrtd take the direction to the incident light (and its solid angle) and compute the color coefficients for the directional diffuse part of reflection and transmission. As a special case, three identical values of '0' may be given in place of these function names to indicate no directional diffuse component.\nUnlike most other material types, the surface normal is not altered to face the incoming ray. Thus, functions and variables must pay attention to the orientation of the surface and make adjustments appropriately. However, the special variables for the perturbed dot product and surface normal, RdotP, NxP, NyP and NzP are reoriented as if the ray hit the front surface for convenience.\n\n\nA diffuse reflection component may be given for the front side with rfdif, gfdif and bfdif for the front side of the surface or rbdif, gbdif and bbdif for the back side. The diffuse transmittance (must be the same for both sides by physical law) is given by rtdif, gtdif and btdif. A pattern will modify these diffuse scattering values, and will be available through the special variables CrP, CgP and CbP.\n\n\nCare must be taken when using this material type to produce a physically valid reflection model. The reflectance functions should be bidirectional, and under no circumstances should the sum of reflected diffuse, transmitted diffuse, reflected specular, transmitted specular and the integrated directional diffuse component be greater than one.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-May/010890.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "May 08, 2015 at 10:57AM", "created_by": "Greg_Ward", "parent_id": "radiance-general_010886", "id": "radiance-general_010890"}