{"body": "Hi Joe,\n\n\nI love your little drawings.\n\n\n1.)  Each point in a ring is luminous when assigned a spotlight material, yes.  However, you will only ever sample the center of the ring if you set \"-dj 0\" in your rendering, which is typically the default.\n\n\n2.)  This is an excellent question, and your drawing illustrates what goes on fairly accurately.  The boundaries of the spotlight is dictated by the spotlight vector, but the output intensity is affected by the cosine of the ring orientation, since this changes the visible solid angle of the source.\n\n\n3.)  Your diagram looks right to me for the focal (spotlight vector) length.  Effectively, it changes the fall-off of the source so that it is 1/r^2 measured from a point behind the object.  The size of the spotlight area is unchanged -- i.e., the cone still covers the number of degrees specified.\n\n\nRemember that a spotlight is just a convenient way to cut off the boundaries of illumination.  It doesn't necessarily correspond to any real light source, but it can be a handy way to save calculation time for narrow spots, since there's no need to do shadow testing except for the part of the scene covered by the spotlight cone.  Ideally, you would still use a measured light distribution or fall-off model as a pattern applied to your spotlight material.\n\n\n4.) I haven't found a good definition of \"reflectivity\" that differs from \"reflectance,\" but the specular component for a plastic is an uncolored highlight that corresponds to the given fraction of incident light.  Generally speaking, non-metals do not have specularity values greater than 0.06 or so.  The rest is treated as Lambertian, with the specified RGB color.\n\n\nCheers,\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2017-July/012186.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "July 27, 2017 at 10:37AM", "created_by": "Greg_Ward", "parent_id": "radiance-general_012183", "id": "radiance-general_012186"}