{"body": "Hi David,\n\n\n> In the case of \"cnuhw.png,\" it looks like you are specifying a\n> horizontal irradiance due to direct solar that is pretty high all the\n> way to sunset.  Since the direct horizontal is proportional to the\n> sine of the solar altitude, and this goes to zero as the sun nears the\n> horizon, the corresponding radiance of the sun has to increase\n> dramatically to compensate.\n>\n> A more realistic scenario would have the direct horizontal component\n> dropping to zero as the sun reaches the horizon.  My guess is that\n> your weather files aren't calibrated properly to the hour, or their\n> direct measurements actually include a significant diffuse component.\n>\n>> I was beginning an attempt to look at annual illuminance using the\n>> information in a weather file (Energy Plus). As an initial test, I\n>> used gensky while providing explicitly the direct normal radiation and\n>> diffuse horizontal radiation from the weather file.\n>> There was no actual geometry in the scene, just the sun, sky, skyglow,\n>> etc. I then tested the illuminance with rtrace -I for a sensor\n>> directed in the +Z direction as well as looking directly at the sun\n>> where ever it was at that time.\n>>\n>> What I found was that at the end of the day, the sensor point directly\n>> facing the sun spikes dramatically. I've tried it with two different\n>> weather files with similar results. Also, other sensor points pointed\n>> in the general direction of the sunset spike correspondingly.\n>>\n>> Here are links to two images, each showing the hourly averages for the\n>> month of June:\n>>\n>> Abu Dhabi: http://i49.tinypic.com/cnuhw.png\n>> New York: http://i47.tinypic.com/20gz991.png\n>>\n>> Does anybody have any insight to what may be causing this?\n\n\nI would recommend you double-check that you're pulling the right columns \nfrom the EPW file. If you're following the documentation in \"Weather \nData Information\" on\nhttp://apps1.eere.energy.gov/buildings/energyplus/weatherdata_format_def.cfm\nthen the columns are counted 1,2,3,4,5,flags,6,7,... so that it easy to \nget confused. It's also likely that the script which you have written \ncounts the fields starting with 0, not 1 like in the documentation.\n\n\nCan you let us know which date your processing that produces the evening \nspike?\n\n\nThirdly, have you considered using gendaylit instead of gensky? \ngendaylit works really well with the Abu Dhabi data, and only produces \none error in the entire year (not counting a dozen or so 'zenith \nwarnings'). This probably means that the sky conditions in Abu Dhabi are \nrather Californian (or British ;-)\n\n\nAxel\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-February/006568.html).</sup>", "attachments": [], "created_by_name": "Axel Jacobs", "created_at": "February 27, 2010 at 12:53PM", "created_by": "Axel_Jacobs", "parent_id": "radiance-general_006566", "id": "radiance-general_006568"}