{"body": "Christopher,\n\n\nI think that you bring some interesting points, but I am afraid that you\nare mixing few things here. Lets try to untangle it a bit:\n\n\n- Haze measurement is simplified measurement, but for relatively thin\nsamples it is reasonably accurate. It does not give you directional\naccuracy, nor spectral info, but overall specular vs. scattering split is\npretty good.\n- Thick scattering samples are difficult to measure accurately, period.\nHaze meter or not. My colleague here at LBNL is working through NFRC and\nICG TC10 to establish criteria how to properly do it. As it turns out large\nintegrating sphere or full goniophotometer is required to correctly measure\nthick samples. Potentially, a correlation could be developed that would\nallow measurement using smaller integrating sphere, but that is yet to be\nfound.\n- Fabrics measurement according to EN standard - I am presuming that you\nhave in mind spectral measurement using ISO 9050 (or EN equivalent). If\nnot, let me know what EN measurement method you have in mind. One general\nobservation, though. Fabrics are thin scattering products, so their\nmeasurement is not questionable. EN does not offer any advantage to what we\nhave developed through the new AERC organization, which will be published\nas series of standards later this year.\n\n\nTo summarize, thick scattering samples need to be measured using large\nintegrating sphere, so neither haze meter nor Spectrophotometer with 150 mm\nsphere is adequate. Thin scattering samples, fabrics included can\nreasonably be measured with haze meter and Spectrophotometer with 150 mm\nsphere, with the provision that haze meter does not give you any spectral\nlevel information or directional resolution, just split between specular\nand scattering.\n\n\nCharlie\n\n\nOn Fri, Mar 31, 2017 at 7:11 AM, Christopher Rush <Christopher.Rush at arup.com\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2017-April/012083.html).</sup>", "attachments": [], "created_by_name": "D. Charlie Curcija", "created_at": "April 04, 2017 at 11:38AM", "created_by": "D._Charlie_Curcija", "parent_id": "radiance-general_012076", "id": "radiance-general_012083"}