{"body": "Hi dhaRam\n\n\nWe do a lot of daylight simulations in Ecotect -  Radiance - Daysim for\nexternal consultant\nand personal I have done a master, the professor at the university they\ndon´t teach all that you need to know about\nthe software and the data.\n\n\nYou need to export the model from Eco to Radiance, and you have two options.\nBut before to do that you need to give in Eco the reflections value of the\nmaterial - material properties and colour.\n\n\nFor Sandstone i recomend to find the coeficient of reflection + the colour\nof the material, is important that kind of data for the simulation.\n\n\nTo export is high recommend to be sure the path of radiance.\nYou need cameras in Eco to see the 3D inside render in radiance.\n\n\nThe first option to export is from CP Radiance (last window). CP open a new\ncontrol panel, be sure that the options selected in Eco are the same\nin CP Radiance, and the click render. This data is very usefull to Daysim.\n\n\nThe other options is called Final Render, this options give the possibility\nto export Rad data to Eco analysis grid.\nTo export the data is very simple because Eco show an alarm of new data to\nexport when radiance had finished.\n\n\nYou can download powerfull information from the page of Harvard University,\nDiego Ibarra from Chile shows on PDF importants tips.\nBest Regards\n\n\n\n\n\n\n2011/4/10 dharam <dharmesh.124 at gmail.com>\n\n\n> Hi there..\n>\n>\n>\n> Im masters student from India doing my dissertation on the topic:  analysis\n> of Indian traditional trellis (Jali) for daylighting\n>\n>\n>\n> My question is...\n>\n> 1. i have done modelling in ecotect and the same im exporting to radiance\n> for daylighting results...\n>\n> Im very new to the software... i need guidance on how to get proper views\n> and information regarding the model.\n>\n> I also want to know hoe to map down results from radiance so for different\n> cases il have to compare.\n>\n>\n>\n> 2. i have to give the material of sandstone to my model... the whole model\n> material is sandstone ..but i don find sandstone as a material in ecotect.\n> Instead its in a layer...so what procedure i have to follow for that or is\n> there a method for direct application of the material.\n>\n> thanks\n>\n>\n>\n> If any tutorial or anyone could guide me....\n>\n>\n>\n> dhaRam\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n>\n\n\n\n\n\n\n        Jorge Ignacio Fajardo F-A\n                   Arquitecto *MDCS*\n\n\niBSA - Ingeniería Blanda S.A\nUSGBC Member\nJean Mermoz 12, of. D\nOf.: (562) 934.7083\nCel. (567) 8782497\n\n\nLas Condes, Santiago. Chile\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2011-April/007747.html).</sup>", "attachments": [], "created_by_name": "Ignacio Fajardo", "created_at": "April 10, 2011 at 09:18AM", "created_by": "Ignacio_Fajardo", "parent_id": "radiance-general_007745", "id": "radiance-general_007747"}