{"body": "On Aug 10, 2006, at 7:07 AM, E. Reinhard wrote:\n\n\n> As a result, the Flickr community is starting to equate HDR\n> with non-photorealistic rendering, which in my view is very\n> undesirable. The NYC article is not helping in that respect\n> either, as it does not present a balanced view of the state\n> of the art in HDR.\n\n\nHi Erik,\n\n\nYou already know my opinion of Flickr and the over-Photomatixed  \nresults, but I see this article and the exposure and popularity of  \nthis \"effect\" on Flickr as both an expected and not entirely negative  \nthing. The basics are that in the greater world of photo hobbyists  \n(which Flickr represents) no one knows *what* HDR is, aside from the  \nfact the letters mean \"High Dynamic Range\" and that Adobe put it in  \nPhotoshop CS2 and some other companies sell software to do something  \nsimilar. Keep in mind these same people also have *no idea* what all  \ncan be done with HDR.\n\n\nI would guess that the vast majority of photographers (pro, hobbyist,  \nand \"holiday snappers\") only know what Adobe said in their marketing  \nof this \"new feature in CS2,\" or what the adventurous ones read on  \nLuminouslandscape.com, and that is roughly that \"HDR images can  \ncontain a greater range of tones and colors than other computer  \nimages, but it cannot be displayed on your monitor or manipulated  \nmuch at this time.\" And most likely these same folks have *not* been  \nstruggling with the lack of range in \"regular\" photography - pros  \ncarefully choose their lighting conditions, and hobbyists frequently  \njust don't notice. So the idea that HDR capture and processing are  \nuseful for extending the visual range of an image ends up getting  \nlost when these same consumers see \"well-tonemapped\" results that  \nlook not too different from the original(s) or not too different from  \nother photos they've seen. It is a lot of work to get what most  \npeople (I've talked to anyway) see as a very small visual difference.\n\n\nPlus, in a content-competitive social community like Flickr (or even  \nthe NYTimes) you have to do something dramatically different to stand  \nout. Pushing all the sliders in Photomatix \"to 11\" to get a wild,  \npainterly and oversaturated compression of dynamic range is certainly  \ndifferent, and when people ask \"how'd you do that\" they can say \"with  \nthat cool new HDR thing.\"  If all Photomatix output looked just like  \nPhotoshop's tonemapping, or just like a nice, well-exposed photo,  \nvery few would ask \"how'd you do that\" and HDR very well might not be  \nmentioned in the New York Times at all. Again, I strongly believe  \nthat this is because the subtleties in a resulting \"photographic\"  \ntonemapped image (as well as the greater impact on image-making and  \nphotography) is not as immediately noticeable to most people.\n\n\nFinally, I think this \"Flickr abuse\" is somewhat typical of what  \nhappens when a \"new\" technology is first put into the hands of the  \nmass-market;  people naturally try to push all the buttons and see  \nwhat lights up, and in the end they decide what they like and what  \nbecomes popular for a time. I've watched this same process repeatedly  \nover 20 years of \"3D images\" being publicized, and even now I don't  \nthink that a shiny car in a white void is any better than a chrome  \nsphere on tiles, and \"3D\" is just beginning to be used judiciously.  \nOf course I don't think what's on Flickr \"is HDR\" by any stretch of  \nthe imagination, but it *is* the most visually distinct result of an  \nHDR process that people can access today. The true aesthetics of the  \nprocess and technology are some time from shaking themselves out (and  \nthe use of HDR in video games is just another example of this).\n\n\nThe only suggestion to alleviate your particular frustration with  \nFlickr and Photomatix would be to write to the makers of Photomatix  \n(and Photoshop, et al) and ask them to include some of the existing  \ndifferent tonemapping methods in their next release. Then at least  \nyour tools would also be in the hands of the people on Flickr.\n\n\n-Mark\n\n\nBTW, you might obviously note that my opinions are those of an image- \ncreator interested in the application of HDRI, not a researcher  \ncommitted to its technical development and understanding. I feel the  \nsame need to vent when something I've created is grossly misused or  \nmisunderstood.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2006-August/000124.html).</sup>", "attachments": [], "created_by_name": "Mark Banas", "created_at": "August 10, 2006 at 10:22PM", "created_by": "Mark_Banas", "parent_id": "hdri_000115", "id": "hdri_000124"}