{"body": "Hi Greg!\n\n\n> There's no sense in using the -P option if you're after parallel runs, \n> because -P insists on serial runs -- it's a mechanism to connect \n> sequential invocations to the same process.  It's exactly the opposite \n> of what you need.  Just use multiple rpicts if OpenMosix doesn't \n> support shared memory.  It will be the same as using -PP in that case, \n> since there's nothing about the -PP option that *requires* shared \n> memory.  It just ends up using it if it's available.\n\n\nWell, the reason why I wanted to use -P is that I need some way to make \nthe processes render just the missing frames. So they need to be \nsynced. If I use just several rpict's without -PP, I will have to split \nmy view files, and that means that I have to regroup the views in the \nview files each time that the cluster configuration changes.\n\n\nThe problem with using rpict with -PP is that rpict will share memory, \nand than openmosix will not allow the processes to migrata any more. So \nif the -PP option is the only way to make multiple rpict processes \nsync, I will have to go back and use a target for each view in my \nMakefile. Than I can use make -j # with # being the number of machines, \nthe most generic way to distribute the processes. I am not too happy \nwith that because I will have the problem with the viewfiles sooner or \nlater when starting animations - I cannot have one target per frame, so \nI will have to find a way to render ONE viewfile's views in parallel \nwithout that \"shared memory\".\n\n\nIn fact I am seriously considering using ranimate for my stills now, as \nthis allows me to distribute processes from ONE viewfile. I could \nsimply add HOST-lines pointing to localhost, which is a bit silly, but \nshould work fine.\n\n\nThank you for all the help, and have a nice week-end, we have a nice \nsunny autumn day here and it is a pity to stay in the lab ;-)\n\n\nCU Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-October/003021.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "October 16, 2005 at 12:44PM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_003017", "id": "radiance-general_003021"}