{"body": "Hi Xian,\n\n\nInteresting surface geometry you have there. Based on your material \ndescription though the results you are getting seem to be fine. The \nso-called \"noise\" that you are seeing is the specular highlights based \non the material that you defined. The plastic material that you defined \nonly has a specular component you have left the roughness parameter set \nto 0, thus you material is \"shiny\" so you are getting the tightly \ndefined specular highlights on the bumps of the geometry.\n\n\nIf you want a \"glossy\" (not sure exactly what you mean here as this \ncovers a variety of things) finish, then you should add a roughness \nparameter, for example, you could try out the following for starters \n(this is not based on anything in particular) to see what the difference is:\n\n\nThe bumpy surface is made of the following material:\nvoid plastic gray_plastic\n0\n0\n5 .2 .2 .2 .1 .1\n\n\nI would try this out with the parameters that you have and see what you \nget. As an additional experiment you may also want to turn on true \nrandom monte carlo sampling by setting -u+, though this may require that \nyou oversample your image at a higher size.\n\n\n-Jack\n\n\nPS - what does the geometry represent?\n\n\nYun-Xian Ho wrote:\n> Hi All,\n>\n> I have been having problems rendering a glossy bumpy surface composed \n> of intersecting ellipsoids illuminated under a rectangular light \n> source. The image appears to contain some random point source \n> reflections on the surface in addition to the direct reflection of the \n> area light.\n>\n> To view the rendered image, see: \n> http://homepages.nyu.edu/~yxh201/bumpysurftest.jpg.\n>\n> The bumpy surface is made of the following material:\n> void plastic gray_plastic\n> 0\n> 0\n> 5 .2 .2 .2 .1482 0\n>\n> and a 30x24 flat rectangular light source is defined as:\n> void light bright\n> 0\n> 0\n> 3 25 25 25\n>\n> I use the following parameters to render the scene:\n> -ab 2 -aa .08 -ad 1024 -as 512 -av .2 .2 .2 -sj 1 -st .01 -dj 1 -ds .05\n>\n> Any suggestions to clean up the \"noise\" in the image? Much thanks...\n>\n> --xian\n>\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n>\n\n\n\n\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-May/003705.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "May 22, 2006 at 02:29PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_003704", "id": "radiance-general_003705"}