{"body": "Hi Axel,\n\n\nThis is a timely question. Zack and I are going to give a review of rsensor at the Radiance Workshop and I need to refresh on these issues anyway. SPOT includes spatial sensitivity files for the sensors tested in the NLPIP report you referenced, so you can download the program and take a look at the files and implementation - if you haven't already. \n\n\nAnswers to your specific questions:\n\n\na) and b) For the comparison you want to do, the values would be relative sensitivity - relative to a cosine response with maximum of 1 as you described. This would allow the result with a cosine distribution to be computed as illuminance depending on parameters and the result with any other file to be \"signal\" relative to illuminance. For the NLPIP report, the zero azimuthal direction (view up vector) coincides with a prominent feature on the photocell housing, such as an arrow. This is probably not clear for all sensors tested.\n\n\nc)I might be misunderstanding the question but you should just multiply the sensitivity values by 2 if you want double the signal. This will increase the volume by 2^3 but is not used to scale the sensitivity file. \n\n\nremainder) Good point about file format. I think the answer is that Greg developed rsensor for AEC/SPOT and AEC received the sensitivity files from the LRC in the format shown in the manpage. So it is not really a SPOT format as much as it is testing output. Ian Ashdown is proposing an extension to IESNA LM-74-05 to give a formal definition for photosensor test reporting. I am unsure of the status of this right now. Assuming this gets published then maybe a parallel or extension to ies2rad makes sense. Other comments, Zack or Greg? \n\n\n\n\nI hope this is helpful,\n\n\nJennifer\n\n\n-----Original Message-----\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-October/006267.html).</sup>", "attachments": [], "created_by_name": "Jennifer Scheib", "created_at": "October 12, 2009 at 12:37PM", "created_by": "Jennifer_Scheib", "parent_id": "radiance-general_009589", "id": "radiance-general_006267"}