{"body": "Giulio Antonutto wrote:\n\n\n>http://www.parallels.com/en/products/desktop/\n>\n>looks to me a quite close solution to the dilemma.\n>\n>any lucky one tried already?\n>\n>Rob any chance on your new macbookpro?\n>  \n>\n\n\nHi Giulio,\n\n\nYes, I tried it out in beta.  Not terribly impressive at first, as you \ncouldn't share files between the virtualized Windows drive and the Mac.  \nThen subsequent releases got slower and slower.  Got a  few kernel \npanics along the way too.  They have added a tool to allow sharing \nbetween filesystems, but I never got a chance to try it out during the \nbeta.  That said, it was very cool running AutoCAD 2000 on my MAC!  It \nran fairly fast at first, but as I said it got slower and slower, but \nyou have to take speed with a grain of salt with beta software anyway.  \nThey just released version 1.0, and I am considering buying it.\n\n\nI should mention, however, that my MacBook Pro experience has not been \ngreat lately.  There is a whine, or a screech emanating from the cpu.  \nThis existed from day one, and it's well documented on the forums.  I \nwaited until day 89 of my 90 day free support in hopes that a \ndownloadable solution to this would crop up, but it never happened.  So \nI sent my computer to Apple to fix it, I explained the issue to the \nletter, and I got it back yesterday.  Guess what?  It's still busted.  \nSo now I get to battle with Customer Relations to see about an unlikely \nrefund.  I'd rather return it than keep sending it back and forth \nculminating in some statement like \"that's normal, that noise\".  We'll \nsee.  Overall, the Intel Macs are really nice (and FAST (and HOT)).  \nI've just got some version 1.0 gremlins in mine, which is a real drag.\n\n\nI never tried BootCamp, because I don't have a license for windowsXP, \nwhich is the minimum OS that it supposedly supports.  Parallels allows \nyou to install Windows 2000 (which I do have), as well as tons of other \nOSes.  It's pretty cool. \n\n\n- Rob\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-June/003776.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "June 16, 2006 at 06:17PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_003767", "id": "radiance-general_003776"}