{"body": "My question arises from some experiments measuring the same paper surface\nunder different light conditions:\n\n\nUnfortunately it appears that if the source has a really narrow spectrum\nthis affects the results within a 40% with my camera (which I cannot give\nthe name... 001DNOKIN ;-) ).\n\n\nI am stressing the methodology to see if it is reliable enough to substitute\nluminance readings for a wide range of conditions with consumer digital\ncameras (street lighting - interior lighting - day lighting ).\nI really underline the concept of 'wide use' (wide = cheap ;-) ).\n\n\nWith this sort of equipment I would like to achieve an error within +-10%\nand therefore a correction factor quite constant (within +-10%); is it\nfeasible?\n\n\n\n\nI found a very interesting product where the question is somehow explained:\nhttp://www.technoteam.de/pdf/lmkrollei_e.pdf\n\n\n\n\n\"\nMeasuring variations1 \nhalogen, D65,...<5%\nfluorescent lamp, MHN-T,...<10%\n1 Due to spectral distributions deviating from CIE standard illuminant A\nwithin the scene.\n\"\n\n\nand also\n\n\n\"\nUnder certain circumstances, spectral distributions\ndeviating from the CIE standard illuminant A may\ncause bad measuring errors.The value displayed can be corrected by applying\nan additional factor (Colour Correction Factor, ccf) during recalibration\nin the software. The calculation of the ccf value requires to know the\nspectral distributions within the measuring scene or also to use a mean\ncorrection factor...\n\n\n...In addition, the user will also be provided with the relative spectral\nsensitivity\nof the single colour channels and the resulting relative spectral\nsensitivity of standard matrix formation. Thus, he\nwill be able to calculate other ccf values or also other weighting factors.\n\"\n\n\nThis suggest to me, I am guessing, that calibration is really important,\nthat must be performed under very strict and controlled conditions and that\nall the measurement should be within a reasonable range of conditions\nsimilar to the calibration environment( if I calibrate with D65 I cannot\nexpect to measure accurately LPS or HPS, isn't it?).\n\n\nDo you have any field experience about this?\n\n\nthanks a lot,\ngiulio\n\n\nPS - sorry for this long and labyrinth style email!\n\n\n-----Original Message-----\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-June/001793.html).</sup>", "attachments": [], "created_by_name": "Giulio Antonutto", "created_at": "June 10, 2004 at 06:06PM", "created_by": "Giulio_Antonutto", "parent_id": "radiance-general_001787", "id": "radiance-general_001793"}