{"body": "On 2010-11-06 12:50:49 -0700, Greg Ward said:\n\n\n> Hi Dave,\n> \n> This is an interesting idea.  I'm not very familiar with Python, so I'm \n> going to ask some naive questions:\n> \n> 1) Can't you just invoke a system command line from Python?  Is this \n> how you would implement these methods?\n> \n> 2) What are the advantages of encapsulating Radiance tools in this way? \n>  Who do you expect will benefit?\n> \n> It seems like you're just trading one syntax (the Unix command line) \n> for another (Python objects and methods).  This can be worthwhile if \n> the syntax is easier to use or leverages capabilities of the language \n> in new ways.  Do you have an actual problem in mind that you think is \n> best solved this way?  Your example gives a flavor of what you could \n> do, but you're not really doing anything here you couldn't do by \n> shelling out commands and stowing the results in files instead of \n> variables.\n\n\nI'll be interested in David's answer, but one reason I use Python \nscripts is that the Python subprocess module implements (relatively) \nplatform-independent argument processing.  On Unix execvp() is used, \nunless a shell is specifically chosen.  On Windows, which doesn't have \nan analog of execvp(), arguments are escaped for the MS C runtime \nlibrary.  So scripts aren't dependent on the platform.  I've used this \nand, in fact, it works.   Also, personally, I prefer working with \nPython lists to csh variables, but I doubt you would!\n\n\n> Can you share a little more of your broader vision?  Are these just \n> hooks for applications like Blender, or are they somehow better than \n> the commands themselves?  Do you plan to store entire images in memory, \n> or does Python manage variables with megabytes of data in them \n> efficiently?\n\n\nWell, it could be done--numpy does it, for instance.  David?\n\n\n\n\nRandolph M. Fritz • RFritz at lbl.gov\nEnvironmental Energy Technologies Division • Lawrence Berkeley Labs\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-November/007434.html).</sup>", "attachments": [], "created_by_name": "Randolph M. Fritz", "created_at": "November 06, 2010 at 11:40PM", "created_by": "Randolph_M._Fritz", "parent_id": "radiance-general_007431", "id": "radiance-general_007434"}