{"body": "George Pantazopoulos wrote:\n\n\n> I'm trying to get parallel rendering working, but there is a problem. If\n> the image is divided into tiles, and rendered with POV-Ray and global\n> illumination, each finished tile has a different basic brightness level.\n> And when the final image is reassembled from the tiles, the effect is like\n> a checkerboard or patchwork. In short, it ruins the final image. Apparently\n> each render slave *needs* to have the entire scene octree available to it,\n> somehow. There has been an effort to share the octree data with the other\n> slaves as soon as it is generated, however this is only partially\n> successful and does not always suppress the artifacts I mentioned. (Here is\n> a link to the pvmegapov page http://www.wozzeck.net/images/pmp/ )\n\n\nHi George,\n\n\njust to eliminate any potential confusions about the terminology:\nWhat POV calls \"scene octree\" is normally called \"ambient data\" in\nRadiance-speak. But we're still talking about the same thing.\n\n\nYour analsysis is correct: You need to share this data between the\ndifferent processes in relatively short intervals, or they will\nget out of sync, producing the observed tile patterns. Radiance does\nthe sharing through a file (we're currently discussing alternatives\nin the radiance-dev list). Each process synchronizes with this file\nwhen its stdio output buffer is full, on my box that means after it\nhas created approximately 100 new values.\n\n\n\n\n> I'm wondering if Radiance handles this problem in a fundamentally\n> different way, which I could learn from.\n\n\nAs far as I understand what POV does, the main difference seems to\nbe in the syncing frequency. I see that you have difficulties\nincreasing that. To improve the quality of the ambient data, it is\ncommon practise with Radiance to \"seed\" the ambient file with a very\nsmall rendering that is then discarded. Maybe it would help too in\nyour case, if you let your slaves render and discard one patch each\nat first (evenly distributed across the picture), and then to start\nthe \"real\" rendering with the ambient data collected that way\nalready available. In most cases, earlier patches will show bigger\ndiscrepancies than later ones.\n\n\nBtw., if you really still have tiles in your PvMegaPOV example\npicture, the woodgrain pattern hides them very effectively... ;)\n\n\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-February/000545.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "February 01, 2003 at 08:29PM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_000544", "id": "radiance-general_000545"}