{"body": "Hi John,\n\n\nI think that one thing to look into in greater depth is what kind of \ncontrol you can exercise on the configuration/setup of NFS on the \nPanther based machines. In particular you need to have both nfsd running \nas well as something called statd (I am assuming these are the names \nused in the apple based systems). The latter is responsible for \nreporting file status for locking requests among other things.\n\n\nIt sounds like you can get a linux to linux nfs setup running ok. I \nthink that you need to debug and get a stable apple to apple nfs setup \nrunning (ie full processor performance). Then you can work on figuring \nout how to get the two to work together. I suspect that there are some \nmount and/or export related switches that may need to be set to make nfs \nwork in a heterogenous environment like this. It is difficult enough in \na homegenous one.\n\n\n-Jack\n\n\nJohn S. An wrote:\n\n\n> Hi all,\n>\n> I'm at my wits end trying to get my machines to play nicely when \n> parallel processing.  I have a 4 computer setup which I am trying to \n> farm together via nfs for some renderings, and I've come to an impass.\n>\n> Set-up:\n> 2 linux boxes running Mandrake 9.1\n> 2 Macintoshes running Panther (10.3.2)\n>\n> One of the linux box is set as the nfs server.  I set the /etc/exports \n> to give read write access and sync to all machines in my private \n> network (192.168.0.0/255.255.255.0).  The server and the other linux \n> box have no problems communicating and parallel processing.\n>\n> On the Macintoshes, I used the shareware program NFSManager to set up \n> the mount for the exported folder.  In the Finder, I am able to \n> access, read, and copy files from the Macintosh to the server, and to \n> erase files that are on the server.  I can also use X11 to run single \n> processor renderings on files that are located on the nfs server.  \n> However, when I try to run the parallel renderings from the Macintosh, \n> the process just freezes.  Using the top command, I see that rpict is \n> there, but 0% of the computers resources is devoted to the process, \n> and it remains in that state indefinitely (5 days).\n>\n> I doubled checked the UID and GID on all for machines to make sure \n> that they all match.\n>\n> Just to test what was going on, I tried setting up one of my \n> Macintoshes as the nfs server.  In this instance, the linux box can \n> mount the file system, but the process freezes when it starts the \n> rendering, whether it be a single rpict command or an rpiece command.  \n> The other Macintosh is capable of running and completing the parallel \n> rendering process, but only about 10% of the computers resources is \n> devoted to the process (this is something that I'll just have to look \n> into).\n>\n> Could somebody please help me figure out what is going on?\n>\n> Thanks.\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general@radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n>\n\n\n\n\n#\tJohn E. de Valpine\n#\tpresident\n#\n#\tvisarc incorporated\n#\thttp://www.visarc.com\n#\n#\tchanneling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-December/001356.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "December 22, 2003 at 04:05PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_001355", "id": "radiance-general_001356"}