{"body": "Peter Apian-Bennewitz wrote:\n\n\n> Jeffrey McGrew wrote:\n>\n> >\n> > OK, so I've got this idea to make a Radiance Render server.\n>\n>    3. web-based leaps to mind before email does (the latter probably\n>       never leaps anyway...).\n\n\n\n\nDont ask me why I didn't mention this an hour ago.\n\n\nProbably because I'm still more thinking of it as a project\nthan a product. But I've been working on a web based online\nversion of Rayfront for quite a while now. It's in beta, and\nthe payment infrastructure is currently being integrated.\n\n\nThe people who commissioned this will offer it as a service,\nor sell it as a \"render appliance\". You can buy a box to be\ninstalled in a rack in your server room, and all you need\nto access it for running simulations is a web browser with\nthe flash plugin.\n\n\n\n\n>    4. how do your users pack their jobs ? zip,tar ? How do they verify\n>       they have everything included ?\n\n\nUpload a DXF file, compressed with zip or gzip if it\ngets too large otherwise. Other types of upload will be\neasy to add if there's a real need.\n\n\n\n\n>    5. why setting up a server anyway? For an occasoanl user the various\n>       boot-radiance-from-cd concepts are probably much quicker (right on\n>       their machine), for bulk processing a render farm with file\n>       sharing is approx 3 orders of magnitude faster and easier to manage\n\n\nHow about a render farm in behind a server based interface?\nThose boot-radiance-from-cd concepts also don't come with\ntools for material assignment and simulation control\n\n\n\n\n>    6. for public usage the server would have to implement some resource\n>       management, otherwise any job may block the resources for an\n>       unpredictable time\n\n\nThe available CPUs need to be adequate for the expecded\nload. In an in-house situation, you just file jobs into a\nqueue. On a commercial service you can buy \"render points\",\nsome of which get eaten up by each simulation you run.\nOther than that you have user and group management, so that\nseveral people from the same organisation can run their jobs\nand it all gets billed together.\n\n\n\n\n> if you still want to go and dig in (good!), my personal recommendation\n> would be PHP scripts on a webserver (very preferably Apache).\n\n\nBuzzword alarm:\nThe online version of Rayfront is a multi-tier solution.\nIt uses the Python-based web application server Zope running\nbehind Apache, with XML-RPC connections to the Flash client and\nto the simulation backend.\n\n\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-April/001619.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "April 20, 2004 at 11:39PM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_001615", "id": "radiance-general_001619"}