{"body": "Martin,\n\n\n> In general, Radiance is more accurate than other programs if you make\n> extensive use of small patches with mkillum, set the -av parameter to a\n> reasonable value, and use the following parameters:\n> -ab 5\n> -ad 2048 or higher\n> -as 1024\n> -ar 5000 \n> -ds .05\n\n\n> If you use -ab 1 instead of 5, your values are typically half of what they\n> should be. If you use -ab 3, they might be 30% too low. \n\n\nThat ar setting is rather on the high side.  Also, the high accuracy\nthat was achieved with the BRE-IDMP dataset relied only on the ambient\ncalculation - no mkillum.  Some tests I carried out at the time (95-97)\nshowed that accurate pure ambient tended to be faster than comparably\naccurate mkillum.  For both cases the parameters were gradually refined\nuntil the predictions converged to the measured values (method described\nin Chap 6 of RwR).  Radiance has changed a bit in the meantime, but I'd\nwager that pure ambient is still an effective way to achieve high accuracy.\nAnd maybe even more efficient too.  Perhaps I should repeat the tests using\nthe latest version - but don't hold your breath just yet.\nIn any case, I'd stick with the method of testing for convergence (Ch 6 RwR).\nThe \"optimum\" parameter combination will depend on the scene, and convergence\ntesting by progressive refinement is the quickest way to get there.\nIt's the most reliable method too.\n\n\n-John\n\n\n\n\nDr. John Mardaljevic                     \nSenior Research Fellow\nInstitute of Energy and Sustainable Development\nDe Montfort University\nThe Gateway\nLeicester\nLE1 9BH, UK\n+44 (0) 116 257 7972   \n+44 (0) 116 257 7981 (fax)\n\n\njm at dmu.ac.uk   \nhttp://www.iesd.dmu.ac.uk/~jm\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-September/002038.html).</sup>", "attachments": [], "created_by_name": "John Mardaljevic", "created_at": "September 27, 2004 at 05:47PM", "created_by": "John_Mardaljevic", "parent_id": "radiance-general_002032", "id": "radiance-general_002038"}