{"body": "Hi Jack,\n\n\nThanks for your extremely useful input on this topic.\n\n\n> I have struggled with NFS based file locking (on Linux) on and off for\n> quite some time. Most of our work usually uses smp nodes so this is\n> normally not an issue. \n> But I have been looking back into this more recently for some cluster\n> based rendering. I would seriously suggest taking a look at:\n>         http://nfs.sourceforge.net/\n> Which has a fairly extensive set of information on NFS.\n\n\nThanks for pointing me to this URL, I should have checked it before.\nEffectively it is the single most useful resource about NFS on linux :)\nso much better than the man pages.\n\n\n> For locking to work correctly I am pretty sure that you need to\n> specify the (sync) option on the server and/or the client side.\n> However NFSv3 is supposed to do sync by default as apposed to v2 which\n> did aysnc. The latter is faster however leads to a wide variety of\n> issues. It is quite likely that you also need to specify the (noac)\n> option, which means that the client is not caching file status\n> information instead it always goes to the server to check the file\n> status. Both of these options together make things slow... To improve\n> performance I believe that you can do a couple of things: 1) increase\n> number of nfsd processes available to handle requests and 2) specify\n> larger rsize and wsize (assuming a fast network transport).\n\n\nI will ask to change the configuration next Monday, and hopefully\nthings should improve.\n\n\n> Please note that I have been trying to read up on this as well as\n> other shared filesystems, I have not had a chance to test a lot of\n> this out. I would be interested to hear what you learn.\n\n\nYes, I'll keep you updated on my trials&errors.\n\n\nI have been using OpenMosix with oMFS so far, and it has been working\nproperly, especially after the DFSA has been introduced.\n(for more info about oMFS and DFSA there is a short section in\nhttp://howto.x-tend.be/openMosixWiki/index.php/FAQ)\n\n\nI understand that the OpenMosix development is moving towards using\nGFS (Global File System) now:\nhttp://www.redhat.com/whitepapers/rha/gfs/GFS_INS0032US.pdf\n\n\nThanks again, and have a nice week-end.\n\n\nFrancesco\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-September/003942.html).</sup>", "attachments": [], "created_by_name": "Francesco Anselmo", "created_at": "September 02, 2006 at 03:19PM", "created_by": "Francesco_Anselmo", "parent_id": "radiance-general_003935", "id": "radiance-general_003942"}