{"body": "Hi Axel,\n\n\nI'll try not to duplicate what Jennifer said too much -- who, by the  \nway, could not have read my response first (nor I hers) because it was  \ncomposed on the plane and not sent until later...\n\n\n> > The sensor file is normalized to 1.0 in arbitrary \"response\" units.\n> > Think of it as a multiplier on the incoming radiance value in each  \n> direction.\n>\n> So I shouldn't think of it as an 'inverse' IES file, then. I've just  \n> run some simple examples with an ideal cosine data file, and the  \n> results do match the one I get from rtrace. Multiplying each value  \n> in the matrix with 2.0 gives me twice the illuminance.\n\n\nYes, it's not really comparable to luminaire data.\n\n\n> I guess that the real question should be 'what do these sensors  \n> actually measure?'. It's not lux, because for this they would have  \n> to be cosine and v(lamda) corrected, which one could expect from a  \n> 500 Pound lux meter, but not from a 5 Pound sensor. I guess it all  \n> boils down to the commissioning of the sensors. The only thing we  \n> can say with certainty is that they measure 'some sort of radiation  \n> thing', which is different in different directions.\n\n\nYes -- the spectral response is unknown, and may or may not be  \nimportant to the sensor output.  The rsensor program reports the  \nsensor-weighted sum of RGB radiance values over the hemisphere, and if  \nyou have an idea of how to multiply the RGB results based on the  \nspectral sensitivity, you can get a more accurate output.\n\n\n> So is it correct to assume that SPOT only uses the relative response  \n> from the photocells, and not absolute W/m2 or lux values?\n\n\nI think Jennifer answered this pretty well, and she knows more about  \nit than I do.\n\n\n> Here is my own cunningly crafted cosine response. Just one column of  \n> azimuth values at zero degrees wouldn't work:\n>\n> degrees\t0\t90\t180\t270\n> 0\t1.0000\t1.0000\t1.0000\t1.0000\n> 10\t0.9848\t0.9848\t0.9848\t0.9848\n> 20\t0.9397\t0.9397\t0.9397\t0.9397\n> 30\t0.8660\t0.8660\t0.8660\t0.8660\n> 40\t0.7660\t0.7660\t0.7660\t0.7660\n> 50\t0.6428\t0.6428\t0.6428\t0.6428\n> 60\t0.5000\t0.5000\t0.5000\t0.5000\n> 70\t0.3420\t0.3420\t0.3420\t0.3420\n> 80\t0.1736\t0.1736\t0.1736\t0.1736\n> 90\t0.0000\t0.0000\t0.0000\t0.0000\n>\n> Does rsensor use a linear interpolation to fill in in-between rows?\n\n\nYes, effectively.  The rsensor program actually inverts the sensor  \ndistribution to derive Monte Carlo ray samples, so it's a bit tricky,  \nbut amounts to the same.\n\n\n> I am still puzzled that the response is not proportional to the  \n> volume of the shape, or at least the area of the curve. Guess that's  \n> just the way it is, and there isn't really any strict photometric or  \n> radiometric reason behind this...\n\n\nRadiation as we use it normally is not a volumetric quantity.  It can  \nbe area-based, but since we report things as a proportion of area  \n(e.g., watts/meter^2), this factors out again.  I'm not really sure  \nwhere you're confused, since there are so many things that are  \nconfusing about lighting units.  I spent months in the beginning  \ntrying to get my head around them.\n\n\nCheers,\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-October/006277.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "October 13, 2009 at 01:41PM", "created_by": "Greg_Ward", "parent_id": "radiance-general_009589", "id": "radiance-general_006277"}