{"body": "Hi Roberto,\n\n\n> The ViewportProperties command in Rhino will show you XYZ values for the\n> current camera location and target location. The camera location XYZ\n> values can be used directly for the -vp parameter in rpict. The -vd\n> parameter should be derived by subtracting the camera location values from\n> the camera target values, constructing a vector relative to the camera\n> location.\n\n\n> Sorry to double-post, but I almost forgot, the vh and vv horizontal and\n> vertical angle parameters can be roughly determined based on the viewport\n> lens length, since Rhino uses a 35mm camera. If you're always using a the\n> same length camera lens, this only needs to be done once.\n>\n> VH = 2.75*(180/pi) * atan[(36 / (2 * lenslength))]\n> VV = 2.75*(180/pi) * atan[(24 / (2 * lenslength))]\n>\n> The 2.75 is a correction factor that I found from experience approximates\n> the rhino viewport quite closely. Its probably also good practice to take\n> the floor of these values.\n\n\n>>> is there a way to import to Radiance cameras set on Rhino?\n\n\nI messed around with this some time ago. I've put up my little Rhino \nscript for you to try:\n\n\nhttp://luminance.londonmet.ac.uk/pickup/ExportRadianceView.rvb.gz\n\n\nI find myself hardly ever using it, but maybe it works for you, or at \nleast, you can use it as a starting point for your own Rhino hacking.\n\n\nThere are three obvious bugs (or missing features) which I should \nmention, so you won't be disappointed:\n\n\na) The view angle you get in Radiance doesn't quite match the Rhino one. \nMaybe Alstan's formulae will get you closer match;\n\n\nb) I have not found a way of getting the view extends for parallel views \nin world coordinates. Rhino seems to insist of returning them in pixels;\n\n\nc) Rhino's view up vector is at 90 degrees to the view direction. This \nis not incorrect as such, but when you load the Radiance view file in \nrvu, you'll find that rotating around the z-axis (pivot or rotate \ncommands) yields unexpected results. The fix would be to always define \nthe view vector as 0 0 1, and ignore Rhino's values.\n\n\nHope you find the script useful. Please share any improvements you make.\n\n\nHappy hacking\n\n\nAxel\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-October/007419.html).</sup>", "attachments": [], "created_by_name": "Axel Jacobs", "created_at": "October 27, 2010 at 01:06PM", "created_by": "Axel_Jacobs", "parent_id": "radiance-general_007416", "id": "radiance-general_007419"}