{"body": "Greg suggested yesterday:\n\"so you should probably intervene with your own correction if you are working from physical\ndata.  Therefore, I recommend multiplying values to the -r and -R options by:\n\n\n        208/179         the ratio between the sun's efficacy and the standard\nRadiance factor\n\n\nLikewise, values to the -b and -B options should be multiplied by:\n\n\n        110/179         the ratio for sky radiation efficacy over the standard\nRadiance factor\"\n\n\n\n\n\n\nI wrote back:\n\n\n> Greg,\n>\n> are you sure? The sun's luminous efficacy above 20 deg. altitude is\n> somewhere around 95-100 lm/W, overcast skies are around 120 lmW, clear\n> skies around 150 lm/W. Therefore, your multipliers for the -R/r\n> options should be smaller than the multipliers for the -B/b  options?\n>\n> Martin\n\n\n\n\nGreg answered:\n\n\n\n\n\tHi Martin,\n\n\n\tNow that you mention it, I'm not sure at all.  I got my number from the\n\tefficacy of Standard Illuminant B, which is simulated (rather than\n\treal) sunlight, and it could be way off.  Where do you get your\n\tnumbers?  If you are sure of them, please forward this message with my\n\tapologies to radiance-general.\n\n\n\tThanks!\n\t-Greg\n\n\n\n\n\n\n\n\n\n\n\tMy answer: \n\n\n\tThe numbers for the solar/beam lumens/watt can be obtained from the Illuminating Engineering Society Handbook , and they are listed as 95 lm/W. If you need more precise data, you can go to \n\n\n\thttp://idmp.entpe.fr/library/papers/evlumeff.pdf\n\n\n\tas one example. I do not think that taking the CIE daylight illuminants and their luminous efficacy is a good way to do it. \n\n\n\n\n\n\n\tThe following book\n\n\n\t\"Daylighting in Architecture\" edited by Baker, Fanchiotti, Steemers and published by James & James  (ISBN 1-873936-21-4) lists luminous efficacy functions for various sky/cloud conditions and sun altitudes on pages 10.4 and 10.5. Input needed is the global irradiance for calculating the overcast efficacy. They also give a formula for calculating luminous efficacies for skies with both clear and diffuse components by taking their ratio. \n\n\n\tFrom those values, they offer a formula to obtain internal illuminance subdivided into the internal direct sunlight factor, the clear sky factor and the overcast sky factor. \n\n\n\tNevertheless, I had good experiences with actual weather data from www.meteotest.com (software Meteonorm) and \"gendaylit\". \n\n\n\n\n\n\n\tMartin, Penn State\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-October/001070.html).</sup>", "attachments": [], "created_by_name": "Martin Moeck", "created_at": "October 16, 2003 at 12:20PM", "created_by": "Martin_Moeck", "parent_id": "radiance-general_001055", "id": "radiance-general_001070"}