{"body": "Hi Alexa,\n\n\nI think that we are agreed that using a spectrophotometer is a more \naccurate solution depending on the users needs, objectives etc... ;->\n\n\nOne clarification though. As far as I know \"pcond\" (the radiance program \nfor physically based simulation of a variety of dynamic range and \ncontrast sensitivity functions as based on research by Jim Ferwerda, \nHolly Rushmeier, Greg Ward and others) is not used with the macbethcal \ncallibration process. The program I was refering to is \"pcomb\" which can \nbe used for a variety of image process operations on radiance image \nincluding applying a calibration function as output from \"macbethcal\".\n\n\n-Jack\n\n\nAlexa I. Ruppertsberg wrote:\n\n\n> Hi Jack,\n>\n> I have not (yet) embarked on the use of a digital camera for \n> calibration purposes, but I imagine that you also have to figure out \n> the sensitivity of your sensors in the camera, as they will determine \n> your 'signal', i.e. picture,  let alone that exposure etc. will also \n> affect it. Actually, it sounds quite complicated in contrast to using \n> a spectro.\n>\n> I agree that as long as you measure a macbethcolour checker card and \n> your data sample under the same illumination, you could go ahead.The \n> routine described in the book relies heavily on macbethcal (about \n> neither you nor me have an idea how it works) and also points out its \n> limitation (the word 'approximation' is used). Also, nobody could \n> explain to me what magic things 'pcond' does, so I rather do not use \n> it (the word 'mimick' appears rather often in the man pages). Human \n> visual perception cannot be accounted for by a magic RADIANCE \n> function. If it would, then why are several hundred scientists \n> world-wide still studying it? I agree, that the results of RADIANCE \n> are visually appealing and that the physics are simulated quite well, \n> but only if you input accurate data your results will be accurate.\n>\n> Cheers,\n> Alexa\n>\n>\n> Jack de Valpine wrote:\n>\n>> Hi Alexa,\n>>\n>> Just a minor comment here. I have no doubt that the using a more \n>> sophisticated measuring device will yield more accurate results. \n>> However, I believe the method of using the machbethcolor checker card \n>> as described in Rendering with Radiance is designed to calibrate to \n>> the current lighting conditions, that is, assuming the use of a \n>> digital camera, if we want to sample a particular material in a give \n>> lighting condition, then we also sample the color checker chart under \n>> the same conditions with the same sampling device (digital camera) \n>> and then perform the calibration with macbethcal and pcomb. I do not \n>> know the underlying method that Greg put together to do the \n>> calibration, so I am not sure how he has accounted for varying light \n>> conditions vis a vis the internal dataset that Radiance uses as part \n>> of the calibration mechanism.\n>>\n>> -Jack de Valpine\n>>\n> ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n> Dr. Alexa I. Ruppertsberg\n> Department of Optometry\n> University of Bradford\n> Bradford\n> BD7 1DP\n> UK\n> ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n>\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n\n\n\n\n#\tJohn E. de Valpine\n#\tpresident\n#\n#\tvisarc incorporated\n#\thttp://www.visarc.com\n#\n#\tchanneling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-May/001686.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "May 12, 2004 at 04:46PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_001679", "id": "radiance-general_001686"}