{"body": "Hi all !\n\n\nI think the discussion starts to leave the range this forum was set up\nfor, but as I don't want to be looked at as the heretic, I simply have\nto state something for self defence :) .\nI really didn't mean Radiance to go for a Disney-style colorful pictures\nrenderer, there are lots of them already available. But on the other\nhand, disregarding physical accuracy here and there is no black magic\neither. In fact, it is already offered by Radiance, e.g with the \"glow\"\nprimitive and its maximum radius for shadow testing, which helps very\nmuch in certain cases. Almost each task shows small details where the\nmeans to create an effect within a picture / a simulation are not 1:1\ncopies from the ones applied in the real installation within a building,\nand this doesn't have to mean a loss of realistic thinking, it simply is\na question of efficiency. And having more freedom to do so would be no\n\"downgrading\" either. \nIt might of course be confusing if too many different approaches to an\nissue appear within the same tool. In this respect I understand the hint\nof relegating \"artistic\" tasks to other programs. But this often is\nhorribly inefficient, more time is spent with converting or setting up a\nscene a second time in another format, so that I personnally prefer to\ndo as much as possible with one tool (cf. Iebeles comment..).\n\n\nAnd then there is of course the aesthetical dimension. For the reception\nof a picture, the question of accuracy is not the only criterium. And\nthe demands of the public are paradox. One one hand, they want sound,\nefficient and realisable solutions, but the same time they want to be\n\"entertained\", want to see something fantastic, impressive. Maybe trying\nto bring this together makes the main proportion of the art of\nsimulation. It is a difficult task, so why restrain oneself by locking\naway some sections of the toolbox?\n\n\nIn the end, all is of course a question of individual preferences, so\nnow I will be quiet. Really. :)\n\n\n-Carsten\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-May/000255.html).</sup>", "attachments": [], "created_by_name": "Carsten Bauer", "created_at": "May 16, 2002 at 01:59PM", "created_by": "Carsten_Bauer", "parent_id": "radiance-general_000229", "id": "radiance-general_000255"}