{"body": "On 4 Nov 2006, at 18:56, Jack de Valpine wrote:\n\n\n> Hi All,\n>\n> I just want to follow-up on this a bit.\n>\n> Clearly there are a lot of CMS options such as Wiki and others\n> that have already been mentioned. I think though rather than\n> revisiting what tool to use, we really need to focus on what\n> content would be valuable, how it is organized and who would\n> be interested in producing what content.\n\n\nI want to support Jack on this point. Though a big part of us\nhas some experience with setup and administration of some kind\nof content management/markup/publishing system we should focus\nour discussion on the things we want to see on the system and\nthe way how we are going to use it, not how this could be\nimplemented with system XYZ.\n\n\nIn fact, I think that all popular systems will support the features\nwe need. Since there seems to be a consent about raising and\nspending some cash for the setup and maintenance I would suggest\nthat we create a 'wish list' (specification) and ask a service provider\nor consultant to do the configuration for us. This could as well be\nsomething else than Plone, provided that the chosen SP has better\nexperience with it and can implement our features.\n\n\n> There is a huge amount of valuable information that gets generated on\n> this list. However it is sometime difficult to realize the value  \n> because\n> one has to dig through email archives.\n\n\nThis could be a possible feature of the new platform. Should the\nmailing list migrate to the CMS as well, should we only have a\n'connector' to reference and archive emails from the lists or can\nwe do with a simple externally created digest page for each month?\n\n\nMy personal wish list for the system is this:\n\n\n1) transparency of content management and storage\n    this is more of an admin issue, but should we decide to have\n    a hosting solution, guaranteed access to the data and backup\n    is a feature we have to request\n\n\n2) authentication\n    could be weak and simple, though, this is mainly to prevent\n    excessive spamming and point 3\n\n\n3) controlled editing\n    I like the instantaneous access of wiki pages. But in this\n    case I'd prefer to have a dedicated editor for each topic\n    who controls and edits the content of the page. I like the\n    idea of a 'shadow page' that's open for everyone to write.\n    That keeps writers with a short attention span interested.\n\n\n4) cross referencing\n    Judging by our current content structure we will have several\n    topics which a dealt with in different places. There should be\n    an easy way to navigate between these connected pages. Wikis make\n    that very easy - but also very messy. I hope we can find a better\n    solution.\n\n\n5) support for different content types\n    there will be at least:\n    - plain web pages with images (reference, tutorials, etc)\n    - code samples\n    - probably quite a few equations mixed in the text\n    - PDF and Powerpoint documents from the workshops\n    - source code (CVS controlled?)\n    - mails (see above)\n\n\n6) external editing\n    Those of us who will write a lot will prefer to use their\n    own editor of choice instead of a browser text box. Maybe\n    there's a chance for revision control as well.\n\n\n7) PDF output\n    I'd like to be able to 'dump' selected chapters in a PDF\n    document. That will make a revised edition of RwR easy -\n    and of course useless.\n\n\n8) email notification/reminders/digests\n    basic feature i guess\n\n\n9) navigation and appearance\n    It should be easy for occasional users to find their position\n    within the content structure and find related content. It's\n    amazing how complicated web pages can be.\n\n\n\n\nIn my opinion those are the most important features the system\nshould provide. Order and relevance is of course open to discussion.\nI'm sure someone else will find other features that should be\nincluded or identify some we can do without.\n\n\nSome of the points above need further detailing (like the editing\nworkflow) but we could agree on the general functionality we expect\nfrom our new home in cyberspace.\n\n\n\n\nI'm sorry I will be away from keyboard and broadband for the\nnext week. So please do not feel offended if I can not answer\nany replies to this message.\n\n\nAnd of course the standard disclaimer:\nI'm happy to contribute to the documentation project whatever\nI can and in whatever form it will appear.\n\n\nRegards,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-November/004083.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "November 05, 2006 at 12:52AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_004054", "id": "radiance-general_004083"}