{"body": "I suggest to use two parallel approaches, one with your LED, one with an incandescent low voltage. The problem with LED luminance measurements from HDRI is that a) the color gamut is small and b) the photopic sensitivity curve V(lambda) currently used is incorrect. It underestimates blue wavelengths quite a bit. Therefore, start with an incandescent first, because LEDs have a strong blue peak around 440 or 460 nm, depending on the manufacturer. You are dealing with the liumitations of V(lambda) and then with tristimulus values which are just not good enough for narrowband LEDs, including white ones with a blue peak.\n\n\nWhen you use the incandescent instead use it in a black lab. Place a few white paper samples on the walls at different known locations. Place your incandescent at a defined location. Derive the geometry, all distances and all angles between those white papers and the lamp. Turn the incandescent on and the room lights off. Measure the luminance of the white papers at a location that you marked with a soft pencil. Make HDR images and determine the luminance and scale.\n\n\nBased on the luminance values of the papers, you can now derive the luminance of the incandescent filament. Make HDR images of the filament as seen from those papers. Check if the corresponding illuminance values of the white paper at reflectance around 85% corresponds to the luminance values of the filament in that direction.\n\n\nRepeat several times to give you confidence.\n\n\nOnce you are heading in the right direction, you can repeat the whole procedure with an LED. But this time your values will be around 20-30% off. You should really use a CCD camera with a photopic filter to get better values, and then try to come up with a procedure to minimize errors for the HDR approach.\n\n\nRegards\n\n\nMartin Moeck\nOsram\n________________________________\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2012-March/000387.html).</sup>", "attachments": [], "created_by_name": "Martin Moeck", "created_at": "March 02, 2012 at 04:04AM", "created_by": "Martin_Moeck", "parent_id": "hdri_000385", "id": "hdri_000387"}