{"body": "Tough questions, Andy.\n\n\nIf you know the droplet size and density, you should be able to  \ncompute the likelihood of striking a particle in one unit's distance  \n(e.g., in a world coordinate system of meters: 1 unit == 1 meter).   \nTo take a real example, let's say you assume spherical droplets of  \n100 microns in diameter at a density of 10^5 drops per cubic meter.   \nThat means that one droplet (on average) can be found in every 10^-5  \nof a cubic meter.  More importantly, looking through one meter's  \ndistance in this volume, your chance of encountering a droplet equals  \nthe combined cross-sectional area of all the droplets in the volume  \ndivided by the volume.  That is:\n\n\n\t10^5 * pi*(50e-6 meter)^2 / 1 meter^3\n\n\nor a 0.000785 (0.075%) probability. This is safely in the range of a  \nsingle-scattering medium for an interior space, since a photon would  \nneed to travel nearly a kilometer to have a 50% chance of  \nencountering a droplet.\n\n\nYour extinction coefficient is approximately equal to the above  \nprobability, i.e., the average fraction of rays scattered per unit  \ndistance.  The value needs to be computed more carefully as the  \ndensity*size gets larger, since we really should be computing the  \nprobability of a ray *not* encountering a droplet after a unit's  \ndistance, and one minus that is the extinction coefficient.  I was  \ntrying to work out the exact formula, but it gets into ODE's, which  \nwas one of my worst subjects in math, right after complex number  \nanalysis...  It's only a problem when you get into the multiple  \nscattering regime, where Radiance isn't really well-suited anymore.\n\n\nThe albedo for water droplets is quite high, somewhere around 0.999,  \nand the H-G is about 0.84 (values taken from \"Rendering with  \nRadiance,\" p. 595).  These values do not change with drop size or  \ndensity.\n\n\nI am not sure how visibility length relates to extinction.  I did a  \nquick Google search and found the following tidbit at  \n<www.envirotechsensors.com>:\n> Conversion from extinction coefficient to visibility involves  \n> different algorithms, one for daytime and one for night. Daytime  \n> visibility is related to the viewing of dark objects against a  \n> light sky as previously mentioned. For measurement of visibility in  \n> the daytime, Koschmieder’s Law is used:\n>\n> V = 3/σ\n>\n>  Where V is the visibility and σ is the extinction coefficient\n>\n>  Nighttime visibility is related to the distance at which a point  \n> source of light of known intensity can be seen. For measurement of  \n> visibility at night, Allard’s Law is used:\n>\n>  V = e-σ*V/0.00336\n>\n>  Where V is the visibility and σ is the extinction coefficient.\n>\n>  Most applications will use only the Koschmieder’s (V = 3/σ)  \n> formula. The aviation community typically uses a photometer to  \n> measure the day/night condition and applies both formulas depending  \n> on the ambient background light.\nSo, a daytime visibility of 0.8 meters corresponds to an extinction  \ncoefficient of 3.75 m^-1, which of course is nonsense because  \nextinction must be < 1.  I assume this approximation doesn't really  \napply below a certain visibility distance, >> 3 in whatever units you  \nhave.  Again, this relates to the problem mentioned above with  \nmultiple scattering, and you need to make sure your in a single- \nscattering regime for any of this to make sense.\n\n\nI hope this helps.  It sure got me confused!\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-December/004124.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "December 07, 2006 at 07:55AM", "created_by": "Greg_Ward", "parent_id": "radiance-general_004123", "id": "radiance-general_004124"}