{"body": "I read through the pab-opto comparisons (thanks Peter!).  Looked pretty\ngood.  Too bad Viz had not incorporated Lightscape at the time.  Not\nsure what AutoDesk's plans are, but I think Viz is already more powerful\nthan Lightscape in all but a couple of areas.  Had a couple of questions\nthough that came up after reading the comparison...  They are kind of\ngeneral radiance questions. \nAre ambient files really independent of the viewfile?  Somewhere in\nRendering with Radiance (where it talks about ambient files) I had the\nimpression different views required different ambient files, and thus I\nstopped using ambient files the way other people seem to and started\nusing view dependent ambient files.  Meaning I would use one ambient\nfile per view regardless of the fact that scene was the same.  If this\nis not right, and one file will work for any view, someone please let me\nknow.  I noticed Rob Guglielmetti also \"generates multiple fisheye views\nfor ambient cache, prior to running calcs\".  (Sounds like ambient files\nare not view dependent).\n\n\nAnother question that came up was regarding ambient bounces.  On pages\n29-31, \"Typical\" ambient bounces are 3-7, and then various calculation\ntimes are shown for ab=0 (.135 hours), ab=1 (.431 hours), ab=7 (24\nhours).  How in the world does one accomplish ab=7 in only 24 hours on a\n~400MHz computer?  Wow!..  I was blown away considering I've been\nrunning some ab=2 simulations on a 2.66GHz computer and taking 24 hours\neach.  Were all the other values minimized (except for ad=16,000?). \nWell it's got me thinking about being more careful about how parameters\nare assigned.\n\n\nThen, something I always thought was a hole missing from Radiance, and\nperhaps is really just a limitation in my own radiance knowledge is\nthis.  All other lighting programs that I am aware of allow you to place\ncalculation grids, run calcs, and then display the grid point results in\nrelation to the calculation model (though most can't do false color\nimages).  Most programs will even export the results to DXF for\nincorporation into CAD programs.  It seems rshow can do some of this?\n\n\nAnd last but not least, what is the trick on page 55?  Replicating\nimage maps in a way that their pattern does not become repetitive.  Are\nwe talking about making sure the edges match-up and that the image is\ngenerally uniform?\n\n\nWell thanks for responding to my original post.\n\n\nMark\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-May/001734.html).</sup>", "attachments": [], "created_by_name": "Mark de la Fuente", "created_at": "May 26, 2004 at 02:18AM", "created_by": "Mark_de_la_Fuente", "parent_id": "radiance-general_001733", "id": "radiance-general_001734"}