{"body": "Erik;\n\n\nThat looks like a good start.    But it still reads a bit complex for non-scientists.  Remember, you're addressing teenagers, amateur photographers, and artists (the ones posting ugly images on Flickr).\n\n\nIn the introduction, you should indicate that HDR means High Dynamic Range - you use both, but don't equate them.  I've spoken to several photographers who think HDR is a look, and have no idea that it might mean something else.\n\n\nOn the problem page:  Where is the \"executive summary\"?  Starting with \"Creating an HDR Image\" is good for a book on HDR imaging, but not for a teenager with a 3 second attention span.  I would suggest giving them your thesis up front, then going into detail.  (problem summary, solution summary, background, details, summarize again)  And be careful about disparaging specific software.\n\n\nWhere are directions on how to do it right?  You show some examples, and discuss some settings.  But can you point to tutorials, and other sites that host HDR images toned in a non-offensive manner?\n\n\nComparison - on the Flickr group, they'd go even farther than your example.  They'd push it until there are more artifacts than image.\nAnd I think you mean \"bad rap\" not \"bad wrap\".  You should probably restate your problem at the beginning of this page as well (\"HDR is not a style or look\", \"tone mapped images are supposed to look natural\").\n\n\nOverall, I think you've got the arguments and facts to back them up -- but the presentation needs to be geared toward the intended audience.\n\n\n\n\nChris Cox\n\"If it looks like charcoal smudges, you did something wrong.\"\n\n\n\n\n\n\n-----Original Message-----\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2008-July/000199.html).</sup>", "attachments": [], "created_by_name": "Chris Cox", "created_at": "July 07, 2008 at 12:42PM", "created_by": "Chris_Cox", "parent_id": "hdri_000197", "id": "hdri_000199"}