{"body": "Hi Erico,\n\n\nwhere did you put your measuring points exactly? And how do you measure \nthe incoming flux?\nIf you put the measuring points not directly on a surface and use photon \nmapping, then it is not surprising that you get strange results.  Then \nphoton mapping calculates the density estimate of the nearest photons in \nthe scene (which are per definition always on a surface). \nSo  if you wanna get the transmission of a pipe, you should \"close\" the \npipe at its bottom by a disk and put the measuring points directly on \nit. This disk shouldn't be completely black - even knowing that it \nreflects the light back to the top.\nThe same must be done for the incoming flux, so you need an extra run \njust for that and should put a disk at the top of the pipe.\n\n\nIn that case, you should get reasonable results also by using the metal \nmaterial.\n\n\nHey Roland, what's your opinion!?\n\n\nJan\n\n\n\n\nErico Rosa wrote:\n\n\n>Hi there,\n>\n>I would like to measure the illumination from a vertical pipe bringing\n>daylight into a building. I have two situations, a clear sky with 30 and\n>60 degrees solar angles - 75,000 and 40,000 Lux reaching the top of the\n>tube - and would like to measure the transmittance of the pipe at its\n>bottom, using materials with 95, 96, 97, 98 and 99% reflectance. Using\n>manual calculations I can fairly expect something between 52-88% and\n>80-96% transmittance for the 30-degrees and 60-degrees sky,\n>respectively. I initially used the metal material which has given me\n>very low numbers. When I switched to the mirror material with a faceted\n>tube (polygons) replacing the initial round tube, the numbers started to\n>match (or at least sort of). \n>\n>For measurements, I divided the ring in the bottom of the tube in\n>approximately 200 measuring points and retrieved numbers that vary from\n>5,000 to 150,000 Lux for the first tube and 9,000 to 400,000 Lux for the\n>later. Dividing the individual values for the number of measuring points\n>give me exact numbers for the \"30-deg\" tube, and numbers 20% higher (but\n>accurate when reduced) for the \"60-deg\" one. Being a newbie at this, I\n>am quite puzzled with the photon distribution and if the measurements\n>are accurate.  Is it the bandwidth that is producing numbers that far\n>low and high? Is it bias that is distributing the photon like this? \n>\n>I am testing with an 80 degrees solar altitude clear sky and the results\n>are 100% higher that I expected (but again, accurate when reduced).\n>\n>My parameters are:\n>\n>mkpmap -appb <file> 1000000 50 5000 - apc <file> 1000000 -ds 0.001 -dp\n>32768\n>rtrace -I+ -ab 1 -ad 32768 -aa 0.001 -ar 32768 -app <file> -apcb 50 5000\n>\n>Erico Naves Rosa\n>Doctor of Design Candidate\n>Harvard Design School\n>\n>\n>\n>_______________________________________________\n>Radiance-general mailing list\n>Radiance-general at radiance-online.org\n>http://www.radiance-online.org/mailman/listinfo/radiance-general\n>  \n>\n\n\n\n\n\n\nDipl.-Ing. Jan Wienold\nProject Manager\nFraunhofer-Institut für Solare Energiesysteme\nThermal Systems and Buildings, Lighting and Daylighting\nHeidenhofstr. 2, 79110 Freiburg, Germany\nPhone: +49(0)761 4588 5133 Fax:+49(0)761 4588 9133\njan.wienold at ise.fraunhofer.de\nhttp://www.ise.fraunhofer.de\n\n\nIn office: \nMo,Tue: 9:00-18:00\nWe-Fr:  8:30-14:00\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-February/003377.html).</sup>", "attachments": [], "created_by_name": "Jan Wienold", "created_at": "February 08, 2006 at 12:45AM", "created_by": "Jan_Wienold", "parent_id": "radiance-general_003374", "id": "radiance-general_003377"}