{"body": "pillo wrote:\n\n\n> i found a strange thing about  luminaire simulation:\n> i tried light+brightdata to map on a sphere the luminance desired (evaluated\n> by ies2rad) , it works, i see the light on the walls and the light emitting\n> ball...\n> but the STRANGE thing is that where the luminous flux is expected to be hi\n> (lower side of the ball), the luminance is low...\n> if you look at the scene you see floor and low portion of wall that receive\n> light BUT the ball is dark (upper luminance >lower luminance)\n> this is not correct.\n> i ll appreciate any help to  solve this strange problem\n\n\n\n\nSurfaces with light output distribution data applied can indeed\nlook very confusing in Radiance, because they may get a surprisingly\ndark look when viewed from outside their main emission direction.\nYou need to differentiate here between the luminous intensity of\nyour ball in a specific direction, and the luminance of a specific\nhalf of that ball. What really counts is the direction from which\nyou look at each specific point.\n\n\nDid you look at the ball from exactly below? I'm sure that you'd\nsee it glaringly bright from there. Since you see the lower half\nof the ball darker than the upper half, I suspect that your\neye point is located approximately within the lower cutoff area\nof the luminaire (in the border area of the output cone).\n\n\nYou're looking at the lower half of the ball in a flat angle.\nSince the luminaire emits little light in horizontal direction,\nyou see it darker under that angle. But when looking at the\nupper half, your view angle is steeper, which means that more\nlight is emitted in your direction from there.\n\n\nTo better understand the effect, just assume that the distribution\ndata aren't fixed in the center of the ball, but at each point\nyou're looking at individually. If you imagine the ball composed\nof very small patches (like a disco mirror ball), where each patch\nhas the same distribution attached, then the result you see might\nmake more sense.\n\n\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch.com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-July/000364.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "July 22, 2002 at 08:59PM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_000358", "id": "radiance-general_000364"}