{"body": "Just to add to what Rob said. I know that it is possible to arrange for \nequipment rentals directly from KonicaMinolta. This especially makes \nsense for the luminance meter which is indeed ~$3,000 at retail. Also on \nthe spot light that Rob mentioned, good camera equipment stores that are \nset up to provide rental equipment to professionals will have a wide \nselection of lighting. I know that for one exercise I rented a small \nspotlight where you could adjust the beam spread (sorry I do not \nremember the name/type) at a reasonable price.\n\n\n>\n> On Jun 3, 2006, at 8:30 AM, Marcus Jacobs wrote:\n>> So I think they are actually more complicated that the example that I \n>> showed to you before. Out of curiosity, just as many modeling \n>> software estimate a complex surface as a mesh of planes or triangles, \n>> could the same principle be used for the lighting fixtures \n>> themselves. In other words, instead of seeing each fixture as a \n>> single complex surface, can it be considered it as just a group of \n>> flat planes? One item that I need to have addressed is whether I \n>> should model the diffuse shades a single surface or if it acceptable \n>> to have inner and outer surfaces (you can think of it as having a \n>> thickness to it). See here:\n>>\n>> http://i35.photobucket.com/albums/d178/marcdevon/luminaireview.jpg\n>\n> Hi Marcus,\n>\n> Without actual photometric data (such as an ies file) to apply to your \n> group of flat planes, you have to model the actual comple geometry.  \n> But I'm afraid I may have misunderstood your question.  As for the \n> single/dual surface question, I guess it depends on how close your \n> views will bring you to the shade.  The trans material is infinitely \n> thin, and it'd be best to model the thng as a single surface.  For \n> closeup work, you may need to introduce thickness but that's gonna get \n> a lot more complicated from a valid material definition standpoint.\n>\n>\n>>\n>>\n>> The information in Rayfront's user manual and pages 325-326 from RwR \n>> were VERY useful to me in gaining insight as to how Radiance treats \n>> light. There was a word that was mentioned that has me worried. \n>> Measure. Aside from not having any experience with performing a \n>> empirical test of light distribution, measuring light sounds very \n>> expensive. May I ask, would purchasing the needed equipment require a \n>> second mortgage to be taken out or giving up one's first born? Is it \n>> required to use transfunc or transdata in lieu of trans to obtain \n>> acceptable accuracy?\n>\n> Mmmm, measurements, yeah.  The gear can be expensive.  Let's see, at \n> my old job, where I did these measurements, I used an illuminance \n> meter, a luminance meter and a theatrical spotlight (ETC Source Four \n> HID, aka \"leko\", or ERS).  The light fixture was a free sample, but \n> you could use other sources too.  The illuminance meter (Minolta \n> Somethingorother-nowdiscontinued) was about $800 and the luminance \n> meter (Minolta LS-100) was more expensive, I believe almost three \n> thousand USD.  Actually, here are a couple of links I just found for \n> the meters I used (the illuminance meter I link to here is a newer \n> model than I used, but it's basically the same thing).\n>\n> http://www.tequipment.net/MinoltaTL1.asp\n> http://www.tequipment.net/MinoltaLS100.asp\n>\n> It's expensive not to mention time-consuming, but it's also fun and is \n> an excellent example of the power of Radiance, in that Radiance is \n> happy to accept material data as complex as you are willing to gather.\n>\n> Maybe Peter can chime in with his thoughts on this stuff, and maybe an \n> update on his goniophotometer project?\n>\n> - Rob\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n>\n\n\n\n\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-June/003748.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "June 05, 2006 at 02:59PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_003743", "id": "radiance-general_003748"}