{"body": "> Hi Jeffrey,\n> \n> What CAD program are you using?  What exporter are you using?\n\n\nI am using AutoDesk Revit for the modeling, then exporting\nfrom that to AutoCAD where everything becomes a polyface mesh,\nand then using RADOUT to generate my .RAD files. The other\napproach I've done is to export from Revit to DXF in parts,\nand then use the DXF2RAD tool to translate them into .RAD.\n\n\nThe problem I have, and hence why I have to use AutoCAD\nas an intermediary currently, is that AutoDesk Revit doesn't\nhave the ability to export geometry so that material = layer\nwithin a DXF or DWG; instead it places elements upon layers\nbased upon those elements classification; i.e. existing walls,\nnew furniture, site elements, etc. Revit also currently lacks\nan API, so I can't write my own Radiance exporter for it.\n\n\nSo, the best way I've found to export from Revit to\nRadiance is to first export to a DWG or DXF file, open\nthat in AutoCAD, swap things onto layers per what\nmaterial I want them to be, then use RADOUT to generate\nmultiple .RAD files.\n\n\nHowever the modeling capabilities of Revit *far* outshine\nthose of AutoCAD when it comes to modeling buildings; so\neven having to jump through these translation hoops, it's\nstill faster than modeling in AutoCAD to begin with. Revit\nis, more or less, 'Inventor or SolidEdge for Architects'.\n\n\n>  You have  \n> to understand that the basic building block of ACIS-based modeling  \n> programs -- when talking to other software -- is the damned \n> triangle,  \n> unfortunately.\n\n\nThat's what I've encountered.\n\n\n> It's not a  \n> Radiance limitation, it's an ACIS translation problem.\n\n\nOh no, I never ment to imply that it was a Radiance\nlimitation; I meant to imply that it was a limitation\nwith the translation programs; in that\nthey aren't aware enough to translate, say, a cylinder\nin a DXF to a cylinder in Radiance.\n\n\n> AutoCAD, when used with Georg Mischler's Radout program  \n> (http://www.schorsch.com/download/radout/), can produce much cleaner  \n> models.  I use AutoCAD and 3D faces as much as possible.  \n\n\nAnother benefit of using AutoCAD as an intermediary\nfrom Revit is what you mention here; indeed using the\nRADOUT tool I've had much less issue with aiming failures,\nas well as replacing the luminescent parts of my light\nfixtures within AutoCAD with simple AutoCAD 3Dface elements\nhas helped immensely.\n\n\n> When you use  \n> 3D solids in AutoCAD, the only way to get them out of ACAD is to  \n> convert them to a 3DStudio mesh first, and that means triangles (and  \n> oftentimes, LOTS of triangles).\n\n\nI'm not using Soilds anymore; when I export from\nRevit, everything comes into AutoCAD as a polyface\nmesh.\n\n\n> As for the placement of native Radiance geometry, have a look at  \n> replmarks \n> (http://radsite.lbl.gov/radiance/man_html/replmarks_1.htm).   \n> You can use your CAD program to place (with great accuracy and  \n> familiarity) markers that can be easily swapped out with a \n> .rad file or  \n> an octree (but don't use octrees for light sources, as I \n> found out the  \n> long way  \n> [http://www.radiance-online.org/pipermail/radiance-general/200\n> 3-August/ \n> 000946.html]!)\n\n\nThanks a great deal for this link. I'm certain that\nthis will help a great deal! Something like this\nwas exactly what I was looking for; lacking the\nability to make 'good' RAD files directly from\nmy CAD software, I needed some way to easily\n'swap' elements within my scenes. Thanks again!\n\n\n> Right now I use CAD and try to use  \n> 3Dfaces as much as possible, export with radout, and do some \n> replmarks  \n> shenanigans for swapping out light sources.\n\n\nThis sounds like what I'll do, at least until\nRevit has an API!\n\n\nThanks again,\n\n\nJeffrey\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-October/001108.html).</sup>", "attachments": [], "created_by_name": "Jeffrey McGrew", "created_at": "October 22, 2003 at 09:36AM", "created_by": "Jeffrey_McGrew", "parent_id": "radiance-general_001102", "id": "radiance-general_001108"}