{"body": "Jack de Valpine wrote:\n> Hey Rob,\n> \n> Do the shades all have the same reflectance or (Cr, Cg, Cb)?\n\n\nNo, and this is one of the things I have been wondering about.  It was \nmy understanding that when specifying trans, that transmittance was \nsoley determined by the Td and Ts parameters (talking about the \"Ehrlich \nassumptions\" that Chas has set up in RwR).  But perhaps that's it, the \nnet transmission of the trans is calculated *after* the reflectance has \nbeen taken into account?  I did a test of that while testing all these \nshades, where I had a 5% transmissive shade, and ran it once with the \nreflectance at 20%, and another where the shade was 70% reflective, but \nthe results were very similar, so I thought that my original assumption \nwas true, that transmission was unaffected by reflectance.  But in \nlooking at the data from the second pass of these tests, where Greg \nsuggested the -lw bit, the values for the 70% reflective shade are much \nlower than the values for the 20% reflective shade.  Hmmm...\n\n\nHowever, the difference in reflectance of my shades is not that great. \nthe 10% shade has a 30% grey reflectance, and the 5% and the 1% shades \nare 20% reflective.  I don't see how a 10% change in reflectance could \naffect the calculated values by 100%, which is what's happenning.  Hmmm, \nagain.\n\n\nStill, thinking about it right now, it seems like that might be it.  It \nseems obvious.  Now.  I will test it out right now.  If this is the \nculprit, I owe you a beer.\n\n\n> I think you indicated that the glass is translucent, what is the makeup? \n> How are you measuring it?\n\n\nThe glass is another story, I won't bore you with the details, I'm \nalready way over my bandwidth limit on this list this month, but it was \nextensively measured and validated against a 1/2 full scale physical \nmockup, and inspected by Greg.  I'm confident in my glass material \ndefinitions, at least.\n\n\n\n\n\n\n      Rob Guglielmetti\n\n\ne. rpg@rumblestrip.org\nw. www.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000751.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "May 14, 2003 at 04:46PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_000733", "id": "radiance-general_000751"}