{"body": "Hi David.\n\n\nI just did a fresh install of my system (now Snow Leopard) and had to\ninstall Radiance again. I have used the source distribution for a while\nbut because of your problems and the nearly 4.0 status of the HEAD\nrelease I decided to try to compile again. It worked fine for me but\nhere are some comments:\n\n\nOn Sat, Oct 31, 2009 at 10:01 PM, David Appelfeld <d.appelfeld at gmail.com> wrote:\n> What I did so far.\n>\n> Install Xcode and downloaded radiance-HEAD.tgz, and rad3R9supp.tar.gz.\n\n\nSame here. I used the \"Developer\" bundle on the CD to install Xcode and did\nnot download anything. Source code archives are from radiance-online.org\ntoday.\n\n\n> Then unpack them inside ray folder according to the instructions on\n> http://www.radiance-online.org/software/ .\n\n\nI unpacked everything in a folder in my home directory. It really doesn't\nmatter where you unpack it. You don't need to create a ray folder. That\nwill be created for you. Make sure that both archives extract to the same\nfolder.\n\n\nHere is a note for Greg: I downloaded the \"official\" 3.9 release before and\ntried to compile that. I always had some problems if the \"tiff\" directory but\nexcept for ra_tiff all tools got compiled. Only the error with the\ntifflib prevents\nthe installation of these binaries. Perhaps the installation could be a bit\nmore fine grained to install what can be successfully compiled.\n\n\nI had no problems compiling ra_tiff with the HEAD release and the\nadditional rad3R9supp.tar.gz download file. Perhaps there is a dependency\nthat the makefile should be adjusted for. I thought that the source archive\nshould be enough to compile all the binaries.\n\n\nBack to David's problems:\n\n\n> Then place ray folder to usr/local/lib/ray and run sudo ./makeall install.\n\n\nNo, don't do that. The necessary files will be copied to the /usr/local/lib/ray\nwith the \"makeall library\" command. Having the source files already in that\nplace might confuse things.\n\n\n> It started to install, but it ended again with message \"There were some\n> errors.\"\n>\n> Here is part of the text from terminal with errors:\n> ....\n> lipo: can't open input file: /var/tmp//cc7tPgdL.out (No such file or\n> directory)\n> make: *** [rpict] Error 1\n> cc -I../common -L../lib -O2 -arch ppc -arch i386 -DBSD -DNOSTEREO -Dfreebsd\n> -I/usr/X11R6/include -L/usr/X11R6/lib -isysroot /Developer/SDKs/MacOSX10.4u.sdk -o ./rvu rvmain.o rview.o rv2.o rv3.o devtable.o devcomm.o editline.o x11.o x11twind.o colortab.o ../lib/libradiance.a -lrtrad -lm -lX11\n> ld: library not found for -lcrt1.10.5.o\n> collect2: ld returned 1 exit status\n> ld: library not found for -lcrt1.10.5.o\n> collect2: ld returned 1 exit status\n> lipo: can't open input file: /var/tmp//cczmztgf.out (No such file or\n> directory)\n> make: *** [rvu] Error 1\n> cc -I../common -L../lib -O2 -arch ppc -arch i386 -DBSD -DNOSTEREO -Dfreebsd\n> -I/usr/X11R6/include -L/usr/X11R6/lib -isysroot\n> /Developer/SDKs/MacOSX10.4u.sdk -o ./lookamb lookamb.o ambio.o -lrtrad -lm\n> ld: library not found for -lcrt1.10.5.o\n> ld:collect2:  library notld returned 1 exit status\n>  found for -lcrt1.10.5.o\n> collect2: ld returned 1 exit status\n> lipo: can't open input file: /var/tmp//ccXciAPr.out (No such file or\n> directory)\n> make: *** [lookamb] Error 1\n> ....\n>\n> I guess it is something with wrong path or environment, I am not sure.\n\n\nAccording to these outputs you are running OS X Tiger on a PPC\nMac. Is that correct? If you have OS X Leopard you should update\nXcode to match the system you're using.\n\n\nIf you have an Intel CPU you can remove the option \"ARCH=PowerPC\"\nand \"CONFIGURE_ARCH=powerpc\" from the build instructions that are\nshown at the beginning of the install script.\n\n\n> I also did as Mark suggested:\n>\n>>All you should need to do is set up your environment. If you are\n>>using the bash shell (check with \"env | grep SHELL\") then add the\n>>following lines to your ~/.bashrc file:\n>>\n>>export PATH=.:/usr/local/bin:${PATH}\n>>export LD_LIBRARY_PATH=/usr/local/lib:${LD_LIBRARY_PATH}\n>>export MANPATH=/usr/local/man:${MANPATH}\n\n\nThe first line allows your bash shell to find the radiance commands\nlike rpict, rtrace etc. So you just need to write \"rpict ...\" instead of\n\"/usr/local/bin/rpict ...\"\n\n\nThe second line I think should read:\n\n\nexport RAYPATH=\"/usr/local/lib/ray:${RAYPATH}\"\n\n\nRAYPATH is used when Radiance runs and needs to find some files\nlike patterns and *.cal files. LD_LIBRARY_PATH is only used when you\ncompile applications, not when you use them. (And then it seems open\nfor discussion if it's right to set this variable.)\n\n\nThe last line is fine (although I personally prefer \"/usr/local/share/man\").\nIt allows you to type \"man rpict\" to have the essential documentation\ndisplayed. The Radiance install script does not copy the man pages to that\ndirectory, though. You have to do this manually after the installation:\nCopy the contents of ray/doc/man to ie. /usr/local/share/man and add this\nline to the bash config (see comments below).\n\n\n>>And then re-source that file with \"source ~/.bashrc\" and you\n>>should be good to go. That's an effective installation path, as\n>>far as I know.\n>\n> I wrote that to the end of file \"bashrc\" at /etc/bashrc. I was not sure how\n> to re-source that file so I just write \"source ~/.bashrc\" to the beginning\n> of file \"profile\" at /etc/profile, but this probably dost not work.\n\n\nBash environment files are a bit complicated on graphic systems like X\nor Mac's Aqua. If you only plan to use the terminal application then you\nshould add those configuration lines to the file \".bashrc\" (mind the leading\ndot) in your home directory. If it does not exist you can create it.\n\n\nIf you ever use SSH to log in to your machine you have to use some\nmore tricks to get it to work.\n\n\nRegards,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-November/006328.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "November 01, 2009 at 11:52AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_006316", "id": "radiance-general_006328"}