{"body": "Dear Greg, Jennifer,\n\n\n > The sensor file is normalized to 1.0 in arbitrary \"response\" units.\n > Think of it as a multiplier on the incoming radiance value in each\n > direction.\n\n\nSo I shouldn't think of it as an 'inverse' IES file, then. I've just run \nsome simple examples with an ideal cosine data file, and the results do \nmatch the one I get from rtrace. Multiplying each value in the matrix \nwith 2.0 gives me twice the illuminance.\n\n\nI guess that the real question should be 'what do these sensors actually \nmeasure?'. It's not lux, because for this they would have to be cosine \nand v(lamda) corrected, which one could expect from a 500 Pound lux \nmeter, but not from a 5 Pound sensor. I guess it all boils down to the \ncommissioning of the sensors. The only thing we can say with certainty \nis that they measure 'some sort of radiation thing', which is different \nin different directions.\n\n\nSo is it correct to assume that SPOT only uses the relative response \nfrom the photocells, and not absolute W/m2 or lux values?\n\n\n >> b) What would the sensor file for a normal, cosine corrected\n >> illuminance meter look like? Does it need to have its maximum\n >> at 1.0 for an angle of (0,0)?\n\n\n > Yes to the second question, with 90 degrees being the maximum polar\n > angle, whose value is zero at all azimuths.  For this distribution,\n > rsensor will produce horizontal irradiance in watts/m^2, which\n > converts to lux using the standard 179 multiplier.  A uniform sky of\n > 100 watts/sr/m^2 would produce a value of 314.16 watts/m^2, or 56235\n > lux, for example.\n\n\nHere is my own cunningly crafted cosine response. Just one column of \nazimuth values at zero degrees wouldn't work:\n\n\ndegrees\t0\t90\t180\t270\n0\t1.0000\t1.0000\t1.0000\t1.0000\n10\t0.9848\t0.9848\t0.9848\t0.9848\n20\t0.9397\t0.9397\t0.9397\t0.9397\n30\t0.8660\t0.8660\t0.8660\t0.8660\n40\t0.7660\t0.7660\t0.7660\t0.7660\n50\t0.6428\t0.6428\t0.6428\t0.6428\n60\t0.5000\t0.5000\t0.5000\t0.5000\n70\t0.3420\t0.3420\t0.3420\t0.3420\n80\t0.1736\t0.1736\t0.1736\t0.1736\n90\t0.0000\t0.0000\t0.0000\t0.0000\n\n\nDoes rsensor use a linear interpolation to fill in in-between rows?\n\n\n >> c) Suppose I wanted to model an illuminance meter that has\n >> a correct cosine response, but gives a reading twice as high as\n >> is should be.\n >> Would I need to multiply the values from b) by the cube root of 2?\n >> Cube root because the overall response appears to be proportional\n >> to the volume contained within the 3d shape of the curves.\n\n\n > It should be a simple proportion, so multiplying all values by 2.0\n > should give you what you expect.  I just confirmed that it works\n > that way.\n\n\nI am still puzzled that the response is not proportional to the volume \nof the shape, or at least the area of the curve. Guess that's just the \nway it is, and there isn't really any strict photometric or radiometric \nreason behind this...\n\n\n >> It seems that the\n >> standard Radiance data file would have been sufficient to describe\n >> the sensor's characteristics. What is the advantage of using the\n >> SPOT format? Why not have a spot2rad (similar to ies2rad) import\n >> filter instead?\n\n\n > As I understand it, SPOT is an Excel-based program, so putting the\n > data in a format that isn't Excel-friendly didn't really suit Zack\n > Rogers and the other developers.  Charles Ehrlich had written an\n > earlier equivalent to rsensor that already used this data format,\n > and since ArchEnergy hired me to develop a more efficient approach,\n > they had the prerogative to specify the input and output.\n\n\nThis makes perfect sense now.\n\n\n\n\n\n\n > so you can download the program and take a look at the files\n > and implementation - if you haven't already.\n\n\nIt requires Windows and Excel, and while I have access to a Windows \nmachine, I don't have Excel. Do you plan on making it cross-platform and \nOpenOffice compatible?\n\n\n > c)I might be misunderstanding the question but you should just\n > multiply the sensitivity values by 2 if you want double the signal.\n > This will increase the volume by 2^3 but is not used to scale the\n > sensitivity file.\n\n\nGreg explained this, thanks. I understand it's all relative.\n\n\nThank you\n\n\nAxel\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-October/006269.html).</sup>", "attachments": [], "created_by_name": "Axel Jacobs", "created_at": "October 12, 2009 at 04:34PM", "created_by": "Axel_Jacobs", "parent_id": "radiance-general_009589", "id": "radiance-general_006269"}