{"body": "Hello.\n\n\nMy name's Thomas and I'm an ACAD user ...\n\n\nMy way to Radiance usually involves Blender which has another set of\nlimitations (it can't read 3ds 4.x files). So my workflow is\n\n\n1) export from ACAD 2004 to 3ds ('3dsout')\n    this does all the tesselation and expansion of solids\n\n\n2) import into a new ACAD file\n\n\n3) export new file to DXF 2000 format\n\n\n4) read DXF into Blender\n\n\n5) export to Radiance\n\n\nNot the best way but it works and we do not need to do it often.\n\n\nI asked a Relux rep about the ability to export geometry from\nAutocad and he said there are no problems or limitations with\nAutocad 2006. I don't know how Relux Vision (which is the\nRadiance part of Relux) manages it's files but for someone who\nhas a licence it might be worth a try.\n\n\nFinally I started to write a DXF to Radiance converter for a special\nproject. It should work with every version of DXF because it simply\nignores entities it does not know anything about. Currently it knows\nabout polylines and lines. 3Dfaces might follow soon but I have not\nyet looked at solids and might not do so for a while. \n\n\nThomas\n\n\n***********************************************************************************\nThis e-mail, (and any attachments) is confidential and may be privileged.  It may be read, copied and used by the intended addressee only.  If you have received this in error please contact BDP immediately. \n\n\nIf you have any queries, please contact the sender.\n***********************************************************************************\nBuilding Design Partnership\nRegistered in England No 2207415:\nRegistered Office: Building Design Partnership Ltd, Sunlight House, PO Box 85, Quay Street, Manchester, M60 3JA, http://www.bdp.co.uk\n***********************************************************************************\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-September/003971.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "September 07, 2006 at 05:57PM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_003959", "id": "radiance-general_003971"}