{"body": "Hi Carlos,\n\n\nAre you predicting glare using the DGI?  if you are, there may be some errors produced by potential glare sources behind the field of view.\n\n\nfindglare identifies potential glare sources.  then glarendx -t dgi takes these sources and calculates glare indices in a range of directions.  take a look at the predicted dgi's at adjacent directions.  if there is an obvious jump in dgi between adjacent directions, then you probably have a glare source behind the field of view.  To fix, simply remove the offending glare source from the file output by findglare, and re-run glarendx -t dgi.  if that doesn't make any sense, let me know and i'll send you a spreadsheet i developed to identify problematic glare sources.\n\n\nFor Greg, or whoever else might be interested, the problem is in the calculation of dgi's omega in glarendx.c.  where the glare source is behind the field of view, posindex returns -1, p becomes 0 and omega is much bigger than adjacent levels.  this means the glare source is artificially inflated, and the glare index jumps up.\n\n\nPhil.\n\n\n_______________________________\nPhillip Greenup\nSpecialist Engineer\nArup Australasia\nLevel 10, 201 Kent St\nSydney NSW 2000\nPh (02) 9320 9426\nFax (02) 9320 9321\n\n\n\n\n>>> carlosochoam@yahoo.com 18/11/2003 9:15:11 pm >>>\nHi Greg,\n\n\nThe pictures were generated using the fish-eye view, they\nare looking from the middle of one of the long walls of the\nroom to the other (the expected position of the user). So I\nhave the window on one side of the picture and the bottom\nof the room on the other.\n\n\nI give the findglare both the octree and the picture name,\nbut I get the same results just as if specifying only the\npicture. By the way, just giving findglare the octree and\ndirection of the view gives an error message in DR 2.0. I\nhave also increased the number of ambient bounces, but it\ndoesn't change, either.\n\n\nCarlos\n\n\n_________________________________________________________\nDo You Yahoo!?\nInformación de Estados Unidos y América Latina, en Yahoo! Noticias.\nVisítanos en http://noticias.espanol.yahoo.com \n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org \nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-November/001213.html).</sup>", "attachments": [], "created_by_name": "Phillip Greenup", "created_at": "November 19, 2003 at 09:08AM", "created_by": "Phillip_Greenup", "parent_id": "radiance-general_001204", "id": "radiance-general_001213"}