{"body": "Hi Everyone,\n\n\nEarlier this week Greg inspired me to look deeper into mkillum code to\nunderstand exactly how mkillum gets arrives at the illum.dat output\nresolution.  It resulted in a double a-ha moment that I wanted to share to\nclose out this thread.\n\n\nFirst A-ha: the reason for the apparent +1 in the illum.dat resolution:\n\n\nFollowing the calculation for hemisphere divisions in the mkillum code I\nstill got a sampling resolution of 12x38 instead of 13x39 that is written to\nthe illum.dat file.  It turns out that the hemisphere sampling resolution\n*is* 12 x 38, but mkillum purposely writes writes an illum.dat array that is\none greater in both dimensions.  It makes perfect sense when I consider\ninterpolation.  \n\n\nThe 0 degree phi value is repeated as a 360 degree value (line 363 of\nmkillum3.c). This simplifies interpolation between the last phi value and\nthe first phi value in a theta row.\n\n\nThe extra theata row is less than 0 degrees (or greater than 90 degrees\naltitude). This is added so to allow interpolation towards a consistent\nzenith value.  The extra values in the illum array are twice the average of\nthe values in the upper theta row minus the value in the current phi\ndivision (line 267 of mkillum3.c).  The values are place on the other side\nof the zenith (over the top).  The result is that as theta approaches zenith\nthe interpolated result approaches the same zenith value for all phi\ndivisions.  \n\n\nIn most cases this avoids anomalies at the zenith.\n\n\n\n\nSecond A-Ha: The cause of an artifact I was witnessing when testing my bsdf\nwith mkillum:\nhttp://www.mcneilorama.com/radiance/BSDF/mkillum.html\n(See sun position 2 & 3)\n\n\nThe over the top interpolation explains an artifact that occurs when one of\nthe illum values in the near zenith row is much greater the the others in\nthe  row ( in this case due to direct sunlight).  The high value increases\nthe computed average for the zenith.  Then the over the top interpolations\ncreate a bright circle between the upper theta row and the zenith.\n\n\nNow that I know what causes the artifact I can safely ignore it.  These sun\npositions used in the renderings are simply for testing the behavior.  The\nsun will never be close to the zenith of the mkillum.  In fact the panelite\ndimensions were specifically determined to preclude sunlight from passing\ndirectly into the gallery.\n\n\n\n\n\n\n\n\n\n\n\n\nOn 12/10/09 8:30 PM, \"Greg Ward\" <gregoryjward at gmail.com> wrote:\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-December/006427.html).</sup>", "attachments": [], "created_by_name": "Andy McNeil", "created_at": "December 18, 2009 at 09:49AM", "created_by": "Andy_McNeil", "parent_id": "radiance-general_006388", "id": "radiance-general_006427"}