{"body": "Dear Séverine,\n\n\n\n\n\n\nI retract my answer from this morning – not quite awake yet, sorry. Basically, I would support Germán. There is also the tool WIS available, which (also) calculates according to ISO 15099. Depending on the level of detail you are seeking, it may be of interest to look at the Tools “TRISCO/VOLTRA” from Physibel. These would also include thermal transport through framing etc. if you are thinking of curtain walls (lots of metal, often). They are slightly less capable in terms of glass description but geared toward energy.\n\n\n\n\n\n\nAnyway, developing a tool which goes beyond the mentioned (in depth of detail and accuracy) is definitely not an easy task … good luck!\n\n\n\n\n\n\nBest\n\n\nAchim\n\n\n\n\n\n\n\n\n\n\nVon: Germán Molina Larrain [mailto:germolinal at gmail.com] \nGesendet: Donnerstag, 7. April 2016 13:48\nAn: Radiance general discussion\nBetreff: Re: [Radiance-general] Asking for informations\n\n\n\n\n\n\nHi Séverine,\n\n\nI often use Radiance for performing calculations in the solar range. In that case, I just use grey surfaces (R=G=B=solar reflectance), and ask the Perez sky models to give me solar instead of visible Radiance (I think this is done using O1 option in the command line).\n\n\nIt is important to notice that these methods will not consider convection and far infrared radiation, thus the absorbed-reemited heat will not be considered.\n\n\nOn the other hand, depending on the geometry of your facade system, it might be worth calculating the BSDF (using genBSDF). Then, the BSDF may be imported to Window for estimating solar heat gain coefficient, considering convection and FIR radiation.\n\n\nIf you want to avoid Window, the method used by it to calculate absorption on each layer is very well documented y two papers by J.H.Klems. Then,  ISO15099 will give you a hint on how to calculate the solar heat gain coefficient from all the information you have at that point.\n\n\nThose three components would allow you, respectively, to:\n\n\n1. Calculate transmission and reflection of each layer (genbsdf)\n2. Calculate absorption on each layer (Klems)\n3. Calculate the inward flowing fraction of the absorbed radiation (iso15099)\n\n\nYes... Avoiding windows is hard.\n\n\nBest,\n\n\nEl 7 abr. 2016 03:23, \"Achim Geissler\" <achim.geissler at intergga.ch> escribió:\n\n\nDear Séverine,\n\n\n\n\n\n\nfrom my point of view, if your interest lies with solar >energy< gain, then Radiance is not really best suited. Typically, what you describe is covered by thermal building simulation tools to a quite high degree of detail (ESP-r, EnergyPlus, IDA-ICE, TRNSYS to name a few). It would likely be quite difficult or probably even impossible e.g. to model the secondary heat gain through windows / glazed facades (or opaque facades, for that matter). Also, “what goes through” is not the whole story. What happens in the building is also of major interest to be able to decide if the gains are “useful” or “harmful”.\n\n\n\n\n\n\nWhy do you think you need the ray tracing approach?\n\n\n\n\n\n\nBest\n\n\nAchim\n\n\n\n\n\n\n\n\n\n\nVon: Séverine HUET [mailto:S.HUET at vs-a.eu] \nGesendet: Mittwoch, 6. April 2016 15:35\nAn: radiance-general at radiance-online.org\nBetreff: [Radiance-general] Asking for informations\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nVS-A.jpg\n\n\nVS-A\n\n\n\n\n\n\n\n\narchitectes d.p.l.g / ingénierie de l’enveloppe\n\n\n\n\n\n\n\n\n\n\n\n\nHi Radiance team,\n\n\n\n\n\n\nI am a student in an engineering school and I am currently doing an internship in a design office specialized in building envelope studies. \n\n\n\n\n\n\nMy work consist in developing a tool to determine precisely the solar factor of a facade, taking into account its shading devices and its geometry which can be complex sometimes.\n\n\n\n\n\n\nMy idea is to use the software Grasshopper to:\n\n\n1.    Import a geometry\n\n\n2.    Define the materials of the scene\n\n\n3.    Create the Radiance geometry \n\n\n4.    Create two analysis grid (vertical): one before the system “shading+facade” to determine the incident solar energy, and one inside my building to determine the transmitted solar energy.\n\n\n5.    Then, use the Ray Tracing method to calculate the solar energy on each point…\n\n\nThis method seems interesting for my problematic but the calculations under the hood may be not relevant for solar energy, insofar as it is designed for light calculations and realistic rendering.\n\n\n\n\n\n\nQuestions :\n\n\n1)    I apology if I am missing something obvious, I have done some researches about the “Ray tracing” method used by Radiance but I still have some interrogations about how it works… Is the ray divided in many rays when it punch a surface ? What is the different between the direct light and the diffuse light (in terms of modeling) ? Is there a way to convert R G B radiance provided by Radiance in solar energy for instance (like it is done for luminance) ?\n\n\n\n\n\n\n2)    I must not be the first to process this kind of problematic, so I am wondering if it exists a calculation engine derived from Radiance which can provide the solar energy using a kind of “ray tracing” method? \n\n\n\n\n\n\nFor me, in principle, it is not that complicated, I mean it is possible. The problematic is purely geometric and mathematic. I imagine: the ray launched is define by a wave length, an intensity and a direction (to model the direct radiation). When it reaches a surface, the intensity took into account is the intensity of the surface’s normal projection of the ray. Then the ray is divided in 3 rays: one transmitted, one reflected and one absorbed, whose proportions (in terms of intensity) and directions depend on the material definition of the surface reached. This last can react differently according to wavelength domain of the ray. Do the same with diffuse rays, to model the diffuse radiation. The absorbed part of the incident energy could be transformed in heat (Infrared radiation) according to the emissivity of the surface.\n\n\n\n\n\n\nI am sorry about the lenth of the message. I really need to understand how I can do to determine solar energy through different kind of materials (translucent, transparent, opaque…). I would be really thankful if you help me! This project constitute my graduation project, it is quite ambitious that’s why I need some guidelines.\n\n\n\n\n\n\nThank you in advance, \n\n\nYours sincerely\n\n\n\n\n\n\nSeverine Huet\n\n\n\n\n\n\n\n\n\n\nVS-A, architectes d.p.l.g / ingénierie de l’enveloppe\n\n\n\n\n\n\n\n\n41 place Rihour / F-59000 LILLE – France\n\n\nTél : +33 (0)3.20.52.11.44 <tel:%2B33%20%280%293.20.52.11.44>  ; Ligne directe : +33 (0)3.20.52.xx.xx / Fax : +33 (0)3.20.52.05.15 <tel:%2B33%20%280%293.20.52.05.15> \n\n\nemail :  <mailto:courrier at vs-a.eu> courrier at vs-a.eu  / email direct :  <mailto:S.HUET at vs-a.eu> S.HUET at vs-a.eu /  <http://www.vs-a.eu> www.vs-a.eu\n\n\n\n\n\n\n\n\n\n\nCe courriel (et ses pièces jointes) est adressé exclusivement à son destinataire ; il n’a pas de valeur hors de ce contexte précis et peut être confidentiel. Nous remercions d’avance les destinataires involontaires de s’abstenir de le dupliquer de quelque manière que ce soit, et de le détruire. Merci également de bien vouloir en avertir l’expéditeur.\n\n\n\n\n\n\nThis e-mail (and its attachments) is intended to be for the only use of its recipient; the message is worthless out of this specific context and may contain confidential information. If you have received this e-mail by mistake, please do not duplicate it in any possible way. Thank you as well for notifying us immediately and deleting this e-mail.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-April/011672.html).</sup>", "attachments": [], "created_by_name": "Achim Geissler", "created_at": "April 07, 2016 at 07:26AM", "created_by": "Achim_Geissler", "parent_id": "radiance-general_011666", "id": "radiance-general_011672"}