{"body": "On Wed, 1 Dec 2004, Lars Grobe wrote:\n\n\n> Hi!\n>\n> > In general you need to print to a print device that goes direct rgb.\n>\n> ??? You mean a driver that can do the rgb to cmyk translation, without the\n> need to do that in an application? Just wondering, I never heard about\n> rgb-printers, do you mean transfering to a film (which is like foto and as\n> such rgb)?\n>\n> Regarding printers, it is a big help to use printers that don't offer just\n> cmyk, but also the light colors (there are 6 and 8 color printers), as this\n> avoids raster problems in bright regions of your renderings.\n\n\nThis is where the Lightjet family of printers is different. They\nupsample the image to ~4000dpi and expose photographic paper with\nlasers. I suppose they use red, green, and blue lasers, but I\nhave no documented proof. I have been very happy with the output.\nIf you managed to make it to SIGGRAPH in the last 3 years, you\nmay have seen these samples of Radiance-rendered work, in\nlarge-format, hanging in the Art Gallery.\n\n\n> Calibration... afaik the radiance output is close to srgb, so if you have an\n> output profile for your printer (icc), this should be easy. There is also\n> macbethcal which could be used to make a simple output calibration, however,\n> I never used it (I tried once).\n\n\nI find that when I call a professional photo/printing business\nand start talking technical, I get forwarded to the specialist,\nwho takes something of an interest once I mention that I have no\nICC profiles, and my work isn't from a Mac or a PC.  I've learned\nthat (if I set my monitor's gamma to ~2.2) what I see on my\nmonitor looks very much like what gets printed when I dictate\n\"assign no profile\" or \"assign sRGB.\" Maybe the sRGB one looks a\nlittle more \"correct,\" or a little less saturated. I have a hard\ntime telling the difference.\n\n\n> I can't imagine that the bit per channel question is really relevant (for\n> inkjet printing), because the limitations of paper and the raster technique\n> used to mix the colors.\n>\n> I will have to do some large-format printouts of radiance pictures (which\n> have to be rendered first ;-) for an exhibition next march, as such I am\n> interested in the topic.\n\n\nAnother bit of advice: learn about the printer that you're using,\nand send it the best possible pixels that you can. Insist that\nthey print at that resolution. Most printers are used to folks\nprinting enlargements of bad photos. It helps to talk to the\nperson who will actually run the machine and explain that there\nis minute detail that is important. For the Lightjet 5000, I\nalways send a 300 dpi file, and I always antialias by pfilt'ing\nmy final rendering down at least 3:1 (sometimes more).\n\n\nI hope my experiences have helped. It has taken me quite a few\nyears to learn how to \"talk the talk\" and get a good image\nprinted.\n\n\nMark\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-December/002195.html).</sup>", "attachments": [], "created_by_name": "Mark Stock", "created_at": "December 01, 2004 at 09:39PM", "created_by": "Mark_Stock", "parent_id": "radiance-general_002190", "id": "radiance-general_002195"}