{"body": "Nick,\n\n\nThe direct sky component should be a snip.  I guess your points are  \nin a horizontal plane, so the spawned rays will not see the ground  \nglow and you can leave it in the description.  Set the following:\n\n\n-ab 1    You need the first level of hemispherical sampling so that  \nrays are sent to the 'glow' sky.\n-aa 0    This switches off interpolation and is likely to give you  \nmore precise results (generally not advised when ab > 1).\n-ad 1024 then 2048, if there's a significant difference, proceed to  \n4096 and so on...\n-as 256 or thereabouts.\n-av 0 0 0\n-ar - doesn't matter because aa is 0\nNo need to bother with the ae or aE parameters for the direct sky  \ncomponent.\n\n\nAnd, of course, you have rtrace set to predict irradiation.\n\n\nI would (strongly) advise against using mkillum to predict the direct  \nsky component.  You can get arbitrarily high accuracy in your  \npredictions with -aa 0 and cranking up -ad until the results have  \nconverged to whatever degree you think is sufficient.\n\n\nShameless plug for CIBSE Daylight Group session of possible interest:\n\n\nWednesday 12th. October 2005\nRights to Light:  A short-paper/discussion session to be lead by John  \nMardaljevic (DMU) and Paul Littlefair (BRE) with contributions from  \nAndrew Thompson (Wilks Head & Eve), Delva Patman and Alistair Redler  \n(Delva Patman), Alex Schaunowski and Ian Absolon (Schatunowski  \nBrooks), Kaivin Wong (Malcolm Hollis) and Lance Harris (Anstey Horne).\n\n\n14.00 for 14.30 at University College London, Torrington Place, London.\n\n\n(With a line-up of that size, there is good chance that the speakers  \nwill outnumber the audience.)\n\n\n-John\n\n\n\n\nDr. John Mardaljevic\nSenior Research Fellow\nInstitute of Energy and Sustainable Development\nDe Montfort University\nThe Gateway\nLeicester\nLE1 9BH, UK\n+44 (0) 116 257 7972\n+44 (0) 116 257 7981 (fax)\n\n\njm at dmu.ac.uk\nhttp://www.iesd.dmu.ac.uk/~jm\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-September/002956.html).</sup>", "attachments": [], "created_by_name": "John Mardaljevic", "created_at": "September 23, 2005 at 05:20PM", "created_by": "John_Mardaljevic", "parent_id": "radiance-general_002945", "id": "radiance-general_002956"}