{"body": "Let me begin by apologizing for the format of my emails.  I only subscribe to \nthe digest of the list, so I don't have the original emails to reply to, so I \nkind of have to haphazardly cut and paste it together.  So, here I go...\n\n\n\n\nGreg Ward wrote:\nYou can get more accurate/smoother results by performing an \"overture \ncalculation\" -- running rpict with the same view and parameters and \nsaving the ambient with a low-resolution image (-x 64 -y 64 is what I \nusually use) and discarding the result.  This \"seeds\" the ambient file, \nresulting in a smoother interpolation.  Then, run your final rpict \ncommand.  Your results look quite nice the way they are.  You could get \na much faster result by using mkillum to create an output distribution \nfor your skylight and reducing some of your rendering parameter values. \n  If this rendering time is acceptable to you, though, it's not really \nnecessary.\n\n\n\n\n\n\nMy reply:\nThanks Greg.  I have started using the overture rendering method to create a \nseed .amb file.  It doesn't seem to take too much extra time, as the second, \nfull resolution rendering seems to go MUCH faster.\n\n\nYou note that mkillum will speed things up, but I also recall reading in \nRendering with Radiance that using illum is not as accurate as just letting \nthe computer calculate the direct and indirect lighting.  Is the difference \nso negligible that using illum would be ok for accuracy?  I am trying to \nproduce renderings for analysis that are as defensible in terms of accuracy \nas possible.\n\n\n\n\n\n\nI had written:\n> Another point I have been unsure about is the material properties of \n> somewhat complex materials.  I understand that for simple materials \n> (plastics, metals) the reflectance is determined strictly by the r g b \n> values (each value multiplied by a specific coefficient).  However, if \n> I apply a texture to the material, does the texture impact the \n> reflectance value?  For instance, I want a floor with 20% reflectance, \n> so I gave it r g b values of .2 .2 .2.  Does the fact that I applied a \n> carpet texture further reduce the value?  In Lightscape, I know that \n> textures don't impact the characteristic of the material; I have a \n> suspicion that in Radiance, it does.\n\n\n\n\nTo which Greg Ward replied:\nYou're correct -- the pattern affects the total material \nreflectance/transmittance.  To avoid this, run pfilt on your picture in \nadvance, like so:\n\n\npfilt -e 2 orig.pic > normalized.pic\n\n\nThe \"normpat\" script will do this for you, and blend the edges for \nbetter tiling as well if that's what you have in mind.\n\n\n\n\n\n\nTo which I ask:\nI'm not sure I understand how adjusting the exposure of an already processed \nimage will correct the reflectance of a material.  Could you help me \nunderstand this a bit more?\n\n\n\n\n\n\nRob Guglielmetti wrote:\nYou use rad to create an octree file, but not for controlling all the other \naspects of the calculation? This overture calculation Greg mentions above is \ndone automatically for you if you use rad to do everything.  Yes, you get \nfiner control of the rendering parameters if you call rpict manually, but you \ncan override any switch you want in the .rif file. rad makes intelligent \nguesses about what the rpict parameters need to be based on how you \nanswer three questions: Quality, Variability and Detail.  And if you add \nthe line OPTFILE=parameters.txt to the rif file, all the choices that \nrad made are saved to a text file called parameters.txt so you can view \nthem at your convenience.  You can reuse the settings too, like so:\n# rtrace @parameters.txt octree...\n\n\nEven if you want to stick with the manual method, playing with the rad \nsettings and observing what rad does to the parameters is instructive.\n\n\n\n\n\n\nMy reply:\nI initially used rad to control everything, but I noticed that the -av \nparameter when I chose High for Quality, Variability, and Detail was .01 .01 \n.01.  While that's close enough to 0 0 0, I wanted to be absolutely sure that \nthe light levels were the result of the calculations, and not some a priori \nassumption.  Thus, the rpict parameters I chose were based on the output of \nmy rad file with some slight modifications.  Is there a way to overide some \nof rad's intelligent guesses within the .rif file itself (specifically, the \nambient value and ambient weight)?\n\n\n\n\n\n\nFinal point regarding the publishing of Rendering with Radiance:\nI'm sure it is a conscious decision not to digitize the entire book into a \nprint disabled .pdf, but could some electronic version be an option?\n\n\n\n\nAgain, thanks for your help.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000746.html).</sup>", "attachments": [], "created_by_name": "John An", "created_at": "May 14, 2003 at 11:04AM", "created_by": "John_An", "parent_id": "radiance-general_000724", "id": "radiance-general_000746"}