{"body": "Hi,\n\n\nhere come the interesting parts of the mails between Greg and me (my stuff\nquoted, a few additional links added):\n\n\n\n\n\n\n> The source distribution contains an older version of libtiff, was this\n> version modified to suit the needs of radiance, or is it replaceable by the\n> libtiff which is shipped by Debian?\n\n\nIt probably works with the new version.  My problem was getting the newer\nversion to compile on Macs and FreeBSD was proving problematic, and I didn't\nneed any of its features so I was lazy and just fell back to one that worked.\n\n\n\n\n\n\n> Where's the difference in the build process between using 'makeall' and  the\n> SConstruct file with scons? Except that building fails when it is done by\n> scons:\n> gcc -o bin/rhpict src/hd/rhpict.o src/hd/rhpict2.o src/rt/Version.o\n> src/hd/holofile.o src/hd/holo.o src/hd/viewbeams.o -Lsrc/lib -lrtpic\n> -lrtio -lrtproc -lrtargs -lrtmath -lrtmem -lrterror -lm\n> src/lib/librtargs.a(badarg.o): In function `badarg':\n> badarg.c:(.text+0x63): undefined reference to `isfltd'\n> badarg.c:(.text+0x98): undefined reference to `isintd'\n> collect2: ld returned 1 exit status\n> scons: *** [bin/rhpict] Error 1\n> scons: building terminated because of errors. </code>\n\n\nGeorg Mischler <schorsch at schorsch.com> is responsible for the SCONS build\nsystem, which is there to make compiling under Windows less painful.  I don't\nknow what its status is, and Schorsch has been pretty difficult to raise these\ndays.\n\n\n\n\n\n\n> If I'd provide a package with optimized binaries for i386/sse3, which programs\n> would you recommend to build in an optimized version?\n\n\nDefinitely the renderers, \"rpict,\" \"rtrace,\" and \"rvu\" built in src/rt.  After\nthat, maybe some of the libraries in src/common, especially the cal*.c routines.\n I'd have to think about it after that....\n\n\n\n\n\n\n\n\n> - There're some manpages missing:\n>\n> W: radiance: binary-without-manpage usr/bin/debugcal\n> W: radiance: binary-without-manpage usr/bin/genambpos\n> W: radiance: binary-without-manpage usr/bin/genrhgrid\n> W: radiance: binary-without-manpage usr/bin/glaze\n> W: radiance: binary-without-manpage usr/bin/mgf2inv\n> W: radiance: binary-without-manpage usr/bin/mgfilt\n> W: radiance: binary-without-manpage usr/bin/nff2rad\n> W: radiance: binary-without-manpage usr/bin/objpict\n> W: radiance: binary-without-manpage usr/bin/optics2rad\n> W: radiance: binary-without-manpage usr/bin/pcwarp\n> W: radiance: binary-without-manpage usr/bin/pdelta\n> W: radiance: binary-without-manpage usr/bin/pgblur\n> W: radiance: binary-without-manpage usr/bin/plot4\n> W: radiance: binary-without-manpage usr/bin/ra_hexbit\n> W: radiance: binary-without-manpage usr/bin/ra_pfm\n> W: radiance: binary-without-manpage usr/bin/rlux\n> W: radiance: binary-without-manpage usr/bin/rview\n> W: radiance: binary-without-manpage usr/bin/vinfo\n> W: radiance: binary-without-manpage usr/bin/xyzimage\n>\n> do you know if there're any manpages for those tools hidden somewhere, or if\n> somebody else is working on them? If not I'll go and write minimal manpages\n> for them.\n\n\nI never wrote man pages for these, as they are specialty programs used by\nexperts, for the most part.  Some aren't used at all, and probably shouldn't be\ncompiled (like pcwarp and plot4).  No one else has written man pages for\nanything, as far as I know.  You are welcome to give it a go if you have time,\nbut I don't even have time at the moment to go through them, really.\n\n\nhttps://ssl.recluse.de/svn/debian/trunk/packages/radiance/debian/radiance-experttools.sgml\n\n\n\n\n\n\n\n\n> there're some wish scripts in src/utils which were written for wish3.6, but\n> 8.4 or so is the actual version - are there any issues I could run into while\n> shipping them?\n\n\nI don't think the trad code works anymore, and I haven't had time to update it.\n I imagine it would take some effort -- a day or two or three.\n\n\n(trad is not included in Debian therefore)\n\n\n\n\n\n\n\n\n\n\n> Could you provide me with a list of tools which shouldn't be\n> compiled/distributed at all? For all others I'll write minimal manpages\n> as long as they have some useful output with --help, for all others I'll\n> write some default manpage.\n\n\nActually, we did a build clean-up a while ago and pulled out all the completely\nuseless programs.  The plot4 program actually serves a purpose, which I only\nremembered after I sent the e-mail.  The pcwarp program is more experimental,\nand should probably be pulled.\n\n\n\n\n\n\n\n\n\n\n> Do you have any font converters,\n> or was the conversion of helvetica and verdana done manually?\n\n\nAs I recall, Paul Haeberli had a really simple polygonal font format, similar to\nmy own, and it was a snap to convert.  If you have something that already parses\nthe foreign format, and it's not difficult to add a new output format, the one I\nuse is quite simple.  It's described in:\nhttp://radsite.lbl.gov/radiance/refer/filefmts.pdf\n\n\n\n\n\n\n\n\n\n\n> in my opinion you want to add\n>\nhttps://ssl.recluse.de/svn/debian/trunk/packages/radiance/debian/patches/rholo-missing-devpath-fix.dpatch\n> to the next version of radiance to make sure rholo finds its dev files even\n> when they're not living in a default directory. I'm not 100% sure what happens\n> if DEVDIR is not set, though, but I guess it will just take the default.\n\n\nIf the DEVDIR is not set, and it usually isn't, rholo searches for its device\ndrivers in subdirectories named dev/ in each of the executable PATH locations.\nIn other words, installing the drivers in dev/ under the Radiance executable\ndirectory should always work.  I put DEVDIR in there as a precaution for strange\nsystems that might cause a collision.  It's never happened.\n\n\n> according to the FHS such files have to go to /usr/lib, therefore I have to\n> change those paths. Btw, would it make sense to include rholo in the package\n> with the sse3 optimized binaries? It seems to be kinda cpu intensive, if I\n> understand the manpage right. Do you probably have some small example I could\n> use to test rholo? Unfortunately nobody here ever used it.\n\n\nThe files you're putting in /usr/lib are executables if that makes any\ndifference -- did you mean /usr/local/lib?  It seems odd to install things in\nthe main system directory.  I wouldn't want them there if I were a user\ninstalling a third-party package.\n\n\nRholo calls rtrace to do most of the CPU-intensive work, but you can compile it\nhowever you think best.\n\n\nTo test, go to the ray/obj/cabin directory and trun \"make nholo.\"  You might\nalso alter the nholo target to set -n 2 to make sure multi-processing is working\nright, and \"-o x11\" rather than \"-o ogl\" to try out the quadtree driver.\n\n\n\n\n> The ogl driver just produces random weird pixels in linux - but x11 works\n> fine.\n> I have another question for you:\n> Does it make a difference if I build radiance with -ffast-math?\n> According to the gcc manpage this makes only a difference for programs\n> which depend on an exact implementation of IEEE or ISO\n> rules/specifications for math functions. Is this the case for radiance?\n\n\n\n\nI'm sorry but not surprised to hear the OGL driver doesn't work under Linux.\nThey seem to have a pretty loose idea of this standard.  It works under Mac OS\nX, but then, that's where I'm able to test and debug it.\n\n\nAs for -ffast-math, there shouldn't be a problem for Radiance.  It doesn't rely\non exact trig calculations or the like.\n\n\n\n\n\n\n\n\n> The only problem I run into now is that rview is a link to vim these\n> days, and something I can't overwrite or reuse. Is it a problem if I\n> remove the rview link, or do I have to patch anything?\n\n\nThe rview program was renamed to rvu just to avoid the conflict with vim.  I put\na soft link in for backwards-compatibility, but you can safely remove it if it\ncauses problems.\nhttps://ssl.recluse.de/svn/debian/trunk/packages/radiance/debian/patches/no-rview-please.dpatch\n\n\n\n\n\n\nAnd last but not least:\n\n\nbzed at hal:~$ wget -q -O - http://www.radiance-online.org/main.html |\ngrep hemp\n<a href=\"hemp://radsite.lbl.gov\" target=\"_top\">LBNL</a>, <a\nhref=\"hemp://www.epfl.ch\" target=\"_top\">EPFL</a>, then\n\n\n\n\n\n\nBernd Zeimetz\n<bernd at bzed.de>                         <http://bzed.de/>\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2007-October/004468.html).</sup>", "attachments": [], "created_by_name": "Bernd Zeimetz", "created_at": "October 14, 2007 at 02:33PM", "created_by": "Bernd_Zeimetz", "parent_id": "radiance-general_004452", "id": "radiance-general_004468"}