{"body": "Hi,\n\n\nfor converting spectral or XYZ data to RGB see Appendix in:\nRuppertsberg, A, and Bloj, M (2006) Rendering complex scenes for psychophysics\nusing RADIANCE: How accurate can you get?, J. Opt. Soc. Am. A, 23, 759-768\n\n\ndownload pdf at:\nhttp://www.brad.ac.uk/acad/lifesci/optometry/uploads/Publications/2006xJOPTSOCAMAx23x4x759.pdf\n\n\nIn that paper we also used spectral data from a data base (ref 47) of Munsell\nchips and natural materials:\n47. See http://spectral.joensuu.fi/databases/index.html.\n\n\nWhat I suspect you are after are surface reflectance descriptor RGB values. The\nXYZ values provided by eg the macbeth color checker are colour signal data (ie\nthe product of surface reflectance with illumination). The illumination is most\nprobably D65, which is white, so it's not far off to correspond to the surface\nreflectance. But a lot of people forget the distinction between colour signal\nand surface reflectance.\nAlso remember that there are no generically valid RGB values. RGB values are\nalways only valid for a particular display device. In that paper up there we\nhave used the transformation matrix based on RADIANCE's 'built-in' primaries.\nIt is true that you can obtain RGB values beyond the [0 1] range when you\nconvert XYZ to RGB and that simply tells you that the gamut of your RGB-space\ndoes not include that colour. Then, you have to do something, either clip it or\ntone-map it....\n\n\nhappy colouring!\n\n\nalexa\n\n\n\n\nQuoting \"Lars O. Grobe\" <grobe at gmx.net>:\n\n\n> While I agree that extending the material file in the radiance\n> distribution would be useful for viz, I'd like to encourage those who\n> did not try yet to use their digital cameras and a calibration tool such\n> as macbethcal and the not too expensive chart as a measurement device.\n> Today as almost everyone has the equipment for digital photography, this\n> should be not too difficult. While one can certainly discuss the\n> accuracy, obtaining an \"inaccurate\" sample of the material that is\n> actually to be simulated should still be better then an accurate sample\n> of a generic material.\n>\n> That said, the most important feature of a new material database must be\n> detailed documentation of the samples, measurement equipment, conditions.\n>\n> CU Lars.\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n\n\n\n\n\n\nDr. Alexa Ruppertsberg\nBradford School of Optometry and Vision Science\nUniversity of Bradford\nBradford, BD7 1DP\nUK\n\n\nTel. ++44 1274 235378\n\n\n\n\nThis mail sent through IMP: http://webmail.brad.ac.uk\nTo report misuse from this email address forward the message\nand full headers to misuse at bradford.ac.uk\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-November/005503.html).</sup>", "attachments": [], "created_by_name": "A Ruppertsberg", "created_at": "November 10, 2008 at 01:29AM", "created_by": "A_Ruppertsberg", "parent_id": "radiance-general_005471", "id": "radiance-general_005503"}