{"body": "Hi,\n\n\nI think there might be some misunderstanding going on here..\n\n\n-1) my joking comment about looking into the mirror is (sad but true ..) \na bit oversimplified. Of course you always need to specify additional \ninformation, i.e., mirroring with respect to what, and although \nintuitively one always thinks of a plane, sometimes the 'inversion' \n(x,y,z) -> (-x,-y,-z) is also called a mirror operation,('mirroring with \nrespect to the origin'). On inversion, the normal also gets turned around.\n\n\n-2) I never used replmarks before, but if I get it right from the \nprevious discussion, you set up a scene with triangles in CAD, convert \nthis to Radiance format and then replace the triangles with, say, instances.\n\n\nThe information about orientation is completely contained in the \ntriangles (as long as they are drawn according to the replmarks specs, \ni.e. three different side lengths, of which the second and third \nsmallest stand for the local x and y axis. The mentioned cross product X \n(x) Y = Z then is in fact the surface normal of the triangle.\n\n\nYou can now make a simple sketch on paper, draw a triangle with sides \nparallel to the coordinate axes, and 'mirror' it with respect to the, \nsay, yz plane. If you simply replace the vertices by their mirrored \ncounterparts, you soon end up with an inverted normal, which is in fact \nnot what you want.\n\n\nNow I don't know how formZ stores surface normal information, maybe it \nis stored separately, allowing to override the above effect. And this \ninformation then gets lost in the conversion, so replmarks gets feeded \nthe wrong triangle and thus transforms the instance equally wrong.\n\n\nMaybe ... just a simple guess..\n\n\nAnyway, I assume that the error already lies within the mirroring \noperation. You can check this by drawing a simple scene in CAD with two \nmirrored triangles and the look at the converted rad input file. (look \nat the ordering of the two sets of vertices in the polygon data)\n\n\n-cb\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-May/001703.html).</sup>", "attachments": [], "created_by_name": "Carsten Bauer", "created_at": "May 15, 2004 at 07:08PM", "created_by": "Carsten_Bauer", "parent_id": "radiance-general_001663", "id": "radiance-general_001703"}