{"body": "Dear 'Googs', Fellow Renderers,\n\n\nThank you for your thoughtful response. Wikis do not take much money to \nrun (far less than $50.00 per year), and they certainly do not (or \nshould not) have any realized (or sense of) personal ownership. The \ninformation is collectively owned by the community of Radiance users, \nits contributors, and the public who pay for it. Admittedly, taxpayer \nmoney handlers, administrators, and other bureaucracies are perhaps \ninvolved in certain aspects of Radiance and its software; however, the \ninformation can and should be freely accessible—a state that is not as \ntransparent or fully realized as the insiders and professionals of the \nRadiance community might believe or project onto the public.\n\n\nAdmittedly, many wikis fail, although many (i.e., all currently \nexisting) wikis succeed, which is why I showed two successful, active, \nand useful wikis of sufficiently divergent topics and obscurity to make \nmy earlier point. In addition to Wikipedia.org, there are countless \nwikis that are supported by communities of the same size as the Radiance \ncommunity (in other words, we have critical mass, but still need \ncritical collective exertion/belief/effort, etc..) If Radiance were born \ntoday, there would be no question as to whether or not to inform the \ncommunity with a wiki. In fact, I can't think of any other serious \nsoftware besides Radiance that doesn't have an active wiki where faq's, \ntutorials, and examples are shared and edited by the community...what \ndoes that say about our current situation?\n\n\nMost of your arguments, from my perspective, are actually in favor of \nhaving what I would call decentralized content. Clones, backups, \nredundancy, historical tracking, and forking (if and whenever necessary) \nare just a few of the advantages of wiki content, which is naturally \nfully capable of supporting fast-changing and evolving topics such as \nRadiance. In fact, wikis are better at this than the current \nweb/email/gatekeeper/server/owner models. The content should be shared, \ncopied, archived, cloned, and forked as the evolution of the software \nand its users (USERS, are not exclusive to paid professionals and \ndevelopers) deem sufficient and/or necessary. It is just a matter of \ntime before a wiki is realized by current or future Radiance users—the \nrelevant questions are: how much time will it take; who (if anyone) has \nto retire, step aside or be ignored; and who will be brave enough to \nchampion the inevitable: a completely shared, open, free, nonlinear, \nuser-based Radiance community?\n\n\nThe problem with naysayers is that they either fundamentally \nmisunderstand or loathe the concept realized by Wikipeida and its \nclones. Bureaucratic entities are horrible at sharing information \n(because they want to, or must, control it), which may be part of the \nreason for why it is presently so darn hard for folks to freely learn \nand use Radiance. Perhaps this is an anticipated or desired effect, but \nfundamentally Radiance is fantastically simple to understand and use, \nonce you figure out how to get a book, find a mentor, or otherwise get a \nhandle on the current instructional tools. The current problem and \nreason why the Radiance community is not larger is because the teaching \nmethods are outdated and obscure. Better methods of communication have \nbeen around since the birth of Wikipedia. Furthermore, the \nradiance-general mailing list is not as intuitive and easy to use for \nbeginners as it might appear to someone who has been in the business \nsince the very first Radiance workshop. And when (the linear and clumsy) \nradince-online server shuts down, who is going to pick up the pieces and \ncarry on the legacy past our current generation? Probably Google, which \nis the only real way to access (read as: stumble upon) radiance-online \ncontent. Wikis are for all levels of users, including beginners and \nadvanced, who will eventually be responsible for the software and \ncommunity's future. Newsflash: you can't make money writing content for \nusing Radiance. So, why not make it free, freely available, freely \neditable, and freely distributable? I urge anyone to think hard about \nthis question before submitting a pseudo-philosophical answer.\n\n\nAs I noted in my earlier email, I am interested in hearing from positive \nresponders (e.g., the thoughtful and defiant students who value the \npoints that I am trying to communicate in this thread, the artists who \nwant to share and inspire their work, the scientists and mentors who \nwant to advance our collective knowledge—in a freely open and \nfully-peer-supported fashion). I am represented in all of those \ndescriptions, and I imagine or hope that there are many like me. Let's \nget together and compare notes, publicly or privately. The professional \nnaysayers, administers, gatekeepers, and content owners might best serve \nthe public by simply listening to (or ignoring) this thread, short or \nlong as it may be...\n\n\nSincerely,\nChris\n\n\nOn 2/5/14 12:26 PM, Guglielmetti, Robert wrote:\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2014-February/010024.html).</sup>", "attachments": [], "created_by_name": "Chris Kallie", "created_at": "February 05, 2014 at 12:03PM", "created_by": "Chris_Kallie", "parent_id": "radiance-general_010014", "id": "radiance-general_010024"}