{"body": "On Thu, May 27, 2010 at 1:25 PM, Ery Djunaedy <ery.mailinglist at gmail.com> wrote:\n> Thomas,\n>\n> Thanks for the suggestions.\n>\n> I am trying to avoid the first option that you suggested below. I get the\n> impression that it is more difficult. Can you elaborate further?\n>\n> I tried your suggestion to use xwd. The problem with this route is that both\n> the ximage (which is called by xglaresrc) and the xwd are interactive\n> programs. We end up trying to automate something that is interactive.\n\n\nximage is interactive if you have to adjust the exposure of the image\nfirst. I think you could use pfilt on the image first to get a\nreasonable exposure adjustment that displays nicely without further\ntweaking. A pfilt preprocess will help with oversized image, too.\n\n\n> The catch is how to select the window to be dumped. The xwd by default asks\n> the user to click on the window to be dumped. I tried to use the HDR file\n> name as the window_name and pass it to xwd. Something like:\n>\n> $ xwd -name sc01jd_view.hdr -out sc01jd_view.xwd\n>\n> It works but (1) it assumes that no other window is on top of this window\n> and (2) it captures what is displayed. The first catch means that we cannot\n> do anything else on the computer while the script is working. The second\n> catch means that if the xglaresrc picture is bigger than the monitor (e.g.\n> netbook screen) the picture is actually cut.\n\n\nxwd is only one app to create screenshots. On Linux you have plenty of\nother choices. I would have thought the biggest problem would be to\nidentify the window. If you can use the image name, fine.\n\n\nAs long as you use a screenshot based method you will always have to\nkeep the screen free of other windows. If you can't find the time to\nlet the computer run for a while and you need to do this type of\nhighlighting a few times you should invest some time in a script that\nreplaces xglaresrc without ximage. It really doesn't seem that\ncomplicated. Initially I even thought it was a shell script ...\n\n\nYou should reduce the size of large images to something that fits on\nyour screen. Remember to run findglare again on the smaller size\nimage! xglaresrc uses a fixed text height and if you have a huge image\nthe text labels will look tiny.\n\n\n> For now, I think I can live with that.\n\n\nProblem solved then.\n\n\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-May/006915.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "May 27, 2010 at 05:51AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_006912", "id": "radiance-general_006915"}