{"body": "Dear Kam,\n\n\n\n\n\n\nI think that Darren is in a better position to answer some of your\nquestions. This is what I can contribute.\n\n\n\n\n\n\nQ1. I tried to generate cumulative skies for direct radiation (binned)\nfor different periods of time in a year.  They all give the same\nresults.  Is it not possible to specify the time and day period for\ndirect radiation?\n\n\n\n\n\n\nI added the time periods and reading of EPW files to the program to make\nit more user-friendly and compatible with DIVA.I do not think that the\nbinned option necessarily works with epw files (at least I have not\ntested it as we have not brought that option into DIVA).\n\n\n\n\n\n\nQ2. I created angular fisheye views of the sky dome (180-deg spread with\nthe centre at the zenith) and found some anomaly that I can't explain:\n\n\n\n\n\n\nDirect - \n\n\n\n\n\n\na. All sun paths are found within approx. 45 degrees from the zenith.\nIt looks like a normal sunpath diagram being \"cropped\", leaving a\ncircular area in the middle.  I changed the view direct (-vd) and it's\nstill the case (i.e. not a view setting problem)\n\n\n\n\n\n\nI cannot explain that. Darren perhaps?\n\n\n\n\n\n\nb. The sun paths are almost continuous rather than in form 5-degree\n\"bins\"\n\n\n\n\n\n\nDiffuse -\n\n\n\n\n\n\na. The lowest row of the 145-patch sky dome is particularly bright on\nthe left and right sides (i.e. west and east sides, respectively) .  It\nappears under both Singaporean and San Francisco skies.  Would it be\nrelated to the limitation on <6 degrees sun angle?  \n\n\n\n\n\n\nWe have preliminary tested GenCumultativeSky against DAYSIM and\nradiation measurements from Freiburg. The paper will be submitted in two\nweeks. Diego Ibarra is the main author. We can send a link of the\nmanuscript to this list once it is available.\n\n\n\n\n\n\nYes, a manual would be nice. In case you are interested in looking\ndeeper, I can provide the code for GenCumulativeSKy (with Darren's\nconsent).\n\n\n\n\n\n\nChristoph\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-November/007505.html).</sup>", "attachments": [], "created_by_name": "Christoph Reinhart", "created_at": "November 30, 2010 at 08:44AM", "created_by": "Christoph_Reinhart", "parent_id": "radiance-general_007504", "id": "radiance-general_007505"}