{"body": "Thanks for the info.   I guess that means I need to know what format \nthe \"Z\" file is and how the information is arranged.  I generated one \nusing the -z option of rpict and then just tried to look at it (\"less\") \nand i was given the message - \"This file may be  a binary file - view \nanyway?\".  I said yes and got gobbledyguck.\n\n\nI also tried the strategy of rendering a background only image (this \nrenders just the HDR image wrapped around my scene) and then a \n\"objects\" render that includes the background and the objects.  If you \nuse pcomb to take the difference between the two images, you should \nmore or less be left with the objects only and presumably you could \nthen do another pcomb to make the image 2 bit.  I tried something like:\n\n\npcomb -s -1 background_image object_image > diff_image <<<(takes the \ndifference between the two images)\n\n\nthen\n\n\npcomb -e 'ro=if(ri(1)=0,0,1);go=if(gi(1)=0,0,1;b0=if(bi(1)=0,0,1)' > \nmatte_image\n\n\nthe idea being that if the pixel value in the \"diff\" image was 0 this \nwould be a pixel which was the same in the background image and the \nobject image (i.e., part of the background) versus anything else, which \nwould be an object.  This has limitations, but in general I was trying \nto say \"if the pixel in the diff image is black, it is part of the \nbackground, keep it black, otherwise if it is not black, make it white.\n\n\nNeedless to say, I got a command line error saying that a ')' was \nexpected.  I'm guessing that this means i used the \"if\" function \nincorrectly within the context of pcomb, or in general.  The obvious \nshortcoming of this crude method is that if the diff image contains a \nblack pixel value in the object area, it will remain black and thus not \nbe part of the object matte.  Definitely not robust.  The Z file info \nsounds like the way to go in this respect so I look forward to an \nexplanation of how to tap into it.\n\n\nCan you tell I'm learning Radiance and Unix  simultaneously?  :)\n\n\nThanks folks!\n\n\nkirk\n\n\n\n\nOn Nov 18, 2004, at 6:33 AM, Peter Apian-Bennewitz wrote:\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-November/002162.html).</sup>", "attachments": [], "created_by_name": "Kirk Thibault", "created_at": "November 18, 2004 at 06:20PM", "created_by": "Kirk_Thibault", "parent_id": "radiance-general_002156", "id": "radiance-general_002162"}