{"body": "Hi!\n\n\n> 1.) What programs do people use to produce animation paths?  I \n> initially wanted to use rshow but couldn't get it working on our Suse \n> 8.2.  I understand programs like maya, studio vis, form-z??\n\n\nI have written down some key points and interpolated. There is some \nhelp on this topic in the archives - I also didn't know how to do so \n;-) I don't know if you can find a way to convert from a vector drawing \ntool to viewfiles, e.g. translating from eps or dxf to radiance view \npoint might be possible? You would still have to define both splines... \nSo interpolating keyframes is certainly not the worst.\n\n\n> 5.) Using an ambfile does not seem to be doing much for my animation \n> times?  I was expecting a big decrease in calc time the further i got \n> into my animation but at about 5/6 through it has not sped up much.  \n> It has been building the ambient file the whole time, although it is \n> only 7MB after roughly 1000 frames, which seems too small (10 \n> panoramic views I've been running on a different machine already has \n> an ambient file of 7MB).  Here is what one of my ranfiles looks like:\n\n\nI have made an animation with ab3 - and had a lot of time saved by \nreusing ambient data. However, you will need an ouverture-calculation, \nas was mentioned before. It depends on the model and the importance of \nthe ambient data, if you need only ab1, you can't save too much with \nthis. I am also quite sure that in my case using illums instead of the \nopen windows would have allowed some faster settings in the ambient \ncalculation, but I didn't try that so far.\n\n\n> 7.) As can be seen, I have many curved surfaces in this model most of \n> which have been faceted.  I would like to use a function to smooth the \n> shading on these.  Is there any way to do this given the geometry is \n> already built?  Something like the Phong shading -s option in gensurf \n> or maybe with the new mesh primitive???  I apologize for my ignorance \n> on this topic, I rarely require this much detail.  I'm imagining a \n> modifier or something I could give to the polygons I want to smooth \n> over.\n\n\nI remember that the 3ds-translator did this fine.\n\n\nCU Lars.\n\n\nLars O. Grobe\ngrobe@gmx.net\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-December/001351.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "December 18, 2003 at 10:53PM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_001335", "id": "radiance-general_001351"}