{"body": "Hi Humberto,\n\n\nIt does help to know a little context about your model.  Yes, using \"u=Z\" for vertical windows in any orientation and \"u=Y\" for the sky or skylights is the standard approach.  This is in fact the default behavior in rfluxmtx if no up-direction is specified, but it's best to be explicit about it.  The \"u=Y\" for horizontal relates to the standard choice of Y for \"north\" in gensky and gendaylit.  You can of course rotate the sky during your dctimestep phase, and this is much faster than rotating your surface orientations and re-running rfluxmtx.\n\n\nIn other words, I recommend running rfluxmtx once for the interior illuminances and their relation to your inward-facing window.  Then, you will run it again to connect the still inward-facing window polygon as a source this time and its flux relationship to the ground and sky hemisphere.  This brings up another important point, which is how best to specify the ground+sky in rfluxmtx.  I discussed this durning my 2014 Workshop presentation on new Radiance features:\n\n\n\tRadiance Code Update 2014  http://www.radiance-online.org/community/workshops/2014-london/presentations/day1/Ward_WhatIsNew.pdf\n\n\nThe discussion of rfluxmtx starts at slide 38.  Pay special attention to the example on slide 42, where I show how to combine a uniform ground hemisphere with a Reinhart sky description.\n\n\nOnce you have your two flux matrices, you will pipe the output of gensky or (more likely) gendaylit to xform -rz to rotate in the opposite direction of your model's rotation, then through genskyvec into dctimestep, where you will combine the matrices with the desired window glazing+shading BTDF to compute the irradiance values for your interior points.  Alternatively, you may run gendaymtx for a whole year, using its built-in -rz option rather than xform.\n\n\nCheers,\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-March/011612.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "March 19, 2016 at 09:18AM", "created_by": "Greg_Ward", "parent_id": "radiance-general_011597", "id": "radiance-general_011612"}