{"body": "Hi,\nMaybe I was a bit fast concluding that I'll use glow. Comparing the glow\nmaterial to the light material reveals a lower sensor signal when the direct\nirradiation is low and the opposite when direct irradiation is high. Do you\nknow why I get this? Due to the ‘subsampling’ problem of window lights as\nDavid mentioned because of my sensor location very close to the window?? And\ntherefore I should stick to glow?\n\n\nI have included the results from the glow simulations in the document:\nhttp://dl.dropbox.com/u/9713279/ThreePhaseMethod_Subdivision.pdf\n(the non-readable legends and axes must be a mac thing...the same happens\nwhen I open the documet on my mac, I can read the graphs nicely in the pdf\non my pc. ...have included some text in the captions, if you want to know\nwhat you are looking at ;-))\n\n\nAnd to your question about my sensor, Andy. The sensor is located on the\nwindow head, just behind the glass. The major detection area is to the\noutside through the window. The sensor used right now comes along with the\nSPOT distribution, and is the WattStopper LD290C - the spatial distribution\ncan be seen from the image linked to below. I wouldn't call it a\nnarrow/peaky/tight sensitivity distribution:\nhttp://dl.dropbox.com/u/9713279/SensorSpatialResponse.png\nand I have placed the .dat file here:\nhttp://dl.dropbox.com/u/9713279/WattStopper_LS-290C.dat\nWhy do you believe that using glow probably won't make much difference -\nunless my sensor has a tight and/or peaky sensitivity distribution?\n\n\n\n\nEnjoy the weekend. It is pre-summer in Denmark; we've had blue sky for the\nlast 14 days, 20C and sun ....who said I miss California?? ;-)\n\n\nBest,\nAnne\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2011-April/007799.html).</sup>", "attachments": [], "created_by_name": "Anne Iversen", "created_at": "April 30, 2011 at 06:11AM", "created_by": "Anne_Iversen", "parent_id": "radiance-general_007791", "id": "radiance-general_007799"}