{"body": "Thanks for the quick reply,\n\n\nJack\n\n\n> If you want to derive light sources from an HDR you should take a look\n> at mksource, this will evaluate the scene and then output as set of\n> illum sources.\n\n\nI'm actually trying to quantify the vignetting and angular response of my\nfisheye lens, so mksource (which I did think about using) isn't quite what\nI want.\n\n\nGreg\n\n\n> Ximage doesn't load the original HDR pixels into memory, instead\n> relying on the file's presence to query specific values.  If you\n> don't give it the file, it disables its query function.\n\n\nSince this is the most puzzling Radiance feature yet, allow me to get back\nto it.\n\n\nAre you saying that ximage reads the file into memory to display it, but\nthen relies on additional file reads for 'L'?\nIf so, then would not -f make sure that all 'L's are read from the\nin-memory copy, rather than from the file (which it doesn't)? Or would in\na networked-X scenario the application still pull the pixel luminance over\nthe network, if called with a file name?\n\n\nIn other words: There are two distinct parts to ximage: the display part,\nand the query part, and the two don't know anything about one another?\n\n\nI've experimented with the -o options ('T'-key), and the results are the\nsame: zero when input to ximage comes through a pipe, expected value when\nread from file:\n$ pcomb -e 'lo=li(1)' -o 004.hdr | ximage -ov\n\n\n> If you don't give it the file, it disables its query function.\n\n\nSo some of the ximage features can not be used when input is STDIN? Is\nthere a particular reason for implementing it this way?\n\n\n> Given what I just said, you would either use:\n> $ pcomb -e 'lo=li(1)/le(1)+li(2)/le(2)' 004.hdr 006.hdr > test.pic\n> or:\n> $ pcomb -e 'lo=li(1)+li(2))' -o 004.hdr -o 006.hdr > test.pic\n> If you felt like it, you could get the same result from:\n> $ pcomb -e 'lo=li(1)+li(2)/le(2)' -o 004.hdr 006.hdr > test.pic\n\n\nAha! This makes it crystal-clear now. Thanks 1000!\n\n\nAxel\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2007-February/004172.html).</sup>", "attachments": [], "created_by_name": "Axel Jacobs", "created_at": "February 02, 2007 at 01:09PM", "created_by": "Axel_Jacobs", "parent_id": "radiance-general_004169", "id": "radiance-general_004172"}