{"body": "Dear Greg,\n\n\nThanks a lot for you quick reply to my last question. Im sorry to bother\nyou again with what is probably another obvious question.\n\n\n I have been spending a lot of time trying to use your 'viewloc()'\nfunction in my program. I believe i know what most of the parameters\nshould be but i was hoping you could confirm (or correct) a few of my\nassumptions as I cannot seem to produce any correct output. \n\n\nFirstly, viewloc() is passed three variables ip, v and p. p is obviously\nthe input co-ordinates in the xyz used by the radiance coordinate\nsystem. v is the details of the view. ip therefore must be the output\ncoordinates - are ip[0] and ip[1] the new x and y coordinates?\n\n\nthe only v setttings that i cannot figure out the origin of is hoff and\nvoff (the horizontal and vertical offsets). As i do not change many\nrendering parameters with rpict (only -vp and -vd) i am assuming these\ndefault to 0 - is this correct? i assume the rest of the v variables\n(i.e. hvec, vvec, hn2 etc.) are calculated in the 'setview' function.\n\n\nFinally, I have been passing ip[0] and ip[1] to the loc2pix function to\nconvert this location to a pixel coordinate. My resolution is the\ndefault 512X512 and my -vv and -vh are also the default 45. Does this\nmean that loc2pix will give me an (x,y) between 0 and 512?\n\n\nAgain sorry to bother you with this - i wouldnt ask unless i really\ncouldnt sort it out myself\n\n\nYour help is greatly appreciated\n\n\nJon Bright\n\n\nps as a matter of interest i hear you are visiting my university\n(Bristol) on sunday to meet, among other people, my supervisor (Alan\nChalmers). Small world isnt it!\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-April/000671.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "April 30, 2003 at 06:58PM", "created_by": "Greg_Ward", "parent_id": "radiance-general_000667", "id": "radiance-general_000671"}