{"body": "ambient rays (this is what you do when using glass for your facade and \nplastic for the surrounding) will not traced along any specular \nreflection towards a light source (here sun), whatever (uhh.. not sure \nthis word is allowed to be used any more...) specular settings you are \nusing for the glass material. E.g. also rtrace -I facing a glass will \nget 0 contribution from sun reflection in the glass.\nSo either you use mirror material, photon-mapping or a modified version \nof Greg's cool tip:\nYou calculate the intersection points and render there a 180 \ndegree-fish-eye image instead and calculate from the image the \nilluminance or irradiance at that intersection point and transfer this \nback to an image. The main difference is that for an image view rays are \nsent out and the specular reflection towards a light source is taken \ninto account. But be aware that secondary effects are not covered with \nthis special trick (e.g. if your reflection hits a white surface (there \nit is covered) and then lights an adjacent surface (this is not covered).\nWhen using mirror you have to take care that you miss the sky \ncontribution from the mirror reflection, when using it normal. A mixing \nbetween mirror and glass might help, also regarding the \"appearance\".\n\n\ngood luck!\nJan\n\n\nAm 8/10/15 um 7:15 PM schrieb Guglielmetti, Robert:\n> There is a cool Greg Trick you can use to render irradiance on the glass material, which I summarize here:\n>\n> http://www.rumblestrip.org/2003/03/19/rendering-falsecolor-on-glass-with-vwrays/\n>\n> As for your quest to find the hotspot, if mirror material gave you a result in a reasonable timeframe, I'd say that may be the most expedient way to get what you're looking for, with the caveat that simply using the inverse of the glazing's transmittance for the reflectance is not correct. Most glazing manufacturers will provide the actual reflectance, which is what you should use.\n>\n> If you want to use the glass material you will need to adjust some of your rendering parameters to better account for the specular reflections. Can you share what you used, and perhaps a sample rendering of the façade?\n>\n> On 8/10/15, 10:31 AM, \"Jiajie Zhu\" <jonathan.zhu.uk at gmail.com<mailto:jonathan.zhu.uk at gmail.com>> wrote:\n>\n> Hi,\n> I am trying to calculate an irradiance map on the ground level in front of a concaved building facade for an instant time at a specific location. Here is the problems that I have:\n>\n> 1.       If I use the glass type material for the building facade with -i option in rpict, there will be no facade in the final result. I have checked the manual page that I know it is because of the Boolean calculation will ignore the transparent surface in the final result. But I do need the facade to be seen in the final result, how can I solve it.\n>\n> 2.       I found in the result that if I use the glass type material, no matter how low I set the transmissivity values, there will always no 'hotspot'/convergent irradiance on the ground level. It seems that the program just ignore the reflection process on the glass surface.\n>\n> 3.       If I change the facade material to mirror type, I can find an obvious 'hotspot' on the ground level as well as the facade in the final result. So I just wonder is it proper to modify the facade material into a mirror type if I am only interested in the exterior irradiance map of a building. Besides, if mirror type material can be used in my situation, how can I set the RGB reflectance values for mirror? For example, if the facade glass has a 40% transmittance, is it equivalent to set RGB values into 0.6 0.6 0.6 for a mirror material?\n> Many Thanks,\n> Jiajie\n>\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\nDr.-Ing.  Jan Wienold\nEcole Polytechnique Fédérale de Lausanne (EPFL)\nEPFL ENAC IA LIPID\n\n\nhttp://people.epfl.ch/jan.wienold\nLE 1 111 (Office)\nPhone    +41 21 69 30849\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-August/011181.html).</sup>", "attachments": [], "created_by_name": "Jan Wienold", "created_at": "August 11, 2015 at 01:16AM", "created_by": "Jan_Wienold", "parent_id": "radiance-general_011173", "id": "radiance-general_011181"}