{"body": "Hi Jason,\n\n\nNice technique with the re-projection. Certainly deals with the problem of spacial uniformity. The problem is, as soon as actual geometry gets involved, you're getting somewhat software-specific. Luxology has branched off their modo environment presets from our smart IBL idea, by including scene geometry. We're not planning to do this, we would like to keep everything referenced in image-space for reasons of simplicity and portability. We will, however, include photographic back plates in the near future. As long as they're shot in the vicinity of the main panorama, we can align a backplate using Hugin's image stack, and then use the actual recorded FOV versus the calculated FOV to triangulate a relative matching camera position.\n\n\nIf you're rendering glossy materials, the placement of the lights becomes rather important, and should be adjustable. There was a recent paper on that: http://www.mpi-inf.mpg.de/resources/ReflectionEditing/\nNot production-ready yet, though. So far your workflow is what comes closest, and is actually used a lot. The folks at Digital Domain have developed a workflow where they routinely separate the brightest lights on separate pieces of geometry, essentially creating floating textured light polys so they can adjust placements. They use Nuke for that, but it's rather easy in any 3d app.\n\n\nIn terms of capturing: Since there is very little time on set, I do still rely on auto-bracketing. Directors and grips get antsy when you fiddle around with a laptop, or when the setup takes more than 10 seconds. So 9er brackets with +- 1 EV is all I can realistically get, anything more would require me to break out the Promote Control, which I try to avoid for reliability reasons. Turns out, if you pick your battle, Nikon's 9 frames are often sufficient when you align the entire sequence to the brightest light source. For lighting purpose, it's totally fine if the \"metered middle exposure\" ends up on the dark end of the bracketing set. You might miss some of the shadows, but they barely contribute to the lighting anyway. Here are two slides illustrating the different ranges:\nhttp://www.hdrlabs.com/files/screenshots/shoot4bg-20110126-111240.png\nhttp://www.hdrlabs.com/files/screenshots/shoot4light-20110126-110907.png\n\n\n.Blochi\n\n\nOn Jan 26, 2011, at 8:27 AM, jason huang wrote:\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2011-January/000307.html).</sup>", "attachments": [], "created_by_name": "Christian Bloch", "created_at": "January 26, 2011 at 11:19AM", "created_by": "Christian_Bloch", "parent_id": "hdri_000286", "id": "hdri_000307"}