{"body": "> Is this accessible online someplace?\n\n\nUhm... no. Guess not. I thought I had posted it to this\nRevit support site where I was talking about Radiance,\nbut I guess I didn't. Is there a good spot for me to\npost it? I don't currently have one.\n\n\n> Ack!  you're right, and I had meant to post something about that months \n> ago when I (re)discovered that.\n\n\nIt's a minor pain. The biggest problem I see with it isn't that\nfact that rview is named the same as the alias used for Vim, it's\nthe fact that people, like me, install cygwin or linux specifically\nfor learning Radiance, run into this problem, and not understanding\nanything about unix are instantly lost. :)\n\n\nBut then it's kinda like when my dad threw me into the deep end\nto force me to learn to swim. :)\n\n\nBut this rview problem is there in Mandrake, and in Cygwin\ntoo if you install Vim. For Mandrake, I simply removed the\nalias with no problems, and for Cygwin I simply uninstalled\nVim, for I use Emacs. :)\n\n\n> It's got nothing to do with the shell, the problem is that if you blow \n> off the default location and install the Radiance binaries someplace \n> other than /usr/local/bin, even if you place your new location on the \n> RAYPATH & PATH, it's likely to be lower in priority than the location of \n> the symbolic link to vim that seems to be present on a LOT of the \n> current Linux distros.\n\n\nRight. Didn't mean to imply that it was Bash, meant that since\nthey are now using Bash in 10.3, there are other things that they\nare probably doing that are closer to linux distros. I don't remember\nthis rview problem happening on my wife's G4, which is running 10.2,\nand where I put the files in the default location.\n\n\n> Kudos for pointing that out to the list, Jeffrey.\n\n\nNo problem. It was just my first big hurtle in learning radiance\nand/or the *nix command line, so I thought I'd talk about it to\nhelp others in my position.\n\n\nJeffrey\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-November/001240.html).</sup>", "attachments": [], "created_by_name": "Jeffrey McGrew", "created_at": "November 26, 2003 at 09:01AM", "created_by": "Jeffrey_McGrew", "parent_id": "radiance-general_001227", "id": "radiance-general_001240"}