{"body": "Bleicher, Thomas wrote:\n\n\n> Francesco is offering Windows binaries here:\n>  \n> http://www.bozzograo.net/radiance/modules.php?op=modload&name=Downloads&file=index&req=viewdownload&cid=4 \n> <http://www.bozzograo.net/radiance/modules.php?op=modload&name=Downloads&file=index&req=viewdownload&cid=4>\n>  \n> AFAIK they don't include any user interfaces (rvu, ximage). But you \n> can use them\n> for rendering and convert the images to a Windows friendly format.\n>  \n> Rayfront (see www.schorsch.com <http://www.schorsch.com>) offers a \n> complete interface on Windows\n> but uses an older version of Radiance (not that it'd make a big \n> difference in\n> everyday use).\n\n\n\n\nHi Thomas,\n\n\nActually, the release notes for the last few releases are sprinkled with \nall kinds of improvements and bug fixes that make the newer binaries \nreally desirable in my book.  So much so, that even though we use \nRayfront here at my job, we pretty much only use it for geometry import \nand material application -- essentially, for scene generation.  After \nthat, we use the latest binaries on Linux to actually create octrees and \nimages*. \n\n\nA couple of things that I now take for granted with the newer binaries \nis the ability of oconv to generate octrees out of very complex geometry \nwith far less \"set overflow in addobject\" errors, and the fixed rpict \nbug that caused half the image to be garbled in certain scenes with many \nlight sources.  There were some fairly serious bugs fixed along the way \ntoo.  If there's any way that people can run the latest Radiance on \nLinux or OS X, (IOW, any 'real' operating system), I highly recommend \nthey do so.  That said, I think it's great all the efforts made by \nFrancesco and Schorsch and others in getting _something_ running on \nWindows.  I just believe that the latest-greatest-Radiance is worth the \nhassle of Linux (or the expense of OS X). \n\n\n*On an unrelated note, I think \"octrees and images\" is a good name for a \nband.  =8-)\n\n\n- Rob\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-June/003766.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "June 15, 2006 at 06:32PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_003760", "id": "radiance-general_003766"}