{"body": "On Friday, October 3, 2003, at 04:39 PM, Arvinder Dang wrote:\n\n\n> Hello Everyone,\n> It was really nice meeting  some of  you at the Radiance conference. \n> As a few of you already know I am really new with Radiance and am now \n> shifting from Desktop Radiance to Radiance. (Thanks a lot Francesco.. \n> Cygwin is a real hit, Thanks Rob for getting me started )\n\n\nHi Arvinder,\n\n\nIt was a pleasure to meet you as well, and to watch your face light up \nas you pressed return following \"ximage test1.pic\" for the first time!  \n=8-)\n\n\n> Now for the newbie questions.\n> 1. When I am running rtrace I am getting a message warning no light \n> source found. I am using a sky without sun and specifying -B. Is this \n> because of the sky type or some other reason since I am getting the \n> values which seem reasonable.\n\n\nYep, the warning is because you are using a sky without sun, nothing to \nworry about.  Happens anytime you spec an overcast sky too...\n\n\n> 2. Since I am comparing results from superlite it is important that \n> the geometry and material properties are exactly the same.The glass \n> type in Superlite is a clear glass with  85% transmittance and 5% \n> reflectance. How do I specify a similar glass type in radiance.\n\n\nI know nothing about Superlite, and little more about Radiance, but a \nclear 85% transmittance glass in Radiance looks like this:\n\n\nvoid glass Avrinder's_glass\n0\n0\n3\n.85 .85 .85\n\n\nNow, the glass material in Radiance has a fixed reflectance value, but \nI don't recall what it is (but it's not 5%).  If you wanna explicitly \nspec the reflectance you will have to use the fancier BRTDfunc, which \nis the domain of the gurus on the list. Sorry I can't be of additional \nhelp on that one.\n\n\nRob Guglielmetti\nrpg@rumblestrip.org\nwww.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-October/001025.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "October 04, 2003 at 11:14PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_001022", "id": "radiance-general_001025"}