{"body": "16.06.2011 21:21, Guglielmetti, Robert wrote:\n\n\n> Chris is right, we're veering, so new subject line.\n>\n> Chris, when I got my first OSX system (2002), the difference between OSX\n> 10.1 and any Linux distro at the time was vast; there simply was no\n> comparison. I mean, really. No comparison, if we're talking barriers to\n> entry for Radiance. Today, I would say Ubuntu is pretty close to MacOS,\n> but still not quite as polished as MacOS. I use Snow Leopard, and then I\n> have WinXP, Win7, Ubuntu 11.04 VMs available on VMWare Fusion. So far I'm\n> still willing to pay the Apple tax on my hardware every few years or so.\n\n\nI think it depends on what you want to do. If you want to integrate e.g. \nwith some architectural CAD, Mac has a lot of software that you will not \nfind in Linux world. If you start scripting, coupling Radiance into \nother tools (e.g. combining it with visualization software), go into \nheavy rendering - Linux will be the way to do so without pain. So back \nin 2002, I was a proud user of a Powerbook, and I had Radiance installed \non it. However, I was suffering that I could not get some nice tools \nworking (opendx, comfortable gnuplot, useable latex-environment). And \nheavy rendering I did using a mosix-cluster with lots (!) of cores, \nsomething impossible on other platforms.\n\n\nSo I think it really depends on what your working conditions are. If you \nare doing enough numerical simulation to have a dedicated machine for it \n(something with a fast cpu, lots of memory, good cooling, but maybe no \nsound- and graphics card and probably not even a screen as it will be \nlocated far from your workdesk anyhow), that would probably be a highly \noptimized linux installation. Everything else would just make it \ncomplicated, and you would not want to have a CAD installtion on this. \nIf you are running Radiance on your work desk - hey, it is \nmultiplatform, so you can do so whatever os you use.\n\n\nIn this case, Mac users enjoy downloading and copying binaries provided \nby Greg into their path and adjusting some settings. Linux users are \neven luckier, they typically will just select Radiance and have all the \ninstallation done automatically by their package manager (at least for \nDebian and Ubuntu, Radiance is part of the distributions). Windows users \nwill suffer, as they first need to choose a way to somehow emulate a \nunix-like environment (using e.g. cygwin). Still, it works for all of them.\n\n\nCheers, Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2011-June/007923.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "June 16, 2011 at 12:34PM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_007922", "id": "radiance-general_007923"}