{"body": "Zack Rogers wrote:\n> Hi Rob,\n> \n> This has been a very interesting thread...many good things to know, and \n> once again Radiance shines on.  I was going to comment that your dealing \n> with a fraction of a lux difference now, there must be some sensitive \n> objects inside your space...is this an art gallery?  And your right, \n> with the logarithmic behaviour of the eye the difference becomes even \n> more insignificant.\n\n\nYes, it's an art gallery.  An art gallery with lots of clerestory \nsurface area that sees the exterior, and het they are asking us to see \nif we could specify a shade system that can get the light levels to 70 \nlux.  That's why we have been doing all these calcs.  And as many times \nas I say it's important to focus on the relative gains & losses with \neach scheme, the client still tends to focus on the numbers, which is \nscary in the extreme, for me.\n\n\nWhen we got to these last galleries, because we were removing so much \nlight, this problem with -av finally revealed itself to us.  We had \nreached the point where the -av approximation was adding light to our \nmodel.  It became evident as we hit the 1% shade region; adding more \nshades beyond that seemed to make no difference to the numbers.  The \narchitect called our model into question, and as he was a physics major \nbefore going into architecture, there was no convincing him that this \nwas correct!  Intuitively, I knew something had to be wrong but I \ncouldn't put my finger on it.  Physical tests at the mockup site bore \nout the intuition; something was wrong.  So, I asked this list for help, \nand got some.  Thanks again!\n\n\n> That was my image in ArchRecord a couple months ago!  I'm excited \n> someone noticed.  I used the same CAD model to create the CFD image that \n> was also in the article.  It was a very interesting project, the first \n> project I've worked on where the plants were the most important building \n> occupant to provide light for.  \n\n\nInteresting!  So, you were tasked with evaluating the resultant spectral \nmakeup of the light after it had passed thru the glass, presumably to \nensure photosynthesis?  How did you get spectral data for all the other \nmaterials?  I know Optics5 is great for glazings, but what about the \nother materials?\n\n\nWith that project and another musuem\n> project, I used optics 5 a lot to look at the spectral qualities of \n> glass.  Optics 5, with its new Radiance output functionality, is great! \n\n\nAs a matter of fact, I think I first looked at Optics5 after you \nmentioned it on the list, in your post about the Phipps bldg.  I used it \nrecently for a project too.  It's nice to pull out a very accurate \nglazing spec for use in Radiance so easily.  I wish there was a similar \ndatabase for paint finishes, metals, etc.\n\n\n> One thing we learned, and anyone correct me if I'm mistaken, is that the \n> adhesive layer in laminates almost completely eliminates ultra-violet \n> from the spectrum.  Ultra-violet, or more accurately the Krochmann \n> factor (which is loosely related to UV and also determined by optics 5), \n> is the main component of radiation that causes degradation of materials \n> (artwork, furniture).  I may be completely off base by now, but if you \n> are concerned about obtaining such low light levels to minimize the \n> footcandle-hours that fall on artwork or what not, I would look at the \n> spectral qualities of the light you are letting in as well as they may \n> be more effective at preventing degradation than low light levels.\n\n\nIt's a combo of intensity, duration of exposure, and UV filtration\n(< 400nm) that we need to manage.  Yes, most (not all) laminate \ninterlayers will filter out UV and that's *always* part of any museum \ndesign strategy.  There is a book, \"The Museum Environment\" by Garry \nThompson, that gives a great overview of the UV problem as it relates to \nmuseum artifact preservation.  It's actually quite interesting.  Here's \na link to the book's info at Amazon:\n\n\nhttp://www.amazon.com/exec/obidos/ASIN/0750620412/qid=1053116105/\nsr=2-1/ref=sr_2_1/104-0083608-5879146\n\n\n> PS.  Your blog is great!  I had planned on doing something similar \n> (although i typically rant and rave about politics) on my website and \n> wasn't aware there was a name for something like that.\n> www.zrogers.fpcc.net - it is not nearly complete (I just had a baby boy \n> last month!) but the home page was made entirely with Radiance!\n\n\nThanks!  Yes, you'll find that it's quite a sensation these days, this \nbusiness of putting up a website and blathering about whatever, out into \nthe void of space.  I like it.  Most of my site is still down, I changed \nhosts in January and haven't had time to upload all that stuff again. \nJust pictures, stories and stuff.  Your basic self-gratification type \ndeal. =8-)  I went to your site, but a couple of the links are not \nworkin'.  The renderings are fun, I like how the rollovers change and \nthe change is also reflected in the water.  Neat!  I'll check back on \nit, presumably after your son starts sleeping through the night?  ;-)\n\n\n\n\n\n\n      Rob Guglielmetti\n\n\ne. rpg@rumblestrip.org\nw. www.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000774.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "May 16, 2003 at 04:23PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_000773", "id": "radiance-general_000774"}