{"body": "Hi Jack, Axel,\n\n\nI agree that a separate HDRI mailing list makes sense, if Peter A-B  \nis willing to set one up.  I would certainly participate, and it  \nwould save those who may not be interested from our noise.\n\n\nRegarding color in HDR images, this really falls under the category  \nof tone-mapping.  Most film and digital cameras increase color  \nsaturation according to well-worn practices, which may be found in  \nR.W.G. Hunt's classic tome on color management, \"The Reproduction of  \nColour\" (ISBN 0-470-02425-9).  Unfortunately, few tone-mapping  \nalgorithms actually pay much attention to preference with respect to  \ncolor, and I know of at least two reasons why not:\n\n\n1) People prefer increased gamma or saturation on their colors, which  \nhappens to correspond to less dynamic range in the reproduction -- in  \nother words, boosting saturation makes it difficult to represent your  \nlarger luminance range.\n\n\n2) Increasing saturation, or even leaving it alone, while compressing  \nan image's dynamic range makes colors look *too* saturated in many  \nimages, because a loss in contrast is often read as haze by the human  \nvisual system, and your brain compensates by imagining the colors to  \nbe more saturated than they appear.\n\n\nThat said, you can of course play around with the gamma when you  \nconvert to 24-bit/pixel formats, and get a boost in contrast and  \nsaturation that way.  Sometimes the results will be nicer, oftentimes  \nthey will be worse.  To boost contrast/saturation, try:\n\n\n\tpcond capture.hdr | ra_tiff -g 1.6 - boosted.tif\n\n\nTo reduce contrast/saturation try:\n\n\n\tpcond capture.hdr | ra_tiff -g 2.7 - reduced.tif\n\n\nThere are more sophisticated ways to play around with contrast and  \nsaturation separately using pcomb, but I'm not sure you gain that  \nmuch by them.\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-January/003269.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "January 16, 2006 at 05:14PM", "created_by": "Greg_Ward", "parent_id": "radiance-general_003267", "id": "radiance-general_003269"}