{"body": "Hi guys,\n\n\nNot sure if you (Marcus and Alan) remember me, but I tagged along on a lunch together when you visited NREL a while back. This sounds like a great and ambitious project. Of course, it's tied to a specific scripting language -- in this case, Python. I used to use Python a bit for just this type of Radiance automation, myself. The SPOT program (Radiance-based lighting photosensor placement and optimization tool) is a mix of Python and VBA. OpenStudio is primarily C++, but we export all of that C++ functionality to Ruby (and C#) in the form of SWIG \"bindings\". Much of the Radiance functionality in OpenStudio is actually a bunch of Ruby scripts. There are even elements of Radiance that are written in Perl. \n\n\nThe point being that everyone has their favorite high level language. Our hand was forced to Ruby, simply because the OpenStudio project leverages SketchUp quite a bit, and the SketchUp API is in Ruby. It'd be great if we could leverage your (and your contributors') work in OpenStudio too, though. We should talk about how we might make that happen. I know SWIG supports Python, but the maintenance headache of supporting even just Ruby and C# is major; I doubt the team is interested in supporting yet another scripting language. However I do see an opportunity here, as we are rolling out the notion of \"measures\" in OpenStudio, which are pre-packaged energy efficiency measures (e.g. modify my model to have a WWR of .10 to .90 in .10 increments, simulate and compile the results, while I go have lunch). We should work together to see how we can best integrate your script library with OpenStudio and other tools. \n\n\nWhat do you think?\n\n\n- Rob\n\n\nRob Guglielmetti\nNational Renewable Energy Laboratory (NREL)\nCommercial Buildings Research Group\n15013 Denver West Parkway MS:RSF202\nGolden, CO 80401\n303.275.4319\nrobert.guglielmetti at nrel.gov\n\n\n________________________________________\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2012-December/009086.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "December 03, 2012 at 08:32AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_009083", "id": "radiance-general_009086"}