{"body": "##### - WARNING: SUSPICIOUS LINK(S)\n\n\nPlease be EXTREMELY careful about one or more of the links in the\nmessage below.\n\n\nThe Berkeley Lab Computer Protection Program inserted this warning\nbecause the email appears to contain a suspicious link.\n\n\nFor more information, see this Berkeley Lab web page:\nhttp://www.lbl.gov/cyber/services/suspicious-links.html\n\n\n##### - END OF WARNING\n\n\nI would first check your model for coplanar surfaces. Maybe your box shaped room does not have a hole cut out where the glass is inserted?\n\n\n\n\n  Sent: Thursday, March 12, 2009 6:23 AM\n\n\n\n\nI am trying to use radiance for visualising the illuminance at the workplane of a simple classroom model developed in ecotect. I am calling radiance from ecotect. Further I will use DAYSIM for detailed calculation of UDI and DC. I have downloaded RADIANCE for windows from http://www.arch.mcgill.ca/prof/reinhart/software/Radiance3P7forWindows.zip. I have used the materials library from http://irc.nrc-cnrc.gc.ca/ie/lighting/daylight/daysim/docs/NRC_LightingLibrarySetup.exe. However the image I am getting after rendering is pretty weird. It seems that the glass has not been properly rendered. I have set all the rendering options to medium. Even with high quality specification and ecotect libraries (glass material other than the link previously mentioned), I am getting the same result. Further when I am importing the .rad file to daysim the glass seems to be having some problem. Please find the image of the room after render attached and let me know how I can solve this problem.\n\n\nThank you\nRegards\nChandrayee\n\n\n\n\nChandrayee Basu (M.Tech)\nSchröfelhofstraße 12, WG 07/02\n81375 München\n+49-89-289-22403\n\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-March/005826.html).</sup>", "attachments": [], "created_by_name": "Christopher Rush", "created_at": "March 13, 2009 at 09:36AM", "created_by": "Christopher_Rush", "parent_id": "radiance-general_005823", "id": "radiance-general_005826"}