{"body": "Jeffrey McGrew wrote:\n\n\n>\n> OK, so I've got this idea to make a Radiance Render server. Basically \n> it will be a computer that sits in my closet, running Linux, that I \n> can e-mail it a render job and have it e-mail back the finished images.\n>\n> First off: Before I replicate a bunch of work, is there already \n> something like this out there available? I know that Design Workshop \n> has a render server available via a web form.\n>\n> Second off: Would it even be feasible to use e-mail as the way to \n> submit and receive jobs? The jobs would probably be rather large, so I \n> guess I'll have to figure something out. Just seems very simple to \n> make some programs that would take an e-mail and run with it than to \n> have to build a web front end or something...\n>\n> Thanks for any input,\n>\n> Jeffrey McGrew\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n>\nif you want my arogant two-cent thoughts after some years of IT life: \nthe only reason for doing it by email is what the name of your domain \nsays: becausewecan.org\n\n\n   1. You'll be moving a couple of dozen megabytes for any serious work,\n      email gateways typically block very large emails, not to mention\n      folks with slow links. A sysadmin may rip out vital parts out of\n      someone using the system mail spool area as intermediate\n      octree/image storage.  ftp/http/scp is just better by design for\n      large volume\n   2. the server has to set up everything the specific job needs\n      (version of binaries, environment variables, libraries, ...),\n      which needs a bit of care with any method\n   3. web-based leaps to mind before email does (the latter probably\n      never leaps anyway...). Marc Fontoynont's group sat up something\n      for their Genelux program long ago (sorry, don't have any further\n      references to it)\n   4. how do your users pack their jobs ? zip,tar ? How do they verify\n      they have everything included ?\n   5. why setting up a server anyway? For an occasoanl user the various\n      boot-radiance-from-cd concepts are probably much quicker (right on\n      their machine), for bulk processing a render farm with file\n      sharing is approx 3 orders of magnitude faster and easier to manage\n   6. for public usage the server would have to implement some resource\n      management, otherwise any job may block the resources for an\n      unpredictable time\n\n\nif you still want to go and dig in (good!), my personal recommendation \nwould be PHP scripts on a webserver (very preferably Apache). Actually I \nthought about it years ago at ISE, but just hadn't found a good reason \nto offer it publicly. Internally we used our own job distribution system \n(based on NFS) at ISE.\n\n\ncheers\nPeter\n\n\n\n\n pab-opto, Freiburg, Germany, http://www.pab-opto.de\n [see web page to check digital email signature]\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-April/001618.html).</sup>", "attachments": [], "created_by_name": "Peter Apian-Bennewitz", "created_at": "April 20, 2004 at 08:53PM", "created_by": "Peter_Apian-Bennewitz", "parent_id": "radiance-general_001615", "id": "radiance-general_001618"}