{"body": "T&E's how I've always done it. =/\n\n\nOn 8/13/14, 5:37 PM, \"Andrew McNeil\" <amcneil at lbl.gov<mailto:amcneil at lbl.gov>> wrote:\n\n\nAh, good point with the roughness. The only way I know how to get a good value for the roughness parameter is trial and error it until it looks about right in a rendering - which is probably why I avoid using it. If anyone has an good method for setting roughness please share!\n\n\nAndy\n\n\n\n\nOn Wed, Aug 13, 2014 at 4:38 AM, Jan Wienold <jan.wienold at epfl.ch<mailto:jan.wienold at epfl.ch>> wrote:\nHi Shri and Andy,\n\n\nI think you can \"spread\" the \"direct\" component when applying a roughness to the trans material. Then, the scattered light is not lambertian any more. You can control the scattering \"width\" by the roughness.\nYou can see the difference then if you look directly onto the material (smaller or larger spot towards sun direction).  Getting different patches on the wall etc. is quite hard I guess. The reason for this is , that as soon as the \"direct part\" is scattered (when applying roughness), it is handled by the ambient calculation and it is not part of the direct calculation any more.\n\n\nUsing a BSDF with a fine resolution is in fact the best way to handle this.\n\n\ngood luck,\n\n\nJan\n\n\n\n\nOn 08/13/2014 01:26 AM, Andrew McNeil wrote:\nShri,\n\n\nIn the images you sent I suspect that the sunpatch is over exposed, so it appears white in all three renderings. If you create a falsecolor rendering you'll likely see that the sunpatch has different luminance values (make sure to set the scale sufficently high).\n\n\nOne of the drawbacks of using Radiance's trans material to model translucent fenestration materials is that the transmission is divided into strictly specular and diffuse. The specular component is not scattered at all, and the diffuse component is completely lambertian. You might have expected the sunpatch to soften and broaden as the diffusion increases, but with the trans material the shape of the sunpatch doesn't change as diffusion increases, it just reduces in intensity.\n\n\nTo study diffusion like this, you'll really want to use a BSDF. Probably also a tensor tree BSDF so you get sufficient accuracy in the sun patch. And unfortunately LBNL hasn't measured BSDFs for diffusing glazing, so I can't offer an immediate solution.\n\n\nBest,\nAndy\n\n\n\n\n\n\n\n\nOn Tue, Aug 12, 2014 at 3:51 PM, Shrikar Bhave <shrikarbhave at gmail.com<mailto:shrikarbhave at gmail.com>> wrote:\nHello All,\n\n\nFor tspec comparison,  I rendered the same scene for four different tspec values of 10%, 50%, 90% and 100% (ideal diffuser).\n\n\nI was expecting varying amount of diffusion, but I am getting puzzling results. only 100% (ideal diffuse) value returns no direct sun-patch. All the other values show a clear sun-patch in the space.\n\n\nAny clue why this is happening? Would you expect such results? Everything else is constant in the model. (images are attached)\n\n\nThanks,\n\n\nShri\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\n\n\n\n\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>http://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2014-August/010464.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "August 14, 2014 at 06:53AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_010460", "id": "radiance-general_010464"}