{"body": "Hi again,\n\n\nI won't post anything any more regarding cms/software for now, if everyone wants Plone, I have nothing to argue against it (as I do not know it) except that I do not see a reason to get an expensive solution for a task that should be simple to implement (meaning that a setup for a working site should be done in a day and without the need to install specialized software). So if someone can do what we need with Plone without spending much money (at least me I do not earn money with Radiance, so my budget is, ahem, limited), do so :-)\n\n\nI have something to throw into the content discussion. As I see it, Radiance provides users with several learning / support ressources, and not all of it has to / can be covered by a website.\n\n\nMore or less everyone will start by installing the software. Those who do so will first look for an installation guide at the same location where they get the software, it should be linked from the download page and be available as a file called INSTALL.\n\n\nThan they will start to play around, and we have some kind of a \"guided tour\" thru Radiance with the tutorial that comes with Radiance. This could be transformed into something more html'ly, like an illustrated step-by-step tour which is something that can be done easily in html, especially if I make the tutorial up with some more hypertext, e.g. linking from the commands used in the tutorial to the online manpages.\n\n\nEveryone who decides to do a serious work with Radiance (as well as most who do anything with light simulation software) will buy the book \"Rendering with Radiance\" than, and will get all the ressources of the basic work with the system and the underlying theory from there.\n\n\nBecause we are all lazy sometimes and don't immediately find what we are searching, users will continue to ask on the mailing list, and that is what could be improved a bit by installing a FAQ - not by developing any kind of structure and topics, but by analyzing the archives of the mailing lists.\n\n\nThan, what is left, what is really missing right now, and what could really be handled by the website? I think it is mainly information that is\n\n\n1) subject to (frequent) changes, like new / changed tools and features (the mesh type, function files, import- export workflow which always depends on the current software environments)\n\n\n2) too specialized to be covered in the book in every detail, like function files, distributed rendering, materials\n\n\n3) updated libraries, for materials, light sources, textures\n\n\n4) updated links, related projects (e.g. the radzilla project, whih is not and cannot be covered in the book, but is an exciting development people want to know about)\n\n\n5) projects, people, papers (also the workshop cd-images)\n\n\nSo basically, I think we should not try to rewrite the tutorial or the book in a website, and to keep this in mind when we define a structure.\n\n\nAnd yes, as others have been promising before me, yes, I will do my best to put my experiences into this project, and if it is only to learn where I understood things wrong in the past ;-)))\n\n\nCU Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-November/004085.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "November 05, 2006 at 03:17PM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_004054", "id": "radiance-general_004085"}