{"body": "Marija\n\n\n> It works perfectly in Linux, but I couldn't make it work in Windows.\n>\n> For command like this:\n> rtcontrib -n 2  -I+ -V- -h-  -b tbin -o outfile.txt -m sky  -f tregenza.cal\n> @param.opt octree.oct<  points.txt\n>\n> I've got errors:\n> bin/rtrace: fatal - command line error at '-PP'\n> rtcontrib: system - select call error in wait_rproc()\n> bin/rtrace: fatal - command line error at '-PP'\n\n\n> Greg suggested that is could be a problem with file locking, but no idea how\n> to solve this.\n> Maybe some variables/flags should be set during compilation on Windows!?\n\n\nI recently looked into various ways of running Radiance/LEARNIX on a \nWindows machine. Francesco's web site was down (fixed now), so I had to \ncompile Cygwin Radiance myself. I did not try mingw, but believe it to \nbe somewhat similar to cygwin in performance.\n\n\nWhen running Mark's benchmark, I encountered the same problem that you \nare describing with rpiece. Trying to figure out why this wouldn't work, \nI played around with the bench4 makefile, and came to the same \nconclusion that Greg suggested. The syncfile which coordinates the \ndifferent rtrace/rpict processes is opened multiple times, each process \nreading from and writing to the same file.\n\n\nI believe it to be a 'feature' of the Windows OS that users are \nprotected from themselves at all cost, so I'd be surprised if there was \na mechanism that would allow you to disable this file-locking. Having \nsaid that, I am no expert in such matters.\n\n\nIf you have a multi-core machine and really need the extra speed, I \nsuggest you look into running Radiance on LINUX inside a virtual \nmachine. Sun's VirtualBox is very good and open source. It is comparable \nin speed to cygwin Radiance, but will utilise all cores/processors. You \ncan double the speed again by running LINUX natively, to which there are \na number of different approaches.\n\n\nTo get an idea about VirtualBox under Windows and the speed increase \nthat you can expect, please see 'Running LEARNIX' which is available \nfrom the LEARNIX documentation page:\n\n\nhttp://luminance.londonmet.ac.uk/learnix/docs.shtml\n\n\nI know this doesn't really answer your question, but might provide an \nacceptable work-around for your problem.\n\n\nAxel\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-December/006371.html).</sup>", "attachments": [], "created_by_name": "Axel Jacobs", "created_at": "December 05, 2009 at 06:45AM", "created_by": "Axel_Jacobs", "parent_id": "radiance-general_006369", "id": "radiance-general_006371"}