{"body": "Hi Victor!\n\n\n> frosted glass can scatter sunlight to avoid glare buy it would  have \n> lower transmittance.\n\n\nYes, as the scattering results in some of the light being reflected \nback, the transmittance has to be lower.\n\n\n> You just mentioned a structure with clear glass, acrylic, polycarbonat. \n> I am wondering what kind of structure it is and is any product in the \n> market?\n\n\nThere are lots of products, if you look at what companies are offering \nfor \"advanced daylighting\", \"daylight redirecting\", you will find many \noptions. It all depends on your application. Most systems either use \nrefraction or total reflection to have a dielectric surface redirect \nlight. Sometimes this works like with lenses, sometimes it is simply \nreflecting light from selected directions into another direction.\n\n\n> i am using Desktop Radiance. How can i difine this kind of property in \n> Desktop radiance?\n\n\nIn general - not at all. Most of these systems can be modeled using the \nphoton map, which is an addition to Radiance but not part of Desktop \nRadiance. There is also rtcontrib which may be used, but this is a \nrather new tool, while Desktop Radiance, as far as I know, is based on \nvery old code. It is possible to model redirecting materials as long as \nthey do not concentrate light (so most planar surfaces) using prism.\n\n\n> By the way i am wondering, Radiance for UNIX and Desktop Radiance which \n> one is more popular and more people use?\n\n\nI was not aware of anyone using Desktop Radiance any more. As far as I \nknow, all updates during the recent years were in Radiance only, I do \nnot know whether anyone is working on Desktop Radiance. Folks on windows \nsystems in general use one of the windows distributions of Radiance, \npeople who need integration into a GUI have options like brad or the \nSketchup-extension, there are tools such as Rayfront. I do not know \nanyone using Desktop Radiance these days.\n\n\nCheers, Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-October/006274.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "October 12, 2009 at 07:53PM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_006270", "id": "radiance-general_006274"}