{"body": "Hey Rob,\n\n\nRob Guglielmetti wrote:\n> Jack de Valpine wrote:\n>> Hi Rob and Jelle,\n>>\n>> Although I have not tried this, what about rendering a light probe of \n>> the exterior environment (using parameters suitable for an exterior \n>> scene) and then using the light probe to supply the background for \n>> the interior scene?\n>\n> Hiya Jack,\n>\n> This was discussed at length on this list a couple years ago, I \n> started the thread and I think my feeble understanding of lightprobes \n> caused the discussion to get a bit scattered.  Bottom line: there are \n> issues with this approach, especially if you are going for numeric \n> accuracy, but I also think that Greg's mksource addition may have \n> solved some of that (as I understand it, mksource is sorta like a \n> \"mkillum for lightprobes\").\n>\nWell there you go. However, we do not what exactly Jelle's objectives \nare with respect to numeric accuracy. I would suggest to anyone \ninterested to go back and read both May and June threads as Rob points \nout below. It is very interesting and suggests the method of mapping \ndirectly to the interior window surfaces to get both the environment \nmapping as well as the distribution output. I had been thinking of \nmapping to a source.\n> I still do not have a fisheye lens so my lightprobe experiments... \n> have not begun.  Jack, I was really impressed with your presentation \n> at the Workshop (actually, I was impressed with all of the ones I've \n> read so far!), it renewed my interest in playing around with that stuff.  \nThanks! We are working on another night lighting project now where I \nhope to use similar techniques. One thing that is intriguing from a \ndesign standpoint, is when the architect says the want to try out some \ndifferent things, the possibility is to actually run rtcontrib with all \nthe needed sources (including optional ones and \"what if\") and then \ngenerating various images shows the possible scenarios as a result.\n> Sliding off the topic a bit, has everyone seen the new Canon PowerShot \n> G7 that's coming out next month?  It looks really nice, with film \n> emulation up to ASA1600, and the all-important autobracket for us HDR \n> heads, in a compact size (and a separate film speed dial!).  With a \n> 10mp sensor, I'm really curious to see how well the ASA1600 pics come \n> out, but even a low-noise 800 would make me really happy.  Guess I'll \n> wait 'till the folks at www.dpreview.com put it through its paces...\n>\n> Anyhoo, the thread I mentioned way back in the first paragraph of this \n> reply begins here:\n> http://www.radiance-online.org/pipermail/radiance-general/2003-May/000818.html \n>\n>\nThis is a great thread, I recommend it....\n> The discussion spills over into June, so look for those too.  For some \n> reason the posts don't appear continuously even when sorted by thread.\n>\n> - Rob\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n>\n\n\n\n\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-September/004032.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "September 28, 2006 at 09:40PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_004028", "id": "radiance-general_004032"}