{"body": "Hi Jeffrey,\n\n\n> \tNow that I've gotten my feet wet with\n> Radiance, so to speak, I'm left with a bit of\n> a paradox; Radiance has provisions to describe\n> almost any conceivable geometry I could need\n> in modeling buildings; however none of the export\n> programs I have used take advantage of this-\n> everything is turned to triangles.\n\n\nWhat CAD program are you using?  What exporter are you using?  You have  \nto understand that the basic building block of ACIS-based modeling  \nprograms -- when talking to other software -- is the damned triangle,  \nunfortunately.  3DStudio is great at producing models with more curves  \nthan Pamela Anderson, but when you ask it to export that model for use  \nin another application, it spews forth a zillion triangles.  It's not a  \nRadiance limitation, it's an ACIS translation problem.\n\n\n> There are times that this simply doesn't work;\n> such as aiming failures and bad looking curves,\n> and times where it's merely annoying, in that\n> I wish to replace some exported geometry from\n> CAD with Radiance-native geometry, but can't\n> easily do so because the item I wish to replace\n> is a tangle of triangles, and it's hard to discern\n> it's placement from the mess within the RAD files.\n\n\nAutoCAD, when used with Georg Mischler's Radout program  \n(http://www.schorsch.com/download/radout/), can produce much cleaner  \nmodels.  I use AutoCAD and 3D faces as much as possible.  When you use  \n3D solids in AutoCAD, the only way to get them out of ACAD is to  \nconvert them to a 3DStudio mesh first, and that means triangles (and  \noftentimes, LOTS of triangles).\n\n\nAs for the placement of native Radiance geometry, have a look at  \nreplmarks (http://radsite.lbl.gov/radiance/man_html/replmarks_1.htm).   \nYou can use your CAD program to place (with great accuracy and  \nfamiliarity) markers that can be easily swapped out with a .rad file or  \nan octree (but don't use octrees for light sources, as I found out the  \nlong way  \n[http://www.radiance-online.org/pipermail/radiance-general/2003-August/ \n000946.html]!)\n\n\n> I can already produce renderings within\n> Radiance that are much better than anything\n> I've done before. However I still haven't\n> found an efficient and acceptable workflow\n> due to my reliance on CAD systems for generating\n> geometry (and their somewhat inferior exporting\n> ability).\n\n\n> So again I'm bothering all of you in asking\n> for two things; first off, how much & what do you\n> typically model in CAD and how much do you typically\n> describe within Radiance (or array, or instance)\n> for a given project; and secondly, has anyone\n> ever made an effort to make a 3D GUI modeler that\n> uses Radiance as it's native file format?\n\n\nYou know what?  I've been slowly learning Radiance over the last year  \nand a half, and I still don't have a real workflow, and I know that's  \nmy biggest problem right now (well, that and the fact that I need to  \ncut down on the cholesterol).  Right now I use CAD and try to use  \n3Dfaces as much as possible, export with radout, and do some replmarks  \nshenanigans for swapping out light sources.  Manual arrays with xform  \nare used every once in a while, when the building supports it, but that  \nis rare.  I think a lot of us rely on CAD for accuracy, I wouldn't  \nworry about that; people like Greg Ward and Carsten Bauer who use vi to  \nbuild entire Radiance scenes are in the minority, and are completely  \ninsane.  =8-)  Seriously, there's nothing wrong with relying on CAD for  \nthings; CAD is really good for things like building precision models.   \nBut I'd love to hear yours and others' methods for making the jump from  \nCAD to Rad.\n\n\nRob Guglielmetti\nrpg@rumblestrip.org\nwww.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-October/001104.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "October 21, 2003 at 10:54PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_001102", "id": "radiance-general_001104"}