{"body": "On Nov 22, 2003, at 3:48 AM, Benjamin Hagan wrote:\n\n\n> Hi everyone,\n>   I am a new Radiance user, currently a student at Penn State, \n> currently trying to get Radiance up and running on my mac running os \n> 10.3\n\n\n... at 3:48 AM?  There are so many other things to do at that hour!  \n(of course, I don't seem to be doing much better here).\n\n\n>   I don't know exactly what to do in order to set the RAYPATH \n> environment variable so that my system knows to look for the radiance \n> files in /usr/local/bin\n\n\nIf you're using Panther, your default shell is bash.  The way you add \nenvironment variables is to add them to your .bash_profile file.  This \nis like the autoexec.bat on a windows system.  Note the period (dot) \nprefix on the filename.  The dot makes it a hidden file, which won't \nshow up when you do a directory listing.  To see if you already have \none, you do \"ls -a\", which lists the hidden files too.\n\n\nAnyway, from your home directory, type:\n\n\npico .bash_profile\n\n\nYou should now be in a text editor displaying the contents of your \n.bash_profile file, or a blank file if it didn't exist already.  You \nwant to add the following lines:\n\n\nPATH=/usr/local/bin:$PATH\nRAYPATH=.:/usr/local/lib/ray\nexport PATH RAYPATH\n\n\nWhat that does, line by line:\n\n\n1) \"make my PATH equal to /usr/local/bin, and whatever else was already \nin the PATH.\"\n\n\n2) \"make RAYPATH equal to the current directory (.) and \n/usr/local/lib/ray.\"\n\n\n3) \"save those requests; so that they exist every time I start a \nterminal session.\"\n\n\n>   Could someone put together a beginner level unix user step by step \n> list of how this is done. I can't wait to get this working! Thanks.\n\n\nThat's something I've been wanting to do for a while.  For now, use \nthis list as a resource, and you'll be up and running soon enough.  \nFollow the steps above, and let us know if you still have problemos.\n\n\n-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-\n   Rob Guglielmetti\nrpg@rumblestrip.org\nwww.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-November/001228.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "November 23, 2003 at 12:22AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_001227", "id": "radiance-general_001228"}