{"body": "Hi Chris.\n\n\nBecause no one answered this so far I will step in with\nmy limited knowledge and experience about materials:\n\n\nOn 9 Aug 2006, at 10:31, Chris Foster wrote:\n\n\n> i want to shine light onto an ON display and measure the\n> combined light reflecting off of it. this has to include\n> the reflected light and the transmitted light of the display\n> itself. how do i achieve this?\n>\n> im comfortable with using rcalc|rtrace|rcalc and bgraph so\n> i dont need any help there. i require some assistance with\n> the materials for the display. i currently have the material\n> LIGHT emitting from one side of the display, would it be wise\n> to put in GLASS in front of this light?\n\n\nYou definitively want to combine your light material with\nsomething in front of it as \"light\" (or \"glow\" as far as\nit matters) has no reflectance and no transmittance. Nothing\nwill reflect off a \"light\" and nothing will shine through.\nThe 'shine through' is what \"illum\" was designed for.\n\n\n'glass' as a reflector would certainly be possible but it\nis not the best choice. Even if there are still glass-screened\ndisplays around they would probably be treated with some\nsort of coating to avoid reflections which the 'glass' material\ndoes not account for.\n\n\nI'd try a 'trans' material with a very high transmittance\n(similar to glass) and nearly no diffuse component. This\ngives you the possibility to tweak the reflectance to something\nsimilar to a LCD screen. I don't know what their physical\nreflectance value is in reality I just know that I can't read\nmy screen at work sometimes because I've the window in my\nback.\n\n\n> can i model this glass so that it transmittes the light\n> coming from behind it (from the display) and at the same\n> time reflects the light incident on it from the front,\n> from the spotlights.\n\n\nReading the above you might just want to simulate the\nglare effect of a point light source on your screen.\nThen a 'mirror' type material may be your friend. Just\nuse your 'light' material as modifier of the mirror for\nnon source rays:\n\n\nvoid light display_light\n0\n0\n3 2.23 2.23 2.23\n\n\nvoid mirror display_surface\n1 display_light\n0\n3 0.8 0.8 0.8\n\n\n(example for something with 80 % reflectance).\n\n\nYou can't change the surface finish, though.\n\n\n\n\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-August/003901.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "August 09, 2006 at 11:29PM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_003874", "id": "radiance-general_003901"}