{"body": "Hi Caroline,\n\n\nI can think of three possible things that you might want to look into:\n\n\n   1. Illums - these are imposter geometry to help optimize daylight\n      simulation in interior environments. I see that you have the\n      illum= line in the rif file, however since you are getting the\n      warning about \"no lights found\" it is likely that there is some\n      problem: A) illum geometry is directionally dependant, the surface\n      normal must point into the room. To create a polygon in Autocad\n      with the normal pointing into the room, the polygon (a closed\n      pline or 3dface for example) can be constructed by generating\n      vertices in a counter clockwise manner, for example if the polygon\n      is built in the xy plane then drawing it counter clockwise would\n      result in a normal that point in positive z. B) I do not use the\n      rad program so I am not so sure about this, but does the geometry\n      that appears in the illum= line also need to apear in the scene= line?\n   2. Ambient value - this allows a baseline ambient value to be\n      established for the scene, this can be estimated or precalculated\n      with a different script (although I am not sure how DR deals with\n      this). If this value is too high then the images can have the kind\n      of \"glowy\" appearance. I am guessing that a default value is being\n      used from the information in the rif file. This may need to\n      estimated by hand for best results.\n   3. Indirect - this indicates how many ambient bounces to calculate.\n      If you are after accurate results this number probably needs to be\n      2 and perhaps more depending on other factors.\n\n\n-Jack\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-April/001604.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "April 19, 2004 at 07:15PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_001602", "id": "radiance-general_001604"}