{"body": "Hi Jeffrey,\n\n\nOn May 10, 2006, at 9:13 PM, Jeffrey McGrew wrote:\n>\n> 1. Revit likes to model glass as a solid plate, not a flat surface.  \n> So a bit of glass is a rectangular solid, not a flat plane. So when  \n> I try to make the windows into Illum's so that they spread light  \n> into the room, I'm getting errors and problems because I think it's  \n> looking for a flat plane with the normal pointing into the  \n> building. How important is it to have the Windows be a lightsource  \n> for interior renderings? Is there some way, via Mkillum or  \n> something, that I could quickly work around this issue? I can  \n> flatten the glass in Max, but that's an extra step and one that  \n> seems to also cause issues with zero-area light surfaces.\n\n\nUgh.  Yeah, programs like Revit and 3DS, et al. make glazing planes  \nas 3D objects with six polygons.  No good.  Your errors and problems  \nare definitely related to this.  mkillum expects a single polygon,  \nlooking in.  Not sure how you're flattening the planes, but I'll bet  \nyou're still ending up with a pair of triangular polys representing  \nthe glass plane, and who the hell knows which way they're facing.   \nmkillum likes regular polygons.  Page 577 of Rendering with Radiance  \nhas the gory details. Not sure the answer to your problem, just  \nstating the issues.\n\n\n> 2. When I export out of Max, I get a .OBJ and a corresponding .MTL  \n> materials file. I currently use Grep and such to pull out all the  \n> material definition names out of the RAD file I get from OBJ2RAD,  \n> and then creating the .MAT radiance material file by hand. I'd love  \n> to hear a way to take the exported .MTL file and turn it into a  \n> starting point for my .MAT (short of having to write my own tool to  \n> do so...).\n\n\nIf you can grep the stuff out, I'd bet you could write something to  \ntake the result(s) and generate a corresponding .mat file, with shell  \nscripting techniques, or python or perl, or whatever.\n\n\n>\n> Now, we're just designers, and looking for design feedback not hard  \n> numbers. We'd be happy with something somewhat-accurate, for if/ \n> when we need 'real numbers' we'll typically turn to a lighting  \n> designer who know how to generate accurate numbers. But I figure,  \n> heck, we're generating these models anyways, why not try to put  \n> that to better use?\n\n\nSounds like a plan. The thing is, you are closer to real numbers than  \nmost lighting designers, by having the wherewithal to tackle  \nRadiance.  Don't short-change yourself.  A good model and sound  \nparameters in Radiance beats any of the tools commonly used in  \nlighting design, IMO.\n\n\n- Rob\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-May/003660.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "May 11, 2006 at 06:38AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_003659", "id": "radiance-general_003660"}