{"body": "Hello,\n\n\nI started just like you a few years ago... I also have a Thermodynamics\nbackground that ad to be complemented with Radiance (lighting simulation)\nknowledge.\n\n\nIn my experience (from learning and teaching), the first really frustrating\nchallenge people face is understanding that Radiance is not \"a program\" as\nthey are used to, but a \"suite of program\" that have to be used in \"that\nugly, old-school and unpleasant terminal\". Getting to understand the Unix\nway might be hard.\n\n\nHowever, if you already know Python, you are, probably, already with those\nconcepts. After understanding that, I found the tutorials available in the\nRadiance-online website very useful for general matters. Also, for\nunderstanding better the different programs and learning how to organize\nyour files, I found the tutorials on the Rendering With Radiance book very\ngood.\n\n\nA third step, I would say, is to understand how Ray-tracing works. There\nare a few good lectures on rendering and computer graphics on YouTube that\nyou can watch. They will guide you on some core concepts, I think. After\nthat, it may be useful to read a bit of how Radiance work itself. This can\nbe done through the Rendering With Radiance book and/or journal and\nconference articles by Greg Ward.\n\n\nFinally, to understand climate based daylight simulation methods (all first\n3 steps were focused on how radiance did things), I would recommend to read\nthe advanced tutorials on the website (3-phase method, 5-phase method,\netc.) and maybe some journal articles on those topics. John Mardaljevic PhD\nthesis is also a good asset, as well as some papers by Christoph Reinhart,\nboth developed methodologies for performing annual simulations using\nRadiance. In this regard, I made a literature review on lighting and\nthermal simulation methods for my M.Sc. thesis a while ago... after a while\nI noticed there were things missing (i.e. John's 4-component method being\nthe most remarkable one), but it might help you.\n\n\nI hope that helps... I learned using these sources, as well as this list,\nwhich is full of very nice people who may help you a lot\n\n\nGermán\n\n\n\n\n\n\n2017-08-28 0:10 GMT-03:00 Randolph M. Fritz <rmfritz3 at gmail.com>:\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2017-August/012244.html).</sup>", "attachments": [], "created_by_name": "Germán Molina Larrain", "created_at": "August 28, 2017 at 05:29AM", "created_by": "Germán_Molina_Larrain", "parent_id": "radiance-general_012242", "id": "radiance-general_012244"}