{"body": "Wauw, this mailing list suddenly lit up, didn't it?\n\n\nThanks to Greg for link to manpages (so far I have been looking in the manpages.pdf that comes with the distribution).\n\n\nI have also studied Jessi Stumpfels paper on sky capture. We were even in contact with the authors to try to get an understanding of how we could not achieve what they achieved.\n\n\nTo sum up on what we tried in terms of attempting to capture nice (and correct) sky light probes:\n\n\n1) Canon 1Ds Mark II camera\n2) Sigma 2.8 fish eye lens, 180+ degrees field-of-view\n3) 3.0 neutral density filter, mounted inside lens, used for capture of all exposures, ie., it was not removed for capture of sky luminances\n4) darkest exposure (to capture sun pixels without saturation) was achieved with a 1/8000 s exposure, don't remember aperture ... \n5) since the sun is roughly 100.000 times brighter than the sky we must have had an exposure sequence spanning 16 or 17 f-stops\n6) sun pixels were not saturated in darkest exposure\n7) sky pixels were properly exposed in brightest exposure\n8) we controlled the camera from a laptop to automate the bracketing sequence acquisition\n9) taking one full exposure sequence took more than one minute (getting properly exposed sky pixels with a 3.0 ND filter requires very long exposure time)\n\n\nAt first we attempted simply to HDR fuse all exposures in one go, but the HDR sky probes never came out nice. I suspect there is some numerical resolution problem internally in HDRshop, which resulted in sky colors coming out very ugly. When using HDRshop, regardless of what the actual top luminance of the exposure is, the highest HDR fusion value is always 1.0. With a 16 f-stop sequence, where the sun pixels in the fusion result are roughly 1.0 or 0.9, then sky pixels are going to be on the order of 0.00001 ... maybe that's too small values for HDRshop to handle without numerical problems?\n\n\nThen we tried fusing the low end and the high end of the exposure sequence separately and then \"manually\" merging them. I.e., we made a HDR light probe image where the sun and the corona (or whatever the bright area around the sun is called) was definitely saturated, but the sky and cloud pixels were good. Then we thresholded that, and replaced the pixels above the threshold with pixels from a properly scaled version of the HDR fusion result from the top end of the exposure sequence (in order to get the correct sun and corona luminances).\n\n\nThis approach sort of worked. There were some color artifact along the edge of the corona, i.e., where the lower end HDR had been tresholded and pixels were inserted from the higher end HDR.\n\n\nBut it was not really a neat solution.\n\n\n\n\nBest,\nClaus\n\n\n\n\n-----Original Message-----\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2011-January/000304.html).</sup>", "attachments": [], "created_by_name": "Claus Brøndgaard Madsen", "created_at": "January 26, 2011 at 12:30AM", "created_by": "Claus_Brøndgaard_Madsen", "parent_id": "hdri_000286", "id": "hdri_000304"}