{"body": "Hi Greg,\n\n\nthank you for the reply. I tried a bit since, so it is almost one week\nlater that I can report on what I experienced so far.\n\n\n> > 2) rtcontrib and patch-based model. > > Advantages: faster for annual\n> simulations. > > Disadvantages: noise, nice images require high (slow)\n> -ad and cannot be > optimized using mkillum, limitations about specular\n> non-planar > reflectors apply.\n> \n> The accuracy of non-planar, specular reflectors is actually better than\n> #1, but the results are somewhat noisy.  A new -c option to vwrays\n> (coupled with the rtcontrib -c option) is a good way to reduce noise\n> that is available in the latest HEAD.  This is a better way to reduce\n> noise than increasing -ad, and less costly.\n\n\nClassical Radiance scenes with both \"light\" and \"glow\" sources used to\nrequire high settings of -ad to generate \"noiseless\" images. This led to\nsomething like, say, -ab 4 -ad 1024 -as 512. This was typically\nimpossible to render, so mkillum was used to smooth out the ambient\ntransmission through fenestration and keep the sharp transmission\ndistribution only in the direct calculation. The ambient settings would\nbe released to e.g. -ab 2 -ad 256 -as 128 - fast and noise-reduced.\n\n\nWith rtcontrib, we typically have no \"light\" sources any more,\neverything is \"glow\". At the same time, mkillum is not available as a\ntool any more.\n\n\nIt is possible to reduce the amount of rays spawned at any ambient\nbounce by not increasing -ad but -c and having the jitter smooth out the\ndistributions from different sky patches instead. This means that\nadditional rays are spawned only at the first level (direct) but not for\ndaughter rays. However it reduces only the direct noise - noise in e.g.\nshadow patterns for the patches representing the direct sun. Noise for\nareas lid only by indirect, diffuse reflected light e.g. in the back of\nthe room is not reduced.\n\n\nMy guess is that the -c option aims at the same strategy as what Mark\nStock found to be promising for scenes with a lot of geometry and many\nambient bounces:\n\n\nhttp://markjstock.org/radmisc/aa0_ps1_test/final.html\n\n\nWhat is the actual advantage of using -c 4 instead of doubling x- and\ny-resolution?\n\n\nCheers, Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2012-July/008825.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "July 30, 2012 at 03:10AM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_008646", "id": "radiance-general_008825"}