{"body": "Hi Lars,\n\n\nI believe that what you need to do is take your colorpict modifier and \napply it to a material such as a plastic that uses the reflectance of \nyour material sample as the rgb parameters. I believe that you DO want \nto use macbethcal to callibrate the color values of the image and \ndetermine an estimated reflectance. Then using normpat on the image will \nmove the values in image so the average is 1.0.\n\n\nSo steps as follows:\n\n\n   1. acquire sample material image by photography, scan....\n   2. callibrate sample image with macbethcal\n   3. use callibrated sample image to estimate average color\n   4. calculate reflectance based on average color values, grey(r,g,b)\n   5. normpat the callibrated image\n\n\nThen create material as follows:\n\n\nvoid colorpict color.image.pattern\n7 red green blue <normpat picture>.pic picture.cal Px Py\n0\n1 <aspect>\n\n\ncolor.image.pattern plastic color.image.material\n0\n0\n5 <grey(r,g,b)> <grey(r,g,b)> <grey(r,g,b)> <s> <r>\n\n\nSince the colorpict is normalized to an average value of one, it will \nmodify the plastic around the reflectance of the plastic. For example, \nif colorpict returns 1.1 for red then the red of the plastic will be 10% \nbrighter.\n\n\nIn short I think that there are two main ways to use colorpict\n\n\n   1. final reflectance set by colorpict image - colorpict is used to\n      set final reflectance of material, that is use callibrated image\n      colorpict modifier and material with reflectance of  1.0\n   2. final reflectance set by base material - colorpict is used to\n      modify reflectance set by material, that is normpat image\n      colorpict modifier is used to modify reflectance set by material\n\n\nI hope this is helpful.\n\n\nRegards,\n\n\n-Jack\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-June/001860.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "June 29, 2004 at 03:38PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_001837", "id": "radiance-general_001860"}