{"body": "If you're PC-based, I recommend Picturenaut. \nIt's meant to be a modern HDRShop replacement, adding in all the modern features like merging from RAW, ghost-removal, multicore processing. Transition is seamless, because it's compatible with HDRShop plugins, but in addition has an open source SDK.\n\n\nwww.hdrlabs.com/picturenaut\n\n\n\n\nIn terms of IBL, me and a team of artists made the \"Smart IBL\" system, which is exactly what I described earlier: The sun represented with light coordinates, and the lighting split up in diffuse and specular component via differently sized/convoluted HDRs. It's not so much a \"scientifically pure\" solution, but rather optimized for integration into a production pipeline. So it has no magic algorithm, instead it has to work with whatever commercial renderers can offer. Essentially, it prepares an HDR file into pre-optimized components, that are searchable with tags and keywords, and then it uses templates to feed these to VRay, mental ray, renderman, arnold, Maya, Lightwave, Cinema4d, ect.... trying to take advantage of each renderer's specific capabilities and quirks. Also a free and open source system.\n\n\nwww.hdrlabs/sibl\n\n\n\n\nRepresenting an HDR only with light sources, well, in real life there are only very few occasions when this is actually more efficient than using the HDR itself for diffuse. There are some, for example, rendering smoke. We just did it this summer in production, using Lightbitch (another one of my creations: www.hdrlabs.com/lightbitch ) to sample an HDR down to 10 spotlights, take it over to 3dMAX and render smoke puffs in FumeFX. Here is a video of it:\nhttp://www.vimeo.com/18607788\n\n\n\n\n.Blochi\n\n\nOn Jan 25, 2011, at 12:22 PM, Claus Brøndgaard Madsen wrote:\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2011-January/000298.html).</sup>", "attachments": [], "created_by_name": "Christian Bloch", "created_at": "January 25, 2011 at 03:00PM", "created_by": "Christian_Bloch", "parent_id": "hdri_000286", "id": "hdri_000298"}