{"body": "Hi Belal,\n\n\nactually evalglare just evaluates, if the exposure is \"valid\" - as soon \nas it is marked as \"invalid\" (e.g. by the use of pcomb, pcompos) it \nstops. It is good to see that the new safety feature in evalglare works \nproperly and prevents making mistakes in the header treatment ;-).\n\n\nActually evalglare can handle multiple (\"valid\") exposure entries, e.g. \nof you apply several time pfilt...\n\n\nAs Clotilde mentioned, just avoid the exposure completely and try to get \nthe exposure values \"in-cooperated\" into pixel values (ra_xyz or pcomb \n-o ). Actually there is no need to add it at the end again with value 1, \nbut it does not hurt.\n\n\nAnd other remarks:\n\n\n- why are you masking the image? If you do this to set the values \noutside 180 to zero, then it is not necessary. Evalglare automatically \nsets the values outside the field of 180°x180° to zero. It is an \nadditional effort for you to create the right mask, the mask might \nchange between apertures and applying it does not change anything, when \nyou apply evalglare afterwards. If you just use evalglare, it is useless \nto apply masking to remove areas outside 180°.\n\n\n- why are you mapping it to vth? Although evalglare can handle -vth \nviews, I recommend using -vta. The reason is, that due to definition \nreasons, I have to set the outer pixels (at 180°) to zero, as soon as \none corner of the pixel is outside of the 180 (problems occur, when the \ncenter of a pixel is \"inside\", but one corner \"outside\"). So you loose \none \"row\" (well actually it is a circle) of pixels.This does not apply \nto -vta.\n\n\n- if I see your view string, I'm not sure this is correct, are you \nhaving only around 50° view angle? No fish-eye? (in your header :-vh \n49.0537 -vv 49.0537). If you don't have a fish-eye, why are you mapping \nit to fish-eye? evalglare could handle also -vtv (of course cannot \ncalculate a correct illuminance, when the FOV is not at least 180.\n\n\n- if you have a fish-eye, please check the projection method of your \nlens. Many of the lenses are equal-solid-angle and have to be re-mapped \nbefore they can be used in any radiance-based tools, which need the \ncorrect angles (e.g. evalglare, findglare..).\n\n\nJan\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2017-October/000673.html).</sup>", "attachments": [], "created_by_name": "Jan Wienold", "created_at": "October 02, 2017 at 04:26AM", "created_by": "Jan_Wienold", "parent_id": "hdri_000666", "id": "hdri_000673"}