{"body": "Victor.\n\n\nThere are a couple of things you should change. If you can't change the\noptions ECOTECT uses you can run the simulation manually as Marija\nhas shown above and then read the results back into ECOTECT.\n\n\nMore details within:\n\n\nOn Sun, Dec 13, 2009 at 4:28 AM, Victor Li <victorpermanent at gmail.com> wrote:\n> Thank you very much!\n>\n> Actually i uesed ECOTET exported to DESKTOP RADIANCE to calculate.\n> The only differernce between Daylight factor and Illuminance calculation is\n> the -B 0.558659 definition in 11_SKY.RAD\n>\n> In Daylight factor calculation the sky is defined as following:\n>\n> !gensky 12 21 12.00 -c -a 31.400 -o -121.400 -m -120.000 -B 0.558659 | xform\n> -rz -27.000\n\n\nI can't see a difference between the two gensky commands below but the\n\"-B 0.558659\" will create a sky with 100 Lux diffuse vertical illuminance. This\nis very low if you want to calculate Lux values. The only reason to do this\nis that you don't have to convert from a 10000 Lux baseline to 100 Lux (or %)\nif you want to calculate daylight factors.\n\n\nSince both setups and scene files (skies) are the same you would\nexpect the same values for both calculations. However, your settings\nfor the rtrace command are not very accurate so the absolute results\nare going to be different. You haven't told us yet how big the difference\nis, btw.\n\n\n[copied from an older mail]:\n>> The rtrace setting is \"rtrace -I -h -dp 2048 -ar 32 -ms 0.063 -ds .2 -dt\n>> .05 -dc .75 -dr 3 -sj 1 -st .01 -ab 8 -aa .1 -ad 512 -as 256 -av 0.01 0.01\n>> 0.01 -lr 12 -lw .0005  -af 11.amb 11.oct < 11.pts > 11.dat\"  And the two\n\n\nFor more accuracy I would use something like:\n\"-ar 128 -ab 6 -aa 0.01 -ad 2048 -as 256\"\n\n\nMind you, I don't know anything about your scene so these may not\nbe the right settings at all.\n\n\nThe remaining settings are less important in a daylight calculation\nwithout sun. I would also remove the \"-av 0.01 0.01 0.01\" because\nthat would introduce a large amount of artificial ambient light that\nis too high for you 100Lux outdoor illuminance.\n\n\n[...]\n\n\n> skyfunc glow ground_glow\n> 0\n> 0\n> 4\n>      1 .8 .5 0\n>\n> ground_glow source ground\n> 0\n> 0\n> 4\n>      0 0 -1 180\n\n\nThis creates a \"ground\" hemisphere that is nearly as bright as\nthe sky (about 80%). You should reduce the values in the\nground_glow definition to a quarter of their current setting\n(unless you have ground covered in snow):\n\n\nskyfunc glow ground_glow\n0\n0\n4\n     0.25 0.2 0.125 0\n\n\n[...]\n\n\n\n\n> In Illuminance calculation, the definition is :\n>\n> !gensky 12 21 12.00 -c -a 31.400 -o -121.400 -m -120.000 -B 0.558659 | xform\n> -rz -27.000\n>\n> The rest is all the same.\n>\n> For converting the output, the ECOTECT can convert it automatically.\n\n\nECOTECT can read \"single\" value and \"[r,g,b]\" value output, but the\nvalues have to be in the right scale. If you want your DF values\nto mean anything you have to know the outside illuminance of the\nsky and scale all the values if it is anything else than 100 lux.\n\n\nHth,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-December/006403.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "December 13, 2009 at 04:03AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_006381", "id": "radiance-general_006403"}