{"body": "Christopher Rush wrote:\n> Your command was missing at least one important item, a maximum for \n> the scale. If your maximum illuminance in the scene that you're \n> interested in is say 2000 lux you should add that to your falsecolor \n> command.\n\n\nAn easy way to get the maximum value in the image is to use pextrem, \nlike so:  pextrem -o lum.pic\n\n\npextrem will print two sets of rgb values to the standard output, the \nmax and the min pixel values in the image.\n\n\nThe main problem I see though, is--if I'm inferring the correct usage \nfrom the image filenames--is you're using an illuminance pic as the \ninput to falsecolor but you're expecting to see nits?  And you mention \nthat you're interested in computing DFs?  It seems as though you're \nmixing and matching your units here.  It is important to remember that \nfalsecolor has no idea what the images represent, you have to supply \nthat info and there is no error checking.  So you could easily supply \nfalsecolor with an illuminance pic and place a cd/m^2 label, as it \nappears you have done and Chris has pointed out as a problem...\n\n\n> A few more items that you can add to make it more legible... Try a \n> greater number of steps to your scale, maybe up to 20, although this \n> might be too many for a 512 pixel image. If your image was larger you \n> could make your scale larger with the -lh and -lw options. Also if you \n> have a high range and want to see detail at the low end of the scale \n> while still registering values at the high end you could try a \n> logarithmic scale, I think a base around the natural log 2.718 usually \n> shows the range well.\nThis is great advice.  These images are quite powerful ways to convey a \nlot of scene information in one view, but the onus is on the user to \nmake sure the image tells a fair story.  This means dialing in the scale \nlogarithmically to present a fair case for contrast, setting the scale \nmaximum to fairly include the extrema (or at least identifying the \nextrema with the -e option to falsecolor) and of course making sure \nyou're presenting the correct units.\n\n\n- Rob\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-April/004949.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "April 23, 2008 at 09:18AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_004946", "id": "radiance-general_004949"}