{"body": "Michael Kruger wrote:\n>\n> \n> ps: Another major problem for point + shoot rendering from 3D modeling \n> programs is ensuring oconv has a bounded finishing time for any given \n> model. Most models I work with in AutoCAD or Lightwave (exporter coming \n> Real Soon!) need extensive conversion work before oconv will run to \n> completion. (Most often it simply runs continuously until it dies \n> because it uses up all available memory. >4GB! ) Are other people having \n> similar problems?\n> \nHi Mike,\n\n\nthe oconv code is not much if counted in lines and statements, but it is \n  definitly one of the complicated parts of Radiance. The memory issue \nis certainly connected to the amount of fine detail in the scene, as one \nalgrithm within oconv calls itself recursively again and again when \nstepping down the tree and subdividing the cube into octants and \nsuboctants etc. This results in oconv 'blowing' itself up considerably, \nusing far more memory for the process than the produced octree later has \nitself.\n\n\nThis means by subdividing the scene beforehand and then including the \nparts as instances you have far better chances to get a model 'oconved'.\n(If I remember it right Greg once said that by using instances and \nsubinstances etc the whole world could be converted to an octree with \nresolution down to some inches ...)\n\n\nAnother optimisation comes into play: if you have lots of similar \ninstances, they are only allocated once. A drawback of using instance is \nthat every ray has to undergo a transformation on entering, but for huge \nmodels this effect becomes negligible.\n\n\nAll in all this means of course some appropriate user intervention. \nComing up with an automatic solution which e.g triggers subdivision of \nthe scene automatically presumably will be not easy :-)\n\n\n-Cb\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-February/002470.html).</sup>", "attachments": [], "created_by_name": "Carsten Bauer", "created_at": "February 28, 2005 at 07:53PM", "created_by": "Carsten_Bauer", "parent_id": "radiance-general_002469", "id": "radiance-general_002470"}