{"body": "Thank you for the responses everyone. This has been extremely helpful.\n\n\nPaula,\n\n\nI look forward to reading your thesis, sounds very applicatable. I agree, I\nthink the method that I will need to use will be to tie a Radiance\nsimulation to EnergyPlus. The trick will be figuring out how to transform\nthe Radiance result to EnergyPlus input.\n\n\n\n\n\n\nRob,\n\n\nThank you for your thorough response. Im excited to see where OpenStudio\ngoes and how it get integrated into the design process. The features you\nguys are integrating and streamlining will be really fun to test out in the\nfuture. Unfortunately, I'm going to need more control over the BSDFs\nselection and control. This project is also on a short(ish) deadline.\n\n\nIt appears as though to model a custom, dynamic CFS I am going to have to\nuse the radiance 3-phase simulations and manually tie the results into\nEnergyPlus with a schedule and maybe (EMS for the solar heat gain). The\n3-phase method seems to be the best method for this so I'm going to have to\nread up on that process.\n\n\nI found \"The Three-Phase Method for Simulating Complex Fenestration with\nRadiance\" tutorial by Andrew McNeil. It looks like a good place to start\nbut the disconnnect in my head is how to take the annual simulation results\nand convert them to a schedule for EnergyPlus. There are a couple programs\nthat do this already, like DAYSIM and OpenStudio, but I haven't figured out\nhow to do it manually. Does anyone have any material on how to manually\nconvert Radiance results to an EnergyPlus schedule?\n\n\nI've been reading through German Molina's thesis, which has been very\nhelpful so far. I was wondering if there are any tutorials (over tips) that\nstep someone through how to convert Radiance result to an EnergyPlus\nschedule? I thought there might have been a module in Radiance that did\nthis but I haven't been able to find it.\n\n\nThank you for the help everyone, I really appreciate it. Sorry to keep the\nchain going for so long. I hope this is benefitial to others too!\nJustin Shultz\nPhD Student\n\n\n\n\nOn Thu, Mar 13, 2014 at 12:21 AM, Guglielmetti, Robert <\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-openstudio/2014-March/000139.html).</sup>", "attachments": [], "created_by_name": "Justin Shultz", "created_at": "March 13, 2014 at 11:08AM", "created_by": "Justin_Shultz", "parent_id": "radiance-openstudio_000128", "id": "radiance-openstudio_000139"}