{"body": "Thanks, Rob, for the long answer.\n\n\nOn Sun, Jul 10, 2005 at 11:25:45 -0600, Rob Guglielmetti wrote:\n\n\n> >about luminaire data:\n> >\n> >*) Which features would you like to see in a data browser?\n> \n> I think the main thing is to be able to see the critical bits of the \n> file, such as multiplier, photometric type, lamp lumens and quantity, \n> notes, and either a text- or image-based view of the distribution. From \n> there one could be able to edit these bits and save variations on the \n> fixture.  A basic-quality rendering of the luminaire would be great \n> too, placed in a box maybe so one could see the distribution in a space \n> (like my ltview utility does).  The 3d object representing the \n> distribution is very cool, but having a rendering of the luminaire in a \n> space would also be useful for troubleshooting purposes, especially \n> when using illum spheres and all.\n\n\nAre there any editable bits in a IES data file? I thought these\ninformations describe this type of luminaire and editing them would\nmean to change the luminaire.\n\n\nAbout the rendering:\nI remember (about 5 years back) a software from a baltic company\nthat could render the \"footprint\" of a luminaire on a piece of\nwall and floor amazingly quick (some sort of photon tracing,\nI guess). Compared to Radiance it was extremly quick. Computers\nbecame more powerfull since and it should be possible to do a\nsimilar thing with rvu now. I'll have to test that.\n\n\n> >*) Is there a common standard for information exchange beyond\n> >   IES, TM14 and Eulumdat(*.ldt)? Particularly I'm looking for\n> >   some sort of database for luminaire, lamptype and geometry\n> >   data or images. It seems like every manufacturer has it's\n> >   own standard and presentation utility.\n> >   I know there is a project call \"DIALUX\" which seems to be\n> >   supported by a lot of manufacturers (at least in Europe) but\n> >   I don't know if it's actually very popular.\n> \n> You're talking about a couple of things here.  In terms of raw \n> information exchange, the formats you mention are the standards.  I'm \n> mostly familiar with the .IES format since I'm in the USA, but many \n> European manufacturers I deal with also make their data available in \n> IES format.\n> \n> Then you mention a \"presentation utility\", and a database.  These are \n> definitely things that exist, and not in any standard format. \n\n\nWell, I was hoping for some de facto file format for the informations\nbeyond IES or EULUMDAT (which in my eyes are interchangeable).\n\n\n> I have \n> used Dialux in the past and I know what you are referring to there; \n> they have an internal database that stores information about luminaires \n> including the photometric distribution, picture(s) of the image, and \n> keywords.  Basically building on the IES file with more organizational \n> information & fields. I believe the makers of Dialux also publish the \n> format for these databases and that is how the manufacturers have been \n> able to provide downloadable plugins to Dialux.\n\n\nThat's what I remember as well. But I read that it's didn't become the\nstandard format it wanted to be. All major manufacturers support it,\nthough. I'll search for their specs. IIRC they used a MSDE database\nfor storage. \n\n\n> Often, US \n> manufacturers will release calculation software that has an excellent \n> database of *their* luminaires, but allow you to define lums based on \n> any IES file, for obvious marketing reasons.\n\n\nNot only US manufacturers (see Zumtobel Staff and \"Cophos\" for example).\n\n\n> There is also a product called Photometric Toolbox, made by Lighting \n> Analysts (the people who produce  the very popular AGI lighting \n> calculation product).\n[...]\n> This is a very useful tool; it's \n> not a database, but an excellent viewer.  The functionality of this \n> tool is essentially what I was describing in my answer to your question \n> above.  Having this functionality, along with the ability to add \n> extended information to search on like manufacturer, lamp type, \n> mounting, notes, etc, and the ability to then copy any luminaire into a \n> project database, would be great!\n\n\nThanks for pointing this out. I had a look at it and functional\nseems not to have changed much. This is definitly a tool to work\n_on_ the IES data, not only to view and sort it. To distribute\nthe IES data files (and associated information) they create (or\nhave the manufacturers create) simple Windows cabinet file that\ninclude a directory tree with those files. Association is simply\ndone by filename (one could think of a better way).\n\n\nIt should be possible to extract these files and use the directory\nstructure as is or with a few conversions. I already do use directories\nto sort the data. Would be a nice way to import manufacturer data.\n\n\n> >*) How do you organize luminaire data in your projects?\n> >   Do you pre-select the files to use in the project and only\n> >   handle a small quantitiy of datafiles or do you use\n> >   (centralized) repositories (by type, by manufacturer)?\n> \n> I generally collect all the ies files (and converted .rad/.dat files \n> from ies2rad) for a given project and keep them within the job file \n> hierarchy.  In general for any given project there will be a manageable \n> amount of files, and it also makes sense because I often modify things \n> like lumen output on a per-fixture basis so libraries don't necessarily \n> work.  HOWEVER, that's not to say that having a library of *standard* \n> luminaires from which to select *project* luminaires, as described \n> above, isn't a great, great thing.\n\n\nI thought that would be a typical approche. Safes me some thinking as\nwell. \n\n\n\n\nAgain thanks for your input.\n\n\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-July/002826.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "July 11, 2005 at 09:50PM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_002814", "id": "radiance-general_002826"}