{"body": "Hi Kirk,\n\n\nThanks for the feedback.  I'm happy, and somewhat amazed, that you've  \nfigured out how to use it already.  The interface is quite different  \nfrom other applications, but that's mostly because I'm a really lame  \nGUI programmer....\n\n\nLens distortions don't always cause misalignment in panoramas, as  \nlong as you overlap where the distortions match.  However, you will  \nget a kind of \"waviness\" to lines going from one image to the next  \ndue to the uncorrected barrel distortion.  You are best off  \nexperimenting with a few different lenses to see the results.  I  \ndon't really have enough experience at this point to advise you past  \nthat.\n\n\nRegarding image exposure, Photosphere uses the sample-to-nits value  \n(a.k.a. EXPOSURE setting) in an HDR file to rectify the brightness  \nscale between images.  This may not work if your images were  \nassembled by a program other than Photosphere or hdrgen, or if you've  \nmanipulated the images with an application that doesn't keep track of  \nthis setting.  (Most image editors that work on HDR such as Photoshop  \nCS2 and HDRShop don't.)\n\n\nFor 24-bit RGB (standard LDR) images, you really need to nail the  \nexposure and keep it fixed on manual throughout your sequence.  If if  \nit were possible to correct for different exposures, you would have  \nissues with clamping differently in the highlights in many cases.\n\n\nThe panorama stitcher in Photosphere does a better job than most at  \nhiding gradient differences between images, so things like lens flare  \nare not the usual disaster.  Instead of seeing a seam or strong  \ngradient, you may notice an erratic line where the two images are  \nstitched together.  That's the way this algorithm looks, I'm afraid.   \nSometimes it looks better than a smooth blend, and sometimes it's  \nworse.  It really depends on the scene.\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2006-May/000083.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "May 11, 2006 at 08:12AM", "created_by": "Greg_Ward", "parent_id": "hdri_000081", "id": "hdri_000083"}