{"body": "Hi Jack, all, Happy Happy, yadda yadda...\n\n\nJack de Valpine wrote:\n\n\n> Hi Greg,\n>\n> Thanks for the follow-up on this. I think that I have gotten the white \n> balance part correct. I always set it by hand (for example to the sun \n> icon) so the auto white balance feature is effectively off. And I have \n> used aperture priority on the camera however I have used auto \n> bracketing, so maybe I am not getting enough samples? It sound like \n> perhaps the best thing to do is set the aperture manually and vary the \n> exposure time manually as well in order to generate your suggested ~10 \n> samples. Although doing everything manually involves a lot of \n> unnecessary touch of the camera.\n\n\nYeah, for this calibration sequence, you definitely need more samples \nthan a typical auto-bracket will do.  Fixed aperture, varied exposure, \nand shoot from a tripod if you can.  The Canon Rebels are really nice \nbecause you can adjust the exposure with a little roller wheel; once you \nhave the WB and aperture set, you just roll the wheel & click, roll the \nwheel & click, etc.  My Olympus requires a lot more futzing with menus \nto do manual exposure and it's impossible to shoot a decent sequence w/o \na tripod.\n\n\n> Once a response curve has been generated is there some way to check or \n> validate it (if that makes any sense)?\n\n\n\n\nI dunno about validating a response curve, but I'd expect you could \nmeasure the scene with a luminance meter while you're shooting it, and \nthen compare those values to some samples from the hdr image.\n\n\n>\n> In the book (the new one;-) you also indicate that the darkest \n> exposure should have no RGB values greater than ~200 and the lightest \n> no values less than ~20. I could certainly figure out a filter routine \n> with pcomb, however there must be a simple way to do this with \n> ImageMagick. The point being to run a quick preprocess check on the \n> the bounding images. Any takers or suggestions for how to do this easily?\n\n\nI just open the high & low images in Photoshop and look at the \nhistogram.  Are you trying to figure out a way to automate this step \nfrom the command line?\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-January/003206.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "January 09, 2006 at 09:56PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_003203", "id": "radiance-general_003206"}