{"body": "Per\n\n\nBasically your command traces rays from the view point (inside the box) to\nthe surface of the box. Where it intersects with the polygon it creates a\nnew ray to render everything on the other side of the box with rtrace.\n\n\nWhen you use boxes as cut-away shapes for this technique you have to think\nfrom \"inside the box\". I assume that your clipping boxes are very large,\nboth enclose the view point and the top and front of the building\nrespectively. In this case you would see from the inside viewpoint the\nfollowing surfaces (top to bottom in an imaginary image):\n\n\na) The inside of the box cutting away the front of the building (green\nbelow)\nb) The eave of the building (blue below)\nc) The bottom of the box cutting away the top of the building (red below)\n\n\nA bit of ascii art to confuse things:\n\n\n   +--------------------------------+\n   |                                | top cutting box\n+-------------------------+         |\n|  | * viewpoint          |         |\n|  |                      |         |\n|  |                      |         |\n|  |                      |         |\n|  |                      |         |\n|  |                      |         |\n|  |                      | b       |\n|  |                      b   b     |\n|  |                    b |     b   |\n|  +------------------b-----------b-+\n|                     b   |       b\n|                     b   |       b\n|                     b   |       b\n|                         |\n+-------------------------+\n  front cutting box\n\n\n\n\nYour command will use the first ray intersection with the boxes to generate\nthe cutting edges: the green and red lines. Everything _behind_ these\ncutting planes will be rendered. Therefore the only thing you cut out of\nthe image is the eave of the building.\n\n\nTo create the effect you want with your current command create a single box\nthat encloses the building core (the part you want to see). Think of it\nmore of a \"gift wrap\" than a \"clipping box\": It encloses the parts you\nwant, not the part you don't want.\n\n\nHth,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-December/011392.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "December 04, 2015 at 05:34AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_011390", "id": "radiance-general_011392"}