{"body": "Dear Germ?n,\n\n\nMany thanks for you. I agree with you totally that all Radiance works need to apply ray-tracing approach as the core principle of it. However, what I meant by using ray-tracing in radiance, was the using of RTRACE directly through stand-alone radiance tool (as you kindly mentioned).\n\n\nAs you clarified, Daysim uses 2-phase method to do annual simulation (2nd phase) fast, based on pre-calculated Daylight Coefficient Matrix (1st phase). Now, if I need to produce the illuminance levels (produced by specific CFS) at the Workplane under static scene, can I still use Daysim for that? Or, shall I stick to RTRACE tool directly through pure Radiance?\n\n\nAnd, if I have to stick to using Pure Radiance (RTRACE), is the method detailed in the attached document (hope, you see that: where Geometry and Workplane sensors are built in Ecotect and directly exported to Radiance engine), is it still valid?\n\n\n\n\nFinally, in both cases (using pure Radiance and/or Daysim), shall we replace the Radiance tool (works as engine) by the latest released version (i.e. Version 4.2 or recent?) as the one works with Ecotect-Radiance approach (I'm not sure about Daysim, yet) is old version (2.0; in think!)?\n\n\n\n\nReally, I am grateful to you for your appreciated help and looking to hear from you again :)\n\n\nRegards,,,\n\n\nIkrima\n\n\n\n\n\n\n\n\n\n\n> As some of you may remember, I am trying to model a set of CFS to compare their effect on indoor horizontal illuminance of a room.\nSo  far, I have been advised by you for several stages, which really helped me a lot for better understanding of radiance and how it works.\nNow, I have a question about how I use ray-tracing method in radiance? Is it similar to the way explained through the following attachment?\nAs here, calculations are run using Radiance engine but Ecotect or Daysim interface (for geometry modelling and material assignment).\nDocument: http://web.mit.edu/sustainabledesignlab/projects/TeachingResources/GettingStartedwithEcotectRadianceDaysim.pdf\n\n\nI hope if you can kindly advise me on that asap, please?\n\n\n\n\nIkrima,\n\n\nStrictly speaking, Radiance always use ray-tracing. Whenever you call RPICT, RTRACE or RCONTRIB, there will always be a ray-tracing simulation performed. However, when you want to perform annual simulations, you will want to do as few ray-tracing simulations as possible since they take time.\nRTRACE, for example, is a method used to calculate the illuminance or luminance of a point (sensor) in a static scene. Doing this for a whole year would require 8760 or more RTRACE calls, which means 8760 or more ray-tracing simulations, which is slow.\n\n\nAccordingly, Daysim (which uses the 2-phase method) runs one ray-tracing simulation that calculates the Daylight Coefficient matrix (this can be done in pure radiance by using RCONTRIB). This matrix relates the sensors\n(workplane?) in the scene with the sky, mich means that you can modify the sky and quickly evaluate illuminance in the same points. This allows performing annual simulations fast (only the sky changes in a static annual simulation). 3 and 5 phase method are extensions to this that allow also modifying the CFSs in the scene.\n\n\nHope that clarify a little bit.\n\n\n\n\n\n\n\n\n-----Original Message-----\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-August/011172.html).</sup>", "attachments": [], "created_by_name": "Ikrima Amaireh", "created_at": "August 10, 2015 at 08:14AM", "created_by": "Ikrima_Amaireh", "parent_id": "radiance-general_011167", "id": "radiance-general_011172"}