{"body": "Just to clarify a bit (hopefully), what German means is that by simulating the glass *as glass*, and tracing rays through an actual glass material to the sky, you will get better results than if you use a BSDF, in the case of a specular transmitter like clear glazing. The standard Klems resolution for the BSDF (and this is what you have available if you use the standard Radiance tools for annual daylight coefficient simulations) will \"smear\" the spiky direct solar contributions into a single patch subtending 17 degrees, or worse, take that radiation and spread it among three Klems patches. By doing a separate annual daylight coefficient simulation for each tint state of your EC glazing, you can then mix and match the hourly values. As German said, this is what he does with his tools, and this is also what we do with OpenStudio for EC glazing simulations.\n\n\n- Rob\n\n\nOn 7/6/16, 7:45 AM, \"Germán Molina Larrain\" <germolinal at gmail.com<mailto:germolinal at gmail.com>> wrote:\n\n\nJulien,\n\n\nA while ago I saw THESE SLIDES <https://www.radiance-online.org/community/workshops/2014-london/presentations/day2/Mardaljevic-Electrochromic.pdf/view> by John Mardaljevic... maybe they can help you.\n\n\nOn the other hand, the method I would choose for simulating electrochromic glass would be using Daylight Coefficients. It may take longer (depending on the number of windows and states you want to simulate), but it will consider the true specularity of the glass (BSDFs used in the 3-phase method will not allow that).\n\n\nWhat I often do is to perform a DC simulation for every state of the office (I usually work with simple offices with a small amount of windows), and then use a script or spreadsheet to select what is the state at each hour. The calculation of the state of the window at each hour will depend on the control strategy...\n\n\nI hope this helps\n\n\nGermán\n\n\n2016-07-06 7:03 GMT-03:00 Julien Boutillier <boutillier at estia.ch<mailto:boutillier at estia.ch>>:\nHi,\n\n\nI would like to achieve annual simulation of an electrochromic glass (tint change) with Radiance to obtain room illumination.\n\n\nI am interested in the 3 phases method, but the glass xml file defines a constant behavior for each hour of the year.\n\n\nIs it possible to create a file containing the evolutionary behavior of glass every hour?\nOr is there another way to simulate this kind of glass (other than one simulation per hour)?\n\n\nThanks in advance,\nBest regards,\n\n\nJulien\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-July/011844.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "July 06, 2016 at 09:07AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_011841", "id": "radiance-general_011844"}