{"body": "Jack de Valpine wrote:\n> Hey Rob,\n>\n> Wow 300Mb, I start being highly suspicious at around 25MB for a CAD \n> model.  On the other hand, I think this BIM stuff is going to go \n> somewhere, so figuring out how to manage the data is going to be an \n> issue worth investigating. I suspect it is particularly nasty if you \n> are trying get data out for use in Autocad 2000. I wonder if would be \n> any more \"inter-operable\" going from Revit to 2008.\nHi Jack,\n\n\nAt the risk of sounding like a crusty old man, I've been hearing that \nthis is going somewhere for over a decade now.  But I do agree that \nhardware and to a certain extent software is looking more than ever like \nit's ready for this challenge.  I still would argue that the end users \nare not.  Despite there being an AIA layer naming standard for ten \nyears, I have yet to get a couple of drawings from a couple of \narchitects that use the same \"standard\". \n\n\nAnd yes, it does seem like the further you go back, version-wise, the \nmore problems you have.  The file size issue is related to this; each \nprogressive version downgrade caused the file to grow a bit more.  In \nour case, this model was exported to AutoCAD 2008 format by the \narchitect, then converted by me to 2004 and 2000 format, just to see the \ndifferences.\n\n\n> As an aside, I really wish that the folks at Autodesk would provide a \n> method for exporting to obj format. Not that this helps with managing \n> gigantic 3D data sets, but it would at least provide good workflow \n> from Autodesk tools to other applications....\nYeah, I agree.  This is one of the reasons for our office purchasing a \nlicense of SketchUp Pro, is the export capability.\n\n\n- Rob\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2007-October/004516.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "October 23, 2007 at 02:17PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_004494", "id": "radiance-general_004516"}