{"body": "Hi Greg and Jan,\n\n\nThe second graph is just a zoom of the first graph. The peaks occur around hour: 6800 = day 283,  this is also the time with the max. deviation of the solar declination calculation methods.\nThe in Radiance calculated elevation angle is at this time lower than the reference. Therefore direct daylight gets deeper into the room and the peaks are higher. That makes for me sense.\n  The test model is quite simple as shown. Just a box with one window, no shading device, no small gaps.\nThe magnitude of the differences could of course have also other reasons than just the solar declination calculation, but at the end only differences in the solar position calculation leads to the two different results.\n   If the error is between 1-2° as Jan Wienold wrote, than the length of a shadow  of the upper part of a window differs from 9 cm to 18 cm at a location at 48°north. If the object is just 30 cm high, than the shadow length differs from 0.9 to 1.8 cm. This is the magnitude I also could see in the pictures of Christoph Reinhart's students. \n\n\nAs Summary:\nAll this examples just show, that the effect of the sun position calculation method could also be seen in the daylight calculation results. This differences could be reduced by just using a more up to date calculation method, which has no significant influence to computation time.\n\n\nMartin\n\n\n\n\nPS.: The whole article I mentioned in the previous e-mails could be downloaded for free under:\n\n\nhttps://www.researchgate.net/publication/224807292_Computing_the_Solar_Vector\n\n\n-----Ursprüngliche Nachricht-----\nVon: Greg Ward [mailto:gregoryjward at gmail.com] \nGesendet: Freitag, 18. Dezember 2015 23:17\nAn: Radiance general discussion\nBetreff: Re: [Radiance-general] Calculation of solar declination in sun.c\n\n\nYes, though it's worth noting that the differences also occur where there is high variance in the data already.  I'm less sure what's going on with the peakiness of the second graph, and whether that was due to some other resolution difference and not just the solar position.\n\n\nIf I can get a clear consensus from folks about which formulas to use, I can work on an implementation at some point.  Perhaps someone wants to compare the Spencer algorithm to the astronomical calculations library Mark mentioned?\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-December/011431.html).</sup>", "attachments": [], "created_by_name": "Martin Gut", "created_at": "December 22, 2015 at 01:50AM", "created_by": "Martin_Gut", "parent_id": "radiance-general_011407", "id": "radiance-general_011431"}