{"body": "On 7 Oct 2008, at 04:11, Jhun Calixihan wrote:\n\n\n> Hi!\n>\n> I am new to Desktop Radiance and wish to ask if anybody knows why I  \n> could\n> not get any differences in luminance rendering clear and dark glass.\n\n\n[...]\n\n\n> But I get the same image rendered, the objects behind the glass  \n> looks the\n> same.  Looks like there is no difference in the transmission thru  \n> the glass,\n> or is there something wrong with my approach?  But when I click on  \n> the image\n> to display luminance I get different cd/m2 numbers.\n>\n> Any advise would be helpful.  Thanks in advance!\n\n\nI think you only have a problem in understanding the image format and  \nits\nrepresentation on screen.\n\n\nRadiance stores the calculation result as an image where every pixel has\nRGB value and an exponent giving the 'brightness' of the point. This\nformat can store an illuminance range that exceeds the capabilities  \nof your\ndisplay by far. To get a visual impression (the image you would expect\nfrom the rendering) the image viewer has to convert the real values  \nin the\npicture file to RGB values for your computer screen.\n\n\nIf you have two different pictures with the same scene but lit with  \ndifferent\namounts of light this adjustment will present you the image optimised  \nfor\nthe display, which probably means that the real brightness of the scene\nis changed to something that gives the best representation for your  \neyes.\nThe images 'look' similar (or indeed identical) but the real content  \nof the\nimage is different (as you have found out with the cd/m2 values).\n\n\nYou can think of this process of something like your eyes do in  \ndifferent\nlighting conditions: At first you will feel blinded in a bright room  \nbut after\na while your eyes adjust to the light levels and you can see  \nnormally. If\nyou move to an identical but dimly lit room you will think it's too  \ndark. After\nsome time you will get used to it and you can see in this room just  \nlike in\nthe room before.\n\n\n\n\nTo help you with your problem:\n\n\nWhile you view the image in an image viewer for Radiance *.pic file\nformat you have to set the 'exposure' to the same value for both images.\nIf you use ximage (on Unix) use the '-e' option for this.\n\n\nIf you can't do this in your picture viewer use the tool 'pcompos' to  \ncombine\nthe two pictures into one and view them at the same time:\n\n\npcompos -a 2 bright.pic dark.pic > brigh_and_dark.pic\n\n\n\n\nRegards,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-October/005411.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "October 07, 2008 at 02:17AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_005410", "id": "radiance-general_005411"}