{"body": "> i am using Autocad Architectural Desktop 2000i with win2000 and all the patches\n\n\nGilles, this is the general Radiance list. You probably want to post \nyour errors and questions regarding Desktop Radiance to the Desktop \nRadiance list, for you're much more likely to get the help you're \nlooking for.\n\n\nhttp://finance.groups.yahoo.com/group/DesktopRadiance/\n\n\n> we are researching other light simulation study software\n> i do have 2 Linux boxs in production, would Radiance work better with Linux?\n\n\nIn my experience Radiance works better as a 'full' version running \nunder some form of Unix. I use it primarily with Cygwin on Windows.\n\n\nCygwin is a 'mini-Linux' that allows you to run some Linux tools under \nwindows, and to port others to be able to run. It's open source, like \nRadiance, so it's free. Thankfully, Francesco Anselmo ported Radiance \n3.5 to run under Cygwin, which gives you full Radiance abilities under \nwindows. Here's the links to both:\n\n\nhttp://www.cygwin.com/\nhttp://www.dream.unipa.it/dream/pub/dot/anselmo/radiance/03.php\n\n\nHowever there will be more of a learning curve for you with this \napproach, for you'll have to learn BASH Unix command-line tools as \nwell as Radiance. I've also used Radiance with Mandrake Linux & OS X, \nand both worked very well. However, learning how to use the full \nRadiance package on Unix/Linux/Cygwin has taken me a long time, and \nI've got quite a ways to go. It's not the easy road, but by far the \nmost rewarding. :-)\n\n\nAlso there is a commercial Radiance port for Windows called 'rayfront' \nthat gives you a much easier to use interface for Radiance. This might \nbe your best option off all, if Desktop Radiance doesn't work for what \nyou need and you find the full command-line Radiance too daunting but \nyou still want to use Radiance:\n\n\nhttp://www.schorsch.com/\n\n\ngood luck!\n\n\nJeffrey\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-May/001646.html).</sup>", "attachments": [], "created_by_name": "Jeffrey McGrew", "created_at": "May 04, 2004 at 12:06AM", "created_by": "Jeffrey_McGrew", "parent_id": "radiance-general_001644", "id": "radiance-general_001646"}