{"body": "On Jun 15, 2006, at 2:39 PM, Gregory J. Ward wrote:\n\n\n> Hi Mark,\n>\n> The Radiance RGBE format is not able to record negative pixel  \n> values, so such primary values should be clamped to zero.   \n> Apparently, Photoshop is not doing this.  Photosphere (and the  \n> Radiance tools) check for and truncate negative primaries, writing  \n> them out as 0's.  OpenEXR doesn't have this issue, as it can read  \n> and write negative primary values -- in fact, you are better off  \n> using OpenEXR for your intermediates also as it is a higher- \n> precision format.  It doesn't really make sense to use a lower- \n> precision format like RGBE for intermediate results then write out  \n> your final as OpenEXR, as you've lost information along the way.   \n> It would make more sense the other way around\n\n\nHi Greg,\n\n\nAarrgh... right you are. A very long time ago I set up a workflow  \nthat was all Radiance file based because: 1) my 3D software only  \nunderstood that file type, and 2) I read \"somewhere\" that Radiance  \nformat could store a much greater range than OpenEXR. Despite reading  \nmany other details about both formats, I stuck with my initial,  \noversimplified understanding which was \"Radiance holds more  \nbrightness than EXR.\"\n\n\nBasically, I should've read your HDR Image Encodings page even more  \ncarefully - not only is the precision in OpenEXR much higher, but  \nmost of the extra brightness latitude in RGBE is essentially unused,  \neven for my very-wide-range \"light probe\" panoramas. EXR is very  \nwidely accepted now, and I think 10.7 orders of magnitude is enough  \nfor my purposes... ;-)\n\n\nGood thing I posted what I did... I doubt I'll forget it now.\n\n\n-Mark\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2006-June/000108.html).</sup>", "attachments": [], "created_by_name": "Mark Banas", "created_at": "June 16, 2006 at 11:02PM", "created_by": "Mark_Banas", "parent_id": "hdri_000105", "id": "hdri_000108"}