{"body": "Hi Jack,\n\n\nIt would be nice if rcalc were smart about strings, but all it can really do is pass them from one place in the input to another place in the output.  It never looks at them, really, and none of the operations supports strings.\n\n\nRegarding your second idea of including the material along with the value, you can do this with rcalc as written.  You would have to go for an ascii output, like so:\n\n\nvwrays -ff [args] | rtrace -h `vwrays -d [args]` -ffa -omv [rargs] octree | sed -f alphas.txt > alphaval.txt\n\n\nThe file \"alphas.txt\" would contain something like:\n\n\ns/^mat1\t/0.35\t/\ns/^mat2\t/1.0\t/\ns/^mat3\t/0.0\t/\ns/^mat4\t/0.75\t/\n[etc.]\n\n\nThis would replace each material with an associated alpha value.  From there, you would have to convert to 16-bit RGBA or something if you wanted to load it into Photoshop, and I think you would need a C program for that.  Alternately, you could split the file using rcalc and pvalue like so:\n\n\nrcalc -e '$1=$1' -of alphaval.txt | pvalue -h -y $YRES +x $XRES -df -b > alpha.hdr\nrcalc -e '$1=$2;$2=$3;$3=$4' -of alphaval.txt | pvalue -h -y $YRES +x $XRES -df > image.hdr\n\n\nPhotoshop can load, convert, and combine HDR files, though you probably have to change from 32-bit to 16-bit mode when you do.  Just make sure not to use any of the fancy tone-mappers when you do....\n\n\nI'm not sure the above would be any faster than Iebele's current method, but it would avoid separate rtrace steps.  This permits you to use the -pj option of vwrays safely, as you won't risk sampling one object in one run and another object in another.  (Pseudorandom sequences should guarantee this in any case, but I'm not sure they do on all systems.)\n\n\nCheers,\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2012-February/008419.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "February 25, 2012 at 09:28AM", "created_by": "Greg_Ward", "parent_id": "radiance-general_008406", "id": "radiance-general_008419"}