{"body": "I’m not well-versed enough to give an opinion on which are ready for use in any particular application, but I would give *my* opinion on your closing thoughts. If the calculation method for the metric isn’t changing, but maybe there’s ongoing research into appropriate values and applications, maybe the metric is useful enough to help “guide the design in the right direction.” However there may be some metrics that have gone out of favor or been invalidated by current research that could be excluded – to avoid a curious user applying something they shouldn’t. But sometimes even the outdated metrics may still be referenced in some governing design standard and a user may need it for a particular project.\n\n\nAs with any other metric, the designer has to know the correct application and the appropriate target values, or which magnitude of difference between two designs might be considered negligible. Something as simple as illuminance isn’t changing in principle, but the design standards and recommended values are still changing and being clarified or fine-tuned. And a designer has to know the appropriate application where daylight factor, or daylight autonomy is an appropriate metric. So if a particular metric is in question and has ongoing research into application limits, tolerance thresholds, etc., a designer may not have full confidence to say a value of X.X in a particular metric is “good enough,” but if they have two design options they can hopefully make a reasonable judgment on which is better (as long as the metric hasn’t been invalidated!).\n\n\n-Chris\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-December/011990.html).</sup>", "attachments": [], "created_by_name": "Christopher Rush", "created_at": "December 02, 2016 at 06:10AM", "created_by": "Christopher_Rush", "parent_id": "radiance-general_011989", "id": "radiance-general_011990"}