{"body": "Jack de Valpine wrote:\n\n\n> OK, now to potentially add fuel to the flame fest fire.... Our \n> in-house workflow is based on a production process where the 3d \n> modeling application(s) are decoupled from the rendering application, \n> eg they are not an integrated solution. I prefer to think that they \n> are best in breed solutions. And there are a whole host of reasons \n> that make decoupling rendering from modeling very important and \n> useful. Modeling occurs in one set of preferred applications while \n> rendering/simulation occurs in another, Radiance. The different \n> applications have different user interfaces. Because of this, \n> different os's are needed to run the preferred applications, it is \n> just a simple fact of life.\n\n\nAmen.  Allow me to respond to Jelle's original post, as from what I can \ntell, the references to winbashing are directed at me.  I may have said \nsomething to the effect that Windows isn't a \"real\" os.  Maybe that was \na cheap shot, but let's look at the facts.  Unix flavors boast many \ntools to facilitate working with Radiance, such as multiprocessing \nsupport, robust shells that are scriptable (yes, cross platform \nscripting tools like Python, Perl, et al. have negated this one a bit, \nbut then again Jelle's point is about Radiance access to the masses and \nthe masses aren't necessarily gonna be Python wizards) and of course \nfull support of the toolbox model _which is exactly the paradigm that \nRadiance was constructed to work in_. \n\n\nI struggled with Linux for a long time to get a usable system and get \nRadiance compiled, way back in the day.  Sure, most people aren't as \nstubborn as I am and perhaps we're losing new users to the dread of \nhaving to become a Unix sysadmin just to use a \"program\" like Radiance.  \nBut let me tell you something else: you know who told me to stick to my \nguns and learn Radiance from the unix shell?  It was none other than \nSchorsch himself, about eight years ago!  Now eight years is a long \ntime, and since then the windows binaries have, well, they've appeared \nin the first place, and only improved since then.  But there are still \nbugs and missing tools.  I agree with Jack that there's a disconnect \nbetween the rendering and modleing processes, and as he and others have \nsaid in this thread, the best tool for the job is what you want to be \nusing.  There is no doubt that it can be a gigantic PITA to have to buy, \nmaintain and bounce between systems to accomplish the tasks at hand.  \nBut many of us have devised a workflow that allows a relatively smooth \ntransition from the modeling side -- usually done on Windows systems -- \nto the rendering/calculation side, usually done on an OS X Mac or a \nLinux box and found the benefits to be worth the efforts.\n\n\nIgnacio's nrv is indeed a very exciting new addition to the Windows \nradiance practicioner's toolkit. Francesco's mingw binaries and \nSchorsch's binaries that ship with Rayfront are great ways to try \nradiance on Windows.  I absolutely agree that Cygwin is awful and DTR & \nI did not get along well either.  I wouldn't wish those on anyone.  But \nI still feel like the best way to get involved with Radiance for the \ntypical Windows user is to get your hands on a spare machine that you \ncan install Linux on. Many users have chimed in on this thread with \ngood, constructive ways of using two machines to get the job done.  If a \ndecent cad program -- let me rephrase that: a cad program that was \naccurate and that this AutoCAD user could figure out in minimal time -- \nwould ever come out for OS X, I'd say a Mac OS X computer is all you \nneed.  I've been waiting for that for four and a half years now, \nthough.  the new BootCamp and Parallels options available to Intel Mac \nusers are promising, in that they offer the ability to use one hardware \nplatform to host all your best of breed apps, in the OS they require. \nBut as Greg said BootCamp requires back and forth rebooting to change \nOSes, which, stinks.  I beta tested Parallels, which can run unix and \nWindows in parallel.  It was pretty fast at first, but strangely enough \ngot slower and more buggy with each interim release.  The final release \nis now available and I'm still debating whether to give it one more \nchance.  But I digress.\n\n\nClearly, the current state of the Windows tools allow users to exploit a \ngood deal of the Radiance toolkit today, on Windows, should they wish to \ndo so.  But I maintain that it's still not perfect, and still has its \nown litany of downloads and workarounds needed to install it and use \nit.  I mean, you don't just double-click setup.exe and start rendering.  \nSo my feeling is that if it's a struggle either way, why not try to use \nRadiance in the environment it was conceived in?  AFAIK, I never told \nanyone to use Cygwin or DTR.  I'll bite my tongue re: Windows in general \nfrom now on.  I'll try.  But I will also stand by my assertion that Unix \nis still the best platform on which to run Radiance.  I don't think \nanyone here gave out INcoherent information regarding anything.  \nOpinions differ, that's all.\n\n\nMaybe a coherent Win/Radiance HOWTO can be part of the \nradiance-online.org knowledgebase as that moves forward.  I ain't gonna \nwrite it, but I agree with you Jelle, there probably needs to be one.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-June/003775.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "June 16, 2006 at 05:54PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_003767", "id": "radiance-general_003775"}