{"body": "Rob Guglielmetti wrote:\n\n\n> On Thursday, May 29, 2003, at 10:40 PM, Marcus Jacobs wrote:\n> > I am in the evaluation phase in my quest to purchase a new computer.\n> > From what I have been told, the Motorola G4 processor is far superior\n> > in scientific calculations as compared to x-86 based processors (i.e.\n> > Intel/AMD).\n>\n> I was told similar, on this list in fact.  But the thing is, while that\n> may be true in theory, the bang for the buck king of the hill is still\n> over at AMD.\n\n\nYou always have to say what you're comparing to. What Apple\ncompares in their PR is the CPU frequencies. Since the PowerPC\nis a true RISC CPU, it will process about twice as much data per\ncycle. This means that eg. an 800 Mhz Mac will roughly equal\na 1600 Mhz PC running Linux (your mileage may vary with Windows).\n\n\nIt does *not* mean that this power will come at an equal price.\nThere's simply no way for Apple to compete with the mass produced\nparts in a PC here, even if they have switched to use some of\nthose as well.\n\n\n\n\n>  so I loaded RHL on an old Pentium 450 we\n> had lying around.  The calc times on that were about the same as the\n> times on my PowerBook, which is a G4 550 with 512MB of RAM.  I was told\n> there was probably something wrong with my hardware (stop laughing at\n> the double-entendre),\n\n\nGiven the similar frequency range, it is indeed very likely that\nsomething is wrong here.  Note that laptops (on both sides) use\ndifferent types of CPUs and probably other components, which will\nslow down a lot of stuff, even when the system doesn't switch to\nsleep mode in between...  Just think of the hard disks for\nexample, which rotate relatively slow to reduce noise and power\nconsumption.\n\n\n\n\n>   The simple fact of the matter is that you can buy more\n> Radiance-photon-number-crunching-per-dollar/euro/drachma/sheckel-what-\n> have-you with homebuilt PCs than you can with Apple's hardware.\n\n\nMass production and competition between various manufacturers\ndo have a noticeable effect.\n\n\n\n\n> >  the GNU C compiler has a SSE2  optimization option.\n\n\nCPU specific optimizations may add another dimension to the\nequation. Compilers will try to do something into that direction,\nbut to get the most bang for the buck, some small key routines\nwould have to be rewritten in assembler. Imagine a vector-matrix\nmultiplication finishing in less than ten cycles on an Altivec\nCPU, instead of the several dozen it currently takes, and the\nMac comparison would look very different to what it does now.\n\n\n\n\n\n\n> >  I do believe there can be some performance gains achieved\n> > if it can be used in conjunction with a 64 bit Operating System.\n\n\n> SuSE already has a 64 bit version of Linux, and I for one am unclear on\n> what that means for us Radiance people.  I'd love to hear some insight\n> about what the 64-bit movement means in terms of performance for the\n> typical rpict process. =8-)\n\n\nProbably not much. The main advantage of a 64 bit system is the\nlarger address range. There may be compiler options that allow you\nto load several values into the same registers together, but I\nwouldn't expect any wonders from that if the software isn't written\nwith it in mind. And other (or maybe the same) compiler options will\ncause harm, if they change eg. the size of an int.\n\n\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-June/000827.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "June 02, 2003 at 07:38AM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_000813", "id": "radiance-general_000827"}