{"body": "Hi Martin !\n\n\nSomehow this reminds me of something. Last year I produced some big renderings on a Linux-Cluster, too, and once I got a weird result looking quite similar to yours. (It's a pity that I've already deleted the picture, so there's no comparison possible anymore.)\nAltogether I've put my experience into the following words: \"If things take too long, they go wrong.\"\nSo that's from the heart. Now back to a more rational strategy:\n\n\npossible crucial points\n\n\n- that ... lock manager.\nrpiece depends on it, as John already pointed out (or was it Jack ? by the way, John, or Jack, are you Jack or are you John ?) The Linux-Version of the lock manager is not comparable to the UNIX one, (maybe this has already changed ??) , as I understood it, the Linux one doesn't really distinguish between read and write, anyway, the shared file\ngets messed up\n\n\n- the model\ntry to separate it into several smaller octrees. When looking at your image I wonder where the 162 MB are, perhaps there is some way of optimising the model, too ?\n\n\n- parameters/light sources (again, already asked by John)\nI have the assumption, that is has to do something with the time needed (see above), which depends of course strongly on those two points. I rendered pictures of 7000 x 5000 pixels and higher on octrees summing up to 20-50 MB without problems (on a 5-node cluster), but when things lasted longer than two days, several blocks \"faded away\" into dark\ngray. (By the way, I used an especially developed PVM-based parallel Radiance, so I don't have the lock-manager problem.)\n\n\nSo long for now. It would be interesting to get some more Information, the things John asked for. Then in return - maybe- more advice is possible. Lets see..\n\n\n-Carsten\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-April/000215.html).</sup>", "attachments": [], "created_by_name": "Carsten Bauer", "created_at": "April 10, 2002 at 01:53AM", "created_by": "Carsten_Bauer", "parent_id": "radiance-general_000210", "id": "radiance-general_000215"}