{"body": "Hi Bernd,\n\n\nI've read your post to radiance-general, and am just installing a\nDebian-unstable in Qemu to give you some more feedback. This has been\ntaking forever--my box isn't particularly fast, and is in dire need of\nsome upgrading. Will get back to you...\n\n\nI have a few thoughts that I'd like to share with you, irrespective of\nthe actual install. Please don't take them as rants, and feel free to\ncompletely ignore them if you feel they're out of place. I seem to\nhave a talent of always striking the wrong string with people...\n\n\nBefore I go on, let me mention that I have not actually packaged debs\nmyself, but I did roll some Radiance RPMs many years ago, and know how\nyou must have been suffering from the non-standard build/install of\nRadiance. I could never release my RPMs, since this was years before\nRadiance went OS, and my explicit request with LBL got turned down.\n\n\na) I've been browsing the Debian pages for the best part of an hour\nnow, but just can't find the relevant page. I might be completely\nwrong (this could well have come from the Fedora packaging\nguidelines), but something tells me that auxiliary data (such as the\n*-materials.deb) should actually go into *-data.deb. This is more\ngeneral, e.g. some of the .cal files that you have in there could be\nfor, let's say some fancy rtrace projection, rather than a parametric\nmaterial definition. I believe the general idea behind the *-data is\nthat it is not required to run the software--many games have extra\ncharacters/cars/worlds in *-data.\n\n\nb) Have you checked with debian-legal yet whether the Radiance license\nis ok for inclusion of the package in Debian proper, rather than\nnon-free? I've been studying the DFSG and Software License FAQ\n(http://people.debian.org/~bap/dfsg-faq.html), and ended up having\nlots of scribble (=doubts) on my print-out.\n\n\nThe Radiance license is not OSI approved, this is what the FAQ has\nthis to say about self-made licenses:\n\n\n\"But it is our strong and heartfelt advice that using a tried-and-true\nlicense is best for almost all purposes. Even large corporations with\ndozens of lawyers on staff itching to write their own license have\nfound this out the hard way, as in the Mozilla license saga, or the\nDjvu license story, or the trouble Trolltech had with the Qt license.\"\n\n\nThe point most relevant (and potentially hindering) seems to be this one:\n\n\n\"# Q: Are clickwrap licenses okay? (Meaning licenses require anyone\nreceiving the software to click on an I AGREE button indicating ascent\nto the terms.)\n\n\n\"A: No, not unless the clickwrap stuff can be removed. Even aside from\nfreeness, as a practical matter such a clickwrap requirement would be\nan unreasonable burden upon our users.\n\n\n\"To be technical, in principle one could put the GPL in a clickwrap\nand the license would be perfectly fine. But once you add a\nrequirement that the software must be distributed via the clickwrap,\nor that clickwrap code cannot be removed from the software, your\nlicense becomes non-free. Since clickwraps without such a requirement\nare a bit pointless, clickwrap licenses are almost always non-free.\"\n\n\nI understand that technically there would be no problem with throwing\nup an 'agree/decline' window upon install, but I think this would be\nnot be solving the problem.\n\n\nWhat I do not know is whether this click-wrap is merely an artifact\nfrom the days when Radiance was non-free (in which case we might be\nable to lobby LBL as the copyright holder to get it removed), or if it\nhas been left in there for a purpose.\n\n\nIf you haven't done any legal checkup yet, I'd be more than happy to\noffer my help.\n\n\nc) This, again, is too long ago to remember: There used to be a\nRadiance RPM in Turbolinux, and I'm fairly convinced that a Debian\npackage also existed. One of them actually packaged it into\nradiance-nox11 and radiance-x11. The idea was that to use Radiance in\nrender farm, all the extra X11 requirements would not have to be\ninstalled. I'm not suggesting that you follow this approach, but do\ngive it a thought.\n\n\nd) Your communication with Greg happened off-list. I feel that many\nRadiance developers (and users, too) would be very interested in\nreading though the thread. BTW, this is also the reason why I'm\nposting this to radiance-devel, rather than just to you personally. I\nstrongly believe that the Radiance development process should be as\ntransparent as possible. Anyhow -- is there any chance of you making\nthis conversation available to the rest of us (with Greg's permission,\nof course)? I am particularly interested in what Greg has to say about\nlibtiff. It seems you linked to the system one, not the one which\ncomes with Radiance. Does that mean that the official one can be\ntrusted now?\n\n\ne) There's more in the pipeline, but let me get my hands dirty first.\n\n\nSo much for now\n\n\nTake care\n\n\nAxel\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2007-October/004461.html).</sup>", "attachments": [], "created_by_name": "Axel Jacobs", "created_at": "October 14, 2007 at 07:25AM", "created_by": "Axel_Jacobs", "parent_id": "radiance-general_004452", "id": "radiance-general_004461"}