{"body": "Hi Prudhvi,\n\n\nYou are correct that changing the luminaire output with ies2rad would be a very inefficient way to go about things.\n\n\nThe best method is to add together illuminance or image results for your separately controllable luminaires using the appropriate dimming factors.  If all of your luminaires are controlled by a single sensor, then this is equivalent to adding a scaled \"electric lighting only\" component to a \"daylight only\" component.  This can be accomplished with pcomb like so:\n\n\n\tpcomb -o daylight.hdr -s 0.7 -o electric.hdr > total.hdr\n\n\nIn this example, I assume that your dimming level is set to 70% output.  If you have three separately controlled luminaire banks, your command might look like this:\n\n\n\tpcomb -o daylight.hdr -s 0.25 -o bank1.hdr -s 0.5 -o bank2.hdr -s 0.65 -o bank3.hdr > total.hdr\n\n\nHere, I have set bank1 to 25%, bank2 to 50%, and bank3 to 65% output.  To compute each of these banks, you will need to render your scene without daylight and with the other banks turned off, somehow.\n\n\nIf you are computing illuminances rather that images, you can use a spreadsheet or similar to apply your dimming factors to the calculated illuminance components in a similar fashion.\n\n\nIf you have individually controlled luminaires, it might be more efficient to use rcontrib to compute the contribution of each luminaire without having to perform multiple rendering calculations.  This is a bit more involved, but you might be able to figure it out from the examples given in my talk from the 2012 Radiance workshop:\n\n\n\thttp://www.radiance-online.org/community/workshops/2012-copenhagen/Day1/Ward/Rtcontrib_tut1.pdf\n\n\nI hope this is enough to get you started.\n\n\nBest,\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-April/011726.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "April 25, 2016 at 10:06AM", "created_by": "Greg_Ward", "parent_id": "radiance-general_011725", "id": "radiance-general_011726"}