{"body": "On 05.02.2006, at 18:43, Christian Fusenig wrote:\n\n\n> Thank you Thomas,\n>\n> i understand your suggestions and the procedure worked for an .dxf  \n> file i grabbed from the internet. It was a luminaire file from ERCO  \n> Lighting. I defined different layers and named them. The dxf2rad  \n> worked fine and i ended up with my desired modifiers.\n> But the files i got from this company didn't work! I opened them in  \n> Autocad 2005 and it said something that they were created with 'Pro  \n> Lignum 3D'. I can work with the file in Autocad but when i save it  \n> as .dxf then the dxf2rad converter messes it up. I get an empty  \n> file like that:\n> ## Radiance geometry file \"Video_Monitor.rad\"\n> ## Converted by dxf2rad 0.9: Sun Feb 05 18:33:59 2006\n> ## C:\\cygwin\\opt\\ray\\bin\\dxf2rad.exe Video_Monitor.dxf  \n> Video_Monitor.rad\n>\n>\n> ## End of Radiance geometry file \"Video_Monitor.rad\"\n\n\nI had a quick look at the ProLignum product description and it\nseems to be a highly parametrical software. To store this type of\ninformation in a DXF file you have to use other data types than\nsimple geometry primitives. Unfortunately you can store information\nin a DXF file that not every DXF reader (or even an older AutoCAD\nversion) can understand. I believe ProLignum makes heavy use of\nthat and dxf2rad can't find anything it could use.\n\n\nYou should ask the producer (http://www.kiwisoft.de/) about the\nbest way to get polygon data from their files. They may have a\nconverter or can tell you what to do in AutoCAD about this problem.\n\n\n> I have no web space to post this .dwg  file to and i guess to send  \n> the file to this list is a bad idea. Maybe i can send it to you and  \n> you can open it and see whats wrong. I have to ask this company if  \n> i can give these files away but maybe we can make a deal. ;-)\n\n\nHold it! I don't even have a version of AutoCAD around. I only\nhave IntelliCad on my system which does not work with ARX\napplications (ProLignum is one). So I may not even be able to\nopen your files.\n\n\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-February/003354.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "February 05, 2006 at 08:10PM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_003351", "id": "radiance-general_003354"}