{"body": "On 15 Jun 2008, at 06:01, ZZ wrote:\n\n\n> I tried to install radiance according to your instruction, and it  \n> should work by my computer's feedback information.\n>\n> (i) I perform install in the directory&quot;/home/myname&quot;, is  \n> it ok? I'm not sure if I\n> should perform \"sudo apt-get install radiance\" in the directory \"root\"\n\n\nThe location where you perform this command does not matter. You just\nneed the rights to do it, hence the use of sudo.\n\n\n> (ii) it is strange that after intallion I can't findany installed  \n> files of radiance.\n\n\nIt's Debian/Ubuntu policy to install everything in the /usr branch of  \nthe file system.\nThe binaries will be in /usr/bin/, library files in /usr/lib or a  \nsubdirectory of it.\nThe advantage is that everything is in your search path after  \ninstallation\nso you won't have to adjust PATH yourself.\n\n\nThe disadvantage is that there will be name conflicts with other  \npackages.\nFor the Debian/Ubuntu packages in particular the name of the 'genbox'\nprogram was changed to 'rgenbox'. If you want to follow the examples in\nold documents you have to keep that in mind and change the commands\naccordingly.\n\n\nAnother frequently used command is 'rview'. It was renamed to 'rvu' a  \nwhile\nago but there are still plenty of examples and tutorials around which  \nuse the\nold name.\n\n\n> (iii) should I set environment path after installion?\n\n\nAs said above you won't have to set PATH if everything is in /usr/bin/.\nYou can check if there is a RAYPATH variable set after you log in.\nType\n\n\n\tenv | grep RAYPATH\n\n\nand you should see the value of the variable (or nothing if it's not  \nset).\nStrictly speaking RAYPATH is not necessary if you're not referring to\nany patterns or calculation files in your scene. Some example scene\ndo, however, so it's probably a good idea to have it set.\n\n\n> (iv) how to get first start of radiance in ubuntu?\n\n\nFirst you have to get an idea about what Radiance is. I'd recommend\nto read and follow the documents linked on this page:\n\n\n\thttp://luminance.londonmet.ac.uk/learnix/docs.shtml\n\n\nThis should give you a good understanding of the basic interaction  \nbetween\nthe Radiance tools. Further you can download a lot of e-papers from\n\n\n\thttp://radsite.lbl.gov/radiance/framer.html\n\n\nSome of these documents are a bit dated but the principles have not  \nchanged.\n\n\nThat should keep you busy for a while.\n\n\nRegards,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-June/005125.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "June 15, 2008 at 03:44AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_005120", "id": "radiance-general_005125"}