{"body": "Hi German,\nIf you're okay with spatial averaging of the solar gains over a group of\nwindows, you could create a BSDF using Radiance to represent the complexity\nin E+. The only caveat is that instances where sunlight coming from behind\nthe facade can enter the facade (reflecting off of buildings across the\nstreet, for example) can not be represented in a BSDF. So you site\nobstructions are best represented as geometry in the energy plus model. But\noverhangs and undulated microperferated screens can now be represented as\nBSDFs.\n\n\nNow I'll try to compare my approach from 2011 to the approach you detail. I\ntraced rays from the window into the space to see what surfaces the ray\nhit. You're creating sensors on surfaces tracing rays from the surfaces to\nthe windows to calculate irradiance. Your approach probably works fine in\nmost cases, but mine is better :).  With your approach you're trying to\ncalculate the average irradiance over a surface. If you have one sensor\npoint your estimate of the average will not be very good. So you decide to\nuse a grid of sensor points, which improves your estimate, but a regular\ngrid will be biased. So you use random points and your estimate is very\ngood. Though if you have a complex model, with say furniture, then you need\nto know what hits the furniture too. Good luck putting sensor on all the\nfurniture surfaces. So then the next question is what settings are you\nusing? where they high enough?\n\n\nInstead if you send rays from the window into the space, like I did, every\nray is accounted for, so your total solar gains will be accurate. With my\napproach, I know that the sum of the energy distributed to the surfaces\nequals the sum of the energy transmitted by the window, error in my\napproach is limited to relative distribution between surfaces. With you\napproach you have to do a lot of work to try to make sure the total energy\nin the space is accurate, and I don't know of a simple way to check that\nthe sum of energy attributed to surfaces equals the sum of energy\ntransmitted by the window.\n\n\nSo while my approach might be trickier to implement, once it's running you\nknow you're not destroying or creating energy. Your approach is simple to\nset up, but you're never really sure that the total energy in the space is\ncorrect.\n\n\nAndy\n\n\n\n\n\n\nOn Sat, Feb 27, 2016 at 4:18 AM, Germán Molina Larrain <germolinal at gmail.com\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-February/011530.html).</sup>", "attachments": [], "created_by_name": "Andy McNeil", "created_at": "February 27, 2016 at 01:28PM", "created_by": "Andy_McNeil", "parent_id": "radiance-general_011529", "id": "radiance-general_011530"}