{"body": "> Did you notice that you can change the \"exposure\" to which the\n> final image is displayed? It has a very similar effect to the\n> combination of shutter speed and iris opening in a photo camera.\n\n\nI have tried that, but I think with stark white surfaces and too much\ngloss, its very much like my Pentax MX: I can 'see' the surface fine\nbut when I dial down the exposure it is either too dark, or localized\ngood. Somehow ther is a median range of view eyes see, but I can't model\n(my fault I suspect: I don't have the theoretical grounding or math)\n\n\n> The pcond program mentioned by Peter is just another step beyond\n> that, which also takes some physiological properties of the human\n> eye into account, that may depend on the absolute brighness levels.\n> \n\n\nI'll play with that. Many thanks.\n\n\n> It could also be that you made your surfaces too glossy. Most people\n> greatly overestimate the amount of gloss in their visual environment.\n> In reality, gloss levels for non-metallic surfaces are typically\n> way below 5% (rather around 1 - 2%).\n\n\nThats confusing. face on, short distance you can see very high quality\nreflected images in tupak finished MDF for instance. Ok, 6 months later\nthe grease stains and dust make that more diffuse, but it 'seems' shiney\nto me. Again, does the eye do a better job of ignoring that?\n\n\nI suspect I just need a better mental table of recommended glossyness for stuff\n\n\n> Note btw., that the surrounding surfaces will *not* see a perfect\n> mirror image, unless you use the \"mirror\" material for the tap,\n> which you shouldn't. If you use just a shiny metal, then the diffuse\n> calculation from other nearby surfaces will hit the tap at most once\n> or twice, which isn't enough for an exact reflection. Only surfaces\n> that are very close will again see more, simply because the tap fills\n> a significant part of their surrounding space.\n\n\nPerhaps I did something wrong in my design. I found setting a minor colour\nchange on the metal of fixtures had a huge effect on the tones of the\nsurfaces that I presumed were reflecting it.\n\n\n> \n> Btw: In real live, just because your eyes don't want to resolve\n> that mirror image anymore, doesn't mean that they don't receive\n> the information about it. If you want to simulate that effect with\n> Radiance, you can simply apply a soft blur to the final image... ;)\n> \n\n\noh my. radiance lens-grease?\n\n\n-George\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2001-December/000085.html).</sup>", "attachments": [], "created_by_name": "George Michaelson", "created_at": "December 12, 2001 at 03:28AM", "created_by": "George_Michaelson", "parent_id": "radiance-general_000081", "id": "radiance-general_000085"}