{"body": "Hi Greg,\n\n\nthanks for the pointers. I am afraid, though, that I was unable to really\nmake heads or tails of them.\na) HDR file (Photosphere)\n\ti, the (test) HDR gives min/max values in falsecolor view of 39 to\n2900, whatever the unit, there\n\tii, it gives histogram min/max values  for Luminance of 34.8 to\n4.43E+06\n\tiii, it does not seem to be clipped\nb) There is a sun (albeit behind a thin cloud cover). Simply adding a sun\ndefinition to my sky description did not really change anything, though.\nAlso, at this point I do not know which r,g,b radiance values to use for the\nsolar \"light\" material and do these influence the result? And, actually, how\nto exactly position the HDR so that the sun positions tally.\nc) I took a look at the genskyvec.pl script, however, I am not perl-literate\nso that is a bit difficult. I seem to be missing out on where this script\n>could< use values from the HDR file to generate the sky vectors. Part of\nthe code seems to be a copy of the setting up of patches from reinhart.cal.\nAlso, the \"skyfunc glow skyglow\" and \"skyglow source sky\" are written to the\n(an) octree in the script. Can I ignore that? Or does that let me leave\nthese definitions out of my sky description? Which definition has precedent?\nI can't really see where the \"skybright.cal\" values from a standard gensky\nsky would come into play - this should be what is replaced by values from\nthe HDR?\nd) using the sky description as below but with \"skyfunc\" gives \nrpict: warning - compute error for colorpict \"skyfunc\"\nrpict: Division by zero\n when trying to generate a view of a scene.\n\n\nI must admit the flow of data (input / output) in all the definitions is a\nbit of a mystery, for me. I did find a kind of description for colorpict in\np_data.c, but that didn't really help, sadly. Looking at your code, I get\nthe feeling I am not literate in any programming language ... :o(\n\n\nIf you (or, of course, anyone else out there that has done this before) can\ngive any further help or tips, it would be much appreciated.\n\n\nBest\nAchim\n\n\n\n\n-----Ursprüngliche Nachricht-----\nVon: Greg Ward [mailto:gregoryjward at gmail.com] \nGesendet: Samstag, 28. Mai 2016 01:27\nAn: Radiance general discussion\nBetreff: Re: [Radiance-general] genskyvec with HDR sky view?\n\n\nHi Achim,\n\n\nI wouldn't call what you are trying to do \"easy,\" even if others have done\nit.  Your HDR file has to be in the correct units or scaled by the right\namount to get calibrated radiance values, and even then, the sun is usually\nout of range(clipped) and won't be properly sampled if it is a clear sky.\n\n\nAs you noted, such a sky cannot be given as input to genskyvec, which\nexpects a very specific set of primitives output by gensky or gendaylit.\nSpecifically, you need to name your colorpict pattern \"skyfunc\" and add a\nsolar source if the sky is sunny.  You could try to modify your description\nto match, but you'd have to look at the Perl script src/util/genskyvec.pl to\nfigure out how to satisfy the input requirements.\n\n\nOnce you have a sky description, you can use rtrace with the -I option to\ncompute hemispherical irradiance, from which you can create an adjustment\nfactor to apply to your glow based on horizontal irradiance.\n\n\nIt's all possible, but the details are not very straightforward.\n\n\nBest,\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-May/011750.html).</sup>", "attachments": [], "created_by_name": "Achim Geissler", "created_at": "May 30, 2016 at 08:05AM", "created_by": "Achim_Geissler", "parent_id": "radiance-general_011747", "id": "radiance-general_011750"}