{"body": "On 27 Jan 2008, at 14:42, steve michel wrote:\n\n\n> Hi Thomas,\n>\n> MARK THIS SOLVED\n\n\nGood. But see below ...\n\n\n> I had created a 'glow' material and applying it to the same polygon  \n> in my ies.rad file. SO I got a render with my fixtures showing but  \n> still no illumination! I was trying to overlap or layer a glow  \n> material on a distribution's polygon. So you are right that the two  \n> might interfere. (But I can see where that might be useful to  \n> avoid  the extra step of two distinct polygon geometry for the same  \n> thing (which I have done before with erco fixtures 3d geometry))\n>\n> BUT The simpler method of deleting the -i option in ies2rad  \n> worked...I see the fixture and the light distribution...\n\n\nI'm still confused about your way of using ies2rad. You'd only\nwant to use the '-i' option if you want to replace the crude IES\ngeometry with a geometry file you created before and you don't\nwant the geometry to interfere with the distribution. A recessed\nfitting has no visible geometry except for a bright disc or rectangle\nand that's already covered in the IES file.\n\n\n> The next challenge is to use a single light distribution material\n> and apply to multiple similar geometry in the scene...\n\n\nIf you want to use the same IES file a few times just use the\n*.rad file that's created by ies2rad a few times in your scene.\n\n\nExample:\n\n\nFirst create the description for the light fitting:\n\n\n## this is typed at the command line\n$ ies2rad -m 0.8 -t default aero.ies\n\n\nThis will create 'aero.dat' and 'aero.rad'. 'aero.dat' is\na converted description of the light distribution. This file\nnever changes. The 'aero.dat' file contains the material\ndefinition and the geometry of the luminous area. This geometry\nis necessary to create light in your scene. Whenever you call\nies2rad with different options but with the same IES file as\nargument it will create the same .dat file but the material\ndefinition in the .rad file will change (brighter or darker,\nmore or less white).\n\n\nThen position the aero.rad file in your scene as required:\n\n\n## these lines are part of the scene description\n!xform -t 0 0 2.4 aero.rad\n!xform -t 0 2 2.4 aero.rad\n!xform -t 0 4 2.4 aero.rad\n\n\n\n\nThis will place three fittings at 2.4m height spaces at 2m along\nthe y-axis. You can create simple arrays with xform in one line\nbut that's not as illustrative right now. All of these fittings\nwill have the same output and distribution.\n\n\nIf you want to change the maintenance factor (-m in ies2rad) or\nthe lamptype (-t) you have to create a second file and use that\ninstead of the first 'aero.rad'.\n\n\nAnother more advanced way is to use ies2rad as an inline command\nin the scene file and use a 'pipe' to transform the geometry:\n\n\n## these lines combine the two separate steps above\n!ies2rad -s -m 0.80 -t default aero.ies | xform -t 0 0 2.4\n!ies2rad -s -m 0.80 -t default aero.ies | xform -t 0 2 2.4\n!ies2rad -s -m 0.80 -t default aero.ies | xform -t 0 4 2.4\n\n\n\n\nNote the additional '-s' in the ies2rad command.\n\n\nWhen you run these lines through oconv the 'aero.ies' file has\nto be present in the directory or you will get an error. After\nthe conversion, there will be one 'aero.dat' file while all\nthe material definitions and light polygons have been passed\nthrough xform instead of being written to a .rad file.\n\n\nThis method has the advantage that you don't have to create\na new 'aero.rad' file for every dimming value you want to\ntry. Just modify the '-m' argument:\n\n\n## same fitting, different dimming values:\n!ies2rad -s -m 0.80 -t default aero.ies | xform -t 0 0 2.4\n!ies2rad -s -m 0.60 -t default aero.ies | xform -t 0 2 2.4\n!ies2rad -s -m 0.40 -t default aero.ies | xform -t 0 4 2.4\n\n\n\n\nI hope this helps to solve your problems.\n\n\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-January/004732.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "January 27, 2008 at 12:01PM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_004720", "id": "radiance-general_004732"}