{"body": "Hi Will,\n\n\n> firstly, i want to specify the brightness of my light sources  \n> accurately. i am using photos (hdr images assembled from several  \n> photos) to specify the output distribution of the source (theatre  \n> spotlights) and i know the \"light output in lux\" at various  \n> distances from the lens (from here: http://www.seleconlight.com/ \n> english/support/english/acclaim%20pc.pdf  ) and i assume that they  \n> give the figure for the centre of the beam, rather than the average  \n> over the whole field.\n> what i'm stuck on is what figures i should use for the (rgb)  \n> brightness in the rad file description of the \"light\" material.\n\n\nI don't have a ready example to offer, but the basic idea is to apply  \nthe HDR capture as a pattern to your light source, indexing the image  \na perspective projection:\n\n\nvoid colorpict spot_dist\n7 red green blue capture.hdr .\n\t\t(-Dx/Dz)/A1+.5  (Dy/Dz)/A1+.5\n0\n1 0.404026\n\n\nspot_dist light spot_output\n0\n0\n3 3881 3881 3881\n\n\nThe value given in the colorpict's first argument (A1) is the tangent  \nof the subtended horizontal angle.  The image (capture.hdr) is  \nassumed to be square.\n\n\nTo get the right output value for your lamp, you can create as scene  \nto match the lux measurement you have and render it in rvu with the - \ni option, having it report on the illuminance for a surface at the  \nsame distance with the 'trace' command.  Then, apply a correction  \nequal to the ratio between this value and the measured one to your  \nlight color (3881 in the example above).\n\n\n> i need the light output of these sources to be physically accurate,  \n> because i want to compare them to models using ies-data described  \n> distributions.\n> i would like to be able to colour correct these sources (i believe  \n> the ies2rad will do this automatically) given the colour  \n> temperature of the bulb.\n\n\nRendering with an RGB color isn't very accurate and won't look right  \nunless you apply a more sophisticated spectral technique, such as the  \none described in the paper:\n\n\n\thttp://www.anyhere.com/gward/papers/egwr02/\n\n\n> secondly i want to colour my lights, as though they had colour  \n> filters in front of the lense, and i dont really understand the  \n> colour space that radiance uses. can anyone point me towards any  \n> resources on this?\n> i want to model the colours of commercially available filters (such  \n> as this one:  http://www.leefilters.com/LPFD.asp?PageID=248  ) but  \n> i cant find any RGB transmission data for them. is it possible to  \n> convert the XYZ values given on the data sheet to RGB?\n\n\nThe following command will take XYZ values on its input (triplets)  \nand produce Radiance RGB values on its output:\n\n\n\trcalc -f ray/src/cal/xyz_rgb.cal -e '$1=R($1,$2,$3);$2=G($1,$2,$3); \n$3=B($1,$2,$3);'\n\n\nExpect to be disappointed by the results if you don't apply white- \nbalancing afterwards.\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-March/003525.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "March 27, 2006 at 07:19AM", "created_by": "Greg_Ward", "parent_id": "radiance-general_003524", "id": "radiance-general_003525"}