{"body": "All:\n\n\nThis is an interesting idea and the excitement over supporting it is inspiring. Many of you provide a good glimpse of the possibilities with a system like this, and the path forward. I should add that at NREL we are working on an analysis platform (written in C++) for combined Radiance and EnergyPlus simulations, that provides Ruby bindings to the underlying C++ components.  I don't think it's a total duplication of this effort being discussed here, and in fact it may be more what Thomas is thinking of (more of a Radiance API).  It's very much in developmental stage, but I wanted to mention it nonetheless. Regardless, our emphasis is on open source, and cross platform tools here.\n\n\nThis leads me to another topic, that of a reliable Windows build environment for Radiance. As part of our efforts mentioned above, NREL is looking into getting a cmake-based cross-platform build env for Radiance and hosting it. The goal is to get a cmake dashboard setup for Radiance (nightly) builds. This would allow us to provide a repository for Windows Radiance binaries, updated nightly and monitored for breakage. Windows functionality is important to us for our tools mission, so we are currently scoping this effort. Stay tuned!\n\n\n- Rob\n\n\nRob Guglielmetti  IES, LEED AP\nCommercial Buildings Research Group\nNational Renewable Energy Laboratory\n1617 Cole Blvd\nGolden, CO 80401\n\n\nOn 11/9/10 9:35 AM, \"Thomas Bleicher\" <tbleicher at googlemail.com> wrote:\n\n\nHi Chris.\n\n\nOn Tue, Nov 9, 2010 at 10:33 AM, Christopher Rush\n<Christopher.Rush at arup.com> wrote:\n> It sounds like what you're looking to write is an enhanced version of the\n> 'rad' program with ability to go through multiple geometries or light\n> conditions for batch processing and comparison purposes with the additional\n> flexibility of file naming that would be required, and maybe automatic\n> falsecolor generation or pcond calls, rtrace data processing routines, etc.\n\n\nWe haven't discussed the actual nature of this package yet,\nI think. My understanding was that at first it would be only\na wrapper for the Radiance binaries that would provide a\nless complicated way of accessing their features from\nPython.\n\n\nYour idea of an enhanced 'rad' is interesting but I don't feel\nthat this is the main goal here. However, the Python package\nshould allow anyone inclined to do so to write an enhanced\n'rad' without having to deal with all the gritty details of file\nhandling and process control.\n\n\n> I think the challenge would be to make it generic enough that it is still\n> useful for all the unique scenarios that come up, but at the same time make\n> it worth the effort of creating and maintaining this extra interface -\n> instead of the current M.O. of any user putting to use whichever shell or\n> scripting package they're most comforable with.\n\n\nFor a start it should be very 'generic' because it only exposes\nthe Radiance features on a Python level. I doubt that we\ncan achieve all the flexibility of Radiance on a Unix shell\nbecause that's what all the binaries are designed for. But\nwithin a Python script you can achieve the same results\nwith a few more Python commands. In most cases this\nwill also improve the readability of the script.\n\n\n> There is a danger that it makes it makes Python expertise\n> necessary to keep up to date with the most current\n> developments, and be able customize as needed.\n\n\nKnowledge of Python will definitely be required. It's a\nPython module after all. However, all of those who have\nshown an interest in the project already have done some\nprogramming in Python and I expect that we have a fair\namount of duplicated features in our common code base.\n\n\nIf nothing else this project could help the known Python\nenthusiasts to share parts of their code.\n\n\n> Although maybe there's something to be said for moving\n> toward a common cross-platform scripting language\n> amongst the community.\n\n\nUnfortunately even within the official distribution there\nis already quite a spread of scripting languages:\nPython/CSH for building\nCSH for some scripts\nPerl for other scripts\nTCL/Tk for trad\n\n\nI expect that it will always be true that on Unix you are\nspoiled for choice of scripting environments and on Windows\nmost users rely on a graphical frontend like Ecotect.\n\n\n> PS, I write this from the perspective of someone using bash and unix\n> commands and who has (very briefly) looked into Python several times, but\n> could never figure out why I would want to re-write the bash shell commands\n> I'm already familiar with into Python with all the same information just\n> within parantheses and with the word \"subprocess\" before it  = )\n\n\nThat's because you haven't discovered the beauty of\nPython OO code yet. I agree that there is little benefit\nin rewriting shell scripts in Python unless you do\nsomething more with it (or you are not that familiar\nwith CSH/Bash programming).\n\n\nPython has it's strength where you extend the basic\nRadiance tools to a more complex application. That\ncould be an image manipulation app that combines\nthe various p-something tools or a script that automats\nrendering and analysis of a scene with variations.\n\n\nThomas\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-November/007445.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "November 09, 2010 at 08:57PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_007431", "id": "radiance-general_007445"}