{"body": "I have just measured the spatial response of some of our photocells and \ndiscovered some rather serious deviations from the standard cosine response.\n\n\nI am looking at the new rsensor tool to model this response, so I can \nestimate the errors compared to a proper cosine-corrected cell for \ncertain configurations. However, the sensor format is not entirely clear \nto me.\n\n\na) What are the units in the sensor file? Is it normalised to anything? \nAn IES data file, for instance is normalised to 1000lm.\n\n\nb) What would the sensor file for a normal, cosine corrected illuminance \nmeter look like? Does it need to have its maximum at 1.0 for an angle of \n(0,0)?\n\n\nc) Suppose I wanted to model an illuminance meter that has a correct \ncosine response, but gives a reading twice as high as is should be. \nWould I need to multiply the values from b) by the cube root of 2? Cube \nroot because the overall response appears to be proportional to the \nvolume contained within the 3d shape of the curves.\n\n\nd) After a bit of googling around, I found this page:\nhttp://www.lightingresearch.org/programs/nlpip/publicationdetails.asp?ID=916&type=1\n\n\nWhich appears to be the photosensor report referred to on the SPOT web \nsite. The NLPIP don't seem to make suggestions about the actual file \nformat for electronically transmitting the spacial response (or any \nother photocell characteristics for that matter). I am therefore \nwondering why the rsensor data file is what it is. It seems that the \nstandard Radiance data file would have been sufficient to describe the \nsensor's characteristics. What is the advantage of using the SPOT \nformat? Why not have a spot2rad (similar to ies2rad) import filter instead?\n\n\nExample:\n\n\nThe example from the rsensor man page:\ndegrees   0    90   180  270\n0    .02  .04  .02  .04\n45   .01  .02  .01  .02\n90   .001 .002 .001 .002\n\n\nAs a Radiance dat file, this would look like (I think):\n2\n0 270 4\n0 90 3\n.02 .04 .02 .04\n.01 .02 .01 .02\n.001 .002 .001 .002\n\n\nMany thanks for sharing your thoughts\n\n\nAxel\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-October/006264.html).</sup>", "attachments": [], "created_by_name": "Axel Jacobs", "created_at": "October 11, 2009 at 03:37PM", "created_by": "Axel_Jacobs", "parent_id": "radiance-general_009589", "id": "radiance-general_006264"}