{"body": "Hi Krystyna.\n\n\n\n\nOn 14 Feb 2009, at 01:57, Krystyna Zelenay wrote:\n\n\n> Hi,\n>\n> I have just uninstalled Desktop Radiance and installed the MinGW  \n> version on my computer (Windows OS). I have been informed that this  \n> is the latest version of Radiance for Windows OS. Unfortunately I  \n> now have trouble reading images exported from Ecotect.\n> When I export the Ecotect example file \"RADIANCE_example.eco\" I am  \n> able to see a rendered view of the space in the image viewer, but I  \n> cannot run any of the options for the information overlay (e.g.  \n> contour lines, false color, daylight factors etc.) and get the  \n> message \"RGBE read error\"\n>\nUnfortunately 'falsecolor' (which is the master tool behind most\nof these overlays) is not distributed with the MinGW binaries\nbecause it is a CSH-script that does not run on Windows. Therefore\nthe ImageViewer bundled with Ecotect can not generate this type\nof analysis.\n\n\nThere is another picture viewer around which is based on\nPython and that seems to be the best option to create\nfalsecolor images on Windows at the moment:\n\n\nRaddisplay - http://www.deluminaelab.com/en/tools.html\n\n\nIt requires some time to setup, though.\n\n\n> When exporting the file from Ecotect, I noticed that when checking  \n> whether Radiance is functional, the exporter returned a message  \n> saying that the application \"rview\" is missing from the directory.  \n> Could this be the problem? If so, what are alternative ways for  \n> evaluating the radiance image?\n\n\nThe application 'rview' is now called 'rvu' and AFAIK it has\nnot been ported to Windows.\n\n\n\n\nThere have been some significant changes to the Radiance\napplications since Desktop Radiance has been released. This\naffects mostly the rendering process, though. The image format\nis still the same and you should be able to open a 'new'\nimage in the old 'rview'. You could try to copy the missing\napplications from your DR installation over to the MinGW\ninstallation and see if that solves your problem.\n\n\nRegards,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-February/005755.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "February 14, 2009 at 02:30AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_005753", "id": "radiance-general_005755"}