{"body": "Hi Christian,\n\n\n> thank you very much for your detailed answer, i think the biggest  \n> problem i am confronted with are these different terms.\n> As i understand:\n>  transmissivity is the amount of light that is not absorbed inside  \n> an object, varies between 0and 1, not taking in consideration the  \n> reflection\n> total transmittance the amount of light, that passes through an  \n> object, taking in consideration the index of refraction and is less  \n> than the transmissivity\n> But what is transmission ?\n\n\nThat's my mistake -- I should have said \"transmissivity\" rather than  \ntransmission.  A transmission is the thing in your car that shifts  \ngears...  In fact, I think the term is used interchangeably in a more  \ninformal context with total transmittance.\n\n\nTotal transmittance takes into account reflections and  \ninterreflections (and absorbtion) inside the glass, and is the  \neasiest value to measure.\n\n\n> As i want to apply the color and transmission of this color filter  \n> to the glass i got these values from LEE:\n> Transmission Y%: 62.4  ; Absorption: 0.21 ; as well as a Spectrum  \n> from which i calculated the xy chromaticity values with the mgfilt  \n> command: cxy 0.2884 0.3034\n> They have precalculated XYZ and Yxy values for different sources,  \n> but i want to apply my own source at different dim and color  \n> temperature levels.  http://www.leefilters.com/LPFD.asp?PageID=193\n> To get my RGB values, i have to calculate the XYZ values and for  \n> that i need Y! Can i take 0.624 ?\n\n\nActually, the Y value of transmittance can change for different light  \nsources.  What you should do is multiply the value you were given  \n(0.624) by the Y you get with your source spectrum, divided by the Y  \nyou get when you use their reference source spectrum.  The confusing  \npart is that you need to normalize the two spectra using the Y value  \ncomputed from each WITHOUT your glass transmittance spectrum.\n\n\nIs this clear enough?  I know it's confusing, but I don't know how to  \nexplain it any better without adding a bunch of pictures and diagrams.\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-April/003581.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "April 21, 2006 at 05:42PM", "created_by": "Greg_Ward", "parent_id": "radiance-general_003580", "id": "radiance-general_003581"}