{"body": "Dear Andy\n\n\nThank you very much for your answer and help, especially also for the hints about the abbreviation with rmtxop and the settings.\n\n\nI finally found the issue, with another old script that not just produced bad results, but refused to work. And it actually is a header-issue, but not because of rcontrib: It looks like genskyvec didn't use to write a header, but nowadays it does. So as soon as I told it not to write a header, I got reasonable results too :)\n\n\nCheers,\nStefan\n\n\n________________________________\nVon: Andy McNeil [mcneil.andrew at gmail.com]\nGesendet: Mittwoch, 25. Mai 2016 01:49\nAn: Radiance general discussion\nBetreff: Re: [Radiance-general] Heavily different sensor values with different (rcontrib?) versions\n\n\nStefan,\n\n\nThe only major change to rcontrib I know of was the addition of extra details in the header, but you're not writing the header so that can't be the problem. The only thing I can think of is that there are some differences in shell tools between BSD and Linux, so perhaps test seq and tr independently to make sure they are doing what you expect. Other than that I don't know what could be happening.\n\n\nNow that you're using a recent version of Radiance instead of the for loop you could use a single inline rmtxop command like this:\n\n\ncat $sensors | rcontrib -I -fo @scene.opt -ab 4 -ad 100000 -lw 0.000004 -y $numsensors -e MF:1 -f reinhart.cal \\\n    -b rbin -bn Nrbins -m sky_glow -w scene.oct | rmtxop -c 0.265 0.67 0.065 - > $sensors_vec\n\n\njust make sure you define $numsensors as your number of sensors.\n\n\nAs for settings to consider, if you're interested in specular reflections you probably want to set -st 0. And you'll probably need to reduce -lw further to something lower than your facade reflectance divided by ad setting. For example, if your facade VLT is 5% it would have to be less than 0.05/100000=0.0000005 or 5e-7 (you currently have 4e-6).\n\n\nBest,\nAndy\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-May/011746.html).</sup>", "attachments": [], "created_by_name": "Stefan Bohren", "created_at": "May 25, 2016 at 08:42AM", "created_by": "Stefan_Bohren", "parent_id": "radiance-general_011744", "id": "radiance-general_011746"}