{"body": "Hi all !\n\n\nI think two aspects have to be separately kept in mind concerning the\nwhole matter, to avoid useless work or disappointment.\n\n\nThe Radiance ambient treatment is somewhat awkward to handle, and I've\nnoticed that people without a sound scientific background have\ndifficulties with the overwhelming features and parameters and all the\nthinking behind it, which is a pity as it appears rather often that\ndesigners or architects are not computer specialists or scientists as\nwell (which shouldn't be misinterpreted now, I do not mean this as\noffence, simply an observation).\n\n\nOn the other hand, Radiance, esp. the ambient calculation, simply is a\nfantastic thing which allows to create images with superior quality\nwhich outscore everything else. And I readily agree with the opinion\nthat 2D postprocessing or some other tricks and workarounds never can\nreplace this adequately and a more promising way is to optimize the\nmethod within itself. Besides, lighting visualisation is a complex\nmatter, and it is common sense that there is no easy way for\naccomplishing difficult tasks.\n\n\nOf course, Radiance is aimed very much at realistic image generation,\nand it would be nice to have more \"artistic freedom\" in using it. This\nis a totally different matter. Within the first stages of a creative\nprogress scientific exactness does not count that much, and so all kinds\nof tricks are welcome as long as they help to produce an impression,\nsomething which can convey ideas. One may compare this to the deliberate\nabstraction and individual styles employed in \"old-fashioned\" techniques\nlike oil-painting for example. And opening Radiance for these kinds of -\nmaybe \"freaky\" - applications certainly is interesting, as then all\nstages of a design process could be covered in a better way as it is\npossible right now. Of course it then is important to keep track of \nwhat is art, what is trick, what is scientifically exact, etc, so in the\nend everything will be even more complex. But complexity makes life\ninteresting, who wants to be bored ?\n\n\n-- Carsten\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-May/000249.html).</sup>", "attachments": [], "created_by_name": "Carsten Bauer", "created_at": "May 14, 2002 at 01:28PM", "created_by": "Carsten_Bauer", "parent_id": "radiance-general_000229", "id": "radiance-general_000249"}