{"body": "Hi all,\n\n\nThe new CIE Standard General Sky is based on the Standard Sky Luminance Distribution of Kittler, Perez and Darula (1997).  I created a cal file and technique to model these skies a while ago, and have been using it wherever possible, as I believe it provides more representative sky models than the old, limited, CIE standards.  The cal file is not ideal, as it takes a few calculations and a bit of stuffing around to create the models.  the difficulty is in setting the relative intensities of sky and sun.  but, it does the trick.\n\n\nIf anyone wants it, i can send it and a document describing its use to you.  Otherwise, can i upload it somewhere?\nRegards,\nPhil.\n\n\n_______________________________\nPhillip Greenup\nSpecialist Engineer\nArup Australasia\nLevel 10, 201 Kent St\nSydney NSW 2000\nPh (02) 9320 9426\nFax (02) 9320 9321\n\n\n\n\n>>> karencarrier@cox.net 19/10/2003 3:55:48 am >>>\nThank you Francesco for summarizing so nicely how gensky generates skies. I\nagree that it would be useful to have a method that allows one to pick sky\nmodels via .cal files\n\n\nThis might be particularly interesting since the CIE recently approved a new\n\"Standard General Sky\" Model that replaces all previous CIE Overcast and\nClear Standard Sky definitions. It is generalized from the old CIE Clear Sky\nformula (Kittler) and consists of 15 sky types of various luminance\ngradations and scattering characteristics - one of them being the new\nStandard Overcast Sky, and two others representing the new Standard Clear\nSkies (one for low luminance turbidity, one for polluted atmospheres).\n\n\nI have listed a few links below, if anyone is interested .....\n\n\nhttp://www.cie.co.at/publ/abst/s011.html announcement of new 2003 standard\nhttp://www.cie-usnc.org/images/CIE%20DS011_2.pdf copy of the draft standard\n(I could not find the final version online - if anyone does please let me\nknow)\nhttp://www.esim.ca/2002/documents/Proceedings/other2.pdf presentation by\nKittler with information on General Sky Standard (Esim 2002)\n\n\n\n\n- Karen\n\n\n_________________\nKaren Carrier\nM.ARCH\nUC Berkeley\n\n\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general@radiance-online.org \nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-October/001094.html).</sup>", "attachments": [], "created_by_name": "Phillip Greenup", "created_at": "October 20, 2003 at 01:42PM", "created_by": "Phillip_Greenup", "parent_id": "radiance-general_001063", "id": "radiance-general_001094"}