{"body": "Hi Jasper,\nhi Alstan,\n\n\nI guess there are several issues in that case. First of all, as Alstan \nwrote, you should crop the image and provide the correct lens \nspecification to evalglare. Be aware that editing the header could be \ndangerous, because sometimes editors add strange characters or you don't \nsee tabs in the header with marks the view string there as \"invalid\" . \nIn case the header is interpreted \"wrong\" in evalglare, the results \ncould be really random and could differ for more than 100% from the \nright ones (e.g. the calculation of the vertical illuminance, see \npresentation on the Radiance workshop in 2012). The header treatment is \nmuch more robust since the evalglare version 1.08, but still the user \nshould take care of providing a correct header. evalglare is relying on \na correct radiance header. To be on the safe side, you should always use \nthe command option to provide the correct view option to evalglare.\nAlso you should make sure, that you use a view type which really \ncorresponds to your lens. If your real lens is a hemispherical fish eye \nand you provide  -vta as view string, the angles and solid angles are \ncalculated wrong in evalglare and you get wrong results. So make sure \nthat you use -vta only if your lens is a angular fish eye.\nAnd please don't use the -1 option in evalglare!!! This is a special \n(undocumented) option to get fast results on images calculated without \nambient calculations. If you use it for normal images, the glare sources \nmight not detected correctly and you could get big differences. It is \nworking mostly properly in images with large black areas (-ab 0).\nSince the -1 option is not robust for normal images, this option is \nundocumented. There exist also other undocumented options since 2009 for \nhdr treatment(e.g. pixel overflow correction, image fillup when \nccd-array is smaller than the projected image...), but these options are \nby purpose undocumented because they should be used only in special \ncases and can cause wrong results when not used properly.\n\n\nIf I look at your image, I guess your calibration is not correct. The \nsun has a luminance of 2e10 cd/m2. In case of low transmittance glazing \nyou still have a luminance of  Xe9 cd/m2, lets say at least 1e9cd/m2, \nwhich is factor 200000 higher than you measured!!! And be aware you you \nmight have to deal with blooming  effects when you have a pixel overflow \n(especially when looking into the sun). Not sure about your camera \nsetting, but if you still have an overflow for the shortest exposure, \nyou should think of adding a neutral grey filter to reduce the overall \ntransmittance to the ccd.\n\n\nFinally I can't reproduce the 0 output of evalglare. I used your image \nand used as well the 2500lux as input (even if the image is not cropped \ncorrectly and the view string is wrong). See here:\n/evalglare -i 2500 pmar_sin_03.hdr//\n//Notice: Low brightness scene. Vertical illuminance less than 380 lux! \ndgp might underestimate glare sources//\n//dgp,dgi,ugr,vcp,cgi,Lveil: 0.311778 18.132195 21.670120 44.798004 \n27.925421 58.052605 //\n\n\n/But I always get an non-0 result, I never experienced this before. I \ntried the linux ,the mac and also the windows version with your image - \nit didn't happen. So which version are you using? Which operating \nsystem? (type evalglare -v to find out)\n\n\n@Alstan: Can you provide me another example where this happens as well? \nWhich version are you using? Which operating system?\n\n\nA zero value should never appear, except your image is completely black.\n\n\nBest,\nJan\n\n\n\n\n\n\nAm 8/11/15 um 5:33 PM schrieb J. Alstan Jakubiec:\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-August/011189.html).</sup>", "attachments": [], "created_by_name": "Jan Wienold", "created_at": "August 12, 2015 at 02:39AM", "created_by": "Jan_Wienold", "parent_id": "radiance-general_010867", "id": "radiance-general_011189"}