{"body": "Hello all,\n\n\n\n\nThanks again for your quick reply. Now I can model my street walls as a\nperfect specular materials (\"mirror\" materials) and obtain the results I\nexpected.\n\n\nI come back with an other problem:\n\n\nThe main purpose of my work is to compute the impact of the specular\nreflections in a street canyon.\nSo, I would like to separate the light that comes from the reflections of\nthe walls (only specular) and the light that comes directly from the sky\n(defined by \"glow\" material and \"skyfunc\"). I wanted to do a simulation\nwith 0 reflection and an other simulation with 5 (or more) reflections. The\nresults obtain with 0 reflection is directly the direct sky component and\nthe substraction of 5 reflections - 0 reflections is the \"environment\" part.\n\n\nI did the same process with a diffuse environment and it worked well. I\nchanged the -ab parameter:\n-ab 1 to have the direct sky component (1 because of \"glow\" material);\nand -ab 5 to have the entire reflections in the environment.\n\n\n*But in the specular environment (with \"mirror\" wall) there is no\ndifference between my \"0 reflection\" case and my \"5 reflections\" case*\nI tried to change the parameters -ab -dr and -lr and it seems that all the\nreflections is computed whatever the parameters.\n>From what I know, -ab is for \"diffuse inter-reflections\", -dr is for\n\"direct reflections\", and -lr I don't know...\n\n\nObviously, I can replace the \"0 reflection specular\" case with the \"0\nrefelction diffuse\" case because it should be exactly the same, but I would\nlike to understand where this problem comes from.\n\n\nI do not know if I was clear and precise in my explanation. I am available\nif you have questions.\n\n\n\n\nRegards,\n\n\nAntoine\n\n\n2017-10-13 19:04 GMT+02:00 Greg Ward <gregoryjward at gmail.com>:\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2017-October/012309.html).</sup>", "attachments": [], "created_by_name": "Antoine Bugeat", "created_at": "October 24, 2017 at 10:38AM", "created_by": "Antoine_Bugeat", "parent_id": "radiance-general_012290", "id": "radiance-general_012309"}