{"body": "Ikrima,\n\n\nI am going to try to build the puzzle of CFS, Phases, BSDF and\ncalculations.... at least the way I understand it.\n\n\n*CFS* are those systems that, via interreflection or other light transport\nphenomena, redirect light (or solar radiation). Thus, in order to get a\nreliable result you will have to consider all the phenomena involved.\nThen, *common\nsimple performance indexes*, such as the miss-used Shading Coefficient and\nthe Aperture Percentage, *always loose a lot of information, trying to\nreduce all the complex behavior of a CFS to one single number*. We all know\nthat venetian blinds are more \"transparent\" from certain viewing directions\nthan from others, but these performance indexes do not tell you that.\n\n\nNow... Radiance can certainly perform calculations of spaces with CFS using\nits \"common\" Ray-tracing. However, this may be slow for some purposes (i.e.\nannual simulations and climate-based daylight modelling), and *this is why\n2, 3 and 5 phase methods have been developed*. The *BSDF* representation, I\nwould say, goes in the same direction... It allow summarizing all the\nbounces, reflections, refractions, etc.  that occure withing the CFS in a\nsingle matrix or tensor.* By using BSDFs*, Radiance itself and other tools\n(i.e. EnergyPlus) can treat CFS as blackboxes, avoiding all the opcits\nwithin the system. A BSDF that uses the Klems Full representation has\n21,045 numbers (instead of one, such as the Shading Coefficient).\n\n\nBeing said all that, I would not trust a calculation method unless it can\nactually deal with the optics of a CFS that is drawn and/or it can use BSDF\n(or similar) information.\n\n\nLets remember that a perforated screen, a venetian blind, a light diffusing\ndevice can all have a Shading Coefficient of 50%, but all of them will\nbehave very differently. I made some presentations about this on my\nprevious work (we sold complex Shading Devices), trying to promote the use\nof BSDF in EnergyPlus calculations... the differences (in solar heat gains)\nwere more than considerable.\n\n\nI hope that someone else gives us his/her perspective on this topic...\nthere are a lot of concepts that I might be misunderstanding.\n\n\nBest!\n\n\n\n\n\n\n2015-06-18 10:50 GMT-03:00 Ikrima Amaireh <ezxia at nottingham.ac.uk>:\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-June/011044.html).</sup>", "attachments": [], "created_by_name": "Germán Molina Larrain", "created_at": "June 18, 2015 at 09:43AM", "created_by": "Germán_Molina_Larrain", "parent_id": "radiance-general_006084", "id": "radiance-general_011044"}