{"body": "Hi Zhe,\nI'm using a commercially calibrated camera (LMK mobile air) so my experience\nwith calibration is limited. But I¹ll try to answer your questions.\n\n\n1) I can average the results (1.84) as the correction factor, but is it\ncorrect? Some values have great difference (1.74 VS 1.93).\nI don't think you should use an average. My understanding is that you should\nalways use the calibration factor for the main light source in your scene.\nThe spectrum of the different light sources is different and that affects\nthe measurements.\n\n\n2) I notice that I use the same model as Coltide, however, our results are\nvery different. Is this normal? (The production of each camera and lens\ncannot be exactly the same?)\nApparently yes, they can be different. Not sure if it¹s the production that\nis different or it is simply the fact that mechanical systems do not always\nbehave in the same way. Even your own system will not always produce the\nsame result. That¹s why you should also test the reproducibility of your HDR\nluminance value. You test that by doing not one but several captures and\nusing the average of those for calibration rather than the result of one\nsingle capture. In that way you would be accounting for the camera's\nmechanical uncertainties.\nIt looks like there are also sources of error relating to the luminance\nmeter measurement itself, as described in Inanici 2006, Evaluation of high\ndynamic range photography as a luminance data acquisition system. So that\nmight add to the differences between yours and Clotilde¹s calibration.\n\n\n3) Does lighting source influence the accuracy of the factor? Focusing on\ndaylighting data collection, should I take images under consistent electric\nlighting conditions or daylighting conditions? (Daylighting conditions have\ndynamic changes, but electric situations offer lower results.)\nDifferent light sources will provide different calibration factors. I was\ntold by the seller of my system that a measurement under white LED has\nerrors of 5 to 12% in relation to the measurement done with a halogen-based\ncalibrated camera. But LED has a lot of flicker, doesn¹t it? I¹m not sure\nhow people using your calibration method deal with fluctuations of the\nlighting conditions during capture, in the case of daylight scenes from\nvariability of the sky and in the case of the electrically lit scenes due to\nflicker. Your LDR shots are done over a period of time and light can change\nfrom one second to the next. I wonder when does your luminance spot\nmeasurement take place in relation to the LDR captures and if that might\naffect the result? Do you take illuminance measurements during luminance\ncollection to see how light varies?\nIn any case, I think you should always make you collection under very stable\nlighting conditions, whether daylight or electric light. One option is to\ncalibrate for the most stable electric light source that you can find and\nthen make the correction for the daylight spectrum independently, if you\nhave access to a spectrometer.\n\n\nHope it helps.\n\n\nBest Regards\n\n\nRaquel\n\n\n\n\n\n\nRaquel Viula\n\n\nPhD candidate\n\n\n\n\n\n\nTU Delft | Faculty of Architecture and the Built Environment |\n\n\nArchitectural Engineering and Technology\n\n\nJulianalaan 134, 2628 BL Delft, The Netherlands | P.O. Box 5043 2600 GA\nDelft\nM +31 (0)62 39 82942 | Email r.j.a.v.viula at tudelft.nl\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2017-March/000624.html).</sup>", "attachments": [], "created_by_name": "Raquel Viula", "created_at": "March 01, 2017 at 10:27AM", "created_by": "Raquel_Viula", "parent_id": "hdri_000623", "id": "hdri_000624"}