{"body": "On Mon, Nov 22, 2010 at 11:49 AM, alexis Loubeyre\n<aloubeyre2 at hotmail.com> wrote:\n\n\n> if the results are different, which version should i trust?\n\n\nNone. Never 'trust' a software. Always try to understand what's going on\nand why the results are as they are. If you expected something else (from\nexperience or from a previous test calculation) then you should get\nsuspicious and investigate what's different.\n\n\n> I've got my 3d model in Ecotect, I export my model to radiance (the grid in\n> fact) , run the calculation and display results in Ecotect.\n\n\nI'm sure you export also the geometry; otherwise you wouldn't be able\nto run a Radiance calculation. Are you starting the Radiance commands\nmanually or is everything done 'behind' Ecotect?\n\n\nWhen Ecotect exports to Radiance it creates a *.bat file that contains\nthe commands for Radiance. Can you locate this file and the other\nRadiance files (*.rad and *.rif) for both exports?\n\n\n> My model is a large floor for an office, one part of this office can't\n> receive any external lights, my room is 30 m depth with only one side (SE)\n> with windows.\n> With Ecotect v5, in the back of the room i've 0.2 where with Ecotect 2011\n> i've 3.2 for the DF.\n\n\n>From the description of the room I'd say that 3.2% DF are way out. Even\n0.6 seem quite high if the only windows are 30 meters (!) away. However,\nI don't know the room reflectances or the size of the window.\n\n\nWhen you import the DF results back into Ecotect and show them as\ncolour plots does the distribution seem right in both cases (bright near\nthe window, continuous drop to the back)? Are there any bright areas\nwhere they shouldn't be?\n\n\nRegards,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-November/007481.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "November 22, 2010 at 09:03AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_007478", "id": "radiance-general_007481"}