{"body": "On 26 Nov 2007, at 20:20, steve michel wrote:\n\n\n> Thanks again for the export script. The following was in  \n> Fransceco's wiki as a\n> future feature (no pun intended)\n> <<replacement of component instances with pre-canned Radiance files>>\n>\n> I hope this will enable the script's ability to handle artificial  \n> lighting.\n\n\nYes. That's my lazy take on IES file support.\n\n\n> I have some ies fixtures i've used in some radiance renders I want\n> to use in the Sketchup to radiance generated files.\n> So far I've only the following method:\n> 1 step converted ies to rad files\n> 2 Use mkillum for a wrapper for fixture geometry\n> 3 'update' the script generated files to search/replace a\n>   named scene 'place holder' with items 1 and 2.\n>\n> Does this approach make sense? If there is a more straight forward\n> way, please let me know.\n\n\nSearch and replace could be done with replmarks. Use triangles\nwhere you want your fittings, find the corresponding \"!xform ...\"\nline for the triangles file and replace it with the correct\n\"!replmarks ...\" line (I assume you have already prepared the\nRadiance description of the fitting, ies2rad and all that).\n\n\nAlternative (more along the lines of how I think about Radiance\nand the Sketchup scenes):\n\n\n1) create a \"component instance\" for the light fitting (shaped as\n    the fitting for better placement)\n2) place instance in scene\n3) export\n4) replace the file that represents the instance in the \"objects/\"\n    directory with a file that's created by ies2rad (and spiced up\n    with a bit of geometry if you like)\n\n\nThe idea behind the \"pre-canned\" files is that every component instance\n_loaded_ into Sketchup has an associated file path. The script could  \njust\ncheck if next to the component's \".skp\" file another file with \".rad\"\nand \".dat\" extension exists and copy these files instead of exporting\nthe actual component geometry.\n\n\nIES support then would require you to create a Radiance file for the\nfitting (with geometry and correct \".dat\" file path), the \".dat\" file\nand a Sketchup component to represent the fitting in the scene. When\nyou load and use the component it gets replaced with the Radiance files\non the fly. Other options like dimming could be shoehorned into this\nprocess as well.\n\n\n> Is there a straight forward way of handling instances\n\n\nIs there more than one way of handling an instance in Sketchup?\n\n\n\n\nUpdate for those who've faithfully read this far:\n\n\nI have created a google code project for this script:\n\n\n     http://code.google.com/p/su2rad/\n\n\nThe download package is still at the last 'release' stage\nbut the SVN repository has the hot new features\n* export by layer\n* export by colour and\n* import with contour lines\n\n\nAs usual it hasn't seen a lot of testing yet.\n\n\n\n\nCheers,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2007-November/004613.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "November 26, 2007 at 02:41PM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_004530", "id": "radiance-general_004613"}