{"body": "> > That's a pretty safe indicator for the -ab 0 syndrome...\n>\n> Which I suppose is one way of saying RTFM.  Sorry gang.\n> Now I see that rtrace needs to be told what to do just\n> like rpict, in terms of the myriad switches.  Sigh.  I guess\n> coming from the Lightscape/radiosity world I still can't\n> shake the idea that once you wait a while for a calc, all\n> the data is there for the asking.\n\n\nI really hate this damned machine,\nI wish that I could sell it.\nIt never does quite what I want,\nBut only what I tell it.\n\n\n\n\nOk, I admit that the default parameters of the various Radiance\nprograms are not designed to give you a first \"nice looking\"\nresult without any tweaking. Which is probably a healthy fact\nto get bumped against right before the first illusions of\nperfection can kick in... ;)\n\n\n\n\n> Is there a way to somehow tell rad to do some rtrace\n> stuff and have rad control the options based on a .rif file,\n> in the manner that rad controls rpict?\n\n\nYou can run a \"rad -n\" on the rif, and copy the relevant parts of\nthe output to a file. Then use the @<file> parameter with rtrace.\nIn fact, it often is a good idea to run a small picture before the\nrtrace, to more thoroughly initialize the ambient file. The few\ndozen initial rays from your grid may not cause the altorithm to\nlook at all corners of your space in sufficient density, which can\nresult in somewhat erratic or even lopsided output values.\n\n\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch.com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-May/000266.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "May 23, 2002 at 04:44PM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_000258", "id": "radiance-general_000266"}