{"body": "Hello again,\n\n\nThank you all for the many hints. I tried it out and it works now.\nBut anyhow I have a following problem now.\n\n\nWhen I do insert the following lines to the header for the description of our used angular fish eye lens, radiance tools like 'evalglare' (the author is J. Wienhold) does calculate wrong results.\n\n\n#?RADIANCE\nFORMAT=32-bit_rle_rgbe\nVIEW= -vta -vv 180 -vh 180 -vp 0 0 0 -vd 0 0 1 -vu 0 1 0\nEXPOSURE=1.79e+02\n\n\n-Y 1040 +X 1392\n\n\n\n\nI do assume this is due to the fact that the circular field of view for our fish eye is just a part of the rectangular aspect ratio of the image.\nFor example the center of the circular view is x = 700px; y = 500px and the diameter = 450px.\nIs it possible to tell this within the header?\n\n\nAnother possibility could be to crop the image according to this circular field of view. Is this possible?\n\n\nKind regards\nTobias\n\n\n\n\n\n\nVon: Gregory J. Ward [mailto:gregoryjward at gmail.com]\nGesendet: Mittwoch, 23. Juli 2014 17:57\nAn: High Dynamic Range Imaging\nBetreff: Re: [HDRI] Question about header information of HDRI\n\n\nWell, you asked at the right place!  The Radiance header format is simple, a set of newline ('\\n') separated comments, some of which are of the form:\n\n\nVARIABLE=value\n\n\nA space may appear after the equals ('=') but rarely/never appears before it.  Other lines in the header do not have this form, and may be anything.  However, the first line identifying the file should be:\n\n\n#?RADIANCE\n\n\nThe \"RADIANCE\" portion above is traditional, whereas the \"#?\" sequence is the so-called \"magic number\" for Radiance pictures.  Below is a typical information header:\n\n\n#?RADIANCE\nCAMERA= NIKON CORPORATION NIKON D700 version Ver.1.03\nPhotosphere created HDR image from '_DSC7719.JPG' '_DSC7720.JPG' '_DSC7721.JPG' '_DSC7722.JPG' '_DSC7723.JPG' '_DSC7724.JPG' '_DSC7725.JPG' '_DSC7726.JPG' '_DSC7727.JPG'\nEXPOSURE=4.887013e-03\nVIEW= -vtv -vh 51.765083 -vv 71.303574\nOWNER= Greg Ward\nCAPDATE= 2014:02:25 09:49:32\nGMT= 2014:02:25 08:47:39\nLATLONG= 46.948730 7.451972\nFORMAT=32-bit_rle_rgbe\n\n\n\n\nThe header is terminated by an empty line (two newlines together \"\\n\\n\").  The following line after the empty line is very important, it contains the image resolution.  It is typically in the form:\n\n\n-Y ysiz +X xsiz\n\n\nwhere xsiz and ysiz are the integer number of pixels in the image.  This ASCII string is terminated by another newline ('\\n'), immediately followed by the raster image data in the order indicated, Y (vertical) major sort, with Y values decreasing as measured from the bottom-left of the image.  This is explained in more detail in the relevant section (pp. 28-35) of the Radiance file formats document, located here:\n\n\n                http://radsite.lbl.gov/radiance/refer/filefmts.pdf\n\n\nI see Lars has provided you with the same information.  I hope this is enough to get you started.  Please note the importance of the EXPOSURE= line in the header and the 179 lumens/watt standard conversion factor in creating a properly calibrated picture.\n\n\nLet me know if you have further questions.\n\n\nBest,\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2014-July/000540.html).</sup>", "attachments": [], "created_by_name": "Tobias Porsch", "created_at": "July 29, 2014 at 05:01AM", "created_by": "Tobias_Porsch", "parent_id": "hdri_000536", "id": "hdri_000540"}