{"body": "On Mon, 29 Jan 2018 14:44:09 +0100, Germán Molina Larrain  \n<germolinal at gmail.com> wrote:\n\n\n> Hello,\n>\n> I agree with Lars in everything, but I also want to add some things:\n>\n>    1. I believe that, for scientific use of daylight simulations, you  \n> need extensive numerical validation. Some renders are not focused on  \n> that,\n\n\nNumeric output is indeed a rare feature of commercial renderers, coupled  \nwith the UNIX-y way of processing it in pipes by chaining modules. And  \nexactly this modular nature distinguishes RADIANCE, as it is really a  \nsuite of independent tools rather than one monolithic chunk of software;  \nthe charm/challenge lies in putting it all together for the task at hand.  \nBy contrast, modular commercial renderers use plug-ins, which generally  \ncannot be used independently. You can of course argue that such software  \nis better integrated than RADIANCE, and that's a definite plus in some  \napplication contexts.\n\n\nA final point that hasn't been brought up is portability. Commercial  \nsoftware may be portable to some degree but is generally optimised for its  \ntarget platform -- usually Windows. RADIANCE's code, by contrast, uses  \nlowest-common-denominator functionality which you'll find on even the most  \nrudimentary platform. While this precludes the use of more modern  \nprogramming paradigms (yeah, I've b*tched about the lack of OOP), it also  \nensures it will probably run unmodified on even the most basic or arcane  \nUNIX-y thing, should you choose to do so. I used to compile RADIANCE on  \nSunOS, IRIX and HP-UX before I even got my first Linux box, and it'll  \nprobably still compile there today, however useful/less that may be. This  \nmay be a moot point to those who've never seen the code, but it reinforces  \nGreg's argument for constancy as opposed to radical changes on each  \nrelease of a commercial package.\n\n\nMy 2¢ worth...\n\n\n--Roland\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2018-January/012432.html).</sup>", "attachments": [], "created_by_name": "Roland Schregle", "created_at": "January 29, 2018 at 11:37AM", "created_by": "Roland_Schregle", "parent_id": "radiance-general_012428", "id": "radiance-general_012432"}