{"body": "Vera,\n\n\nJust in case you do not find the answer (it would be good to find models\nwith well-defined materials and parameters); I guess what you can do is to\nuse any CAD program with an exporter. This should work in case working with\ntriangles (not continous spheres, cones or cylinders) is OK for you.\n\n\nThere is one called Groundhog project, which you can use to create your own\nRadiance models in SketchUp. Also, you should be able to use models from\nthe 3D Warehouse; so you will have cars and/or furniture available for\ndownload.\n\n\nThe project is still in development, but I used it and developed it during\nmy 2 year MSc. Thesis; and I guess it is already \"OK\" for others to use\nit... It is free and Open Source.\n\n\nhttp://groundhoglabs.github.io/Groundhog/\n\n\n\n\n\n\nThere are also other CAD programs/extentions that you can use with the same\npurpose... SU2RAD, Ecotect, blender, OpenStudio, etc.\n\n\nAny doubt, do not hesitate in contact me.\n\n\nGermán\n\n\n\n\n2014-05-16 15:46 GMT-04:00 Vera Liu <lizzielyh at gmail.com>:\n\n\n> Hi Radiance experts,\n> I'm conducting an experiment on evaluation of different algorithms to\n> light and colour analysis on materials. Previously we've only analyzed on\n> real-world scenes. And we're looking for to do some experiments on\n> simulation scenes and we figured pictures generated by radiance using light\n> simulation would be perfect. Currently the scenes I'm using are from the\n> tutorials of Rendering with Radiance. I'm wondering if there are any public\n> available datasets of built radiance models such as tables, windows,\n> chairs... that I could use? Thank you very much for taking a look!\n>\n> Best,\n> Vera\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n>\n\n\n\n\n\n\n*Germán Molina L.*\nIngeniero Trainee\nHunter Douglas Chile S.A.\nCelular +569 89224445\n\n\n\n\n\n\n\n\n*Nota de Confidencialidad:* Este mensaje incluído los archivos adjuntos son \nconfidenciales y pueden contener informacion privilegiada protegida por \nley. Si Ud. no es el destinatario, deberia abstenerse de copiarlo, \ndistribuirlo, divulgarlo o usar la informacion contenida. Por favor, avise \ninmediatamente al emisor y borre este mensaje de su sistema. Los mensajes \nelectronicos son susceptibles de ser cambiados, infectados o adulterados \nsin autorizacion. No asumimos responsabilidad alguna por ninguna clase de \ncambios o sus consecuencias. Usted debe estar informado que la compania \npuede hacer un seguimiento de sus mensajes electronicos y su contenido, \ngracias.\n\n\n*Confidentiality Notice:* The information contained in this email message, \nincluding any attachment, is confidential and is intended only for the \nperson or entity to which it is addressed. If you are neither the intended \nrecipient nor the employee or agent responsible for delivering this message \nto the intended recipient, you are hereby notified that you may not review, \nretransmit, convert to hard copy, copy, use or distribute this email \nmessage or any attachments to it. If you have received this email in error, \nplease contact the sender immediately and delete this message from any \ncomputer or other data bank, Thank you.\n\n\nA informação transmitida é confidencial e para conhecimento exclusivo do \ndestinatário. Sua utilização, não autorizada, constitui crime passível de \nprisão. Todas as precauções possíveis foram tomadas para garantir que este \ne-mail não contenha vírus. Uma vez que nossa empresa não pode assumir \nresponsabilidade por nenhuma perda ou dano causado por este e-mail ou de \nseus anexos, recomendamos que o destinatário utilize seus procedimentos de \nantivírus antes de qualquer uso.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2014-May/010280.html).</sup>", "attachments": [], "created_by_name": "German Molina", "created_at": "May 16, 2014 at 01:01PM", "created_by": "German_Molina", "parent_id": "radiance-general_010279", "id": "radiance-general_010280"}