{"body": "Hey Rob and other Apple afficianados,\n\n\nGreg suggested that it might be worth it to by a mac-mini so I can run \nphotosphere. Any hints, comments or otherwise about what might be a \nsuitable configuration. As you know I am a Linux fanatic, so I really do \nnot know that much about Apple configs.....\n\n\nSurprise ;->\n\n\n-Jack\n\n\nRob Guglielmetti wrote:\n\n\n> Kirk Thibault wrote:\n>\n>> From what I read leading up to this release, it was clear that Apple  \n>> wanted to finally move its laptops to the next level, hence the \n>> Intel  chipset.  I have a feeling that, as with most things Apple, \n>> there  will be issues - but the Apple faithful (me included) are \n>> willing to  be beta testers and see the bugginess as a badge of honor \n>> in some  convoluted way (paying money to be a beta tester will do \n>> that to your  rationalizing psyche I suppose).  It is weird to \n>> mention Apple and  Intel as complements, but I think all Mac users \n>> (again, me included)  realize Apple's shortcomings, even if we tend \n>> to defend the brand to  the death. \n>\n>\n> I was a defender (and early-adopter of the PPC with a PowerMac 7600 \n> (33 MHz!!)), then a hater for a few years as I grew tired of bomb \n> icons and the like, but it was Greg's statement that he got Radiance \n> compiled on OSX that brought me back to the fold.  It is really OSX \n> that I love so much, more so than Apple, but their product design is \n> quite pretty too (altho that magnetic power adapter looks a bit \n> flaky).  Giulio, I hear ya.  But it's been a long time since I've done \n> the early adopter thing, and I've been putting off upgrading my PB for \n> a while as well, so I'm gonna make the gamble.  I'll be sure and let \n> you all know how it works out; I ordered mine last night!\n>\n>>\n>> I imagine that a 17\" version of the Intel dual core laptop can;t be  \n>> far behind..\n>\n>\n>\n> Although it seems as if they lost money having three sizes and decided \n> to focus on the best seller, slightly increasing the size (15.4\" \n> instead of the old 15\").  It just may be the sweet spot.  Who knows?  \n> Interesting times ahead...\n>\n> - Rob\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n>\n\n\n\n\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-January/003238.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "January 11, 2006 at 04:59PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_003231", "id": "radiance-general_003238"}