{"body": "Francesco Anselmo wrote:\n\n\n>Hi Jelle,\n>\n>Thanks for your feedback and support, but I've done really very little,\n>and think we all need to thank both Greg for keeping adding new features\n>to Radiance, Georg for having set up Scons and fixed all the windows \n>compatibility issues, and both of them for still maintaining the\n>precious Radiance code without compromising stability and reliability\n>of results.\n>\n>Mh, as a Linux addict, I still feel a bit guilty for making more \n>accessible Radiance to the \"lazy\" windows users, especially after \n>Greg's \"wrap-up & outlook\" presentation at the Radiance Workshop in Montreal ;)\n>I'm so sorry I've missed it ...\n>  \n>\nHi Francesco,\n\n\nAs you were writing this email, I was struggling with making some \nin-house scripts operate on either wintel or linux, and I don't know if \nyou should feel guilty or not.  Certainly having windows binaries of the \nlatest code is a big help for people who can't or won't deal with \nlinux.  As for me, I *like* linux (but *love* OSX) =8-), and so here I'm \nhappy to report that just today I got one of our scripts going on both \nwindows and linux (gotta love Python, which takes care of 95% of that \nproblem all by itself).  The availability of new windows binaries for \n3.7 will just make this setup even more uniform, and I'll have to have a \nlook at those.  (Hey Schorsch, could these binaries be \"dropped in\" to \nan existing Rayfront installation?) \n\n\nAnd yeah, we missed you in Montreal too!  (and Schorsch, and Jack, and \nPillo, and PaB, and John M, and everyone else who make this list so useful!)\n\n\n- Rob Guglielmetti\nwww.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-October/003012.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "October 14, 2005 at 01:58AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_003010", "id": "radiance-general_003012"}