{"body": "Carsten Bauer wrote:\n\n\n>if you and Greg ascertain that there are calculational advantages (mainly \n>speed) in using distributed random numbers will believe it., although I \n>haven't noticed a considerable slowing down so far. And I cannot confirm at \n>all the mentioned strong effect on necessary picture size before downsampling \n>If the relevant parameters are set correctly, I've made very good experiences \n>with the -DMC version. For printing, one can even get along with \n>downfiltering by a factor less than two, provided the image itself is big \n>enough in absolute pixels. But adequate parameter setting is of course vital.\n>\nWell, - stratified Monte Carlo does have advantage (lower noise and \nfaster convergence speed). \"Pure\" MC might be feasible per combinations \nof computers and projects, but I still see it's worth considering other \nstrategies for evenly spread random numbers in Radiance.\n\n\n>Additionally, when considering PCs becoming faster and faster, I wonder if \n>there's a reasonable way to overcome the MonteCarlo mess completey and \n>establish a completey different, 'deterministic'  treatment of the problem \n>\nA better, yet general, numerical integration would be appreciated by a \nfew ...\n\n\nIn specular hightlights and ambient calcs the integrant is stepwise \ndefined, non-functional with only very roughly pre-known boundaries. All \nI see as further enhancement is a better adaptive method. All one can do \nwith a unknown integrant is to use already gained information as \n\"intelligently\" as possible. Educated guesses.\n\n\nIt might be well worth looking at the integrant more closely, though. \nSome statistics on the integrant found in all the sceneries of light \nsimulations might show some patterns that suggests optimizing the \nintegration method.\nThis proposal is not very scientific, but, RISC CPUs \n(\"reduced-instruction-set\") where suggested by the statistic that only a \nfraction of the many complex instructions of older CPUs was ever used.\n\n\n-Peter\n\n\n\n\n pab-opto, Freiburg, Germany, www.pab-opto.de\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000709.html).</sup>", "attachments": [], "created_by_name": "Peter Apian-Bennewitz", "created_at": "May 05, 2003 at 05:20PM", "created_by": "Peter_Apian-Bennewitz", "parent_id": "radiance-general_000704", "id": "radiance-general_000709"}