{"body": "Hi Lars, Rob,\n\n\n>From what I understand, gensky produces accurate CIE sky descriptions\naccording to the older definitions of 3 different sky types (clear, partly\ncloudy, and cloudy) - but does not include definitions for the newer CIE\nstandard that has 15 different sky types derived from 5 different\nparameters (A-E).  For the older CIE sky types, I am not clear on what\ngensky uses to predict the magnitude (zenith luminance, Lz) but from what I\nhave seen it does not match the methodology that the IESNA lays out for\npredicting Lz.  With gensky alone I might get around 70,000 lux on a sunny\nsummer day where as the IESNA guidelines would predict around 100,000lux.\n This is the reason I wrote a IES_gensky.py python script, it produces the\nsame CIE sky distribution functions (adopted by IESNA) but also uses IESNA\nguidelines to determine Lz based on some lookup tables.  I recall some\nbabbling from me on this topic around when I developed this:\n\n\nhttp://www.radiance-online.org/pipermail/radiance-general/2003-October/001074.html\n\n\nhttp://www.radiance-online.org/pipermail/radiance-general/2003-October/001090.html\n\n\n\n\nIES_gensky.py and a corresponding IES_skybright.cal are part of all the\nSPOT releases and I would be happy to send them along individually (not\nsure I can attach to an e-mail to the group).  So I use this script to\ndefine an IESNA standard clear sky with a sun (I agree that although likely\nvague in the manual, a sun is supposed to be part of the clear sky calc)\nand do my LEED calcs with that sky.  When I have looked at weather data and\nvery clear sky days, the illuminance seems to match this IESNA clear sky\nmodel fairly well.\n\n\nI have also never had this part of the calc questioned on LEED reviews.\n\n\nCheers,\nZack\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2012-June/008666.html).</sup>", "attachments": [], "created_by_name": "Zack Rogers", "created_at": "June 19, 2012 at 10:23AM", "created_by": "Zack_Rogers", "parent_id": "radiance-general_008656", "id": "radiance-general_008666"}