{"body": "Hi Lars and Marija,\n\n\n\n\nthe mentioned restriction occur also for glazings, which are defined as\nBRTDfunc!\n\n\nThat means, the angular information of the BRTD is lost for the glow\nmaterial (= sky distribution). This means for example, the the\ncircumsolar range of a sun with high altitude will contribute in the\nsame way as other parts of the sky with lower angles of incidence. And\nall the contributions from glow will be distributed lambertian from the\ninner pane. So whenever you use a sky distribution (e.g. with gendaylit\nor within DAYSIM), the  occurred  difference may be significant.\nThis modeling may be sufficient for many applications, but you must be\naware of loosing the angular information as soon as the ambient\ncalculation hits BRTDfunc.\nMy way is to use other standard material which do not show those\nrestriction and to mix them together according to the\ntransmission/reflection properties (which I get either from the\nmanufacturer or I generate them with window  or WIS. The \"mix-func-fix\ntakes me 10 min and then I'll get a model which works for (hopefully ;-)\n) all situations.\n\n\nThe other comments are below:\n\n\nLars O. Grobe wrote:\n>\n>> A remark from me: I never use BRTF in RADIANCE now, since all the\n>> angular information you put into your model is lost for the glow\n>> material. That means, if you model a specific sky luminance distribution\n>> and you are using BTDF-func, no angular information of your BTDF-model\n>> is used! It is treated lambertian ! And this is especially hard, if you\n>> want to model a system, which is intended to redirect the bright\n>> zenith sky.\n>>  If I model advanced glazings, I use either standard glass and modify it\n>> by brightfunc or for high reflective materials I use a mixfunc of glass\n>> (+brightfunc) and metal. I always check the angular transmission and\n>> reflection of the model by a virtual measuement - and I also test, if it\n>> still works for the sky.\n> Hi Jan, hi list,\n>\n> one more late reply to this. At the moment I am setting up the\n> materials for a model with known specifications for the glazing, but I\n> do not have samples to measure. So if I want to get a material\n> description e.g. for a double-glazing including coating and such, I\n> use the script glaze to have some reasonable values that I could not\n> produce else (and I can write this down as a reproduceable routine for\n> the docs). I could use Optics and access the glazing database, but for\n> some strange reason it requires administrator access to a Windows\n> maching that I do not have at the moment (did anyone manage to open\n> the database file using something like Openoffice?) - but also Optics\n> would give me brtf modifiers.\n>\n> Did anyone try to model such glazings in radiance, using dielectric\n> and interface? What are you using for defining glass panes if no\n> samples to measure are available? Ah, and one more question (which\n> leads me back to the idea of modeling glazing), what about glazings\n> that consist of laminated glass panes + non-uniform laminate (such as\n> printed screens for sun protection or advertising), would it be\n> possible to model these using dielectric&interface, having one (very)\n> thin layer for the laminate modified by a pattern and two dielectric\n> layers of glass on both sides? Is it complete nonsense to try modeling\n> such layers geometrically (there will be a limit as the thinnest\n> layers surfaces may get too close to each other)? Or is all this\n> trouble about considering the coatings and such only introducing\n> error, and a simple clear glass definition ignoring the coating would\n> still be \"better\" to use?\nA colleague of mine -Francesco Frontini - is currently just doing this\n(=geometric modeling), even extending your ideas having printings at\nvery specific positions and having three layers (directed laminated\nusing interface, printings modeled with plastic or trans).  In principle\nit is possible to model it like that, but it is a rather hard job to get\na reliable model. My colleague is working on that issue for months and\nis trying to get close to the laboratory measurements. As far as we are\nnow, we cannot get a potential contribution of multi-internal\nreflections within the glass for the sun as light source (the plastic\nstripes reflect the light and there should be a certain light transport\nto the inner side). The ambient calculation will not find the sun - even\nif the parameters for ad is increased radically. But this is as I\nexpected before. But the direct light transport and the sun blocking for\ncertain angles (that's the purpose of the system) works more or less\nlike in theory.\n\n\nCheers,\n\n\nJan\n\n\n>\n> TIA&CU... Lars.\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\n\n\nDipl.-Ing. Jan Wienold\nProject Manager\nFraunhofer-Institut für Solare Energiesysteme\nThermal Systems and Buildings, Lighting and Daylighting\nHeidenhofstr. 2, 79110 Freiburg, Germany\nPhone: +49(0)761 4588 5133 Fax:+49(0)761 4588 9133\njan.wienold at ise.fraunhofer.de\nhttp://www.ise.fraunhofer.de\n\n\nIn office: \nMo,Tue: 8:30-18:00\nWe,Thu: 8:30-16:00\nFr:  8:30-15:30\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-December/005585.html).</sup>", "attachments": [], "created_by_name": "Jan Wienold", "created_at": "December 10, 2008 at 01:32PM", "created_by": "Jan_Wienold", "parent_id": "radiance-general_005576", "id": "radiance-general_005585"}