{"body": "> -- OK, seconds before I was to press send, Carsten Bauer sent me an\n> email.  He's been doing some testing of his own with this model, with\n> much better results.  It seems that if we set -lw to zero, and not a\n> really-really low number, you get results that match the math.  The\n> other big difference between his process and mine is that he's getting\n> his values from a rendering (rpict) and I'm just rtracing values.  So\n> perhaps there's the missing link(s).\n\n\nHi Rob \n\n\nGreat - Carsten's results agrees with the fact that the swings you were\ngetting from that amplified illuminance suggestion pointed to something in\nthe settings being at least part of the problem.\n\n\nThe role of rpict makes sense too - with renderings every pixel (if -ps 1)\nis equivalent to an rtrace data point - (eg a 100x100 image rather than\nrelying on 10x10 =100 pts of measurement points) all helping to generate a\nmore 'well behaved' ambient file to describe the indirect lighting\ndistribution. \n\n\nThat's why (in answer to an earlier email) reusing the ambient file\ngenerated from an 'overture' image will still benefit your quantitative\nsimulation (rather than starting from scratch with a relatively few\nmeasurement points).\n\n\nBut usually not done because ab setting is normally different between\nrenderings and quantitative simulation.\n\n\ncheers\nalex\n\n\n*******************************************************\nA. J. Summerfield                 alex@arch.usyd.edu.au\nFaculty of Architecture, University of Sydney\n*******************************************************\nOutside of a dog, a book is man's best friend.\nInside a dog, it's too dark to read.       Groucho Marx\n*******************************************************\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000770.html).</sup>", "attachments": [], "created_by_name": "alex summerfield", "created_at": "May 16, 2003 at 12:39AM", "created_by": "alex_summerfield", "parent_id": "radiance-general_000768", "id": "radiance-general_000770"}