{"body": "Dear Group\n\n\nI have a question concerning an issue that I am encountering with illum \nobjects that were created with mkillum and the type of polygon that is used \nin conjunction with it. I perform quite a bit of my modeling with 3D Studio \nVIZ. This is more or less a \"lite\" version od 3D Studio Max. As many of you \nmay already know, virtually all of the geometry no matter whether it's a \nsphere, cylinder, plane, etc. is composed of a multitude of triangles. To \ncreate my windows, I generally model them as a plane. When I export the \nscene to RADIANCE (using ConRad), all of the planes are converted to \nindividual triangles. I have no problem using mkillum to create the illum \nmodifiers for these polygons. The problem comes when using rpict. Once \nrendering of the scene begins, a bunch of \"Aiming failure\" error messages \nare generated for all of my window polygons. It doesn't matter what value \nfor -dj I use, this error message still occurs. As an experiment, I decided \nto create the windows in AutoCAD. Using Desktop RADIANCE's conversion, the \nwindows planes were translated to Radiance as four sided polygons (as \nopposed to three when modeled in 3D Studio). The polygons were modified as \nillums with mkillum and when rendering with rpict I had no \"Aiming failure\" \nerror messages. My question is does anyone <coughGreg> know if Radiance has \nany preferences for a polygon type when the polygon is modified by an illum \nprimative?\n\n\n\n\nThanks\n\n\nMarcus\n\n\n_________________________________________________________________\nAdd MSN 8 Internet Software to your existing Internet access and enjoy \npatented spam protection and more.  Sign up now!   \nhttp://join.msn.com/?page=dept/byoa\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-September/001004.html).</sup>", "attachments": [], "created_by_name": "Marcus Jacobs", "created_at": "September 30, 2003 at 03:26PM", "created_by": "Marcus_Jacobs", "parent_id": "radiance-general_001005", "id": "radiance-general_001004"}