{"body": "Hi Rob,\n\n\nGeorg and Peter have already done a really good job answering these, but \nI wanted to add my two cents, anyway....\n\n\n> Failing rview, what other geometry previewers are you\n> folks using?  Ole Lemming's ConRad has a useful\n> previewer, that operates similarly to the \"view setup\"\n> dialog in Lightscape.  I really think this would speed\n> things along for me, the ability to interractively orbit a\n> scene & check for modeling errors, normal orientation, etc,\n> and most importantly, SETTING VIEWS.  THis is a real\n> hassle when you have to provide vp, vd as 3D points.  Are\n> there other previewers besides ConRad?\n\n\nCheck out the \"glrad\" program that comes with Radiance 3.4.  It works on \nmy version of X11 for OS X, which is the same as yours, as you told me \nhow to install it!  Also, take a look at the rholo program and see if \nyou can figure out how to work it.  This gives you a more flexible way \nto move around your scene than rview.\n\n\n> I have been using George Mischler's radout to bring\n> geometry from AutoCAD to radiance.  But there doesn't\n> seem to be a way to handle blocks.  It would be great if\n> there was a way to substitute autocad blocks for\n> instanced rad files!  One could export the blocks as\n> separate rad files, but is there a way to take a series of\n> insertion point coordinates and build a rad file that\n> instances the \"block\" rad file at those\n> coords/orientations?  That seems to be the key to being\n> able to rapidly change scenes, and stay accurate.  Anyone\n> doing this type of thing already?\n\n\nI'm way out of my depth, here, but have you looked at the replmarks \nprogram that comes with Radiance?  I would think Georg would have \nmentioned it in his reply unless he had a reason not to, so maybe it's \nirrelevant.  Anyway, replmarks replaces triangular placeholders with \nRadiance instances or objects, and it shouldn't be too difficult to \nadapt this to work with AutoCAD blocks, though I admit that I'm not sure \nwhat these are.\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-May/000237.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "May 09, 2002 at 10:13PM", "created_by": "Greg_Ward", "parent_id": "radiance-general_000230", "id": "radiance-general_000237"}