{"body": "Hi Zack and all,\n\n\nJust to add to the discussion (I hope not to the confusion) T. Muneer gives\na very detailed description of efficacy models in his book \"Solar Radiation\n& Daylight Models\" which I think is very recommendable.\nOr you can also look at:\nLuminous Efficacy: Evaluation of models for the UK, Lighting Research &\nTechnology, 27(2) 71-77 (1995)\nSolar irradiance and illuminance models for Japan II: Luminous efficacies,\nLigh. Res. & Tech., 27(4) 223-230 (1995)\nboth also by Muneer.\n\n\nFor beam luminous efficacy, he says that taking a single average value is \"a\nsimple yet robust model\", but he recommends using a value between 93-115\nlm/W.\n\n\nFor global and diffuse efficacies there are several models. I used the Perez\nmodel for my masters thesis, but I found it had to be corrected for Tokyo,\nwhich I did with local weather data. There is a short description of what I\ndid in last year's Radiance Workshop CD. The Perez model considers many\nfactors like atmospheric turbidity, precipitable water content, etc, etc\n(the list is long) which can be derived from TMY data, and since the model\nwas originally calculated from US and european data, you can probably use it\nfor your location without re-calibration.\nI think the reference is:\nPerez et al., Modeling daylight availability and irradiance components from\ndirect and global irradiance. Solar Energy, 44, 271 (1990)\n\n\nHope this helps. On the other hand, if it`s not a problem I would like to\nsee your study on different heights. I`m very interested in the subject as\nwe usually have to interpolate-extrapolate data in Argentina, due to the\nlack of measuring stations.\n\n\nPlease keep posting your findings, I for one, get a lot from it. Thanks and\nregards!\n\n\nSantiago.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-October/001076.html).</sup>", "attachments": [], "created_by_name": "Santiago Torres", "created_at": "October 17, 2003 at 02:30PM", "created_by": "Santiago_Torres", "parent_id": "radiance-general_001063", "id": "radiance-general_001076"}