{"body": "Hi Schorsch:\n\n\nGeorg Mischler wrote:\n\n\n> What this means is that you *can* use a dual CPU machine to its\n> full potential, without any further tools necessary. The only\n> thing that you need to do is split up your vector sets into two,\n> and start a seperate rtrace process with each half. If all\n> preprocessing (mkillum etc) is already done, then they will\n> happily share their ambient file, which accelerates both of them.\n> As long as you stay on the same box, you'll also definitively\n> have no locking problems.\n\n\nOK, thanks.  Your info suggests that I could just build a dual box, \ninstall Linux and Radiance, and continue doing things the way I am doing \nthem (multiple shell scripts calling rtrace), and both cpus would be \nfully utilized.  Maybe I'll still go that route, I don't know.  A single \nAthlon 2400XP goes for less than $200 US though, and I like the \nredundancy of having my processors in two separate machines.\n\n\nI was hoping for the ability to make both cpus appear as one, \ntransparently to Radiance.  PAB says this is not doable at the kernel \nlevel.  I'm running shell scripts that simulate a series of days for \ndaylighting analysis.  The whole thing is fairly linear, and even the \nsharing of the ambient file is not necessary because when the script \nadvances to the next hour, the octree is different, and thus the \nprevious calculation's ambient cache is not valid for the next one.  I \nalready have separate scripts/rtrace processes for each day, but was \nhoping to make all the days run off one command, hence my desire for \n\"one\" fast box.  I guess I was looking for one terminal window to run \neverything from, in order, with one command.  I'm lazy.\n\n\n> I didn't check: Is PVM also available for Windows?\n\n\nYes (http://www.csm.ornl.gov/pvm/pvm_home.html).  Maybe the beginnings \nof the next feature of Rayfront?  =8-)\n\n\n\n\n\n\n      Rob Guglielmetti\n\n\ne. rpg@rumblestrip.org\nw. www.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-January/000525.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "January 17, 2003 at 12:25PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_000518", "id": "radiance-general_000525"}