{"body": "Zack Rogers wrote:\n\n\n> [about inter-polygon smoothing]\n> I'm guessing that I can not just apply it to my polygons in my radout rad\n> file cause there are no normals...but can't the normal be determined\n> fairly easily as the cross product of this sides of the polygon?  Do you\n> really need to define each surface normal when the surface vertices are\n> defined?  Is it just a more expensive calculation?\n\n\n\n\nUnfortunately, a typical rad file is just a heap of unrelated\ntriangles. Or worse, other types of polygons, which you then need\nto split into triangles first.\n\n\nIf the normal vectors aren't supplied, then you'll have to try\nto reconstruct the topology of the surface. Basically you run\nthrough the list of triangles multiple times, searching all the\nones that share vertices. The assumption being that the normal of\neach vertex will be the average of all adjoining triangles.\nAs long as the geometry is topologically simple (no manifolds or\nintersections etc.), this can be done, but it isn't very\nefficient, and may produce unexpected results in some cases.\n\n\nIf your surface has any discontinuities (eg. edges: triangles\nconnecting at an angle that shouldn't be smoothed away), then\nyou need to start guessing threshold angles, which is at best\nunreliable. If the normals are supplied, then you can just smooth\neach triangle individually, and not worry about connections\nbecause you *know* the result will be correct in any case.\n\n\nIn your animation, the most obvious places where I noticed any\nlack of smoothness in supposedly curved surfaces were the\nhandrails, and possibly the roof of the entrance pavillion. Those\neffects *won't* go away with normal vector interpolation, because\nit's not primarily the shading that gives them away, but the\nsegmented outlines. You'll have to make shorter segments for that\nto improve. For some entity types (extruded arcs and arc segments\nin polylines), you can reduce the angle and distance tolerances\nin Radout to improve their appearance.\n\n\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-December/001342.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "December 17, 2003 at 09:01AM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_001335", "id": "radiance-general_001342"}