{"body": "Hi Raghu,\n\n\nHere are a couple of things to think about.\n\n\nMODEL GEOMETRY\nBased on your description, I am guessing that you are using genbox to \nmodel each sheet of glass in your insulating glass unit. The radiance \nmaterials that can be used to describe glass, such as \"glass\" and \n\"brtdfunc\" are designed to be applied to a surface as opposed to a \nvolume. Using genbox will give you a volume, applying a \"glass\" material \nwith a specific transmittance to that volume will not give you the \ncorrect resulting transmittance because rays are going through two \npieces of geometry. In order to get the correct transmittance for a \ngiven glass material you would need to use a single surface to describe \nthe geometry.\n\n\nGLASS MATERIALS\nIf all you care about is transmittance through a insulating glass unit \ncomposed of two layers of glass, there are a variety of ways to to come \nup with a material description. The resulting transmittance of a \nspecific makeup should either be available from a manufacturer or can be \ncalculated with an application like Windows or Optics (both available \nfrom LBNL). Note that for the glass material type transmittance needs to \nbe transformed to the Radiance term for transmissivity. If you also need \nto more carefully account for reflectance for such a glazing unit, \nassuming you are using Radiance on Linux, then you can use the \"glaze\" \nscript that comes with Radiance. To learn more about how to use the \nscript, you can check out my blog post:\n\n\n    http://modsimvis.blogspot.com/2014/12/glass-in-radiance.html\n\n\nBest,\n\n\n-Jack de Valpine,\nVisarc Inc\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-December/011425.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "December 18, 2015 at 01:39PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_011424", "id": "radiance-general_011425"}