{"body": "Rob,\n\n\nThank you for your response. Let me elaborate on the difficulty I run into\nwhen I add the Perl interpreter to my environment variable paths on Windows\nor calling the interpreter and passing the script's path to it in\ncomparison with packaging the Perl scripts with PAR or any commercial\nproduct that does such packaging:\n\n\nUsing Git Bash on Windows 7 (64-bit), if I call a Perl script by calling\nthe interpreter and then the script path such as \"$ perl C:/Radiance/bin/\ngenklemsamp.pl ...\" OR by adding the the Perl interpreter to my environment\nvariable paths so that I just could call the name of the desired script in\nthe command line such as \" $ genklemsamp.pl ...\", I would run into the\nfollowing error message given as an example:\n\n\nCommand:\n\n\n\"$ genklemsamp.pl -c 10000 -vd 0 -1 0 objects/glazing_outside_pane.rad |\nrcontrib -c 10000 -ab 2 -ad 1024 -e MF:4 -f reinhart.cal -b rbin -bn Nrbins\n-m sky_glow -fa model_3_phase.oct > daylight_matrices/daymtx_6.dmx\"\n\n\nError:\n\n\n\"bash: daylight_matrices/daymtx_6.dmx: No such file or directory\nC:\\Radiance\\bin\\xform.exe: cannot find file\n\"objects/glazing_outside_pane.rad\"\noconv: warning - (standard input): empty file\nC:\\Radiance\\bin\\vwright.exe: illegal horizontal view size\nIllegal division by zero at /c/Radiance/bin/genklemsamp.pl line 118\"\n\n\n\n\nEssentially, in either way of calling the Perl scripts in\n\"C:/Radiance/bin/\" (without packaging it to an executable and saving it in\n\"C:/Radiance/bin/\" with \".exe\" format), it looks like that my current\nworking directory (project folder) is ignored when the Perl script  is\ncalled and therefore, I encounter an error message regarding missing\ndirectories/file as given in the example above. This is despite the fact\nthat if I run a \"pwd\" call in Git Bash command line, my current working\ndirectory is still appears to be correctly set to my project folder where\nthe missing files are located.\nTherefore, I end up having to pass the absolute path of each file in my\nproject to the called Radiance Perl script which is inconvenient.\n\n\nOn the other hand, If I package the Perl scripts into an \".exe\" format, I\ndo not receive any errors with regards to missing project files and I can\npass my project files with relative paths just like passing files to any\nother Radiance command that is originally in \".exe\" format.\n\n\nThe described issue with missing directories/files error, has been the\nprimary reason for me, so far, to follow the approach to packaging the Perl\nscripts. It would be great if you could guide me through this issue that is\nleading me to be dependent on packaging the Perl scripts in Radiance.\n\n\nPlease let me know if you needed any further information.\nBest Regards,\n\n\nAlireza\n\n\nOn Sat, Feb 27, 2016 at 4:31 PM, Rob Guglielmetti <\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-February/011535.html).</sup>", "attachments": [], "created_by_name": "Alireza Hashemloo", "created_at": "February 27, 2016 at 09:14PM", "created_by": "Alireza_Hashemloo", "parent_id": "radiance-general_011532", "id": "radiance-general_011535"}