{"body": "Hi all,\n\n\nthe current status of pmap is:\n\n\nI have a patched version to on of the latest  head release (of December\nI guess). I've already tested it and made some validations. This looks fine.\nI will put it on the server soon (by end of next week or the week after).\n\n\nFor those of you who are using daysim: I've also tested a pmap-version\nof daysim! This works in principle (I already used it for a project),\nbut before releasing some small issues must be fixed first. This will\nneed maybe another 4 weeks.\n\n\nBUT: The windows compilation haven't been done or tested....\n\n\n\n\nBest,\n\n\nJan\n\n\n\n\n\n\nLars O. Grobe wrote:\n> Hi Valère!\n>\n>> I am using desktop radiance2.0b on windows. As I need to simulate a room\n>> with a deep lightpipe, I would like to use the photon map but I can't\n>> find\n>> any version of it I can use on windows.\n>\n> I think it would be worth to find out the status of the current\n> attempts to update the photon map extension to the Radiance 4.x code\n> base. I am not sure whether Jan or anyone else involved at Fraunhofer\n> ISE is reading, but probably they are the only ones who know about the\n> project.\n>\n> First, I would immediately stop using Desktop Radiance. We are in 2011\n> now, and I think the old releases are interesting mostly for\n> historical reasons now.\n>\n> Second, I do not know how well a patched Radiance 3.7 (the latest\n> official patch of the pmap) compiles on Windows. It used to work find\n> on Mac OS, but Windows is quite different from everything else. You\n> may still consider to use a virtual machine (e.g. Virtualbox,\n> available for free) to get a complete Linux environment on a Windows\n> machine.\n>\n> Third, as I am doing some experiments on light pipes and the pmap, I\n> would really be curious whether we will have some validation data once\n> a Radiance 4.x pmap is to be released. There used to be caveats which\n> I am still trying to understand.\n>\n> I imagine that once we have a complete pmap patch for Radiance 4.x,\n> people will get it useable in cygwin & Co., too. Still, probably it\n> would make sense to get your hands on a Linux installation for now.\n> And using a virtual machine is the easiest way to go for people not\n> having access to a native installation.\n>\n> Cheers, Lars.\n>\n> btw: I changed the subject line, please make sure to avoid subject\n> lines such as \"Re: [Radiance-general] Radiance-general Digest...\" when\n> replying.\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\n\n\nDr.-Ing. Jan Wienold\nProject Manager\nFraunhofer-Institut für Solare Energiesysteme\nThermal Systems and Buildings, Lighting and Daylighting\nHeidenhofstr. 2, 79110 Freiburg, Germany\nPhone: +49(0)761 4588 5133 Fax:+49(0)761 4588 9133\njan.wienold at ise.fraunhofer.de\nhttp://www.ise.fraunhofer.de\n\n\nIn office: \nMo,Tue: 8:30-18:00\nWe,Thu: 8:30-16:00\nFr:  8:30-15:30\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2011-April/007735.html).</sup>", "attachments": [], "created_by_name": "Jan Wienold", "created_at": "April 01, 2011 at 08:46AM", "created_by": "Jan_Wienold", "parent_id": "radiance-general_007734", "id": "radiance-general_007735"}