{"body": ">\n> I would go with this definition. But the reflections here are those that\n> happen between two parallel interfaces of a refracting material as the\n> front and back of a sheet of float glass. Some light is reflected at\n> the back of the sheet when the light exits the glass. This light will\n> travel back through the glass to the front and again a small amount\n> will be reflected towards the back and so on.\n>\n> I know what you mean but i am sitill confused the difference between\nTransmisivity and Transmittance?\n\n\nWhat is the difference between the first three parameters and trans (the\nsecond to last parameter) in trans definition?\n\n\n\n\nThe formula to calculate transmissivity from the transmittance of glass\n> (VLT) takes these inter-reflections into account and so you can model\n> the two interfaces of a single pane of float glass with one single polygon\n> in Radiance and you don't have to calculate the reflections during the\n> ray tracing process.\n>\n> > According to Andrew's email, for glass with VLT of 0.325\n> > has a transmisivity of 0.354. The glass is defined as\n> >\n> > void glass glazing.325\n> > 0\n> > 0\n> > 3  0.354  0.354  0.354\n> >\n> > For trans with VLT 0.325 and no diffse transmission.\n> > Can we difine it as the following?\n> >\n> > void trans window.0.325\n> >\n> > 7     0.325 0.325 0.325 0 0 1 1\n>\n> The correct definition would be\n> void trans window.0.325\n> 0\n> 0\n> 7 0.325 0.325 0.325 0 0 1 1\n>\n> This produces a dark clear material without any specularity that has\n> a VTL of 0.325 (or nearly as far as I can tell from my tests). But it\n> is not the same as glass.\n>\n> > For glass, the light transmitted would be specular transmitted,\n> > is it right? If right, what is the differrence between above meteirals\n> > definition - glass glazing.325 and trans window.0.325?\n>\n> The most obvious one is that \"glass\" is a specialised \"dielectric\"\n> material type which modulates the reflection according to the\n> angle and refraction index of the material. So if you want to\n> reflections/refractions of glass with another material you should\n> start with \"dielectric\" not \"trans\"\n>\n> The \"window.0.325\" material defined above has not specularity\n> and no roughness. The glass material has a visible specularity.\n> Just create a small test scene with a bubble of glass/trans and\n> a light source (like the sun) and you will see the difference.\n>\n> If you don't care about the particular refraction of glass and\n> specular refraction and only focus on VTL you could say the\n> materials are similar or equal depending on your use.\n>\n> Actually i run the simulations by two different materials i found the\nilluminance in the room is a little different. Why is it different?\n\n\n For \"dielectric\" definition, is anyone can tell me where i can find the\ndetailed definition and the instruction fo corresponding parameters?\n\n\nBest Regards!\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-December/006411.html).</sup>", "attachments": [], "created_by_name": "Victor Li", "created_at": "December 16, 2009 at 02:14AM", "created_by": "Victor_Li", "parent_id": "radiance-general_006380", "id": "radiance-general_006411"}