{"body": "On 14 Feb 2008, at 16:28, Ramana Koti wrote:\n\n\n> All,\n>\n> I use IES <VE> Radiance among other software to help design teams\n> optimize daylighting design.\n>\n> The dilemma is - The same illuminance distribution that's well above\n> the design fc level under sunny sky conditions is well below that\n> threshold under standard clear sky. I just double check to make sure\n> it's meeting the LEED criteria of 75% of space meeting 25 fc at noon\n> on June 21 under clear sky conditions and it almost never does (I use\n> the standard clear sky in IES Radiance for that).\n\n\nIES only bundles a (to my knowledge rather old) version of Radiance. So\nI assume that the sky is generated using the 'gensky' program from the\nstandard distribution.\n\n\nThere you have the basic sky types of\n\n\n   * sunny (CIE clear day)\n   * intermediate\n   * cloudy (CIE overcast day)\n   * uniform\n\n\nplus the option to switch the sun off and on for the first to skies.\n\n\n> What is the difference between the standard clear sky and sunny sky\n> models within IES Radiance?\n\n\nIn plain standard Radiance terms there is not difference between\n'sunny sky' and 'clear sky'. You can find out the command used to\ncreate the sky in the sky file that's created by the IES export\nto Radiance. In an older version of IES there was an 'obj' folder\nthat contained all the Radiance scene files. Search for a file with\n'.sky' extension or 'gensky' in the content.\n\n\n> In the rendered image, I never see solar penetration into the space\n> under clear sky conditions, what am I missing?\n\n\nI would say that the sky model does not include the sun by default.\nMakes sense to me because a sun patch would alter your illuminance\nlevels in the room beyond a point where a simple threshold value\nwould make sense.\n\n\nRegards,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-February/004786.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "February 14, 2008 at 01:45PM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_004782", "id": "radiance-general_004786"}