{"body": "Tank you very much Thomas and Carsten but it looks like I still have problems:\n\n\nIt is impossible for me to use eulum2ies . I tries it in ubuntu 7.10 64 bit and it doesn't work [core dumped] (maybe 'cou8se of 64 bit architecture) so I tried it under windows in cygwin.. agai core dumped even if there are some more explanations: \n\n\n17537 [main] eulum2ies 3792 _cygtls::handle_exceptions: Error while dumping state <probably corrupted stack> \nSegmentation fault <core dumped> \n\n\nSo, no way for me to use it.. ah, probably it is important to say that while compiling it it is reporting : \n\n\neulum2ies.c:71: warning: built-in function 'pow' declared as non-function\n\n\n\n\nI quite understand nothing from this.. do you? \n\n\nI managed to convert from eulum to ies with ies2tab a program for ms-dos written in pascal, but I still have doubts about the correct translation.. it looks like distribution is still ok, but it has some offset. If I rotate the luminaire around z axis, and I check with illuminance curves on an orizzonatal plane, the distribution is not rotating around its most luminouse point (as i guess it was supposed to do.. ) but it has an offset of almost 10 units, then 10 meters.. \n\n\nDo you have any suggestion on how to solve this problem? Is this really a problem or am I missing something? Can you suggest me any other converter at least to check that both them are working the same way ?\n\n\nThank you very much in advance.. \n\n\nLucio\n\n\n\n\n.On 29 Dec 2007, at 01:05, loscotec@@libero..it wrote:\n.\n.> Hy everybody !\n.>\n.> Does exist a way to convert directly from .eul (eulum) files  \n.> to .rad files?\n.>\n.> In any case, how do you suggest me to obtain that conversion?\n.\n.Steve has already mentioned Carsten Bauer's eulum2ies. I have used\n.it a few times with good results.\n.\n.I don't think it matters which converter you use. There is a lot of\n.information in these files but for ies2rad you only need the the\n.distribution. The luminaire is considered to be a point source so\n.even the shape info is not required unless you do glare calculations.\n.\n.> Right now I'm using \"ies2tab -ei\" to convert from eulum to ies and\n.> then ies2rad to convert form .ies to .rad but ies2rad is reporting:\n.> \"warning - no lamp type .. \"\n.\n.ies2rad has a limited knowledge on lamp types. The search patterns are\n.defined in the \"lamp.dat\" file in your Radiance installation.  \n.Manufacturers\n.now tend to use a product name in their lamp specification which is\n.harder to identify.\n.\n.If ies2rad fails to identify the lamp type it prints this warning\n.and uses a default lamp type with neutral white colour. This is\n.fine for most simulations (in particular Lux levels). When you're\n.interested in the actual rendering of the lamp colour you can use the\n.-t option of ies2rad to tell it which lamp type to use. Look in the\n.'lamp.dat' file for the specification.\n.\n.Please not that you only have to worry about this if you have different\n.lamp types in your scene. You can also change the colour balance of\n.an existing image to simulate this effect with pfilt.\n.\n.> Maybe this is normal, but in any case, having just one conversion  \n.> would\n.> be probably better..\n.\n.Support for new data file formats would be nice but given the number\n.of conversion tools out there it's probably not worth the effort.\n.\n.Happy new year.\n.\n.Thomas\n.\n._______________________________________________\n.Radiance-general mailing list\n.Radiance-general at radiance-online.org\n.http://www.radiance-online.org/mailman/listinfo/radiance-general\n.\n\n\n.. Caminante no hay camino, solo se hace camino al andar ..\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-January/004663.html).</sup>", "attachments": [], "created_by_name": "Stefano Ponzetti", "created_at": "January 04, 2008 at 04:39AM", "created_by": "Stefano_Ponzetti", "parent_id": "radiance-general_004652", "id": "radiance-general_004663"}