{"body": "Rob-\n\n\nI'm a biomechanical engineer who, for my job and as a hobby, has been \ninto 3d graphics, modeling, etc. for a while.  I primarily use Light \nWave and started getting into global illumination techniques in Light \nWave and the use of HDR images about 6 months ago.  I found Paul \nDebevec's site and learned a lot about image-based lighting techniques \n- on his site and in his work he frequently cites and uses Radiance.  \nOnce I realized the limitations of Light Wave wrt image-based lighting, \ni started looking into Radiance.  Wow.  The differences are obvious, \neven to a new user like me.  Learning Radiance has made me very acutely \naware of the fact that I wasn't really thinking about the physics and \nquantitative aspects of my modeling and rendering when using LightWave, \nmore just concentrating on the rendered output.  With Radiance, \nconsidering the physical aspects of light and its interaction with \nobjects, etc. gives me a while new appreciation for composing a scene, \nrendering it and compositing it.  The fact that the Radiance \nenvironment is a collection of tools in the Unix setting is a new way \nof problem solving for me, having been used to a single package that \ndoes it all.  Understanding the tools and the way they interact is \npresenting me with the steepest part of the learning curve currently, \nas I imagine you can appreciate.  However, as I am beginning to find \nout, this system leads to extremely robust and flexible solution \ntechniques.  I'm a Mac user, so I really appreciate the fact that now I \nhave an excuse to dust off and expand my Unix abilities.\n\n\nI really am interested in photo-real combinations of synthetic objects \nand \"real\" photographic environments.  I have been making my own \"Light \nProbe\" images and rending Radiance scenes with them - mostly just test \nscenes.  Now I am using the context of compositing synthetic objects \ninto \"real\" photographic plates as the basis for expanding my knowledge \nof Radiance.  So, in short, it's more art-related than quantitative \nanalysis of lighting, but i am realizing that appreciating the \nquantitative physical aspects of the lighting will give my scenes much \nmore realism and robustness.  The first time I emailed Greg he \nsuggested that I join the forum - there you have it.\n\n\nBesides that, I can't think of any other software I've used where I can \nemail the author and get answers at all, let alone in a friendly and \nnurturing manner.  That attitude is also evident in this forum's \ncommunity and i really appreciate it.  Thanks to all the folks on the \nlist who have helped me already and thanks in advance to those who will \nanswer my future questions - believe me, there will be more.  :-)\n\n\nkirk\n\n\n\n\nOn Nov 19, 2004, at 1:16 PM, Rob Guglielmetti wrote:\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-November/002171.html).</sup>", "attachments": [], "created_by_name": "Kirk Thibault", "created_at": "November 19, 2004 at 08:37PM", "created_by": "Kirk_Thibault", "parent_id": "radiance-general_002156", "id": "radiance-general_002171"}