{"body": "On Mar 15, 2004, at 8:05 PM, John Sutherland wrote:\n> Firstly – Ive read a lot about the mkillum approach, so for stained \n> glass I’m guessing I create an object that is textured glass material, \n> and have the mkillum secondary source behind it? Shining through. This \n> presumably will project the colours of the glass into the room?\n\n\nI still struggle with the correct usage of illum, but let's have a go \nat it.  Generally, for most accurate results, the glass panes \nthemselves would be converted to illums.  But in this case, I'm \nimagining that your window is comprised of lots of irregularly shaped \npieces of glass.  These will never resolve properly when mkillum tries \nto convert these polygons into illums.  I'd guess your best bet is to \ncreate some impostor geometry just on the *inside* of the stained glass \nwindow geometry.\n\n\n> Secondly – You can see mkillum sources from the rear side, I’m \n> guessing you turn them off for renders of the outside of buildings \n> looking at the windows?\n\n\nHmm.  For an exterior rendering, I'd turn them off, but not for the \nreason you mention.  Illums are invisible when visible.  That is to \nsay, in views where the illum geometry is directly visible, it is not \nrendered.  So, don't worry about excluding illums from your scenes if \nvisibility is ever a concern.\n\n\nBut in this example case, a rendering outside the building, the illums \naren't contributing anything to the image so why even waste time adding \nthem to the scene and calculating them?  So, for your exterior views \nyou should use a different set of parameters, and leave out the stained \nwindow illum geometry (the stained glass itself will get illuminated by \nyour sky & sun and thus will still look correct.)\n\n\n> Secondly – I’m really interested in the internal lighting, how bright \n> the inside will be at different times of day etc. When I render \n> internally with no av settings (rview), and set e to 1 is it bringing \n> the environment into a range that we can see? What im saying is, how \n> do I know what settings to use to get the most realistic \n> representation of what it would have been like to the human eye? I \n> know this is a tricky problem considering that the human eye adjusts \n> to light. How can I approach this problem?\n\n\nWhoo-whee.  Well, that is a monster question.  Simple answer is that \nthere is no simple answer to this.  Every model you do in Radiance will \npresent new challenges, but Radiance by and large can handle whatever \nyou throw at it.  Have you used the rad program yet?  Rad will \ncertainly get you going in the right direction quickly.  You can also \nsave the various parameters that rad feeds to rpict and inspect them \nlater.  It's quite educational.  You're on the right track with illum \nthere, that will improve your results and accuracy immensely.  Careful \napplication of mkillum, a handful of ambient bounces and say Q=M V=H \nD=[M or H] for your rad settings and you'll be in good shape, in \ngeneral.\n\n\nYour question about eye adaptation leads me to one of my favorite tools \nin the Radiance suite, pcond.  Pcond is a tonemapping program which \nalready has a very useful commandline parameter (-h) built into it to \nsimulate human visibility in a Radiance image.  So, after you generate \nyour radiance images, you simply run them through pcond like so:\n\n\npcond -h image.pic image-human.pic\n\n\nPcond takes the radiance image and performs a tonemapping operation.  \nThe results are fantastic, and it's really one of the best ways to \ndemonstrate the power of Radiance to people.\n\n\nHave fun, and welcome aboard!\n\n\n\n\nRob Guglielmetti\nwww.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-March/001515.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "March 16, 2004 at 03:18PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_001513", "id": "radiance-general_001515"}