{"body": "Hi Lars,\n\n\n\n\nLars O. Grobe wrote:\n> Hi Jan!\n>> I'm pretty sure its a question how you modeled the end of your\n>> \"light-pipe\".\n>> Photon mapping is doing an density estimate to calculate the radiance\n>> and is searching for photons in the nearby.\n>> Unfortunately the algorithm is doing this also for surfaces , which are\n>> \"leaving\" a closed space. For example, if you have a closed box and you\n>> add a surface to the scene, which is half inside and half outside the\n>> box, you will get light into the box.\n>> You can avoid this phenomena, if you really \"close\" your pipe (I assume\n>> so  ;-)  ).\n>>   \n>\n> Well the pipe is closed by the 45 degree mirror, but I guess that I\n> must not have geometry extend from the end (so that a part of it is\n> inside the system and a part is outside). This is really important for\n> modelling and was not clear to me so far! So the viewer in the sketch\n> below will see the surfaces A and B lid even though light is not able\n> to reach those, because the photons hitting the surface are counted\n> even though not visible from the viewer position, right?\n>\n> Surface A\n> ___________________________\n>                          |\n> light source      |    viewer\n> ________________|___________\n>\n> Surface B\n>\nYes! And the higher the bandwidth is the more will be transferred in the\nthe \"dark\" space. But its only a problem, if the \"outside\" is very dark\nand no photons are stored there. Then, the density estimate searches for\nnearby photons and collects the \"wrong\" ones.\n\n\n\n\n\n\n>> By the way, we will probably update photon-mapping for the 3.9 version\n>> (or the 4.0) version within the next half year, fixing also some bugs.\n>> This depends on a new project probably launched in January.\n>>   \n> This is good news for all Radiance users! Will it be possible to use\n> BRTDfunc modifiers with the photon map than? At the moment we have a\n> strange situation - most Radiance users most probably use the software\n> for advanced daylighting simulation. But they cannot model the\n> advanced systems with the core distribution (pmap is not integrated),\n> and even if they patch Radiance to support photon mapping, they cannot\n> use the galzing definitions as given e.g. by the glaze script because\n> of a lack of support for BRTDfunc in the pmap extension. I wonder how\n> one can model a daylight set-up with light redirection systems in\n> Radiance at all at the moment.\nWe will probably include BRTDfunc into pmap, but this is not clear now.\n\n\nA remark from me: I never use BRTF in RADIANCE now, since all the\nangular information you put into your model is lost for the glow\nmaterial. That means, if you model a specific sky luminance distribution\nand you are using BTDF-func, no angular information of your BTDF-model\nis used! It is treated lambertian ! And this is especially hard, if you\nwant to model a system, which is intended to redirect the bright zenith sky.\n If I model advanced glazings, I use either standard glass and modify it\nby brightfunc or for high reflective materials I use a mixfunc of glass\n(+brightfunc) and metal. I always check the angular transmission and\nreflection of the model by a virtual measuement - and I also test, if it\nstill works for the sky.\n\n\nBut Greg  presented at the workshop the BTDF implementation into mkillum\n- this seems to me a very good approach to calculate the advanced window\nsystems! So this can probably solve your problem now. But I don't know,\nhow it treats the sky and if the angular information is also \"lost\".\nThis is also new to me - I haven't tested it yet.\n>\n> How are experiences with the pmap for Radiance 3.8? I could use that\n> one for now (I cannot really wait for half a year, so I must use what\n> is available) if it is found to have been relieable. Or should I stay\n> with 3.7?\nI have to admit, that we work here still with the 3.7 version (RADIANCE\nand pmap). No experience with 3.8.\nIf you are using pmap, don't use the -I option for rtrace - it is giving\nyou wrong values. This is one of the bugs we will solve in the near\nfuture. If you want to calculate the illuminance, you should calculate a\n180 degree fish-eye-picture at  your calculation points and integrate\nthe picture  (you can use findglare or evalglare to calc an illuminance\nfrom a picture)\n>\n> Again thanks to you and the other Fraunhofer folks making this\n> important extension available to us - is there any hope that pmap\n> could become part of the Radiance distribution itself one day?\n\n\nWell, this is not so easy to answer. It is also a problem of maintenance\n- we can maintain only, if we have funding. And we are still looking for\na volunteer  for that.....\n\n\nCheers,\n\n\nJan\n\n\n\n\n>\n> CU, Lars.\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\n\n\nDipl.-Ing. Jan Wienold\nProject Manager\nFraunhofer-Institut für Solare Energiesysteme\nThermal Systems and Buildings, Lighting and Daylighting\nHeidenhofstr. 2, 79110 Freiburg, Germany\nPhone: +49(0)761 4588 5133 Fax:+49(0)761 4588 9133\njan.wienold at ise.fraunhofer.de\nhttp://www.ise.fraunhofer.de\n\n\nIn office: \nMo,Tue: 8:30-18:00\nWe,Thu: 8:30-16:00\nFr:  8:30-15:30\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-December/005561.html).</sup>", "attachments": [], "created_by_name": "Jan Wienold", "created_at": "December 05, 2008 at 01:50AM", "created_by": "Jan_Wienold", "parent_id": "radiance-general_005555", "id": "radiance-general_005561"}