{"body": "Hi!\n\n\nGeorg Mischler wrote:\n\n\n> Automatic mappings on single geometric primitives would be\n> relatively simple, but also not very useful. In most cases,\n> mappings will be applied to a group of primitives together,\n> eg. all the polygon segments of a curved wall. There's no\n> good way to automatically determine the axis of a cylindrical\n> mapping without user interaction in such a case.\n\n\nOk, I didn't want \"automatic mapping\" (something like this might be done\nin the modeler, as I can find the axis of a cylinder quite easy there -\nso this is what makes conrad interesting, as it exports 3ds-mappings).\nWhat I think about is a way to create a static map for the object, so\nthat I can edit the mapping for this object until it fits and save this\npic-file. So I would not have the calculations in cal-files any more. Of\ncourse this means a loss of flexibility, maybe it's simply better to\nhold the complete object as an oct-file. \n\n\n> I can only speak for myself, but enabling casual users to\n> place mappings without effort is not very high on my list of\n> priorities.\n\n\nMappings are usually not the most important feature in radiance at all.\n\n\n> (especially after buying a certain piece of software on Ebay)\n\n\n;-) this \"piece of software\" is happily running on my laptop now!\nThere's just one reason for my question. I am working on a model of a\nchurch. In fact, mappings are not the most important for our project,\nbut we have documented most important surfaces. So we have photos of the\ndomes, what AFAIK means a planar projection of a spherical surface. I\nwonder how I would map this easily, if it gets important... ooops....\nmight it be that I could simply map it as on a planar surface in this\ncase...?\n\n\nCU, Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2001-November/000073.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "November 24, 2001 at 01:23PM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_000070", "id": "radiance-general_000073"}