{"body": "Hello,\nI’m new to Radiance and I’m trying to use genBSDF in order to obtain the optical properties of a complex solar screen.\nThe problem is that when I try to launch the program from the command prompt this message appears:\n\n\n“rfluxmtx is not recognized as internal command or external, an executable program or a command file. Failure running rfluxmtx at script/genBSDF.pl line 416”\n\n\nI really don’t know what to do and I hope someone can advise me.\nI’m working on Windows 7 and with genBSDF.exe.\n\n\nThanks a lot\n\n\nMicol\n\n\n\n\n________________________________\nCe message et ses pièces jointes peuvent contenir des informations confidentielles ou privilégiées et ne doivent donc pas être diffusés, exploités ou copiés sans autorisation. Si vous avez reçu ce message par erreur, merci de le signaler à l'expéditeur et le détruire ainsi que les pièces jointes. Les messages électroniques étant susceptibles d'altération, Egis décline toute responsabilité si ce message a été altéré, déformé ou falsifié. Merci.\n\n\nThis message and its attachments may contain confidential or privileged information that may be protected by law; they should not be distributed, used or copied without authorisation. If you have received this email in error, please notify the sender and delete this message and its attachments. As emails may be altered, Egis is not liable for messages that have been modified, changed or falsified. Thank you.\n________________________________\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2017-February/012029.html).</sup>", "attachments": [], "created_by_name": "BORSA Micol", "created_at": "February 01, 2017 at 06:03AM", "created_by": "BORSA_Micol", "parent_id": "radiance-general_010107", "id": "radiance-general_012029"}