{"body": "Alireza - Five great questions.\nRob - Five great responses.\n\n\nI've done these simulations with and without spacing. There are probably\nexamples I've produced of both ways floating around. So I'll try to explain\nwhy you'd want to do it one way or the other.\n\n\nThe basic idea is to make sure that you account for the window thickness\nand edge condition once and only once in your simulation. The genBSDF\ntutorial touches on the difference between a system specific BSDF, which\nincludes edge conditions, and an infinite layer BSDF, which has no edge\nconditions. If your BSDF does not include the edge condition, then you want\nyour sending and receiving surfaces to be coincident, so that the edge\ncondition is accounted for in the view and daylight matrices. If your BSDF\ndoes include the edge conditions, then you want a space between your\nsending and receiving surfaces so that the edge condition is not duplicated\nin the view and daylight matrix.\n\n\nSo how do you know whether you have an infinite layer BSDF or a BSDF with\nedge conditions?\nIf your BSDF is generated by Window then it is an infinite layer, without\nedge conditions.\nIf your BSDF is generated by genBSDF then it contains edge conditions,\nunless you took care to minimize sampling of edges (see genBSDF tutorial).\n\n\nIf you're using proxied geometry, than your sender and receiver geometry\nneeds to be spaced (the thickness of the geometry) so you should make sure\nthat your BSDFs contain the edge effects.\n\n\nFor the 5-phase method, your strategy starts with what you want to do for\nthe direct sun coefficient matrix.\nIf you want to use proxied geometry than the sender and receiver must be\nspaced apart and the BSDF should include edge effects specific to your\nmodel.\n\n\nIf you want to use a tensor tree BSDF, then it depends on what you did to\ncreate the BSDF. If it is a typical genBSDF tensor tree run, then edge\nconditions are included in the BSDF and you should include a space between\nyour sending and receiving surfaces. If however you took care to create an\ninfinite layer BSDF (tensor tree) with genBSDF then your sender and\nreceiver surfaces can be coincident.\n\n\nHopefully this gives a little bit of backgroud to the whole space or no\nspace between sending and receiving surfaces.\n\n\nBest,\nAndy\n\n\n\n\n\n\nOn Sun, Jan 31, 2016 at 8:40 AM, Rob Guglielmetti <\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-January/011467.html).</sup>", "attachments": [], "created_by_name": "Andy McNeil", "created_at": "January 31, 2016 at 12:00PM", "created_by": "Andy_McNeil", "parent_id": "radiance-general_011465", "id": "radiance-general_011467"}