{"body": "Hi Richard,\n\n\no.k. then, let's open this can of worms:\n\n\nQuoting from \"Daylighting in Architecture - A European Reference Book\",\nthe DGI is stepped as such:\n\n\nJust imperceptible    16\n                      18\nJust acceptable       20\n                      22\nJust uncomfortable    24\n                      26\nJust intolarable      28\n\n\nIt seems to me that you definitely shouldn't be using the UGR or any other\nnon-DGI, because they are all derived for artificial light sources. Having\nsaid that, although the DGI is the only GI available now for natural\nlighting (windows, sky lights etc.), more recent research has shown that\nit's hardly applicable. So while artificial GIs might hold true to some\nextend, daylight GIs should be treated with much scepticism and asbestos\ngloves. You are pretty much on your own here, there is no generally\naccepted theory. The DGI is the best we have at the moment, but there is\nmuch debate about it.\n\n\nI would suggest that you look at the contrast ratios of the surrounding vs\nthe reflected sun light and try to make the best of it. Glare is also much\nmore tolerated when it's not directly in the direct field of view.\nAlthough not true in your case, you'll find that DG is much more tolerated\nand glare from artificial light sources because usually it goes\nhand-in-hand with a view out of the window which causes glare, and this\ncan not be quantified in a formula. There are just too many physiological\nand psychological aspects that play a role here to make this an \"exact\nscience\".\n\n\nSorry for giving such a hard time, but it ain't easy.\n\n\nTo bring up a more \"holistic\" point of view: if you have bright sun\npatches, then it's more likely that you should be worried about\noverheating than glare. The latter costs you money in terms of A/C, the\nformer is a nuisance, not a problem, if caused by daylight.\n\n\nCheers\n\n\nAxel\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-January/002305.html).</sup>", "attachments": [], "created_by_name": "Axel Jacobs", "created_at": "January 19, 2005 at 01:23AM", "created_by": "Axel_Jacobs", "parent_id": "radiance-general_002302", "id": "radiance-general_002305"}