{"body": "Hi Axel,\n\n\nI like your step by step documentation of your process. I picked up a few\ntricks along the way.\n\n\nI do have one tip for you which you may have already figured out give the\ntime elapsed between your email and my reply.\n\n\nWhen combining your tregenza patch renderings you should use pcomb's -o\noption to use original pixel values instead of exposure adjusted values.\nThe -o option needs to precede every image, so I'm not sure if it'll work\nwith the wild card character.  Alternatively you could use pfilt -1 -e 1\nwhen resizing the tregenza patch renderings to explicitly set exposure at 1.\n\n\nI think this might solve the brightness issue you are having with rtcontrib\nrendered images.\n\n\nBest,\nAndy\n\n\n\n\nOn 1/17/10 6:04 AM, \"Axel Jacobs\" <jacobs.axel at gmail.com> wrote:\n\n\n> Dear all,\n> \n> I've been reading some of the very interesting presentations from the\n> last Radiance workshop and am now keen on finally getting to the bottom\n> of this rtcontrib thing.\n> \n> My aim is to do Dynamic Daylight Simulations, DDS, using rtcontrib\n> rather than DaySim.\n> \n> As I am going along, I am preparing more material for the Advanced\n> Tutorial. A usual, the notes advance at a leisurely pace, trying to make\n> one little mistake or discovery a time, rather than doing them all at once.\n> \n> I have put up some very early notes (really only just scribble with some\n> images) here:\n> http://luminance.londonmet.ac.uk/pickup/rtcontrib_lesson.html\n> and would be grateful for any feedback.\n> \n> This is what's there at the moment:\n> \n> - show that rpict is simply a convenient way of calling rtrace to\n> produce an image\n> - show that rtcontrib is a souped-up version of rtrace (bear with me\n> before banging your head against the wall over this one)\n> - show how rtcontrib produces individual images based on light source\n> modifiers\n> - show how this can be extended to different 'zones' using binning, e.g.\n> for daylight coefficients\n> \n> I have not looked at the mkillum-like functionality of rtcontrib yet\n> (pseudo-forward-raytracer?), and the model you see in the images doesn't\n> even have a window pane.\n> \n> All images under a glow sky (not the ones with circular 11deg light\n> sources) have an overcast distribution. Eventually, this should probably\n> be a simple glow without any distribution assigned to it, but I've used\n> a gensky material for now to be able to compare the absolute values of\n> the combined results which should match the rpict ones.\n> \n> The big show stopper so far is that I don't get the absolute values\n> right for a glow sky with Tregenza subdivisions. You will also see just\n> how weird the sky hemisphere looks in this simulation after the 145\n> patches have been combined.\n> \n> Any hints are very welcome.\n> \n> Cheers\n> \n> Axel\n> \n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-January/006479.html).</sup>", "attachments": [], "created_by_name": "Andy McNeil", "created_at": "January 21, 2010 at 02:01PM", "created_by": "Andy_McNeil", "parent_id": "radiance-general_006471", "id": "radiance-general_006479"}