{"body": "Hi Germán, Xiaoming,\n\n\nThank you both for pointing this out and having me go back to check the \nwork on specular materials. I indeed made a pretty critical mistake by \nmomentarily forgetting the tricky procedural nature of Radiance \nmaterials... and then never noticing. This is rather a shame after \nspending a long time getting a trans material just perfect earlier in \nthe week. First of all, big apologies for the mistake. All diffuse \nmaterials, metals, and the specialized PV materials should be correct on \nthe website. Things with specularity will have some errors, and I will \nfix this soon.\n\n\nIn the interim, the specularity and total reflectance values on the \nwebsite are correct, and you can fix individual R, G or B coefficients \nwith a little math:\n\n\n(R_Website - Specularity_Website) / (1-Specularity_Website) = R\n\n\nSo in the case of the material referenced earlier \n<http://www.lighting-materials.com/materials/648>,\n\n\nR = (0.3517 - 0.0218) / (1 - 0.0218) = 0.3373\nG = (0.3480 - 0.0218) / (1 - 0.0218) = 0.3335\nB = (0.3313 - 0.0218) / (1 - 0.0218) = 0.3164\n\n\nAgain, I apologize for the mistake. I will post a public message here \nwhen all is corrected on the website.\n\n\nGermán, I owe you a separate e-mail and will reply soon afterwards :).\n\n\nXiaoming, to answer your question: If you want a 50% diffuse and 10% \nspecular material, then indeed the R/G/B coefficients are 0.5556 and the \nspecularity is 0.1 as far as I understand the functioning of the \nmaterial models. Germán, R_specular is simply equal to the specularity \nin the plastic material. In that sense, Red, Green and Blue are not the \ntotal reflection (that's the mistake I made). Rather they represent the \npercentage of the leftover light after specular reflection that is then \nreflected diffusely.\nR_diffuse = 0.5556*(1-0.1) = 0.5\nR_specular = 0.1\nR_total = R_diffuse + R_specular\n\n\nBest,\nAlstan\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2017-January/012024.html).</sup>", "attachments": [], "created_by_name": "Alstan Jakubiec", "created_at": "January 23, 2017 at 07:12AM", "created_by": "Alstan_Jakubiec", "parent_id": "radiance-general_012019", "id": "radiance-general_012024"}