{"body": "Dear Clotilde, List,\n\n\n    Well, I think this is not the case. The SIGMA 8mm f/3.5 has an equisolid projection.\n    I am quite sure as I received this information from Sigma UK. Moreover, I checked the information Sigma gave me by measuring myself the projection of the lens. I did it following David Geisler-Moroder method, that he presented at the 15th International Radiance Workshop in 2016. And I also got an equisolid projection. I could send you more info if you want.\n    The images have thus to be reprojected from equisolid to equidistant.\n\n\nI wanted to follow up. Because of all of the questions about the lens \nprojection of the Sigma 8mm, I measured one of mine today using a \npanoramic tripod attachment. I verified that the lens was rotating \ncorrectly about the opening as per the standard parallax tests first. I \nam including the measurements of the Canon 8-15mm fisheye as a reference \nin addition although I measured it in 2015. You may find the results at, \nhttps://dl.dropboxusercontent.com/u/3175325/lens_projection.pdf\n\n\nIt is notable that the Sigma 8mm is very close to an equisolid \nprojection, although not as nicely matching as the Canon 8-15mm at 8mm.\n\n\nZhe, Tobias and Claus -- I'm CC'ing you directly to make sure you see my \nmeasurements related to the previous discussion.\n\n\nClotilde, there is one notable place where my workflow for calibration \nfactors is a little different than yours. I calibrate each image based \non a specific luminance measurement as per Inanici and Van Den \nWymelenberg's methods. Generally speaking, this brings my results \nreasonably close to the measured illuminances in most cases where \noverflow is not present. I keep the measurement point near the image \ncenter (where vignetting~0) and perform vignetting correction after \ncalibrating the luminance at the near-center point.\n\n\nSecondarily, I'm curious about your vignetting correction process before \ncropping if you wouldn't mind sharing some more details. I imagine it is \ndifficult to correct when there is no valid Radiance view associated \nwith the image yet.\n\n\nBest,\n\n\nAlstan\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2017-February/000617.html).</sup>", "attachments": [], "created_by_name": "Alstan Jakubiec", "created_at": "February 13, 2017 at 03:28AM", "created_by": "Alstan_Jakubiec", "parent_id": "hdri_000610", "id": "hdri_000617"}