{"body": "On Dec 2, 2003, at 8:39 PM, Fitzsimmons, Rob wrote:\n\n\n> I'm trying to use mkillum to render my house.. and I'm having trouble \n> understanding it.\n\n\nHi Rob F,\n\n\nAs Georg mentioned, you only need to reference your windows once, in \nthe illum= line.  Also, your \"illum=\" options are a little off, as \nGeorg also mentioned.  Greg Ward explained this to me rather well, in \nan email that is either on my office computer or on my PC upstairs, \nbecause it ain't on the laptop sitting on my lap at the moment (I \nreally need to start using IMAP).\n\n\nAnyway, you basically have to tell mkillum what's going on with your \nmodel in the illum= line, because all your input with QUALITY=, \nVARIABILITY= and DETAIL= in the .rif file mean absolutely nothing to \nthe mkillum process.  This is something that is not well documented, \nIMHO.\n\n\nMake sure your illum= line includes sufficent -ab, and -ad, and -ar, \nand -as to ensure that the mkillum process is aggressively calculated.  \nAs Georg said, if you wimp out with the ambient calculation on your \nwindows, the effect of the exterior environment will be largely ignored \nin terms of the distribution of the windows' luminance. Bottom line: \njust because you're using rad, that does not exempt you from having to \nbe intimate with the various rpict switches for a proper rendering if \nyou're using mkillum. (and please don't read this as some guru talking \ndown to you; I'm still learning this stuff myself.)\n\n\nI hope this helps.\n\n\nRob Gee.\n\n\n-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-\n   Rob Guglielmetti\nrpg@rumblestrip.org\nwww.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-December/001279.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "December 02, 2003 at 10:12PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_001277", "id": "radiance-general_001279"}