{"body": "Hi Marcus,\n\n\nOf course, I'm a big fan of Apple computers.  They offer a great \ncombination of quality (i.e., sturdiness, reliability, and aesthetics) \nover Wintel computers.  However, I'm forced to agree with Rob that in \nterms of peformance vis a vis Radiance, your best value is a probably a \nhome-built, dual-processor Linux box.  I very nearly got one myself, \nbut decided instead to pay roughly twice as much to get a dual 1.4 GHz \nPowerMac G4 with 1 GByte of RAM and a DVD writer for about $3K.  Its \nperformance and features are comparable to PCs I could have bought \nprebuilt for around $1.5K.  The advantage is that I don't have to \nadminister a Linux system, which I've found in the past to be a pain in \nthe butt.  Mac OS X, built on FreeBSD, is a snap by comparison, and \nwhat's better is I can run Word and Excel and all those other Microsoft \nnasties without having to reboot into another system.  Better still, I \nget to run Photosphere, which I've spent two years developing and don't \nhave time to port to other systems right now.\n\n\nThe hype about the G4 being superior for scientific applications is a \nPR effort by Apple to save face for a processor that despite many \ndesign superiorities, just hasn't kept pace with Intel and AMD's \naggressive speed increases.  To be fair, you can use the Altvec \nprocessor (a short vector SIMD on the G4) to get substantial speed \nboosts if you go to the extra work to use it.  I haven't done any \ncustom hardware coding in Radiance, and I'm unlikely to in the future.  \nOthers are welcome, of course.\n\n\nIn your case, a dual-processor Wintel machine with dual-boot into Linux \nor (my recommendation) FreeBSD may be the best option with your \nexisting software investment.\n\n\nI don't know what a 64-bit processor will buy in terms of Radiance \nperformance.  Other than getting past the 2 GByte memory addressing \nlimit, there might be some improvement in floating point speed since \nyou can load double's into registers, but 64-bit integers are not \nreally useful as far as I'm concerned.\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000814.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "May 29, 2003 at 10:19PM", "created_by": "Greg_Ward", "parent_id": "radiance-general_000813", "id": "radiance-general_000814"}