{"body": "Hi George,\n\n\nThat's quite an e-mail.  At least you've done your research.  However, \nI don't think you'll get anyone to \"bless\" your calculation based on \nyour current approach.  I won't even hazard a guess as to how close \nyour results are to correct.  (I hesitate to make any claims about my \nown calculations for that matter.)\n\n\nGiven the amount of time you must have spent on this, even on composing \nthis e-mail, don't you think you should spend a little time getting a \nnewer version of Radiance onto your computer?  Just a thought.\n\n\nHere are some others:\n\n\n> - modelled a small Test Room A with the triple façade modelled\n>   accurately in geometric detail, using Optics5 data for each sheet\n>   of glass, and assumed reflectances and detailed geometry for the\n>   venetian blinds.\n\n\nDoes Optics5 do ray-tracing to figure out the spatial distribution of \nlight coming from scattered sources?  I had no idea it had such a \ncapability!  I really should talk to my compatriots at LBNL more \noften...\n\n\n>  - modelled a Test Room B of the same dimensions, but with a\n>   pseudo-façade of simple plane elements with BRDFs,\n\n\nUsing BRTDfunc, or what?\n\n\n>  - tweaked the BRDFs until the renderings compared well between\n>   Rooms A and B under 3 outside environments, with external\n>   obstructions, materials and ground planes,\n\n\nThis is the part that has me most worried.  Getting a reasonable match \nin a few different scenarios is no substitute for good modeling.\n\n\n>  - applied the façade and BRDFs of Test Room B to my big models,\n>   so I can crank out the illuminances and extract the daylight \n> statistics.\n\n\nIt should be possible to arrive at a reasonable BRTDfunc approximation \nto blinds based on a particular slat spacing, angle, and reflectance.  \nIt would take me a week or so to do it, though.  I wouldn't trust \nplasfunc or any of the other types, because they don't include a pure \ntransmitted component, which you will certainly have with venetian \nblinds.  In short, I think for the time being at least, you should \nstick with a mkillum-driven calculation, or rely on the basic Radiance \ninterreflection calculation with some large values for -ad and -as if \nall you want are a few data points per time step.\n\n\nThat's my two cents.  I hope the others have something more to say, \nbecause I know there are users out there with more experience with \ndaylight simulations than I have....\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-October/002079.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "October 27, 2004 at 06:42PM", "created_by": "Greg_Ward", "parent_id": "radiance-general_002078", "id": "radiance-general_002079"}