{"body": "Hi Jan,\n\n\nHow are you calculating the solid angles in your table?  I assume these are per-pixel, since the total should equal the actual solid angle of a 0.5° source.  I use the following to calculate total solid angle as understood by pcomb:\n\n\n\t pcomb -e 'lo=if(gi(1)-10,S(1),0)' input.hdr | pvalue -pG -h -H -d | total\n\n\nThis simply adds up all the solid angles corresponding to pixels greater than 10, which will just be the sun in your case.\n\n\nI've noticed there's actually about a +/-5% error in the disk size using a 5000x5000 pixel rendering.  If you increase this to 15000x15000, you can get this error down below 1% or so.  This error stems from the on/off nature of the boundary and random sampling.  To get more consistent results, I also recommend adding \"-pj 0\" to your rpict line.\n\n\nWhat kind of differences are you actually expecting between these two calculations?  Since you are using rpict to render the sky, the \"uncorrected\" fisheye is the one that will add up to the correct solar solid angle, which is about 6e-5 for a 0.5° source.  The above pcomb command should give you this value for all of  your sun positions in the uncorrected versions.  I confirmed this from the 15000x15000 runs.\n\n\nThe \"corrected\" images will still be interpreted by pcomb as having \"-vta\" projections, so will yield incorrect estimates of the sun's solid angle.  Had you fed them actual fisheye captures using an equi-solid-angle lens, then presumably they would end up agreeing again.  Off-hand, I don't know how to generate such test images, but when I run the 15000x15000 images through the above pcomb command, I get the following ratios for the new over the original solid angles:\n\n\nAngle\tmodified/original\n5°\t\t1.00\n15°\t\t0.97\n25°\t\t0.96\n45°\t\t0.93\n75°\t\t0.91\n\n\nI don't know what to do with this, however.\n\n\nCheers,\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2017-June/000637.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "June 27, 2017 at 03:57PM", "created_by": "Greg_Ward", "parent_id": "hdri_000633", "id": "hdri_000637"}