{"body": "Hi Adriana,\n\n\nif I'm not mistaken you want to look into the use of 'pvalue'.\nNote, that RGB values will give you some idea about the colorimetric \nproperties of any point in the scene, but if you are remotely interested \nin accurate data - your comparison with the spectroradiometer suggests \nthis - then you might want to look into spectral rendering. You can also \ndo that with RADIANCE. see e.g. Yang & Maloney, 2001, Vision Research, \n41:2581-2600 (the appendix).\nAs far as I remember RADIANCE will return RGB values < 0 and > 1, and \nit's up to you how you interpret this data, i.e. outside of the \nRGB-gamut of the default phosphors (also somewhere defined in RADIANCE), \nwhich will definitely become an issue with day-light scenes.\n\n\nGood luck!\n\n\nalexa\n\n\n\n\nalira at gsd.harvard.edu wrote:\n>    hi all,\n> \n>    I'm starting to use Radiance and I want to work with it in order to\n> simulate both daylight and artificial light. I want to change both the\n> RGB propeties of the light source and the materials. After Radiance\n> analizes the scene one can obtain as the output data, the luminance of\n> any point I select in my scene. Besides knowing what is the luminance\n> in any desired point, I'm very interested in knowing what is the RGB\n> component also of any point of the scene (such as if I were measuring\n> the RGB spectral component in several points of a room with a\n> spectometer). Is that possible? And if yes, what do you recommend me to\n> do in order to obtain this as an output data?\n> \n>    I would appreciate any help.\n> \n> Than you,\n> -adriana\n> \n> \n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nDr. Alexa I. Ruppertsberg\nDepartment of Optometry\nUniversity of Bradford\nBradford\nBD7 1DP\nUK\n\n\nemail: \ta.i.ruppertsberg at bradford.ac.uk\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-August/002914.html).</sup>", "attachments": [], "created_by_name": "Alexa I. Ruppertsberg", "created_at": "August 25, 2005 at 11:39AM", "created_by": "Alexa_I._Ruppertsberg", "parent_id": "radiance-general_002910", "id": "radiance-general_002914"}