{"body": "Jeffrey McGrew wrote:\n\n\n> Jack de Valpine wrote:\n>\n>> Hi Jeff,\n>>\n>> When you say 3D Studio do you mean Max or Viz? There is an okino \n>> polytrans plug-in for Max for geometry conversion in/out. Though I do \n>> understand that the main issue is getting the material assignments \n>> from Revit as well.\n>\n>\n> Once you link in a Revit model into Max or Viz, the material \n> assignments are there, so I'm assuming if you bound the linked model \n> that any export would include the material assignments, for it's just \n> a mesh in 3D Studio now. While I've got access to Viz right now, I \n> could get access to Max instead, so I'll check out that plug-in.\n>\nYes, but I would imagine the most seamless link would be Revit to Viz?\n\n\n>> Also here is something that I grabbed off of the following list: \n>> http://www.formz.com/forum/forum_archive/forumC/general/186.html\n>>\n>> There are a number of limitations and features of 3DS format that we\n>> must keep in mind. First and most important limitation is the 65535\n>> triangle limit on any single object. The 3DS file also has an object\n>> limit of 65535 objects.\n>\n>\n> Oh man, I'm sure I'm blowing past that limit. I'll look up the number \n> of faces in the model when it's brought into 3D Studio, but this is a \n> big ol' problem with Revit in general: that it allows you to make \n> huge, highly detailed models of buildings that work very well in Revit \n> but can choke other 3D software that's not meant to take models with \n> so many surfaces...\n>\nYes, but the thing to remember is that the 3ds format is really really \nancient. It is probably around for convenience more than anything else \nand probably works well on models of objects. So this is really an issue \nwith the format not revit, max, viz or whatever else.\n\n\n-Jack\n\n\n\n\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-December/003167.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "December 21, 2005 at 07:54PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_003151", "id": "radiance-general_003167"}