{"body": "It's an ideal \"crowdsourcing+research\" problem, but it still needs some \nstaffing. Maybe, if I can get some funding...\n\n\nOn 2010-04-27 10:44:31 -0700, Jack de Valpine said:\n\n\n> Hi Dan,\n> \n> There have been questions and discussions on a material database. But I \n> think that given the quantity and variety of materials out there this \n> quickly gets out of control. Consider glazing alone with something like \n> Optics5  (a complete software package!) for dealing with this class of \n> materials.\n> \n> Perhaps another way to consider the forest is by estimating an average \n> transmittance and then just using a trans material. One could even vary \n> this over some vertical dimension.\n> \n> Best,\n> \n> -Jack\n> \n> \n> Dan Glaser wrote:\n>> Dear Jack and Lars,\n>> Thank you very much for the timely modeling advice-- yes, I can see how \n>> calibrating the photographs can help with selecting the right color for \n>> the stone and brick.  Also, thanks for the tips on color variation \n>> strategies.\n>> I will let you know what I come up with for the texture.  I know its a \n>> cross between an art and a science in doing so (e.g. see the \"forest\" \n>> example below)-- just thought maybe someone have studied this material \n>> before.  On a related note, have there been discussions on having a \n>> material database at radiance-online/elsewhere? On a project where I \n>> had to quickly model how a forest would impact the lighting on a \n>> facade, I hacked perforate.cal instead of trying to model the actual \n>> trees (trunks, branches, needles, yuk).\n>> \n>> This was the real scene:\n>> \n>> http://www.lightfoundryllc.com/materials/forest/forest.jpg\n>> \n>> and this was what was modeled:\n>> \n>> http://www.lightfoundryllc.com/materials/forest/model.jpg\n>> \n>> and the script I hacked:\n>> \n>> http://www.lightfoundryllc.com/materials/forest/forest.cal\n>> \n>> Given more time I would have tried to increase the density of the dot \n>> pattern near the ground/etc.\n>> - Dan\n>> \n>> \n>> \n>> On 4/26/2010 10:05 AM, Jack de Valpine wrote:\n>>> Hi Dan,\n>>> \n>>> I just got back in and see that I missed this so perhaps my reply is \n>>> too late to be of use. In any event here are a few thoughts.\n>>> \n>>> If you want to create \"high quality\" renderings then the best thing to \n>>> do is to obtain some good photographs of these materials. I know that \n>>> this can be a challenge as it means that you have to be much more \n>>> demanding with the client in terms of the information that they need to \n>>> provide, such as access to decent samples, but it can definitely be \n>>> worth it. In my experience the best thing to do is to shoot your own \n>>> photos of good samples and calibrate with the Macbeth Color Checker (or \n>>> some other mechanism for calibrating reflectance and color). That way \n>>> you have control over everything. On the other hand if you could \n>>> perhaps get representative photos from the stone supplier then you \n>>> could perhaps use these to develop image patterns that can be adjusted \n>>> to the estimated reflectance information that you do have. Note though \n>>> if you want the rough surface of the materials to cast shadows \n>>> depending on how the light is hitting the surface (time of day \n>>> perhaps), then you will have to use actual geometry, which is going to \n>>> be a lot more complicated.\n>>> \n>>> Again depending on your rendering/visualization goals and if it just is \n>>> not possible to get good photos, another approach is to consider what \n>>> is important to demonstrate given the possible view(s) that you will be \n>>> showing. For stone masonry materials the first thing that I always \n>>> consider is how much variation is there from stone to stone. My guess \n>>> is the sandstone is supposed to have relatively low variation, whereas \n>>> the brick seems to have quite a high degree of variation. This kind of \n>>> variation can be accounted for procedurally with a tiling function that \n>>> varies the brightness and/or color of the tile (stone unit). Another \n>>> item to consider at this macro level is the relative reflectance of any \n>>> mortar or joint condition, this again can be treated as part of a \n>>> procedural tiling function. With these two items accounted for the next \n>>> thing to try to approximate to some level is variation within a given \n>>> stone unit. This is where things get a bit more challenging with the \n>>> materials you are looking at. The sandstone can probably be \n>>> approximated with some variation of noise functions. The brick though \n>>> demonstrates some pretty sharp cutoffs in variation and color which I \n>>> am not sure offhand how I would treat. Just to get the variation it \n>>> might be worth searching for imagery online and seeing if there is \n>>> something that you could use to get the variation.\n>>> \n>>> Hope this helps.\n>>> \n>>> Regards,\n>>> \n>>> -Jack de Valpine\n>>> \n>> \n>> \n>> --\n>> LF logo \tDaniel C. Glaser, PhD, LEED AP\n>> Principal\n>> Light Foundry, LLC\n>> T: 510.387.8890 | F: 315.410.2617\n>> www.lightfoundryllc.com <http://www.lightfoundryllc.com>\n>> \n>> \n>> \n>> \n>> \n>> \n>> \n>> ------------------------------------------------------------------------\n>> \n>> _______________________________________________\n>> Radiance-general mailing list\n>> Radiance-general at radiance-online.org\n>> http://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\n\n\nRandolph Fritz\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-April/006790.html).</sup>", "attachments": [], "created_by_name": "R Fritz", "created_at": "April 28, 2010 at 03:49PM", "created_by": "R_Fritz", "parent_id": "radiance-general_006743", "id": "radiance-general_006790"}