{"body": "Hi Julien,\n\n\nYou can simulate an estimate of electrochromic glass performance fairly\neasily with SPOT Pro <http://www.daylightinginnovations.com/spot-home>.  It\nis a work-around and performance estimate but does not have the limitations\n(smearing that Rob mentioned) that a daylight cofficient approach might\nhave with a specular product.  You can also control the electrochromic via\nan actual exterior photosensor signal or using advanced manual control\nalgorithms.\n\n\nIn SPOT to simulate electrochromic glazing, you just apply a \"multiplier\"\nglazing as the window treatment.  Your base window might have the ~58%\ntransmittance of a clear state.  Then, say, the most tinted state is ~1%,\nyou can define a 1.7% transmittance glass and apply as the window\ntreatment.  This is not the most accurate way to model in Radiance as it\nintroduces another uneccesary surface and reflectance interactions but\nshould work well enough for annual space performance analysis.  This only\nmodels the top and bottom tint state, but I think it comes pretty close to\nsimulating annual performance as I am not sure how often in between states\nare even used.  As a designer or an occupant, I would want to have the\ndarkest tint if I was under direct sunlight and the clearest tint\notherwise.  They exist, but there are limited hours where there is no\ndirect sunlight but the clouds/sky are just too bright.  SPOT would not\ncapture these 2nd and 3rd state conditions.\n\n\nA more accurate generic electrochromic model is in the works and will be\nincluded in an upcoming SPOT release.\n\n\nCheers,\nZack\n\n\nOn Wed, Jul 6, 2016 at 4:03 AM, Julien Boutillier <boutillier at estia.ch>\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-July/011845.html).</sup>", "attachments": [], "created_by_name": "Zack Rogers", "created_at": "July 06, 2016 at 11:25AM", "created_by": "Zack_Rogers", "parent_id": "radiance-general_011841", "id": "radiance-general_011845"}