{"body": "Hi Rob,\n\n\nRob Guglielmetti wrote:\n> Jack de Valpine wrote:\n>\n>>\n>> Probably the best way to get a more sophisticated material \n>> description for a specific glazing make-up is to export glazing specs \n>> from Optics one at a time (ie the glass used for surface 1/2 as one \n>> export and the glass used for surface 3/4 as another export) and then \n>> use the RGB and specularity values with the glaze.csh script that \n>> comes with Radiance. The script will enable you to output a more \n>> sophisticated material definition that better accounts for angular \n>> dependencies in the material. Note that the geometry is normal \n>> dependent, requiring that the glass geometry be modeled with the \n>> normal being pointed to the interior of the building (hope I got this \n>> right, I am working off memory here).\n>\n> Hi Jack,\n>\n> I forgot all about glaze!!  Thanks for the reminder.  I also had no \n> idea that Greg added the ability to read in files; this makes it \n> infinitely more useful. I assume you simply take all the \n> glazing/coatings you want and export each to a radiance file from \n> Optics5, and then feed them to glaze with the -f switch, huh?  That's \n> great, you guys.  Thanks again to Greg for the work, and Jack is being \n> very modest in his post by mentioning the tool but not mentioning the \n> fact that his company funded the work.  Thanks to you both.\n>\nUnfortunately it is not quite that streamlined.... The -f switch takes a \nfile with specific formatting (one glazing description per line) which \nis then parsed by the glaze script. I think that if you run glaze -f \nwith nothing else it will spit out the formatting requirements... I \nshould probably come up with an example to show this... Let me see what \nI can do by way of example on this to demonstrate how it works. You are \nright though that the -f switch makes it way more convenient to use \nglaze for specific libraries of glazing on a per project basis.\n> And yes, the normal should face into the building. (the script \n> actually throws up a nice little ASCII section for reference. =8-)\n>\n> - Rob\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n>\n\n\n\n\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-May/003633.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "May 01, 2006 at 05:16PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_003627", "id": "radiance-general_003633"}