{"body": "Dear Group\n\n\nThanks for all of the suggestions regarding my rendering problems. I know \nits taken me a while to reply back about this issue to the group. I have \nspent some time investigating these issues that I am having. This way, I at \nleast try to solve my problems myself before bringing to this group.\n\n\nFirst, the dark splotches:\n\n\nhttp://i35.photobucket.com/albums/d178/marcdevon/AFrame2_Camera6_final.jpg\nhttp://i35.photobucket.com/albums/d178/marcdevon/AFrame2_Camera03_final.jpg\n\n\nI think I have some idea as to what is causing this issue. Generally when I \nrender, I perform a small overture calculation at a 100 x 100 pixel \nresolution. The ambient settings are generally at -aa 0.1 and -ar 0. The \nnext step is to take a medium resolution overture usually at 500 x 500 \npixels. The settings are generally set at -aa (.15 - .2) -ar = maximum scene \nsize as determined by getinfo -d in inches (basically a 1 inch grid).  The \nfinal render is performed at -aa (.25 - .3) and -ar = maximum scene size as \ndetermined by getinfo -d in inches/(2 to 10) (basically a 2 - 10 inch grid) \ndepending on the illumination contrast. The -ad and -as settings are \ngenerally set based on the illumination contrast in the scene. For these \nrenderings, I set -ar very low since I had already rendered it at the same \nresolution with higher -ar settings. Essentially, I wanted to force it to \ninterpolate using the existing ambient data. The splotches usually come in \nas the -ar parameter degrades. The number of splotches depends on how low \nthis parameter has been set. The reason why I ask is because this seems to \nme to have started occuring recently even though I have used the \naforementioned technique for some time now.\n\n\nFor the bright splotches here:\n\n\nhttp://photobucket.com/albums/d178/marcdevon/th_room2a_view2_render1.jpg\n\n\nit looks like mkillum saves the day again. I tried Greg's suggestion of \nsetting an illum at skylight openings at the surface level of the ceiling. \nThis seems to have done the trick. It's funny but I ran dozens upon dozens \nof renderings and for some reason I thought these artifact were due to the \nbright spots on the floor rather than the skylight openings. Here are the \nresults:\n\n\nhttp://i35.photobucket.com/albums/d178/marcdevon/room2_view3.jpg\nhttp://i35.photobucket.com/albums/d178/marcdevon/room2_view2.jpg\n\n\nMay I ask, why is the brightness of the skylight openings more prone to \ncausing these artifacts rather than a bright spot on the floor or wall?\n\n\nWhen initially attempting to find a solution to this problem, I tried to go \nback to issues that Rob Guglielmetti  was experiencing a couple of years \nback with a museum that he was modeling. At one time he documented his \nprogression on his blog but the page has since been deleted. I did remember \na couple of threads from July/2004 which discussed whether to place illums \ninside or outside the scene:\n\n\nhttp://www.radiance-online.org/pipermail/radiance-general/2004-July/001871.html\nhttp://www.radiance-online.org/pipermail/radiance-general/2004-July/001953.html\n\n\nThe reason why I have been hesitant to using illums inside is because I \nthought that mkillum could only simulate illumination that's a smooth \nfunction with no discontinuities. I thought that this may be an issue when \nwindows have lites. I did a little experiment with another old scene of \nmine. It is a window that I knew would receive direct illumination from the \nsun. I wanted to place the illums on the inside to see if mkillum would pick \nup the lites. Here is the result:\n\n\nhttp://i35.photobucket.com/albums/d178/marcdevon/room2_camera1_tm.jpg\n\n\nI am impressed that mkillum has able to detect the presence of lites in the \nwindows as you can see their occluding effect by the direct sunlight that is \non the floor.  By placing the illums on the inside of this room, I was also \nable to eliminate some bright splotches (although less conspicuous than the \nprevious scene) from this room.\n\n\nIn my investigation of course there are more questions/issues that has \narisen.  From another test room, I wanted to see how much the smoothness the \nindirect calculation would improve by placing an illum inside its skylight. \nThis is what's happened:\n\n\n\n\nhttp://i35.photobucket.com/albums/d178/marcdevon/room1_12_amb_view4.jpg\nhttp://i35.photobucket.com/albums/d178/marcdevon/room1_12_amb_view5.jpg\nhttp://i35.photobucket.com/albums/d178/marcdevon/room1_12_amb_view6.jpg\nhttp://i35.photobucket.com/albums/d178/marcdevon/room1_12_amb_view8.jpg\n\n\nThe indirect illumination in the corner I do not believe is correct. I know \nthat this problem isn't due the presence of the illum in the skylight at the \nsurface level of the vaulted ceiling. This seems to occur sort of \nhaphazardly. Here is the same room with the same day/time settings, albeit \nwith different materials, and this problem didn't occur:\n\n\nhttp://i35.photobucket.com/albums/d178/marcdevon/room1_b_view4_render2.jpg\nhttp://i35.photobucket.com/albums/d178/marcdevon/room1_b_view5_2.jpg\nhttp://i35.photobucket.com/albums/d178/marcdevon/room1_b_view6.jpg\n\n\nThis problem that I am receiving looks similar to issues that I am having \nwith this rendering (right side near the corner):\n\n\nhttp://i35.photobucket.com/albums/d178/marcdevon/KountryKitchen_view2_render3_3.jpg\n\n\nAlso, for the previous rendering and the next, I do not know what's causing \nthe gray artifacts on the floor nearby the dishwasher and lower cabinets:\n\n\nhttp://i35.photobucket.com/albums/d178/marcdevon/KountryKitchen_view1_render3_99.jpg\n\n\n\n\nGenerally, what I wish to be able to acquire is achieving a higher level of \npredictability so that I may take a scientific approach to rendering rather \nthan constantly tinkering. Sometimes when I think I got it, I later realize \nthat I don't. That's pretty much it in a nutshell.\n\n\n\n\nThanks everyone for all of your help.\n\n\n\n\nMarcus\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-December/003179.html).</sup>", "attachments": [], "created_by_name": "Marcus Jacobs", "created_at": "December 23, 2005 at 07:25PM", "created_by": "Marcus_Jacobs", "parent_id": "radiance-general_003112", "id": "radiance-general_003179"}