{"body": "> For a research project using Ecotect and Radiance, me and my colleague\n> are looking for /specularity/ values of building materials.\n\n\nDear Saskia,\n\n\nI try to help out a bit, even though I will not provide you with any \nsuch value here. I hope that I will be able to explain why.\n\n\nFirst, the term. I guess you are referring to specular reflectance, \nmaybe also direct transmittance. These define the fraction of light \ngetting reflected / transmitted directly. With a lot of simplification \nsomething like incident angle equals outgoing angle for reflection \n(mirror), or light passing straight through (glass). Be aware that the \nreal world is not that simple, but let us assume it is.\n\n\nIf you want to measure the specular reflectance, you typically do it \nindirect. A very common approach is to use an integrating sphere with \neither a photocell (if you do not need color information) or a \nspectrometer connected. In a first run, you would measure the total \nreflectance. In the second, you would open a small hole in the sphere so \nthat light reflected according to the \"incident=outgoing angle\"-rule \nwould simply escape the sphere and thus be skipped in the measurement. \nThis leads to the diffuse reflectance. Substracting both would give you \nthe specular reflectance. For transmissive samples, the procedure works \nmore or less the same. Doing a direct measurement is rather \ncomplicated... Measurements on an integrating sphere are a standard \nmeasurement.\n\n\nThe procedure seams to be straight forward. However it is not. First, \nyou can never measure only one outgoing direction, and you never have \nonly one incident direction. There is always an angular range, larger \nthen zero. Imagine the device for the measurement described above - \nthere will be a light beam used, and that is not perfectly parallel and \nhas a diameter. And if you open a hole in the sphere, that has more then \nzero mm^2 area - thus it excludes more then one direction. In other \nterms, you are always talking about solid angles.\n\n\nThe reason is not only imperfection in making measurement devices. Even \na very good mirror reflects light not only into one direction. For each \nincident direction you will always get a distribution of reflected and, \nsometimes, transmitted light. There are some labs offering measurement \nof such distributions (maybe you have seen candela distributions for \nelectrical lighting - it is something like that), I have been working at \none until just recently. Using the measured data is not simple, as the \ndata isn't. That is why the observation that for some surfaces, there \nare predominant directions where most of the light is directed to, led \nto the use of terms such as specular and diffuse. We use these \nsimplifications to be able to describe the characteristics and, in \nsimulation, we use these to optimize algorithms.\n\n\nNow, for building materials, you will find very different levels of \nsupport from manufacturers. Some will give you detailed information on \nreflective and transmissive properties (go to the website of Alanod, \nthey let you download the bidirectional reflection distribution data of \ntheir frontside mirrors - the distribution I describe in the paragraphe \nabove at a high angular resolution). Quite a lot of manufacturer of \nmaterials where lighting is involved will give you some values like \ndirect/specular and diffuse (glazing, sunshades, ...) but not more. And \nthen, a lot of manufacturers may be able to give you color information.\n\n\nYou will also find that, depending on the application, different terms \nare used when talking about reflective and transmissive characteristics. \nGloss, shininess, application standards differ often from what is more \nestablished in physics.\n\n\nThe conclusion is that there is no way to simply collect specularity \nvalues of building materials. Define what you are interested in and what \nyour application is. If you are talking about appearance, energy \ntransports, ... Are you looking at facades? Glass? Paints? Different \npolishing techniques?\n\n\nI hope that this helps to find a starting point...\n\n\nCheers, Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-June/007011.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "June 23, 2010 at 04:35PM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_007010", "id": "radiance-general_007011"}