{"body": "On 22.09.2005, at 00:48, Rob Guglielmetti wrote:\n\n\n> Kirk Thibault wrote:\n>\n>\n>> Has anyone using Mac OSX with RADIANCE tried rigging the OSX built- \n>> in  xgrid app to distribute rendering and general crunching over  \n>> a  cluster of Macs?\n>>\n>> http://www.apple.com/server/macosx/features/xgrid.html\n\n\n[...]\n\n\n> Kirk, I hadn't seen this xGrid before; this is something they added  \n> with 10.4 (I'm still on 10.3 and an OLD Powerbook) and it looks  \n> interesting!\n\n\nYou can download xGrid for 10.3 as well (accordign to the PDF  \navailable on\nthe page above - nice and short intro).\n\n\n> However, there is a long history of file locking issues with  \n> Radiance and multiple machines.\n\n\nReading the man-page for xgrid I think file locking of the amb-file  \nwould\nbe the only problem as the controller process _copyies_ the whole  \nworking\ndirectory to the clients.\n\n\nEverything else could be as simple as this example (from the man-page):\n\n\n > Submit myscript with the files in the input directory.  Send email to\n > somebody at apple.com on every job state change. Then retrieve the  \nresults\n > and save the stdout and stderr streams in files instead of  \nprinting them\n > out to the terminal and save the output files in the specified  \ndirectory.\n > Finally delete the job:\n >\n >     $ xgrid -job submit -in ~/data/working -email somebody at apple.com\n >     myscript param1 param2\n >     { jobIdentifier = 27; }\n >     $ xgrid -job results -id 27 -so job.out -se job.err -out job- \noutdir\n >     $ xgrid -job delete -id 27\n\n\nSeems like no changes to the code are necessary. It would be nice\nif someone with a flock of Macs at his/her disposition could test\nthis sometimes ...\n\n\n\n\nAs a related note on OS X 10.4:\n\n\nI'm trying to get a bit of performance from my G5 iMac. Compiling the\nRadiance source is a matter of minutes. But when I try Mark's benchmarks\n(http://mark.technolope.org/pages/rad_bench.html) the rpict time is  \nworse\nthan his results for an 1.6 GHz P4-M.\n\n\nI thought a 2 GHz PowerPC would perform much better than that. I have\nonly tested a few compiler optimizations so far but I don't think they\nwill change that much any more. Apple ships gcc 4.0 as default compiler\nfor 10.4. Could this be the reason?\n\n\nWhat performance should I expect from the G5?\n\n\n\n\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-September/002946.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "September 22, 2005 at 11:36AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_002941", "id": "radiance-general_002946"}