{"body": "Thanks for this pat on the back, Greg.\n\n\n> I guess you'd want to correct for vignetting in whatever projection you measured your vignetting error, probably before getting to this reprojection stage.  I still think the easiest thing is to correct for vignetting and pixel size at the same time, then go ahead and treat the image as if its an equidistant projection.  In other words, divide by the solid angle ratio (i.e., multiply each pixel by theta/sin(theta)) and then pass it through findglare as you would normally.\n\n\nWill do. I shall report back to this thread. One last sub-question, if I may:\n\n\n> An overall calibration of the image luminance can be carried out (I\n> think) by measuring the vertical illuminance at the lens when the\n> exposure-bracketed sequence is taken, and then running findglare and\n> glarendx -t ver_illu on the HDR, which should give a calibration\n> factor that can then be used to fiddle with the EXPOSURE= line. This\n> is probably more accurate than calibrating against spot meter\n> readings. So far, so good.\n\n\nDoes this make sense? Is this what the NYT trolley did? Spot luminance\nmeter calibrations are a bit messy, because it's very difficult to\nmatch the target circle of the luminance meter against a pixel value\n('L' in ximage), or against a box average\n('drag-your-mouse-in-ximage', then hit 'L')?\n\n\nThe problem with lux meters, on the other hand, is that cosine\ncorrection for near-the-horizon-angles is hopeless, even for 'proper'\nilluminance meters. Some manufacturers will not even give you a number\nfor angles > 80deg, which is a problem almost identical to the HDR\nprojection function. Perfect alignment appears to be critical for\nlight sources close to the visible horizon of the meter, irrespective\nof the cos weighting.\n\n\nCheers and have a pleasant weekend\n\n\nAxel\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2012-February/000352.html).</sup>", "attachments": [], "created_by_name": "Axel Jacobs", "created_at": "February 03, 2012 at 01:21PM", "created_by": "Axel_Jacobs", "parent_id": "hdri_000348", "id": "hdri_000352"}