{"body": "On May 25, 2004, at 8:16 PM, Mark de la Fuente wrote:\n\n\n> Rob, Could not agree more.  I think people put quite a bit of stock in \n> a well rendered image and the arguments can get blurred.  Especially \n> when you are talking about something as subjective as lighting as a \n> whole.  Are you after accurate results for research purposes, close \n> enough results, convincing pictures, etc? \n\n\nThe problem with convincing pictures is that a lot of clients don't \nhave the eye to spot the con jobs.  People are easily fooled by a slick \nimage that looks nice, but the image can easily be telling a false \nstory.  You mention the subjectivity of lighting, and now I couldn't \nagree with you more; this is one of the things that fascinates me about \nRadiance, is that the Radiance image format is so much more than a \npicture -- it's a rich dataset.  And the Radiance toolkit includes all \nthese other great tools to extract that data and manipulate it, in ways \nthat tell an honest story.  pcond obviously comes to mind here.\n\n\n> I know we have some very impressive images here in our office that \n> were developed with the latest Lightscape/Viz that look (and were \n> developed to look) identical to the photos they were extrapolated \n> from.  And the associated false color images actually gain a certain \n> amount of credibility based simply on how \"real\" the renderings look.  \n> Which as you pointed out has nothing to do with the accuracy of the \n> calculation result since the ray-traced part does not affect the \n> numerical results!  ;)\n\n\nRight!  It's funny, I've been doing this for quite a while now (first \nwith Lumen Micro & AGI, then Lightscape, and now Radiance) and I have a \npretty boring collection of images.  But my images (and data) tell a \nricher story than the pretty pictures, to me and my colleagues.  There \nare a few gifted people on this list who have mastered Radiance to the \npoint that they can produce physically accurate AND pretty pictures, \nand I guess the rest of us settle for accuracy over slick glamour.  All \nof us are using these tools to pursue the elusive goal of simulating \nreality, and to me that's just incredibly cool.  I'm intrigued by the \nslick renderings coming out of the top visualization firms, and more \nimpressed every day.  But it's not what I want to do.  I want to \nproduce renderings that are tools.  I wish the industry as a whole \nrecognized the value of them more than they do.\n\n\n\n\n    Rob Guglielmetti\nwww.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-May/001736.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "May 27, 2004 at 12:37AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_001733", "id": "radiance-general_001736"}