{"body": "Hi Caroline,\n\n\nFirst off, there is a Desktop-Radiance Yahoo forum, and you should \ndefinitely ask around on there too, especially for your falsecolor scale \nquestions.  I'm not familiar with the Windows version(s) of the various \nRadiance binaries.\n\n\nGiulio gave you some good leads there regarding sky simulations.  This \nkind of question pops up on here regularly, and indeed I went through \nthe exact same experience as you.  I'd read about how accurate Radiance \ncould be (read that again, the semantics are important), then did my \nfirst daylight simulation and was disappointed.  Lots of words have been \nput down on paper about the difference between real, measured skies and \nsimulated ones.  Papers with lots of Greek symbols fill the servers at \nuniversities & research facilities worldwide.  Greg Ward can cut through \nthe haze as well as anyone regarding this, but being all smart and \n\"mathy\", his explanations still confused me for a while.  Eventually I \ngot it:\n\n\nNature is way too complicated.  To think that one or even a thousand \nformulas could mathematically describe the luminance distribution of the \nnearly infinite number of skies is pure folly.\n\n\nWhat has been proven by Dr. Mardaljevic is that Radiance can simulate \nlit environments with a high degree of accuracy.  What he had was an \nincredibly fine dataset of real sky luminance and building interior \nilluminance.  When this data was fed to Radiance, he got very close to \nthe same answers.  But most of us do *not* have an incredibly fine \ndataset of real sky luminance and building interior illuminance, we have \na lat/long, maybe some sky turbidity info, and the woefully inadequate \nsuite of sky conditions descriptors \"clear, intermediate and overcast\". \n  Whoopie. So, it's no wonder that our initial forays into daylight \nsimulation with Radiance tend to be confidence shakers.\n\n\nThe truth is Radiance can be as accurate as you want, but most of us are \nstarting with input that is inherently inaccurate.  It's a good starting \npoint, but you simply can't expect your results to match up to reality \nwith any kind of high precision when using these basic CIE skies.  Don't \nget me wrong, the CIE skies can still be used to make valid design \ndecisions, and certainly comparative studies of building form and \nmaterial will be quite valid.  But it's when people want to take a light \nmeter and have the LCD display show the same number that Radiance spat \nout that the disappointment creeps in.  For pure numeric accuracy, which \nDr. M proved is possible, you need more measured info about your site. \nMy experience with Radiance is that it's very very good, certainly the \nbest available tool out there for daylighting analysis.  But I don't \nexpect my numbers to be ±5%, or even ±10% sometimes.  But I believe ±20% \nis a fair goal.  Our faith in the numbers is based on experience and \nintuition and we have to work hard to get this point across to our \nclients all the time.  In my view, it's been worth the effort.\n\n\nHopefully the Greek symbols types will weigh in on this too; it's an \ninteresting topic.\n\n\n\n\n\n\n      Rob Guglielmetti\n\n\ne. rpg at rumblestrip.org\nw. www.rumblestrip.org\n\n\n\n\nAnd, while I'm thinking of it, from Ian Ashdown's excellent \"Thinking \nPhotometrically\" Lightfair course notes \n(http://www.helios32.com/Thinking%20Photometrically%20II.pdf):\n\n\n\"One major problem is that the calculations are necessarily based on the \nvarious CIE or IESNA sky models, which predict illuminances based on \naverage sky conditions. It is not uncommon for instantaneous measured \nilluminances to be more than twice or less than half of the mean \nilluminances predicted by clear and overcast sky models; the situation\nfor partly cloudy skies is even worse.\n\n\n\"As for daylighting calculations, it is likely that Jongewaard (1993) is \ncorrect – the results are only as accurate as the accuracy of the input \ndata. Done with care, it should be possible to obtain ±20 percent \naccuracy in the photometric predictions. However, this requires detailed \nknowledge and accurate modeling of both the indoor and outdoor \nenvironments. If this cannot be done, it may be advisable to walk softly \nand carry a calibrated photometer.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-April/001576.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "April 06, 2004 at 05:37PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_001573", "id": "radiance-general_001576"}