{"body": "This message is in MIME format. Since your mail reader does not understand\nthis format, some or all of this message may not be legible.\n\n\n------_=_NextPart_001_01C3A928.89726F30\nContent-Type: text/plain\n\n\nHi,\n\n\nI'm currently using Radiance compiled to run under Windows Services for Unix\n(Interix) and am attempting to upgrade from my current version (3.1) to the\nlatest version (3.5).  I have managed to get 3.5 to compile without any\nerrors (except for trad and rholo, which I'm not too worried about right\nnow), however I am experiencing problems when using rpict.  The other\ncomponents (rtrace, rview, etc) seem to be working correctly (or at least\nproducing results similar to my previous installation) however the images\nproduced rpict are looking very strange (and very different to rview).  \n\n\nIt is kind of hard to describe the results I am getting in plain text, but\nif for example I use rpict to produce a fisheye view of a CIE overcast sky\nthen it produces a luminance pattern that starts off from the horizon\ngetting brighter as it heads towards the zenith before suddenly dropping to\nzero about a third of the way up from where it increases again until about\n2/3rds up where it drops to zero again, so the luminance distribution from\nhorizon to zenith looks something like a saw tooth (rather than smoothly\nincreasing from horizon to zenith as it should).  I get a similar effect\nacross surfaces when I render more complex scenes.  The same scene with the\nsame settings works on the older version of rpict.  The effect is as if a\nvariable somewhere is increasing beyond its maximum range and wrapping back\naround to zero.\n\n\nI'd be very grateful for any help as to what the problem might be (and how I\ncan fix it).  Perhaps there is some compiler switch that I need to set?\n\n\nKind regards,\n\n\nAndy Stone\n\n\n------_=_NextPart_001_01C3A928.89726F30\nContent-Type: text/html\nContent-Transfer-Encoding: quoted-printable\n\n\n<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 3.2//EN\">\n<HTML>\n<HEAD>\n<META HTTP-EQUIV=3D\"Content-Type\" CONTENT=3D\"text/html; =\ncharset=3DUS-ASCII\">\n<META NAME=3D\"Generator\" CONTENT=3D\"MS Exchange Server version =\n5.5.2653.12\">\n<TITLE>Compiling Radiance under Interix (rpict problems)</TITLE>\n</HEAD>\n<BODY>\n\n\n<P><FONT SIZE=3D2>Hi,</FONT>\n</P>\n\n\n<P><FONT SIZE=3D2>I'm currently using Radiance compiled to run under =\nWindows Services for Unix (Interix) and am attempting to upgrade from =\nmy current version (3.1) to the latest version (3.5).&nbsp; I have =\nmanaged to get 3.5 to compile without any errors (except for trad and =\nrholo, which I'm not too worried about right now), however I am =\nexperiencing problems when using rpict.&nbsp; The other components =\n(rtrace, rview, etc) seem to be working correctly (or at least =\nproducing results similar to my previous installation) however the =\nimages produced rpict are looking very strange (and very different to =\nrview).&nbsp; </FONT></P>\n\n\n<P><FONT SIZE=3D2>It is kind of hard to describe the results I am =\ngetting in plain text, but if for example I use rpict to produce a =\nfisheye view of a CIE overcast sky then it produces a luminance pattern =\nthat starts off from the horizon getting brighter as it heads towards =\nthe zenith before suddenly dropping to zero about a third of the way up =\nfrom where it increases again until about 2/3rds up where it drops to =\nzero again, so the luminance distribution from horizon to zenith looks =\nsomething like a saw tooth (rather than smoothly increasing from =\nhorizon to zenith as it should).&nbsp; I get a similar effect across =\nsurfaces when I render more complex scenes.&nbsp; The same scene with =\nthe same settings works on the older version of rpict.&nbsp; The effect =\nis as if a variable somewhere is increasing beyond its maximum range =\nand wrapping back around to zero.</FONT></P>\n\n\n<P><FONT SIZE=3D2>I'd be very grateful for any help as to what the =\nproblem might be (and how I can fix it).&nbsp; Perhaps there is some =\ncompiler switch that I need to set?</FONT></P>\n\n\n<P><FONT SIZE=3D2>Kind regards,</FONT>\n</P>\n\n\n<P><FONT SIZE=3D2>Andy Stone</FONT>\n</P>\n\n\n</BODY>\n</HTML>\n------_=_NextPart_001_01C3A928.89726F30--\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-November/001188.html).</sup>", "attachments": [], "created_by_name": "Andy Stone", "created_at": "November 12, 2003 at 02:23PM", "created_by": "Andy_Stone", "parent_id": "radiance-general_001190", "id": "radiance-general_001188"}