{"body": "Dear John,\n\n\nI meant a different thing: The implementation of the Perez sky model in \nRADIANCE is made in a way, that you plug in site information and direct \nand diffuse irradiation (regardless if those values a measured data or \ntest reference years) and you will get a RADIANCE description of the sun \nas light and source. This model has been validated on different datasets \nin the past. If you change then the size of the source(from 0.533  to \n0.5) without a change of the \"light\" parameters (which are produce by \ngendaylit) and keeping all other factors, than you decrease the total \nflux of the sun (not of the sky, this remains the same since the \nparameters are the same). And therefore you get different results than \nusing the original version.\n\n\nThis has nothing to do with the accuracy of the input radiation data, \nwhich is another issue which could be discussed.\nIt's just a simple implementation matter of the tool. I totally agree \nthat the size change of the sun has no significant impact as long as the \ntotal flux is kept (which isn't in our case here).\n\n\nJan\n\n\nJohn Mardaljevic wrote:\n\n\n> Greg/Jan,\n>\n> > So I assume you changed the value in the source code, or? But as\n> > long as you are not adapting the radiance value of the light source\n> > (which you don't do), you'll loose more than 10% of the flux of the\n> > sun by reducing the value from 0.533 to 0.5 !!\n> >\n> > Is there any reason to use 0.5 instead of 0.533?\n>\n> Whether this matters depends on how you determine the solar  \n> radiance.  Usually, it is derived from measurements of direct normal  \n> irradiance or illuminance (commonly found in climate files).  Rarely  \n> is the solar radiance or luminance measured directly.  Provided the  \n> solar radiance is determined in a consistent fashion from  \n> measurements of direct normal, then there is negligible practical  \n> difference as far any evaluation is concerned - the flux will be the  \n> same whatever the solid angle used for the sun.\n>\n> In any case, the best measurements of direct normal are taken using a  \n> tracking device that commonly has an acceptance angle of 6deg (with,  \n> I recall, a fairly flat response).  This is because it is impractical  \n> to attempt to track the sun using anything with a much smaller angle,  \n> let alone an angle that matched exactly the solar disc.  So, when  \n> using these data from climate files etc., the difference between 0.5  \n> and 0.533 is made pretty much irrelevant because the sun radiance is  \n> being calculated from a measurement that includes a lot of  \n> circumsolar region also.\n>\n> Intriguingly, in practical terms, this matters more for overcast  \n> rather than clear sky conditions (I can almost hear the gasps of  \n> disbelief).  For clear skies, the solar radiance dominates the  \n> brightness of of the circumsolar region -- so the \"contamination\"  \n> that results from basing the solar radiance on a measurement that  \n> includes the contribution of the circumsolar region is small.   \n> However, when a sky is overcast, the measurement of direct normal (in  \n> the climate file) is that which results from a (sunless) 6deg patch  \n> of sky.  Say that value is used routinely in an annual calculation  \n> procedure to determine the radiance of the 0.5deg sun.  Then, for  \n> overcast days, the solar radiance will be about ~144 times the  \n> radiance of the background sky (i.e. [6/0.5]**2).  So, a brightish  \n> sun will be a permanent feature in all your overcast skies.  If your  \n> evaluation is very sensitive to the magnitude of the sky and sun  \n> radiance or luminance (as I suspect Jan's is), then this may be an  \n> issue.  It's probably wise to play around with a threshold value  \n> below which the sun radiance is set to zero.\n>\n> -John\n>\n> PS.  There is some discussion on related matters in chapter 3 here:\n> http://www.iesd.dmu.ac.uk/~jm/zxcv-thesis/\n>\n> -----------------------------------------------\n> Dr. John Mardaljevic\n> Senior Research Fellow\n> Institute of Energy and Sustainable Development\n> De Montfort University\n> The Gateway\n> Leicester\n> LE1 9BH, UK\n> +44 (0) 116 257 7972\n> +44 (0) 116 257 7981 (fax)\n>\n> jm at dmu.ac.uk\n> http://www.iesd.dmu.ac.uk/~jm\n>\n>\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n\n\n\n\n\n\nDipl.-Ing. Jan Wienold\nProject Manager\nFraunhofer-Institut für Solare Energiesysteme\nThermal Systems and Buildings, Lighting and Daylighting\nHeidenhofstr. 2, 79110 Freiburg, Germany\nPhone: +49(0)761 4588 5133 Fax:+49(0)761 4588 9133\njan.wienold at ise.fraunhofer.de\nhttp://www.ise.fraunhofer.de\n\n\nIn office: \nMo,Tue: 9:00-18:00\nWe-Fr:  8:30-14:00\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-April/003552.html).</sup>", "attachments": [], "created_by_name": "Jan Wienold", "created_at": "April 06, 2006 at 09:08AM", "created_by": "Jan_Wienold", "parent_id": "radiance-general_003544", "id": "radiance-general_003552"}