{"body": "Hi Greg!\n\n\n> Just finished with the Radiance workshop, so catching up on e-mails.\n\n\nI am curious to hear about it, will there be a documentation cd \navailable again? Hope ou had a nice time.\n\n\n> The \"glow\" type with an effective radius still illuminates the scene \n> correctly.  Base your radius on the distance over which you expect your \n> sources to be important.  Past that distance, they will be considered as \n> \"indirect\" sources.  One important caveat:  the smaller and brighter \n> they are, the more artifacts you will see from them if your radius is \n> too small.\n\n\nI will hide it behind an illum. The configuration is as follows: I group \nmy (artificial) light sources and define one illum sphere per groups of \nsources. That way, first I will have much less sources in the indirect \ncalculation, and second avoid these artefacts. Actually I was not aware \nabout the advantage of using glow instead of light modified sources. The \nactual sources are small oil lamps, which I expect to be effective only \nindirect a groups - the room is too large compared to the lamps.\n\n\n> Another tip to reduce calculation time if you are using a recent version \n> of Radiance (3.6 or later) is that large surfaces in the main octree \n> will be tracked in the shadow cache.  Neither instances nor meshes will \n> work as obstructors, so if you must instantiate geometry, leave at least \n> some large occluders in the main octree to help in the shadow cache.\n\n\n;-) Do you know my model that well? Thank you, this may help a lot. My \nmodel is build up in a hierarchic way, with the top elements often being \ninstances. Maybe I should even accept overlaps just to get some \noccluders without changing the model too much. If I keep the visible \ngeometry in instances, but have some large faces in the main octree a \napproximations to these main elements, which are invisible because \ncompletely covered by the instances' geometry, should I expect some \nperformance gain from the shadow cache?\n\n\n> It's a curious idea.  I'm not sure whether or not it will help, but I'd \n> love to see the results.\n\n\nI will try it. I think it highly depends on the point of view related to \nthe scene, but in my case it may help (important viewpoints all in \ncentral hall-like room, window openings mainly in adjacent \naisles/galleries etc).\n\n\n> There is no such hack.  It's not really physical, is the problem.\n\n\nYes, but it is useful to exclude patterns and textures from the ambient \nand stay with the base modifier.\n\n\n> One other note -- you might try setting -ar 0 in your case.  If you have \n> really large and small geometry that require enormous -ar settings, you \n> may be better off without it.\n\n\nI was at around 2000, I will try 0 now.\n\n\n> ground plane from the indirect calculation with a -ae option.\n\n\nThere is none. I use the sky/ground-sphere only. It is the building's \ndimensions related to its details.\n\n\nThank you for your help! CU Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-September/003998.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "September 15, 2006 at 01:24PM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_003983", "id": "radiance-general_003998"}