{"body": "Hi Francesco,\n\n\nI can partly confirm the observations from your parallel rendering \nexperiments. I didn't use openmosix so far, but some time ago I wrote a \nparallel Radiance using the PVM-Library ('Parallel Virtual Machine').\n\n\nThis PVM provides a collection of routines for interprocess \ncommunication on different sorts of machines. Instead of using rpiece I \nchanged the Radiance code to produce a set of master and slave modules, \none for the distribution of the work, the others for doing the rendering \nand  collecting the results to produce the final picture. By this, I \nalso could avoid the Linux lock manager problem for the ambient files, \nas I shared ambient values among the processes with help of the PVM \nroutines.\n\n\nAlthough PVM offers to connect all sorts of machines and OS-es together, \nit is of course advisable to use a symmetric cluster built from machines \nwith comparable speed. (BTW, by this you also can use the same data \nformat on all machines and don't need to codec data into a separate \nexchange buffer).\n\n\nI started with 4 equal 400MHz processors, when I later added faster \nmachines, I quickly observed that, e.g  the two 1.2 GHz machines already \nfinished almost all the blocks of the divided image when the four old \nones hardly managed to trace one block each. So it really doesn't pay \noff to add slow machines to your cluster.\n\n\nAdditionally, the overhead from parallelization was considerable. I \ndidn't really care about benchmarking, but I remember to have had an \noverhead of rougly about 20% (with my PVM version), meaning when using \ne.g. 4 machines, rendering was not 4 times but only ~3.2 times faster.( \n-nb: PVM does no migrating, at least not the version from several years \nago). Its important to make the blocks small, because you almost always \nwill end up with the following: all machines finished long time ago but \nonly one still working on it's last block :-)\n\n\nAnother totally different problem I observed was that sometimes the \nblock boundaries have been visible, i.e. the image showed a checkered \npattern, different blocks appeared with different brightnesses. I came \nso far to attribute this effect to the direct calculation, but haven't \ncompletely found out where exactly the cause lies.\n\n\nNevertheless that migrating of openmosix sounds interesting, if I find \nthe time I'd like to have a look at it..\n\n\nso long & see you in Fribourg\n\n\n-Carsten\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-August/001994.html).</sup>", "attachments": [], "created_by_name": "Carsten Bauer", "created_at": "August 28, 2004 at 05:01PM", "created_by": "Carsten_Bauer", "parent_id": "radiance-general_001992", "id": "radiance-general_001994"}