{"body": "Thanks for the heads up!\n\n\nI'm in the process of choosing a camera and the Digital Rebel seems to be a \nfine choice indeed. However I would like some more background info on the \nfile formats. I can't seem to be able to dig up much on what the \"raw\" \nformat actually contains, I imagine it isn't necessarily the same from \ncamera to camera? Are there parameters to be passed on to the hdr \ngenerating software based on the raw format?\n\n\nI have no support for macosx, so it's between windows and linux, although \nthe hdrgen program looks interesting as it's command line based and easier \nto enter into batch processing. But I couldn't find any documentation about \nit and the executable doesn't have any built in help whatsoever. :)\n\n\nCould I possibly ask you to roughly describe the process of generating hdr \nimages from those taken with the Rebel? Any calibration involved?\n\n\n\n\nBarbara\n\n\n\n\nAt 10:38 28.05.2004 -0400, you wrote:\n>Barbara Matusiak wrote:\n>\n>>I wonder if it is possible to convert pictures taken by digital camera to \n>>Radiance format? And if yes, how it could be done? The Radiance format \n>>enables reading of luminance values directly from the pictures, something \n>>that could be very usefull in the project I plan to start soon.\n>\n>Yes, but only if you shoot the images in a specific manner and convert \n>them to high dynamic range (HDR) format first.  A single image does not \n>contain the dynamic range necessary for what you want to do.  But for \n>typical scenes, if you simply bracket your exposure (using aperture, not \n>changing shutter speed) by two F stops in each direction, you can use \n>utilities like Debevec's HDR Shop or Greg Ward's Photosphere (or his \n>command-line hdrgen) to merge those into an HDR image with the full \n>dynamic range.  You can then use Radiance tools like falsecolor (and even \n>pcond) to extract real luminance information from a photograph.\n>\n>We use a Canon Digital Rebel here in my office to create these image \n>sequences.  The autobracket function of the camera is very useful for \n>this.  Many \"prosumer\" cameras have this feature, but you must make sure \n>the camera will separate the images by two f-stops.  Of course you can do \n>it manually too, but then you usually need a tripod to keep everything in \n>registration.  You also need to \"go manual\" to capture scenes of really \n>high dynamic range, using more images to capture the full range.\n>\n>I've been meaning to place some samples on my website, but haven't had \n>time.  But these resources are better anyway:\n>\n>http://www.anyhere.com/\n>http://www.debevec.org/HDRShop/\n>\n>HDR photography is extremely cool.  You can even use HDR images as light \n>sources for Radiance scenes!  Santiago Torres of this list has done quite \n>a bit of work in that.  Search the radiance-general archives for \n>details.  Have fun!\n>\n>----\n>\n>      Rob Guglielmetti\n>\n>e. rpg at rumblestrip.org\n>w. www.rumblestrip.org\n>\n>_______________________________________________\n>Radiance-general mailing list\n>Radiance-general at radiance-online.org\n>http://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\nassociate professor Barbara Matusiak                            Tel.: +47 \n73 59 50 77\nFaculty of Arcitecture and Fine Art                             Fax: +47 73 \n59 53 88\nNorwegian Univ. of Science and Technology \n(NTNU)                barbara.matusiak at ark.ntnu.no\nN-7491 Trondheim, \nNorway \nhttp://www.ab.ntnu.no/byggekunst/ansatte/ansattesider/bam.html\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-June/001771.html).</sup>", "attachments": [], "created_by_name": "Barbara Matusiak", "created_at": "June 01, 2004 at 03:44PM", "created_by": "Barbara_Matusiak", "parent_id": "radiance-general_001754", "id": "radiance-general_001771"}