{"body": "Hi  Raghu,\n\n\nthe answers in detail below.\nThere will be released a new version soon (before the radiance workshop) \nwith plenty new features (masking, zones, other indexes) and also a huge \nspeed increase.\nI have already tested the new version on more than 1000 different images \nand it is reproducing the data to 100% with an average speed improvement \nof factor 15 (for the images I have).\nTo extend the test I'm looking for approx. 5 volunteers doing some \nbeta-testing with the new version in the next weeks. Operating systems \nfor the test are Mac or Linux preferably.\nIf someone is interested in this new version, please send me a message.\n\n\nJan\n\n\n> 1. difference between *E_vert*, *Edir* and if indirect vertical \n> illuminance which is not shown here could be defined as (*E_vert- Edir*) ?\nE_vert is the Illuminance calculated from the image (usually vertical \nilluminance)\nE_dir is the illuminance just by the detected glare sources (needed for \nthe CIE glare index)\n> 2. What are *Eglare_cie* and *Lveil_cie*? if you could explain in \n> simple terms it would be good.\nthese are disability glare values, for details read the documents on \ndisability glare from the CIE\n> 3. How is the *lum_sources* calculated? is it area weighted or just \n> the average of luminance sources?\nIt is the average luminance of all glare sources, weighted by the solid \nangle   equation: \nLum_sources=(L1*omega_1+L2*omega_2+...Ln*omega_n)/(omega_1+omega_2+...omega_n) \n\n\n> 4.difference between *Lveil* and *Lveil_cie*?\nLveil is the disability glare according to Pointer. Lveil_cie according \nto CIE.\n> 5. what is *band_avlum*? every time i get -99 as its value.\nyou should read the manual page;-) , it is explained there as well. If \nyou define a horizontal band, then you get the average luminance in that \nhorizontal band calculated. If you dont activate the option, you get \n-99. The new upcoming version will have a separate output section for \nthe band evaluation, showing more data within the band. So the last-line \noutput for the band (and the -99 for non-activation) will disappear.\n> 6. Why is the last column for each glare source repeated i.e i think \n> its *sigma *which is repeated? is it on purpose or its a bug?\n>\nsome values are the same for each glare source, some of them differ. \nThat's why. Sigma is an angle needed to calculate the position index.\nThe actual official version, distributed from the Radiance-web-site, is \nbug-free as far as I know. A nasty output will be created, when no glare \nsource is found (some results are nan or -inf). this is fixed for the \nupcoming version.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-July/011839.html).</sup>", "attachments": [], "created_by_name": "Jan Wienold", "created_at": "July 05, 2016 at 10:53AM", "created_by": "Jan_Wienold", "parent_id": "radiance-general_011837", "id": "radiance-general_011839"}