{"body": "> > Is there some wierd cube law here? Is it actually not possible to do\n> > better than 512x512 images? 1024x1024 don't work for me.\n> >\n> > (the sizes are notional. Its been a while)\n> \n> What OS and hardware had you used ?  rpict  renders and writes the image\n> line-by-line, so memory consumption doesn't scale quadratically with \n> image size\n> \n> (only linearly with image width). Images > 12000x12000 pixels worked well\n> on machines with <256MB main memory.\n\n\nNot for me. Dec Alphas, 586 and PIII class boxes with up to 512Mb and it\ndied. Could be compiler problems? I was using gcc.\n\n\n> \n> > Also, some of the *wonderful* textures such as the finer woodgrains\n> > have very odd effects on time to compute. Is there a FAQ like known\n> > set of textures to avoid for fast render?\n> \n> What usually slows down rendering are (beside ambient bounces) cal files:\n> Their computing time is approx twice that of compiled code (if I remember t\nhat\n> number right- Greg ?). So the more elaborate the functions, the longer it\n> takes.\n> \n\n\nI'm a naieve user. I construct 'furniture' as discrete boxes of surface in\na texture I like and then micro-adjust their position against room walls\nuntil it looks 'right' -It may well be this introduces some overhead that\nbetter constructed objects would avoid.\n\n\nI still have real problems thinking in the project 3space inside the\nmodel. I feel like a 5 year old trying to use a treasure island map on\nthe kitchen floor: 3 forward three left two up rotate twice six back...\n\n\nlabelled anchors to get base-relative locations could be nice. \n\n\nand I think I asked for a simple floating compass a while back, is there\na hack to get one into initial models to confirm various positions? or\na way to float key object points in text over the model?\n\n\ncheers\n\t-George\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2001-December/000084.html).</sup>", "attachments": [], "created_by_name": "George Michaelson", "created_at": "December 12, 2001 at 03:19AM", "created_by": "George_Michaelson", "parent_id": "radiance-general_000081", "id": "radiance-general_000084"}