{"body": "Hi Axel,\n\n\n> I have a few thoughts that I'd like to share with you, irrespective of\n> the actual install. Please don't take them as rants, and feel free to\n> completely ignore them if you feel they're out of place. I seem to\n> have a talent of always striking the wrong string with people...\n\n\nany comments are welcome!\n\n\n> a) I've been browsing the Debian pages for the best part of an hour\n> now, but just can't find the relevant page. I might be completely\n> wrong (this could well have come from the Fedora packaging\n> guidelines), but something tells me that auxiliary data (such as the\n> *-materials.deb) should actually go into *-data.deb. This is more\n\n\nI've called it -materials now, I doubt that makes a big difference. I\ndon't know any policy about packages having to use -data. I think most\nof the stuff are material definitions in the package, so I think it's fine.\nI don't want to split them again, Debian's ftp masters like to start to\ngrumble if a package builds too many small packages.\n\n\nIf you're facing such questions - the Debian policy is what you want to\nread: http://www.debian.org/doc/debian-policy/ch-binary.html#s3.1\n\n\n\n\n> b) Have you checked with debian-legal yet whether the Radiance license\n> is ok for inclusion of the package in Debian proper, rather than\n\n\nradiance is NOT in non-free. It is in Debian/main.\nActually the license is a bit weird, it's similar to the php license\nwith some name changes, but it's fine for main.\nYou're probably thinking abut the .dfsg. in the version number - it just\nmeans I had to remove two pdf files which are shipped without source.\nSeems the source of one of them is lost, and Greg will ship the other\nfiles's source with 3R9, or they're removed both by him. THen the .dfsg.\nis gone, too. Nothing that stops a package from going into main, though.\n\n\n\n\n> c) This, again, is too long ago to remember: There used to be a\n> Radiance RPM in Turbolinux, and I'm fairly convinced that a Debian\n> package also existed. \n\n\nIf I remember right Lars build those packages. I know they exist, but\nusually it is faster for me to repackage things from ground of then\ntrying to understand what other people did and doing things based on that.\n\n\n> One of them actually packaged it into\n> radiance-nox11 and radiance-x11. The idea was that to use Radiance in\n> render farm, all the extra X11 requirements would not have to be\n> installed. I'm not suggesting that you follow this approach, but do\n> give it a thought.\n\n\nI gave it a thought, too, but discarded that for now as the dependency\nto x11 only brings a few hundred k of extra libraries. I doubt that's\nworth the work. You don;t need to install X completely on Debian...\n\n\n\n\n\n\n> d) Your communication with Greg happened off-list. I feel that many\n> Radiance developers (and users, too) would be very interested in\n> reading though the thread. BTW, this is also the reason why I'm\n> posting this to radiance-devel, rather than just to you personally. I\n> strongly believe that the Radiance development process should be as\n> transparent as possible. Anyhow -- is there any chance of you making\n> this conversation available to the rest of us (with Greg's permission,\n> of course)? I am particularly interested in what Greg has to say about\n> libtiff. It seems you linked to the system one, not the one which\n> comes with Radiance. Does that mean that the official one can be\n> trusted now?\n\n\nI doubt it is worth to read trough the whole thread. But if it's ok for\nGreg I'll create a summary of the interesting parts of it.\n\n\nAbout libtiff: if I remember it right (without reading trough the 30\nmails again), the reason why there's one shipped in radiance is that the\nlibtiff in BSD was broken, or so. Anyway I have no other chance then\nusing Debian's libtiff, I'd get slapped by the ftp masters if I'd try to\nadd the source of an old version of libtiff to Debian - it's a waste of\nspace and another thing you need to patch if there's a security hole in\nlibtiff.\n\n\n\n\nCheers,\n\n\nBernd\n\n\n\n\nBernd Zeimetz\n<bernd at bzed.de>                         <http://bzed.de/>\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2007-October/004462.html).</sup>", "attachments": [], "created_by_name": "Bernd Zeimetz", "created_at": "October 14, 2007 at 08:21AM", "created_by": "Bernd_Zeimetz", "parent_id": "radiance-general_004452", "id": "radiance-general_004462"}