{"body": "Hi Ruggiero,\n\n\nAs given, your command:\n\n\n\trcontrib -c 105 -I+ -f tregenza.cal -m skyglow -m groundglow test.oct < samps.txt > daycoef.mtx\n\n\ndoes average 105 irradiance positions, taken them in sequence from samps.txt.  I assume this contains exactly 105 random sample positions & directions.\n\n\nThe output will not be Tregenza sky patches, because you are missing some needed options.  If you want your ground average to precede your 145 Tregenza patches in your matrix, then use the following order:\n\n\n\trcontrib -c 105 -y 1 -I+ -f tregenza.cal -m groundglow -b tbin -bn 145 -m skyglow test.oct < samps.txt > daycoef.mtx\n\n\nThe above process can in fact be simplified by merging your ground.rad and sky.rad files with some comments like so:\n\n\n<combined_sky.rad>\n# Combined ground and sky vault for calculating cylindrical irradiance\n\n\n# Start by telling rfluxmtx to generate a single coefficient for the ground:\n#@rfluxmtx h=u\n\n\nvoid glow groundglow\n0 0 4 .8 1.1 .8  0\ngroundglow source ground\n0 0 4 0 0 -1  180\n\n\n# Now, tell rfluxmtx to generate a set of Tregenza sky patches using Y for \"north/up\":\n#@rfluxmtx h=t u=+Y\n\n\nvoid glow sky_glow\n0 0 4    1 1 1 0\nsky_glow source sky\n0 0 4    0 0 1 180\n\n\n\n\nNotice how I took out the actual sky distribution, which you don't need for a coefficient calculation.  (It would make no difference to the results in fact.)\n\n\nThen, you can then use rfluxmtx to call oconv and rcontrib for you:\n\n\n\trfluxmtx -c 105 -y 1 - combined_sky.rad < samps.txt > daycoef.mtx\n\n\nNote that the lone hyphen (\"-\") tells rfluxmtx to read from its standard input, and must be given as shown above.  Assuming you have just 105 positions  in samps.txt, I've specified -y 1, so that the output matrix has both its dimensions set properly.\n\n\nOnce you have the above matrix, you can multiply it against any sky vector to get the desired cylindrical irradiance:\n\n\n\tgendaylit [options] | genskyvec | dctimestep daycoef.mtx\n\n\nThe above command should produce a single RGB triplet corresponding to the cylindrical irradiance with the given sky. \n\n\nCheers,\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-March/011555.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "March 03, 2016 at 12:22PM", "created_by": "Greg_Ward", "parent_id": "radiance-general_011239", "id": "radiance-general_011555"}