{"body": "etsaweb wrote:\n\n\n> There are several utilities in radiance to achieve interativity with \n> radiance(rview, rholo...) but all of them are based in sofware, so \n> they are a bit slow, is there any way in which radiance can make use \n> of hardware acceleration? or could be it possible in future? can \n> opengl help to it?...\n\n\nHi,\nToday's hardware acceleration is polygon based. Every geometry is \ntesselated into triangles and feed more or less optimized into a \n\"geometry pipeline\" that is made up of specialied hardware transforming \nthe 3d triangles to 2d screen triangles, removing hidden surfaces and \npainting the triangles (shading and texturing). The interface specs of \nthe entry point into the pipeline are defined by OpenGL. Only very \nrudimentary lighting (termed shadow free \"local\" lighting with a simple \nsurface model) is done at the hardware level. It could be useful in the \nRadiance context for either speeding up basic drawing functions or as a \npure (non-physical lit) geometry display engine.\nOpen-GL is used by rholo to speed up \"painting\" of triangles and by \n\"rshow\" for displaying the geometry. I found the latter one useful for \ninteractive display (thats why I wrote it) , but I'm still not donating \nenough time to port it to the new internal libs of R3.5, so a fresh \nversion is not yet ready.\nThere are some ideas around as to map pre-calculated lighting \"levels\" \nonto polygons and then feed them though the pipeline at interactive \nrates, and there are questions as to whether stick to the geometry \n(rshow like) or a \"scene cube\" (rholo like) or an intelligent (read \n\"fast\") mix of the two. Greg had some pretty good ideas about this in \nmind years ago, which never really materialized in projects so far. (as \nfar as I'm aware).\n\n\n-Peter\n\n\n>  \n>  \n> Ignacio Munárriz,\n> Escuela de Arquitectura, Universidad de Navarra\n>  \n> Pta:Now i have a \"rendering with radiance\" ebook version and i am \n> happy!!!! , thanks Greg\n\n\n\n\n\n\n\n\n pab-opto, Freiburg, Germany, http://www.pab-opto.de\n [see web page to check digital email signature]\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-January/001386.html).</sup>", "attachments": [], "created_by_name": "Peter Apian-Bennewitz", "created_at": "January 07, 2004 at 08:26PM", "created_by": "Peter_Apian-Bennewitz", "parent_id": "radiance-general_001383", "id": "radiance-general_001386"}