{"body": "Hi Rob,\n\n\n> Philip Thompson, way back in '94, inquired about the\n> ability to show surface normal orientation in rview.  Was\n> this ever developed?  My frame of reference is Lightscape,\n> which has been excellent in this regard.  Surface normals\n> can be interractively viewed, and backfaces are displayed\n> in a garish green color.  Incorrectly oriented surfaces can\n> be flipped with a click of a button.  It was only after my\n> initial experiments that I learned surface normal\n> orientation is a non-issue in Radiance (excepting windows\n> via mkillum).\nIMHO, the only real non-trivial problem with incorrectly oriented\nsurfaces happens with solid glass (=dielectric) objects. If the CAD\nspills out polygons with quasi-random orientation (AutoCAD 12 caused me\nsome temporary headaches years back), hand tweaking the orientations is\nnot an option. Problems with orientation of glow and spotlight surfaces\nare typically easier to hand-tweak. All other surfaces, as you know,\ndon't care for orientation. \n\n\n> Failing rview, what other geometry previewers are you\n> folks using?  Ole Lemming's ConRad has a useful\n> previewer, that operates similarly to the \"view setup\"\n> dialog in Lightscape.  I really think this would speed\n> things along for me, the ability to interractively orbit a\n> scene & check for modeling errors, normal orientation, etc,\n> and most importantly, SETTING VIEWS.  THis is a real\n> hassle when you have to provide vp, vd as 3D points.  Are\n> there other previewers besides ConRad?\nhttp://www.pab-opto.de/progs/rshow/rshow.html - shows surface\norientation too (when moving the mouse over surfaces and keeping the\nmiddle (OS-X ??) button down.) come to think of it,- there's no OS-X\nversion available yet.\n\n\n> ...\n> \n\n\n> \n> Along those lines, is there a way to create a grid or really\n> any series of points in autocad (via nodes, or blocks or\n> whatever) and then have the coordinates of those points\n> be fed to rtrace for lighting analysis? \nrshow has an option for that too\n ... \n> I found a nice collection of materials online (Kevin\n> Matthews, Design Workshop).  Some of the cal files are\n> missing, but many of the materials are usable.  Does\n> anyone else have material & light libraries they are willing\n> to share?  I'm also really interested in obtaining\n> definitions of translucent materials, such as one would\n> find in a light fixture (sandblasted glass, acrylic, etc).\nI guess one problem with libraries is the naming. When 4 people find\n\"Sandblasted\" in the list, they have 25 different ideas how that looks\nin reality. \"Lightly sandblasted\" doesn't help either.\n> \n...\n> \n> I tried the first one and my PowerBook G4 550 rendered it\n> in 582 secs, which is almost exactly three times as long as\n> the render time for a 1.5 GHz P4 (see the site for more\n> times).  Is it just coincidence, or is there a fairly direct\n> correlation between CPU speed and render time,\n> regardless of processor type? \nNo way. CPU architectures (super-scalar, pipelining, cache coherence)\nplus compiler optimizations de-correlate clock speed from rendering\ntimes.\n\n\n> to go.  Interestingly, there is a benchmark for a dual 2GHz\n> PC, which was only 50% faster than the single 1.5 GHz.\n> I'm interested in parallel processing, but this seems to\n> make a case against it.  What are your experiences out\n> there in the field?\nI've got no experience with 2Ghz (AMD ?) dual boards, although all other\nduals (PII 200MHz- PIII 1Ghz) worked as expected so far. Mem speed, disk\ntimes (if needed, typically not so much for Radiance during rendering,\nrpict does heavy I/O only at startup while reading the scene) and cache\nsize may slow down overall throughput.\nbtw: With rpict, -PP allows sharing the geometry between two rpict\nprograms on the same machine. Useful for large scenes.\n\n\n-Peter\n\n\n pab-opto, Freiburg, Germany, www.pab-opto.de\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-May/000232.html).</sup>", "attachments": [], "created_by_name": "Peter Apian-Bennewitz", "created_at": "May 09, 2002 at 09:58PM", "created_by": "Peter_Apian-Bennewitz", "parent_id": "radiance-general_000230", "id": "radiance-general_000232"}