{"body": "Hello Niloofar,\n\n\nI hope I can clarify this.  We seem to be caught in some kind of  \nInternational Month of Color Calculations...\n\n\n> The calculation method used in “Radiance” for computing  the  \n> luminance value is:\n> Luminance = 179 * (0.265*R + 0.670*G +  \n> 0.065*B)                                            (1)\n> Where the 179 value has been defined so: The value of 179 lm/w is  \n> the standard luminous efficacy of equal energy white light that is  \n> defined and used by Radiance specifically for this conversion.\n>\n> 1. Unfortunately I could not find this value at any other document  \n> about lighting and colour measurement. Does anybody know how the  \n> value of 179 has been derived? I assume it is the average of all  \n> the luminous efficacies in visible light spectrum (380 – 780 nm).  \n> Isn't it ?\n\n\nThat's correct, but the actual value is very sensitive to where you  \nset the endpoints of what constitute \"visible,\" since the tails  \nrepresent a greater proportion of energy relative to what's visible.   \nIn this sense, the value is somewhat arbitrary, and as long as you  \ndivide by 179 on the way in and multiply by 179 on the way out, the  \nvalue cancels and is therefore irrelevant.  Integrating equal-energy  \nwhite from 380 to 780 gets you something very close to 179, though I  \ncan't promise it's exact.  I can promise it doesn't matter.\n\n\n>  2. As I know, the method for calculating the luminance is:\n> L = 683 ∫ I (λ) * ρ (λ) * V (λ)  \n> dλ                                                                    \n>           (2)\n>\n> Where: 0=<V (λ) < =1 and has a maximum of 1 at 555 nm and I (λ) is  \n> the Spectrum power distribution at any wavelength of arbitrary  \n> spectrum. If I have understood correctly,  in the file “src/common/ \n> color.h” the value of (0.265*R + 0.670*G + 0.065*B) will give us  \n> the tristimulus value “Y”, which is the same as:\n\n\n> Y= ∫ I (λ) * ρ (λ) * ‾y (λ)  \n> dλ                                                              (3)\n>\n> Since ‾y (λ) = V (λ) for computing the luminance value  \n> (according to the methods (2), (3)) what we should do is to  \n> multiply the Y value at 683 which gives:\n\n\n> Luminance = 683 * (0.265*R + 0.670*G + 0.065*B)\n\n\nHow do you figure?  For this to work, the luminous efficacy of the  \nwhite corresponding to our RGB color space would have to be 683  \nlumens/watt.  The only light that matches this efficacy is a  \nmonochromatic source at 555 nm.  Let's hope we don't have an RGB  \ncolor space with a monochromatic green white point.\n\n\nThe white point defined in Radiance (different from most other RGB  \nspaces) is equal-energy white, hence the luminous efficacy of 179,  \nwhich is just a conversion factor as discussed above.\n\n\n>  I suppose if we use the method (1), it means that we have  \n> calculated luminance so: L = 179 ∫ I (λ) * ρ (λ) * V (λ) dλ\n> That means the value of 179 lm/w has been used as maximum luminous  \n> efficacy instead of 683 lm/w at 555 nm??\n\n\nNo, because Eq. (1) assumes not a spectrum but a tristimulus color  \nspace.  They are different beasts, and you can't go freely from one  \nto the other like they represent the same information.  They do not.   \nData is irretrievably lost when you convert from a continuous  \nspectrum to any tristimulus space (eg., RGB or XYZ).\n\n\n> And if 179 has been used as average, I can not understand why we  \n> shoud average again , whereas behind the 683 ∫  V (λ) dλ   \n> (380nm- 78nm) there is the meaning of averaging the luminous  \n> efficacy over the visible light spectrum.\n\n\nYou don't average again.  Equations (1) and (2) are correct.  Eq. (3)  \nis missing a normalization constant, and the subsequent equations are  \nconfused because of that.  Y = L from Eq. (2).\n\n\nIf you can understand why the coefficients 0.265 + 0.670 + 0.065 add  \nup to one, whereas the *maximum* value of V(lambda) is 1.0, I think  \nyou will resolve your mystery.\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-April/003616.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "April 27, 2006 at 09:05PM", "created_by": "Greg_Ward", "parent_id": "radiance-general_003615", "id": "radiance-general_003616"}