{"body": "Axel Jacobs wrote:\n\n\n> Hi Rob\n> \n> I've tried ltview with this luminaire ... <snip>\n\n\n> I can't see which one of the default rvu parameters causes this. Could \n> be one of the -a* or -d*, but I am not sure...\n> My feeling is that -av should be set to zero. The lamp might be very \n> dim, in which case it's washed out with the ambient. Is it really \n> necessary to involve rad? this is done in objview, because you don't \n> know upfront how big the scene is etc.\n\n\nHi Axel,\n\n\nHmm.  The only parameters I change in the script are -ab (1 from 0) and \n-ds (.15 from 0).  I suppose rad is making some other changes?  The \nreason I'm using rad is because with the addition of the -bs option the \nscript also dosen't know how big the scene is.  I suppose I could change \nit to set up a default view like you have, and scale the -vp if the user \nenters a different value for -bs.  I was trying to change as little of \nobjview as possible though.  Anyone who's seen any of my programming \nknows why. =8-)\n\n\nI set -ab 1 because the scene just looks better, the bounce reveals \nfixture geometry and glow sources; I thought by scaling the room with \n-bs you could always have the light source close to the room surfaces, \nminimizing the ambient washout problems.\n\n\nYour erco source file shows a tiny ring (radius of .0175), but your \nroom/box is 10 units square (in your example).  Did you maybe assume \nmeters for one thing and milimeters for the other?  I did \"ltview -bs .2 \nerco.rad\" and it looked fine (and there is approx. 1730 Lux under the \nfixutre, .1 units away).  I can't read an ies2rad -> rad file and spot \nerrors easily (hence this ltview utility), but I suspect maybe there's a \nunits mismatch.  That doesn't explain why your test scene at 10 units \nsquare looks OK, though.  Hmmm.\n\n\nCould you double-check your ies2rad input?\n\n\n\n\n\n\n      Rob Guglielmetti\n\n\ne. rpg at rumblestrip.org\nw. www.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-May/001676.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "May 11, 2004 at 07:25PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_001671", "id": "radiance-general_001676"}