{"body": "Hey Dan,\n\n\nI think Andy said he planned to offer links to the NREL stuff, no reason why he couldn't offer up links to other projects like Daysim, Thomas' stuff, Aksel's stuff, Zack's stuff, and other stuff. The site is very much a labor of love, and is totally unfunded; Andy's been doing this work largely on his own dime. AFAIK, it's still the only planned centralized Radiance site. It'd be nice if it were implemented in something like Drupal, which would make it easy for collaboration on the site's content but I'm not sure how that would work with LBL. I know here at NREL that becomes a headache (managing collaboration with outside sources), which is why I wouldn't offer taking up such a project! I'm happy to say that it looks like we will receive funding to continue to maintain the Radiance binary offerings we do have, at least through FY13.  =8-)\n\n\n\n\nRob Guglielmetti\nNational Renewable Energy Laboratory (NREL)\nCommercial Buildings Research Group\n15013 Denver West Parkway MS:RSF202\nGolden, CO 80401\n303.275.4319\nrobert.guglielmetti at nrel.gov\n\n\n\n\n\n\nOn 7/26/12 11:57 AM, \"Daniel C. Glaser\" <daniel at lightfoundryllc.com<mailto:daniel at lightfoundryllc.com>> wrote:\n\n\nHi Everyone,\n  The RADSITE page <http://radiance-online.lbl.gov:82/download-install/download-radiance> under development Andy sent us a link to looks promising.  Can it also point to or store to helpful downloads like NRELs system or Zack's IES Gensky?\n  Zack I just went to the SPOT website, downloaded version 4.2 and did not see its source files, including the python gensky file-- I think this will be very helpful for the community right now and/or as guidance for updating Radiance's gensky?\n  Are there other plans or ideas for a Radiance website?\n  Thanks,\n- Dan\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2012-July/008820.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "July 26, 2012 at 12:31PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_008819", "id": "radiance-general_008820"}