{"body": "Hi Raquel,\n\n\n>> I think there is a misunderstanding here. I am sure that the\n>> documentation you refer to is related to the source images. These are\n>> 8-bit coded, and allow values from 0-255. This means that below 20 and\n>> over 200 you get into the edges of this range. As the jpg's you get from\n>> a digital camera are not linear mappings from luminance to pixel values,\n>> and a slight change in these edge pixel values is related to a huge\n>> change in the luminance of the recorded scene, it gets impossible to\n>> reconstruct luminance values from such values. Have a look at the\n>> s-shaped response curve of your camera, it should explain this problem.\n>>\n>> So hdr tools can use only this \"middle\" range, and this means that you\n>> must make sure that the ranges of your overlap have a sufficient\n>> overlap. Also, of course, the darkest (shortest exposure time) image\n>> should not contain any very bright pixels, and the brightest one\n>> (longest exposure time) no very dark ones. So if e.g. your brightest\n>> image was taken with 1/2sec and has significant pixel values below 20,\n>> take one more with 1sec time.\n\n\nLars is absolutely correct in what he is saying. WebHDR is mostly \nconcerned with using HDR for (reasonably) reliable luminance \nmeasurements, so it's important that the entire dynamic range of the \nscene is captured in the photos. When you tone-map a scene with very \nbright lights (electric lighting fittings), then in theory you should be \nable to see details of those light sources: filaments in tungsten lamps, \nthe uneven luminance of diffusers, mirror images of the lamps on the \nreflector etc. If, however, on the darkest image (shortest exposure), \nsome or all parts of the bright sources are either over-exposed (they \nhave a value of 255 in the JPEG), or even if they are above 200, then \nthe HDR engine can't reliably work out the true luminance and will \nsimply cut it off.\n\n\nIn reality, the HDR stitcher will even produce an HDR image from JPEGs \nthat have only slightly different exposures. It'll work, but will be \nuseless for our particular application. If you use HDR for anything \nother than luminance measurement, and find that the results are visually \npleasing, you may simply ignore this 20/200 rule.\n\n\nFor a while, WebHDR did actually display the dynamic range of the HDR \nimage (the more the better: I was even thinking about implementing an \nall-time highscore list!), but then decided to remove it. The lowest \nluminance values in an image (below desks, in dark corners) are too much \naffected by camera noise, so it didn't really say a lot about the \nquality of the HDR. So in a sense, the 200-rule is more important than \nthe 20-rule, but depending on your application, feel free to ignore both.\n\n\nI actually don't remember where I got this 20/200 from, maybe Greg \nhinted at it in a message on this list, or I might have read it in the \nHDR book. I didn't make it up, though. Honestly!\n\n\nRegards\n\n\nAxel\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2009-September/000248.html).</sup>", "attachments": [], "created_by_name": "Axel Jacobs", "created_at": "September 09, 2009 at 02:31PM", "created_by": "Axel_Jacobs", "parent_id": "hdri_000245", "id": "hdri_000248"}