{"body": "On May 11, 2006, at 2:12 AM, Gregory J. Ward wrote:\n\n\n> The panorama stitcher in Photosphere does a better job than most at  \n> hiding gradient differences between images, so things like lens  \n> flare are not the usual disaster.  Instead of seeing a seam or  \n> strong gradient, you may notice an erratic line where the two  \n> images are stitched together.  That's the way this algorithm looks,  \n> I'm afraid.  Sometimes it looks better than a smooth blend, and  \n> sometimes it's worse.  It really depends on the scene.\n\n\nHi Greg,\n\n\nI tried out the latest function in Photosphere and was able to pretty  \nquickly get good results from an LDR image set, but then I threw your  \nnew toolset a curve by extracting multiple rectilinear images (no  \nlens distortion) from an otherwise happily stitched HDR original. (I  \ndid this because all my panos are shot with fisheye lenses, and I was  \njust playing around...).\n\n\nThe results of this experiment are \"mixed\" to say the least. The HDR  \nis retained (yay!) and out of the 4 image used there were minimal  \nartifacts (this coming from a longtime Panotools/ Stitcher/ QTVRAS  \nabuser), and only one seam was \"erratic\" and it seems to be in an  \narea of high detail (buildings). You can see the results of this test  \n(in JPEG-HDR) here:\n\n\nhttp://www.mab3d.com/temp/ot3d/panotest1.jpg\n\n\nI'll admit that this isn't a \"fair\" image, since only pinhole cameras  \n(and in this case, Flexify 2) can create rectilinear images  \nnaturally, but overall it seemed to be a success. Yes, the interface  \nfor putting the pano together is nebulous and \"well-hidden,\" but then  \nits not supposed to be Hugin or AutopanoPro. When the rain stops, I  \ncan dig out the 18-55 \"kit lens\" and do some HDR tests with a \"real\"  \nlens. (Maybe I'll go up to the rooftop putting green again...)\n\n\n-Mark\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2006-May/000086.html).</sup>", "attachments": [], "created_by_name": "Mark Banas", "created_at": "May 11, 2006 at 07:27PM", "created_by": "Mark_Banas", "parent_id": "hdri_000081", "id": "hdri_000086"}