{"body": "Hi Ian,\n\n\n> Greg Ward wrote:\n>> Added -pd option to handle depth-of-field blur in rpict.  This  \n>> requires\n>> that the view directon (-vd option) include focal distance  \n>> information,\n>> which is now preserved by the various view file routines, and  \n>> reported\n>> by the vwright command.\n>\n> From the man page, this new feature completely replaces pdfblur. So  \n> there's no need to render multiple images and average them  \n> together? I haven't seen any other mention of this new feature.  \n> Does rpict simply trace multiple rays for the one pixel?\n\n\nIt's not a complete replacement, as pdfblur is quite a bit faster.   \nAlso, rpict will not as a rule send multiple samples per pixel.  To  \nget such a behavior, you have to increase the initial image  \nresolution and downsample more with pfilt.\n\n\nSimilar to motion blur, best results are usually obtained through a  \ncombination of pdfblur and the new -pd option.  There is also a new  \nscript to do combined motion and depth-of-field blur, as the two are  \nnot really separable.  It's called pmdblur, and it's man page is the  \nbest place to get details.\n\n\nThanks is due to Jack de Valpine of Visarc, who funded this addition,  \nalong with support in ranimate that now provides motion and depth-of- \nfield blurring as an option.\n\n\n> Does it adapt e.g points in focus only require a few rays, but  \n> points out of focus require more rays over the area of confusion  \n> (or whatever it's called) ?\n> That would improve the efficiency/speed over the laborious pdfblur  \n> method.\n\n\nThe technique is not adaptive, but it takes advantage along with  \neverything else of rpict's selective rendering of samples based on  \nimage coherence (the -ps and -pt options).\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-July/002873.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "July 27, 2005 at 07:13AM", "created_by": "Greg_Ward", "parent_id": "radiance-general_002871", "id": "radiance-general_002873"}