{"body": "On 7 Nov 2008, at 09:17, steve michel wrote:\n\n\n> I am 100% in agreement with idea of using  photospectrometer  \n> validated readings of 'standard' color charts. Let me add that  \n> perhaps paint manufacturers may already have this data ready or be  \n> keen on the approach.\n\n\nI have here a list of 50+ RAL and xKxxx (like 2K216) colors.\nI don't remember where I got those from and if I'm allowed\nto share them in public. I also do not know if the Radiance\nRGB values are validated or 'just' calculated.\n\n\nOn the subject of material conversion in general I have\nto confess that my own attempts to use the equations on\neasyrgb.org failed and I really don't know how it should\nbe done. I was only concerned about the monitor RGB\nto Radiance RGB bit (for Sketchup exports) but even here\nI felt that a simple linear scale by 0.85 gave better results\nthan jumping from colour space to colour space. I finally\nfound a mail from Greg or Axel stating that these two RGB\nspaces are so close that a big convoluted conversion is\noften not necessary. And so I left it at that.\n\n\nThe library idea sounds appealing at first but i think the\npractical value of validated colour charts is just as big as\na good conversion from the published RGB values. The\nreal world problem I see is that the colour changes it's\nproperties depending on the material it's painted on.\nTake wall paint on plaster for example and compare this\nwith the same paint on a dense wood fibre board (HDF\nor whatever you call it). The texture of the material will\nchange the properties of the paint.\n\n\nSo instead of a big honking official library a nice and\nsmall peer-reviewed  HOWTO on the conversion from\nmanufacturer's RGB data (and colour space) to\nRadiance values would have more practical value.\nI assume that there is such a conversion procedure.\nIf we have to measure before we get any realistic\nvalues then a library seems to be the thing to do.\nNice job for a student in the need of a thesis ...\n\n\n\n\nYours humbly,\n\n\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-November/005488.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "November 07, 2008 at 02:21AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_005471", "id": "radiance-general_005488"}