{"body": "George Michaelson wrote:\n\n\n> > It could also be that you made your surfaces too glossy. Most people\n> > greatly overestimate the amount of gloss in their visual environment.\n> > In reality, gloss levels for non-metallic surfaces are typically\n> > way below 5% (rather around 1 - 2%).\n>\n> Thats confusing. face on, short distance you can see very high quality\n> reflected images in tupak finished MDF for instance. Ok, 6 months later\n> the grease stains and dust make that more diffuse, but it 'seems' shiney\n> to me. Again, does the eye do a better job of ignoring that?\n\n\nThe relative amount of light reflected in a specular way is\nindependent of the \"quality\" of that specular reflection. Even if\nit amounts for less than 1% of the total reflection, it may still\ngive you a clear mirror image, as the eye is capable of filtering\nout a surprising amount of background noise as created by the\ndiffusely reflected light.\n\n\nRemember that the human eye is a highly dynamic system, and not a\nstatic camera. It doesn't snap still images, but scans the scene\nby moving around, while usually also varying its own position to\na certain degree. If you're driving through the rain in your car,\nthen it's a good idea to keep your head moving a little from one\nside to the other. This will cause you to see that road sign\nshifting behind different raindrops on the windscreen, and helps\nthe image processing unit in your head to seperate the \"real\"\ninformation from the visual noise caused by the wet glass. The\nsame thing happens if you try to discern a mirror image in an\nimperfectly reflecting surface.\n\n\n\n\n> > Note btw., that the surrounding surfaces will *not* see a perfect\n> > mirror image, unless you use the \"mirror\" material for the tap,\n> > which you shouldn't. If you use just a shiny metal, then the diffuse\n> > calculation from other nearby surfaces will hit the tap at most once\n> > or twice, which isn't enough for an exact reflection. Only surfaces\n> > that are very close will again see more, simply because the tap fills\n> > a significant part of their surrounding space.\n>\n> Perhaps I did something wrong in my design. I found setting a minor colour\n> change on the metal of fixtures had a huge effect on the tones of the\n> surfaces that I presumed were reflecting it.\n\n\nGlobal illumination in action!\n\n\nYou might want to compare your results to a photograph instead of\nwhat you perceive when looking at the scene directly. The human\neye will adapt to the prevailing light color in the scene, and\nfilter out any global tints that it doesn't consider important.\nYou're visual apparatus performs a permanent and automatic white\nbalance correction, which doesn't happen when you make a picture\nof the same scene.\n\n\nIsn't it interesting how we only realize the extremely refined\ninner workings of our perception when we try to simulate it by\ncomputer?\n\n\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch.com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2001-December/000087.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "December 11, 2001 at 01:40PM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_000081", "id": "radiance-general_000087"}