{"body": "Hi Marina,\n\n\nYes you want to describe the glass geometry, that is one polygon \nrepresenting the multiple layers of the physical makeup. The material is \nwhat should represent the behavior. If you take the output from Optics \nand run it through optics2rad you will get a single BRTDfunc material \ndescription. One thing to be careful of is that this is dependent on the \ncorrect orientation (normal) of the glass geometry. I believe that the \nnormal is supposed to be pointing \"into\" the interior of the building. \nOne way to check normal orientation in radiance is to assign \n(temporaryily) a \"glow\" material to the glass geometry and view it. The \nsides that are \"black\" are the back sides of the geometry, the sides \nthat are not black are the positive normal side.\n\n\nRegards,\n\n\n-Jack de Valpine\n\n\nmarina aviles olmos wrote:\n> Hi everybody,\n>\n> I have two questions about the description of a glass facade with a\n> complex glass system: one about the geometry and one concerning the\n> material.\n>\n> 1-. With the objective in daylight calculations and daylight efficiency\n> of materials I try to simulate, so accurate as possible, a doble glazing\n> facade with the next composition:\n>\n> 9mm laminated glass with spectrally selective interlayer -- 16mm air --\n> 4mm float glass \n>\n> All the papers I've read describe the glass geometry as polygon as follows:\n>\n> mod polygon id\n> 0\n> 0\n> 3n    x1    y1    z1\n>     x2    y2    z2\n>     ...\n>     xn    yn    zn\n>\n>  In my case, with such a glass system, would be this geometry\n> description of the glass right and accurate? or should I define the\n> radiance geometry like the contructed geometry?\n>\n>\n> 2-. The second question is about the material description.\n> I have measured the transmittance of this doble glazing material sample\n> with a Spectrometer and an accessory for external measurements and\n> computed its transmissivity.\n> The complete definition of the material that I get is as follows:\n>\n> mod glass id\n> 0\n> 0\n> 3 rtn gtn btn\n>\n>\n> On the other hand I have exported in Radiance format from the software\n> Optics5 a similar glass, also with sun protection interlayer, and the\n> material description is much complexer. It is as follows:\n>\n> void  glass       sunstop-t-silver-20_glass\n> 0\n> 0\n> 3     0,205     0,222     0,239\n>\n> void  BRTDfunc    sunstop-t-silver-20_front\n> 10\n>       0,325     0,281     0,197\n>       0,188     0,203     0,219\n>       0 0 0\n>       .\n> 0\n> 9 0 0 0 0 0 0 0 0 0\n>\n> void  BRTDfunc    sunstop-t-silver-20_back\n> 10\n>       0,259     0,289     0,307\n>       0,188     0,203     0,219\n>       0 0 0\n>       .\n> 0\n> 9 0 0 0 0 0 0 0 0 0\n>\n>\n> My question is if the description I did is complete and will give an\n> accurate calculation.\n> In case it is not, how can I get the hole description with the BRTD\n> information if I just have the glass sample and the Spektrometer to\n> start and this glass is not in the IGDB?\n>\n> Thank you,\n>\n>\n> Marina\n>\n>   \n\n\n\n\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-April/005943.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "April 29, 2009 at 07:54AM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_005942", "id": "radiance-general_005943"}