{"body": "Reporting back to all:\n\n\nGreg is correct, but with some caveats in my opinion. My preferred rendering parameters did include -dj 0.7 or whatever. Actually rad set -dj 0.9 without me noticing, and I applied -dj 0.6 in my script using rtrace. The rad command set -ps 2 and saved 5% of the calculation time using 3 processors compared to nearly the same settings with vwrays and rtrace. The rad command also did 2x oversampling in that 5% less time, so I admit it's not an apples-to-apples comparison. However I found much better rendering quality (in my opinion) using vwrays with rtrace for the slightly extra time, despite the lack of oversampling. You can see a partial comparison in the attached cropped partial image close-ups - which were processed with a mix of pcond options before compressing and cropping.\n\n\nThe scene is a complicated curving opaque reflective ceiling geometry with IES files placed amongst it. I've cropped that part of the image out for the sake of small files and not having to ask anyone for permission to share in-process design images. On the old machine I was using, took a little under 4 days when limiting to only 3 processors (to run both tests simultaneously).\n\n\nIn the vwrays and rtrace result there's none of the subdivision artifacts that I saw from rpiece. And I saw better ambient calculation consistency with vwrays-rtrace even though I tweaked the rad settings until the ambient parameters were approximately the same as my script. The rad command gives a crisper image within that rendering time because of the extra oversampling. The aliasing and slight blur isn't objectionable in the full rendering in my opinion, although I admit hard to judge from the snippets I'm sharing.\n\n\nI tested also without the -dj setting (penumbras = false) for sake of time comparison even though I already knew the results weren't up to the quality I was looking for. In this case, rad and rpiece set -ps 4 and the calculation time was 20% less than with vwrays and rtrace. Obviously the shadow results were less accurate, but I also saw some of the same rendering artifacts as in the attached snippets.\n\n\nMy guess is that the time savings of rad might increase with additional processors due to compounding of the pixel processing efficiency. But I'm not which settings I'd need to tweak to get an equal rendering quality, and might always be able to see hints of the rpiece segments.\n\n\n\n\nBy the way, I had noted in a different email on this thread that I wasn't getting the expected rpiece behavior from rad. I discovered that was due to an outdated copy of rad from 2010 accidentally mixed into the set of binaries on that machine.\n\n\n-Chris\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-October/011930.html).</sup>", "attachments": [], "created_by_name": "Christopher Rush", "created_at": "October 27, 2016 at 01:46PM", "created_by": "Christopher_Rush", "parent_id": "radiance-general_011913", "id": "radiance-general_011930"}