{"body": "On Fri, Jul 19, 2002 at 02:28:17PM +0100, Bruce Sounes wrote:\n> \n> I am finding Linux a bit of a challenge.  How do I set the RAYPATH\n> environment variable under the Bourne Again Shell (bash), and how do I set\n> it as part of my login? I have discovered that if I change to the c-shell\n> (csh) and follow the installation instructions, it works for that session.\n> Similarly the animation scripts in the old email archives work under csh,\n> but not under bash. Should/Can I set Linux to use the c-shell as standard?\n> Is it worth the bother? Can anyone offer advise on the best way to go, or\n> refer me to good documentation sites.\n> \n\n\nAll programs you run in a Unix session will inherit their environment\nvariables from the original shell you run, which will (usually) read\n.profile (ksh/bash) or .login (tcsh).  Hence the suggestion to put the\ncommand in that file.  It doesn't always work with GUIs,\nthough--sometimes the command has to go in some other file.  If you\nhave a computer science background, I refer you to the now 28-year-old\nBell Labs paper on Unix--that will probably fill in some gaps.  You\ncan read it at <http://cm.bell-labs.com/cm/cs/who/dmr/cacm.html>.\n\n\nOther than that, the c-shell has been mostly superseded by tcsh, which\nis available on Linux.  There is no need to change your regular shell\nto run (t)csh scripts--I've done it--but it's been too long since I\nset up Radiance on my Linux box and I don't remember exact details.\n\n\nRandolph, now sending from BSD Unix via Internet Explorer, Java, and\nMindterm in the Lake Oswego Public Library.  It's weird, and if you\nknow anyone in the Portland, Oregon, USA area who wants to hire\nsomeone with Radiance knowledge, pass along my name. :-)\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-July/000357.html).</sup>", "attachments": [], "created_by_name": "Randolph Fritz", "created_at": "July 19, 2002 at 03:05PM", "created_by": "Randolph_Fritz", "parent_id": "radiance-general_000354", "id": "radiance-general_000357"}