{"body": "Hi,\n\n\nthere are even more renderers, e.g. pbrt/luxrender, mitsuba, ....\n\n\nI think the main difference is - that the difference is not known. In \nthe Radiance universe, a lot of work is spent on testing the validity of \nthe models and methods. This allows professionals to rely on the \nsoftware, as long as they are within the boundaries of the validations. \nThere is a lot of other software capable to solve the global \nillumination, but few people will rely on it for quantitative studies \nbefore they have been validated.\n\n\nAnother, really important reason that people stick with Radiance \nregardless what exists \"out there\" is that for daylight simulation, a \ngood renderer does not help you without the ecosystem of tools making it \na useful simulation environment. So to make use of climate data, perform \nannual simulations, model the often exotic properties of fenestration, \nand analyze the results, you need more than the ray-tracer.\n\n\nFinally, what may appear as an advantage - the quick introduction of new \nfeatures and state-of-the-art rendering algorithms, can become a serious \ndrawback. The \"modular\" renderers out there, e.g. Mitsuba, allow to \ncombine different modules. Other, often commcercial renderers, may bring \nnew features with every release (and may not even tell you if something \nchanged). However, if you need to redo all your validations with every \ncombination of such modules, or any change in your implementation, you \nhardly reach the point where you can make use of the software.\n\n\nSo while there exist lots of codes to trace light, the motivation of the \ndevelopers usually is not to ensure valid quantitative simulation for \nbuilding performance analysis. In fact, most software in this field is \nbased on tuning and adapting good-old radiosity.\n\n\nhttps://www.janwalter.org/RadianceVsYouNameIt/radiance_vs_younameit.html\n\n\nThis is an impressive coverage of rendering engines! It just lacks the \nnumbers. So while images may look similar, we do not know about \nquantitative agreement.\n\n\nCheers,\nLars\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2018-January/012429.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "January 29, 2018 at 04:23AM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_012428", "id": "radiance-general_012429"}