{"body": "On Saturday, May 31, 2003, at 05:45 AM, Carsten Bauer wrote:\n\n\n> Hi Rob,\n>\n> is there snow on the mountain top? Can you go skiing over there?\n\n\nYes and no.  There is snow on the peak, but I cannot go skiing over \nthere, because if you strapped a pair of skis to my feet and pushed me \ndown a snow covered hill, I'd turn into a dangerous projectile for \nabout five seconds before crashing.  It's definitely not what I'd call \nskiing.  =8-)\n\n\n> Excluding objects form the ambient calculation is done by setting the \n> -ae\n> parameter to the objects material name (-ae mat_name or -aE\n> file_with_matnames). So excluding the mountains is no problem, the \n> drawback\n> is, that Radiance determines the resolution of its ambient cache (-ar\n> setting) dependent on the scene bounding cube. So a HUUUGE bounding \n> cube\n> results in values spaced so far apart that probably only one falls \n> into your\n> room. (Unless you set up -ar extremely high, if everything outside is\n> excluded, this might even work ...)\n\n\nSee my response to Greg about this one...\n\n\n> But why not tread an intermediate path: set up a 3D landscape model \n> and render\n> some pictures with it from your viewing point.  They contain the exact\n> radiance values, so in a second step you can map them with colorpict \n> to a\n> plane made of  glow with fourth param set to zero, and put this plane \n> 100 or\n> 200 m apart from your scene. This will keep the blowing up of the scene\n> reasonable and still deliver correct results. Do some checking if the\n> settings are right, i.e compare the landsscape rendering with your fake\n> landscape rendering, one never knows ...)\n\n\nOK, so this is basically using Radiance to create a \"lightmap\", instead \nof using HDR, yes?  I assume I could further increase the accuracy by \nusing your method described here, but then also using mkillum to create \nillum sources out of the window panes?\n\n\nAm I making any sense at all??!!\n\n\nRob Guglielmetti\nrpg@rumblestrip.org\nwww.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-June/000828.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "June 02, 2003 at 09:12AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_000818", "id": "radiance-general_000828"}