{"body": "Gregory J. Ward wrote:\n\n\n> Hi Rob,\n>\n> I suspect that the corners of your image are not specified in the  \n> proper coordinates, or are not the right corners -- assuming you used  \n> the -p option to macbethcal.  Remember that the y-coordinate from  \n> Photosphere is reversed from that produced by ximage, which is what  \n> macbethcal expects...\n>\n> -Greg\n>\n> P.S.  If you're still stuck, send me your image and I'll see what I  \n> can do with it.\n\n\n\n\nHey Greg, I think I got it.  Thanks.  I think it was cropped too \nclosely, is all.  I ended up re-shooting the whole thing (a few times), \nanyway.  I'd send or post a copy of the new debug image, but I'm having \na problem with my internet connection here at home, and can't send any \nlarge files at the moment.  =8-/ \n\n\nI was getting a lot of patches out of gamut with my northern light \nimages, so I did it again under direct sun, and only had two patches \nwith the diagonal lines on them which I guess is good. (?)  The \ngreyscale sequence at the bottom row was perfect, but the colors were \nless so.  Maybe this is a white balance issue?  I fixed it at \n\"sunlight\", but I'd like to do some more tests when I have sun at my \ndisposal again. \n\n\nInterestingly, I got some variation on some paint color swatches that \nwere photographed twice with two different backgrounds.  I have two \ndifferent materials (sofa cushions) that I wanted to sample, onto which \nI taped three paint color swatches that I also wanted to sample.  I \nphotographed each cushion with the same three swatches taped on, ran \nthem through pomb with my .cal file generated with macbethcal, but the \nrgb values (plucked from ximage) for the three swatches differ somewhat:\n\n\nsample1\n\n\ngreenish background: .56 .52 .38\nbrownesque background: .58 .55 .41\n\n\nsample2\n\n\ngreenish background: .35 .30 .22\nbrownesque background: .47 .41 .29\n\n\nsample3\n\n\ngreenish background: .41 .35 .25\nbrownesque background: .38 .32 .24\n\n\nsample2 shows the most variation, but truthfully I'm not sure what's an \nacceptable range here.  sample1 and sample3 have very similar rgb values \nin both images, which gives me a warm fuzzy feeling about the whole \nprocess.  But sample2 seems pretty variate.  Is this as good as I should \nhope for, or is my technique off here?  These samples were photographed \nwithin seconds of each other, under direct (Colorado!) sun, so I think \nthe lighting is pretty consistent. \n\n\n- Rob Guglielmetti\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-February/003355.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "February 06, 2006 at 01:32AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_003352", "id": "radiance-general_003355"}