{"body": "Hi Ji Zhang!\n\n\n> vwrays -fd -vf ./view_vta.vf -x 800 -y 800 | rtrace -av 1 1 1 -w -h -fda -opdv ./scene1.oct > ./zzz_vta_pts_P_N_v_1.txt\n> vwrays -fd -vf ./view_vta.vf -x 800 -y 800 | rtrace -av 1 1 1 -w -h -fda -opdv ./scene1.oct | rcalc -e '$1=if($7,1,0); $2=1' | total > ./zzz_vta_pts_total_1.txt\n\n\nThe problem here probably is, that your fisheye view -vta produces pixel values outside the circular image you would expect. These get counted in the total number of pixels. So if you are using -vta, you need  way to filter pixels lying outside the circle. Several approaches to do so come to my mind. A generic one is:\n\n\n1) vwrays -vta into a scene consisting only of a source, corresponding to the hemisphere you want to sample\n2) pipe the output to rtrace, check for intersections with the source and get origin and direction vectors\n3) pipe that into rtrace again, this time checking for your pixel values as above...\n\n\nStill, there is a problem with the -vta (equiangular) fisheye not being a equisolid fisheye, so pixels do not represent equal solid angles.... for sky view factors, that is what you would want, but for your definition, you want the ration (solid angle visible sky) / (solid angle sky without obstructions). So either calculate the solid angle of the pixel depending on the distance from view centre, or go with rpict, create a fisheye image (-vta), and use the S and T functions to filter pixels outside the view and to weigh pixels by their solid angle. So in above commands, you would not set the pixel value to 0 or 1, but to 0 or S(n).\n\n\nAgain, I could not try out all this and send a complete example, just trying to point you to some direction.\n\n\nCheers, Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2012-October/009003.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "October 23, 2012 at 01:40AM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_008984", "id": "radiance-general_009003"}