{"body": "On Wed, May 5, 2010 at 3:03 AM, Jia Hu <hujia06 at gmail.com> wrote:\n\n\n> (2) The following uses dxf2ad\n>\n>     (a) In revit, export .dxf file (save as autocad 2000 rather than current\n>          version),\n>\n>     (b) Then use dxf2rad to convert the .dxf file to .rad\n>\n> But I found all the geometries get the same materials.\n>\n> So, does anyone know how to handle this problem?\n\n\nThe dxf2rad man page says:\n\n\n\"Output primitives will have modifiers based on the layer of each\nentity in the form \"l_<layer>\".\"\n\n\nBasically you have to make sure your DXF has the elements split on\nlayers based on their material. If Revit uses another convention you\nwill have to export export elements with different materials\nseparately.\n\n\n> (3)  The following uses Ecotect\n>\n> (a) Export .dxf file from Revit (I can not import dwg by Ecotect, is that\n> normal?)\n>\n> (b) In the diag, define different zones by item name;\n>\n> (c) Export the model into .rad file directly, including .mat file\n>\n> The problem is that .mat file seems not correct. One material is assigned to\n> one zone. For example, in the Door object, there are two types of materials,\n> but they are combined into one material after importing to Ecotect.\n>\n> So does anyone know how to deal with the materials problems?\n\n\nDXF can only hold information about linetype and linecolor but not\nadvanced properties like 'material'. Ecotect otoh uses a very\nsophisticated material definition to account for all the thermal,\nacoustic and reflective properties. In your step (b) above you assign\nmaterials to the layers (\"item name\") and split them out into zones.\nIf your door has two materials on the same layer you loose that\ninformation. You can still assign a different material to individual\npolygons in one zone, though.\n\n\nWe usually import geometry as 3DS or obj, assign materials in Ecotect\nand export to Radiance. Typically we only have 4 or 5 materials so the\nproblem of defining different materials for a door does not arise.\nWhen we model the geometry in Ecotect we don't even include doors ...\n\n\n> The problem is that I always get some zero value of  “vn” in obj file. Even\n> if I use “–f” option or delete “vt” “vn”, it still does not work because the\n> “face” in obj file uses “v/vt/vn” format.  If I delete them, errors appear\n> because obj2rad can not find “vt” and “vn”. Could anyone know how to solve\n> this problem?\n\n\nZeros for vt should not cause problems; it's a perfectly acceptable\nvalue for a texture coordinate. The normal vector should always be\nnormalized to 1 so (0,0,0) doesn't work. Perhaps you can find a 3D\nmodeler/converter that can recalculate the normals and produces better\nquality *.obj files.\n\n\nYou should be able to replace all normals with a (fake) 0,0,1 value.\nIf you use the -f option obj2rad should ignore the actual value.\n\n\n\n\nRegards,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-May/006820.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "May 05, 2010 at 02:44AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_006819", "id": "radiance-general_006820"}