{"body": "Hi!\n\n\n> input. What concerns me is that my 3D models can get very complex.\n\n\nThan it is even better to stay on the command line, you can e.g. have \none model for the landscape, one for the building, one for trees etc. \nand combine them using command line techniques even without opening the \nfiles. Believe me, when working on complex file sets, you will love \ncommand line work after a while! Have a look at renderings of a highly \ndetailed model (down to 1.5cm) of Hagia Sophia in Istanbul we did using \nonly lots of small files and shell scripting to combine them - a model \nnoone will be able to open at once in a conventional CAD (sorry for the \nultralong URL) for the near future:\n\n\nhttp://www.archipelagus.de/lenya/archipelagus.de/live/projekte/rekonstruktionen-index/HagiaSophia-index/Kollonaden-Bild-mittel.html\n\n\n> How do I know what wall I'm working on or the color of the staircase\n> ,etc.\n\n\nYou \"alias\" the layer names to materials in a library, e.g.\n\n\n> How do I choose the locations of light sources, such as a table\n> lamp without seeing it in model form?\n\n\nOne way to do this is to place a triangle \"marker\" on a layer called \n\"table_lamp\" and have the radiance command \"replmarks\" replace all \nmarkers on that layer with the lamp geometry and illuminaire description.\n\n\n> export to DXF, DWG, GTF,STL and SKP. It also has a translator to\n> export to \"Lightscape\" ( .lp  file).\n\n\nWe will have to check for the export routes. I love obj, but it looks \nlike this one is not supported by Arris. dxf is fine with dxf2rad \n(www.schorsch.com). But there may be other ways, too, if you could \nexport to the old arris format e.g., or use 3rd party tools (I love \nbrlcad as a converter tool, but there are others).\n\n\n> modified, since ARRIS changed it's file format. I did see the\n> Rayfront site and downloaded the Demo. But it runs in AutoCad.\n\n\nThere is a standalone version for Solaris, too. But as I told you - \nRayfront is a great tool for professionals, as it supports a workflow \nand libraries, but it does not make it \"easy\" to render with Radiance. \nYou will need an understanding of what important tools Radiance offers, \nwhat input and processing parameters are needed to describe and process \na scene for the simulation (you would need that with a GUI as well), and \nthe rest is to develop a workflow for your needs. Actually, if you will \nhave established that workflow, this might be reduced to one script \ncalling the converters, referencing you libraries and viewfiles and \nrunning the rendering process incl. preview and converions all at once - \nbut you must know what happens, because in most cases you will want to \ntweak some settings or just better understand the resuts.\n\n\nReally, the tutorials are a great help to avoid frustration and losing \ntime by \"just trying\".\n\n\nCU Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-January/004701.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "January 17, 2008 at 11:05AM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_004699", "id": "radiance-general_004701"}