{"body": "Hi Lucio.\n\n\nSorry. I can't comment on the compile errors. It's quite a while since I\nused and compiled eulum2ies and then I did it on a Mac. Your problems  \nmight\nbe specific to your distribution/version of the libraries.\n\n\nOn 4 Jan 2008, at 12:39, loscotec@@libero..it wrote:\n\n\n> I managed to convert from eulum to ies with ies2tab a program for  \n> ms-dos\n> written in pascal, but I still have doubts about the correct  \n> translation.\n\n\nI don't know ies2tab. I used and still would use Dialux on Windows if I\nhad to deal with photometry a lot. You can import LDT, IES and some  \nother\ndata formats into Dialux and then export the photometry as IES if  \nrequired.\nIf you have a converted IES file load it into Dialux and compare it  \nto the\nLDT version in the 3D editor. If you get the same distribution shape and\nspecs it's ok.\n\n\nThe good thing about Dialux is that it's more or less a marketing tool\nfor the manufacturers and therefore is very well supported by their\ntechnical departments. Most big manufacturers have dedicated databases\nwith their products for Dialux or a good online import function.\n\n\n> it looks like distribution is still ok, but it has some offset.\n> If I rotate the luminaire around z axis, and I check with illuminance\n> curves on an orizzonatal plane, the distribution is not rotating  \n> around\n> its most luminouse point (as i guess it was supposed to do.. ) but it\n> has an offset of almost 10 units, then 10 meters.\n\n\nI'm not quite sure what your problem is. Do you have trouble\nto verify your converted data file or to place it in a Radiance\nscene? If it's the first use a photometric viewer software (as Dialux)\nto check it.\n\n\nRegards,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-January/004664.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "January 04, 2008 at 11:23AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_004652", "id": "radiance-general_004664"}