{"body": "On 24 Jan 2008, at 00:33, steve michel wrote:\n\n\n>\n> I was running test renders to determine some electric lighting\n> levels at a back wall: I had run ies2rad for the fixtures and\n> associated the distribution to simple flat geometry\n\n\nies2rad does that for you. You don't have to add 'geometry'\nto make the light appear.\n\n\n> to the same plane as the ceiling.\n\n\nBad move. Try to keep at least a tiny distance to the ceiling.\nActually, ies2rad creates the light sources a few mm below the\norigin of the light distribution. If you place your fixture\nscene file (the .rad file that's created by ies2rad) at 2.5m\nthe disc or rectangle will be at 2.4975m; enough for Radiance\nto keep light source and ceiling apart.\n\n\n> When I render I don't 'see' the lights\n\n\nDid you use the -i option for ies2rad? This would use an 'illum'\ntype for the source which is invisible in a picture. The default\nlight source should be visible, though.\n\n\nDo you miss the bright light source itself or is there no light\nat all in your scene?\n\n\n> so I ran objline and\n> objpict to check that the geometry of fixtures are there\n> and get the following errors:\n>\n> $ objline Scene_1.rad | x11meta\n> fatal - cannot open file \"/usr/local/lib/ray/meta/vchars.mta\", mode  \n> \"r\"\n\n\nquick guess: this path is hardcoded in one of the scripts that are used\nby objline or x11meta. I think these tools are fairly uncommon these  \ndays\nwhen everyone just fires up rvu to get a preview.\n\n\n> $ objpict Scene_1.rad | ximage\n> oconv: system - cannot open scene file \"/usr/local/lib/ray/lib/ \n> testroom\": No such file or directory\n\n\nOn my system I have '/usr/local/lib/ray/lib' hardcoded in the\nscript 'objpict'. I use the /usr/local/ prefix so I can not say\nif it's adjusted by the installer or not. Your error suggests it's\nnot so you could adjust the script yourself. The path is defined\nin the first line after the comments.\n\n\n> 2-Could someone clarify the visibility of lighting distributions\n> in  radiance.\n\n\nTypically light sources from IES files are visible, as disc,\nrectangle or box. You can use the '-i' option to allow a fancy\nfitting geometry to appear and still have the light distribution\nfor the room. Also, the '-dv' option in rpict switches off the\nrendering of sources as bright objects (they will appear black).\n\n\nHth,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-January/004723.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "January 24, 2008 at 11:29AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_004720", "id": "radiance-general_004723"}