{"body": "Hi Lars!\n\n\n> ...In the case of open blinds, this will lead to a very low requirement for\n> ab. In the case of mostly closed blinds, where the sky cannot be seen from\n> the glass pane, ab would lead to an irradiance reading of 0, but will\n> stabilize at higher ab. So the requirement will change according to the\n> blinds tilt angle, and you will probably have to go with the worst case of\n> almost closed blinds to determine the ab for your scene. I still doubt that\n> you will see much changes when reaching high values for ab such as 8.\n\n\nLet us assume that for the worst case of almost closed blinds, requirement for\n-ab is 8. Is it right to use this set to ab (-ab 8) for the open blinds, or I\nhave to adapt (decrease) value for -ab?  I know that high value for -ab leads to\nthe longer time of calculation.\n\n\n> Again, important to imagine what this means. The ab value used by rtrace\n> after the mkillum surface has been generated needs to ensure that the mkillum\n> generated source is hit during diffuse indirect calculation. As it is\n> probably directly visible from the sensor location, most of the irradiance\n> received will be directly transported from the source to the sensor, and only\n> a very little fraction by one or more bounces over walls and ceilings. You\n> will also be able to use relaced ad and as here, if the source surface is\n> rather large and not hidden behind geometry.\n\n\nI think that I understood this: If I use an appropriate high value of -ab for\nmkillum, after that, I can use an appropriate low value of -ab for rtrace, and\nthus, reduce a calculation time.\nI have done some preliminary calculations for an empty room with completely\nclosed blinds, four luminaires turned on, and when I used rtrace with -ab 0 to\n-ab 8 (for more accuracy), I got higher and higher values for an illuminance in\none sensor point (for -ab 0, illuminance~500 lux; for -ab 8 illuminance~800). I\nassume that the higher value for an illuminance (-ab 8) is close to correct\nvalue? (Similar situation is explained on p.43, figure 33, Basic Radiance\nTutorial, Axel Jacobs).\n\n\n> Important detail, all the responses you got would not be true for highly\n> specular blinds...\n\n\nMaterial for the slats is define:\n\n\nvoid plastic whit_0.9\n0\n0\n5  .9 .9 .9  .015 .02\n\n\nSpecularity :  0 - matte;      0.07 - satin\nRoughness :  0 - polished; 0.2   - low gloss\nI used a value of .015 for specularity, but if you think that I need to use a\nlower value, I will do that. Maybe a value of 0?\n\n\nCheers, Milan\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-December/007594.html).</sup>", "attachments": [], "created_by_name": "Milan Cakanovic", "created_at": "December 30, 2010 at 08:32AM", "created_by": "Milan_Cakanovic", "parent_id": "radiance-general_007574", "id": "radiance-general_007594"}