{"body": "Finally I have time for email again:\n\n\n> > The honeycombs diffuse the light so much that there is hardly\n> > a directional component left. It looks odd and the sculptures\n> > and architectural modells are shaded poorly even if the interior\n> > is rather bright.\n> \n> That sounds interesting, as I actually do not have experienced such a room.\n> Were the panels used on all sides or to one direction only?\n\n\nIn this case the architects concept was a cube of glass. For details\nand pictures look for images on the TU Braunschweig homepage\n(www.tu-braunschweig.de) or publications about \"Gerkan, Mark und\nPartner\" (Gerkan is the architect and never fails to make a lot of buzz\nabout his work).\n\n\n> My idea was to have a big diffuse-translucent wall (only) to north.\n\n\nBig is good, diffuse-translucent not so much. The problem in our case\nwas that too much light was scatered sideways from the walls. So\nyou got a wall-high bright surface with close to uniform distribution.\nModells simply get too much light from the left and right in relation to\nthe light from the \"window\" or wall closest to the modell. \n\n\n> Also Ithink that for an exhibition pavillion, especially for architectura\n> models, a diffuse environment is a terrific idea.\n\n\nDiffuse to a certain degree. Architecture in only less sensitive to this\ndirectional component because it's mostly flat surfaces. But todays\narchitecture contains a variety of shapes - especially in a university.\nAnd we had some sculpture exhibitions there, too.\n\n\n> But I really wonder on the impact of these panels on color, did you\n> experience any noticable effect?\n\n\nNo. And I would not expect any change in the color rendering of the\nlight. Inside of the honeycombs the light is only reflected on the surface\nof the PMMA (?) structure (which would be transparent as a pane\nanyway). The only filtering or color tint is the effect of the glass profiles.\nI'd guess you can get better glass for this type of application than what's\nused in industrial constructions.\n\n\n> It would also interesting to know what happens after some years, at least\n> with those based on plastics (I would not worry about the glass-based\n> products, but I am also not sure here).\n\n\nI'm sure the pick up dirt quickly. I haven't seen the pavillion for a few years\nnow but I would not expect much given that the wall is an open construction\n(as opposed to sealed modules) and the insulation material was added as an\nafterthought.\n\n\nThomas\n\n\n\n\n\n\nViel oder wenig? Schnell oder langsam? Unbegrenzt surfen + telefonieren\nohne Zeit- und Volumenbegrenzung? DAS TOP ANGEBOT JETZT bei Arcor: günstig\nund schnell mit DSL - das All-Inclusive-Paket für clevere Doppel-Sparer,\nnur  44,85 \u0080  inkl. DSL- und ISDN-Grundgebühr!\nhttp://www.arcor.de/rd/emf-dsl-2\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-May/003739.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "May 29, 2006 at 03:14PM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_003726", "id": "radiance-general_003739"}