{"body": "Jack de Valpine wrote:\n\n\n> Hi Kirk,\n>\n> Depending on what you are trying to do you may want to consider \n> something more robust in terms of programming features such as Perl or \n> Python. I am a huge fan of Perl which is extremely robust. On the \n> other hand I know that Georg Mischler is quite a proponent of Python \n> which is also quite robust.\n\n\nStarbucks coffee is also known for their robustness, but then again that \ndoesn't really help you with programming.  =8-) \n\n\nAhem. \n\n\nKirk, Jack is steering you in the right direction, but I'd also like to \ncast a vote for good old fashioned shell scripting, using either bash or \ntsh.  Some of the radiance commands are actually shell scripts, usually \nwritten in tsh, which may be a case for learning tsh.  I learned shell \nscripting by dissecting some of the stuff Greg Ward and John Mardaljevic \nwrote, which served me well for many years.  Bash has more features than \ntsh, but then again like Jack said languages like Python and Perl have \nmany more than Bash.  It comes down to what you're trying to do, and how \nmuch you expect to borrow from other sources too. \n\n\nAlso, regarding Perl: Jack's a Perl fan because he knows it well.  But \nI'd caution that Perl can be a bear when working with Other People's \nCode, because it is so \"loose\".  There is a saying among Perl People \nthat goes \"There's more than one way to do it\", which can be an obstacle \nwhen trying to read someone else's programs (which is how I learned \nprogramming in the first place).  I grow fonder of Python all the time.\n\n\nWhatever way you go, have fun!  Scripting is the key to unlocking the \npower of Radiance.\n\n\n- Rob Guglielmetti\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-September/002969.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "September 29, 2005 at 07:51PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_002966", "id": "radiance-general_002969"}