{"body": "Thank you for the response everyone, I appreciate your time and efforts.\nSorry to ask such a non-straightforward question.\n\n\nHello Denis,\n\n\nDiva4Rhino is actually a tool I've used for solar analysis in the past.\nIt's a really cool tool, especially since I've seen a lot of grasshopper\nuse in architecture practice lately. Unfortunately, the radiation maps are\nnot what we're looking for because we're trying to apply the result to the\ninterior heat gain of the building. I believe Diva has some functionality\nfor determining the solar heat gain to the interior, because I remember\nusing in the past, but for my current project I don't believe its robust\nenough.\n\n\nThank you, I'll look into ESP-r and see if it's something that can apply.\n\n\n\n\n\n\nHello Rob,\n\n\nNo problem at all, I landed on the page from a google search and didn't\nnotice the subscribe button from the radiance page. Andrew was very helpful.\n\n\nThe EnergyPlus lighting load schedule, generated from the Radiance daylight\nsimulation, makes sense to me. It's really awesome that you made those\ncalculations so streamline. I do whole building simulation in an\narchitecture graduate program and I can already see how it would be applied\nin many design applications. Though, I'm a bit confused how the solar heat\ngain is effected from the OpenStudio model, with Radiance turned on.\n\n\nHow does the coupled Radiance and EnergyPlus method impact the solar heat\ngain calculations in EnergyPlus (if at all)? In other words, if two\nidentical buildings were modeled, one with a CFS and Radiance and one\nwithout, would the CFS OpenStudio model have a reduced solar heat gain? Is\nthe BSDF applied somewhere in the EnergyPlus model to determine new solar\nheat gain values or through Radiance? If so, maybe you can elaborate on how\nit's applied. Is the reduced solar heat gain due to the modules in\nEnergyPlus or a data flow between Radiance and EnergyPlus?\n\n\nYou guys are doing awesome stuff at NREL with OpenStudio. I look forward to\nseeing where it goes in the future. Whole building simulation has been my\nresearch interest in my PhD. Through my research, I hope to gain an\nadvanced understanding of what's going in whole building simulation and\ncontribute to the field someday.\n\n\nSorry if my questions are a bit confusing. I tried asking the same question\nin a couple different ways in the hope that one of them is clear.\n\n\nThank you,\nJustin Shultz\nPhD Student\n\n\n\n\n\n\n\n\nOn Tue, Mar 11, 2014 at 4:14 PM, Guglielmetti, Robert <\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-openstudio/2014-March/000136.html).</sup>", "attachments": [], "created_by_name": "Justin Shultz", "created_at": "March 11, 2014 at 02:19PM", "created_by": "Justin_Shultz", "parent_id": "radiance-openstudio_000128", "id": "radiance-openstudio_000136"}