{"body": "Thank you, this was very helpful.\nBut it apparently means that only the latest Unix releases will have the \nnew feature?\n\n\nThe von Kries transform seems to be a linear matrix transform. Is there any \nway to perform such arbitrary (user defined 3x3 matrix) transforms on \nRadiance images? If not, would it be possible to have such a thing some \nday?... It could be suitable for various tasks and experiments with images.\n\n\nRegards,\nMarkku N.\n\n\nAt 10:35 2002-02-07 -0800, you wrote:\n>>Does anybody know tools that might help in tuning chromaticity (color\n>>temperature) adaptation for Radiance renderings? [...]\n>One of the new features in Radiance 3.4 is a von Kries white-point \n>transform built into the -p option of pcond (and other programs).  This \n>transform does a reasonable job of simulating the apparent colors under a \n>different illuminant, and is an improvement over the straight color \n>transform that was used previously.  However, when you have a mixture of \n>illuminants in your rendered scene, there is no accepted adaptation \n>transform for such a condition.  A number of researchers have worked on \n>this problem, and no one has proposed a workable solution to my \n>knowledge.  The best you can do is pick an average of the illuminants that \n>seems right for the part of the scene you are viewing.\n>\n>The issue of white balance is separate from the issue of spectral \n>rendering, but as long as we're on the topic, one of the things people \n>have requested over the years is a means for full spectral rendering in \n>Radiance.  As it turns out, this is difficult for the very silly reason \n>that all the materials and patterns have arguments whose count would \n>change with the number of spectral samples.  Choosing anything other than \n>three samples will make Radiance input files incompatible with the \n>change.  In hindsight, it would have been much better to do things the way \n>I did them in the Material and Geometry Format (MGF), which separates \n>color into its own entity, with a number of different ways to specify it.\n>\n>Be that as it may, it is possible to obtain accurate spectral renderings \n>of a scene with a single illuminant, provided you precompute the adjusted \n>RGB color of the surfaces using a technique I described in my most recent \n>paper at the Color Imaging Conference.  You can get a PDF copy of the \n>paper through the link below if you want to read about the details.\n>\n>-Greg\n>\n>http://viz.cs.berkeley.edu/gwlarson/papers.html\n>\n>_______________________________________________\n>Radiance-general mailing list\n>Radiance-general@radiance-online.org\n>http://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\nMarkku_Norvasuo\nTechnical_Research_Centre_of_Finland\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-February/000148.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "February 08, 2002 at 01:55PM", "created_by": "Greg_Ward", "parent_id": "radiance-general_000147", "id": "radiance-general_000148"}