{"body": "Hi Reinier,\n\n\nYou should probably take a look at the \"three-phase method\" which breaks \nflux transfer down into three discrete steps:\n\n\n 1. sky to glazing exterior\n 2. transmission through glazing\n 3. glazing interior to built environment\n\n\nGlazing transmission (2) is accounted for via a BSDF representation. The \nnice thing about this is that if you want to change glass \ntype/performance you do not end up having to re-run a complex \nsimulation, it is a matter of recomputing a matrix calculation. In other \nwords, the material behavior of the glazing is a separate step and does \nnot actually take that long. Andy McNeil has a great tutorial on using \nthis method:\n\n\nhttp://www.radiance-online.org/learning/tutorials/Tutorial-ThreePhaseMethod.pdf\n\n\nI recently worked on a project using this method. The main goal was to \nevaluate daylight based on hourly weather data for the locale for plant \ngrowth within a selected exhibition environment. Using this approach, \nwas a big help when we needed to look at some other glazing options.\n\n\nThis does requires some setup work particularly if you are looking at \nrooftop glazing. You will also want to think carefully about how far you \nwant to break down the glazing panels, whether individual panels or \ngrouping of some sort.\n\n\nIf you are calculating sensor points you may find that you can do it on \nyour workstation, however AWS/EC2 is definitely worth considering as an \noption. I did use AWS/EC2 for final runs as I did not want to have to \nwait, however I was generating images...\n\n\nHope this helps.\n\n\n-Jack\n\n\n\n\nJack de Valpine\nPresident\n\n\nVisarc Incorporated\nwww.visarc.com\n\n\nchanneling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2013-July/009618.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "July 15, 2013 at 06:32PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_009617", "id": "radiance-general_009618"}