{"body": "Hi Alstan,\nThank you for your suggestions, may I ask what would be the implications of using a cropped-sensor camera for glare analysis?I've seen that full frame ones are more more expensive than small sensor ones. I don't remember exactly the thesis or the name of the study, but I saw that they were using a cropped-sized sensor with special fisheye lenses (I think it was Sigma 4.5mm which its special for this kind of camera). Is that a crucial requirement to use full-frame for accurate glare results?\nWe were actually considering a Canon 80D or Nikon D7100, both have max shutter speed of 1/8000s but small sensor format...\nI'd really appreciate your comments on this..\nSt.\nP.S. Sorry if this msg doesn't get attached to the thread, I got it in the digest, I think I lost the original one--------------------------------------------------------------------------\nHi Steph,\n\n\nA couple of things to look out for from my experience:\n\n\n  * Try to purchase a camera with a full-frame sensor. This is a\n    requirement for fisheye lenses used in glare analysis.\n  * The range of shutter speeds can make a difference as well for the\n    measure of very high luminances (1/4000s vs 1/8000s).\n\n\nBeyond those two use cases, any camera with a manual mode that can \nadjust the shutter speed quickly will work fine. I recommend to adjust \nthe shutter speed by hand or computer control rather than to rely on \nauto-bracketing. Still, if you want to go the auto-bracketing route, you \nmay consider a camera that supports a firmware hack like Magic Lantern \nwhich gives better bracketing capacity to cheaper DSLR cameras. \nOtherwise you'll end up needing to buy an EOS 5D or something in a \nsimilar price range for a good bracketing functionality.\n\n\nBest,\n\n\nAlstan\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2017-October/000678.html).</sup>", "attachments": [], "created_by_name": "Stef Cy", "created_at": "October 19, 2017 at 04:11PM", "created_by": "Stef_Cy", "parent_id": "hdri_000676", "id": "hdri_000678"}