{"body": "Greg,\n\n\nI did read through the previous threads about the illums about one month \nago. Though my question was similar in nature, I was looking for a more \ntheoretical explaination of what goes on because I had been encountering \nsome issues with some illums that I had placed outside of a window.\n\n\nAs I mentioned before, I was getting some very strange looking reflections \non the floor of my renders. Here is an example:\n\n\nhttp://pg.photos.yahoo.com/ph/marcdevon/detail?.dir=b3e9&.dnm=1736.jpg\n\n\nThe window has a dog ear arch. The rectangular bottom part of the window I \nprobably could have made into an illum while placing a separate illum \noutside for the upper portion of the window. Instead I used illums placed \noutside the entire window. While reading through RWR in the section \nexplaining the adaptive source subdivision, it mentions that large light \nsources can be a significant source of error in a standard ray-tracing \ncalculation. Because of this, the illum plane I created consisted of 8 \nsub-planes (similar to the illum planes created in the museum scene in RWR. \nThe only difference is mkilum create the distribution instead of winbright). \nFor some reason this is what is causing a significant problem with the \nreflection. Why is this? It seems that the rendering would be better because \nthe illum  sources are smaller. Anywho, I did take your advise and I made 1 \nlarge plane instead of the multiple subplanes. The reflection did improve. \nHere is what I came up with:\n\n\nhttp://pg.photos.yahoo.com/ph/marcdevon/detail?.dir=b3e9&.dnm=d860.jpg\n\n\n\n\nYou can see that the reflection is improved. It still isn't completely \nnatural but it isn't as disurbing as the first picture. I set -ds to 0.1 and \n-dj to 0.75 for this rendering. I attempted to do three things in order to \nimprove the reflection. None exactly worked. The first method I tried was \ndecreasing the -ds parameter. I used a rediculously low number (0.001) with \n-dj set to 0.3 to see what would come out. Unfortunately,there wasn't any \nimprovement. Here is the result:\n\n\nhttp://pg.photos.yahoo.com/ph/marcdevon/detail?.dir=b3e9&.dnm=1dad.jpg\n\n\nI do not know if the lack of improvement was do any limit in Radiance for \nthe -ds parameter. The second method I used to attempt improve the \nreflection was to increase the sampling density (i.e., increase the image \nsize). I rendered the reflection at 12 times the final image size. There \nwasn't any improvement using this method either. Here is the result:\n\n\nhttp://pg.photos.yahoo.com/ph/marcdevon/detail?.dir=b3e9&.dnm=dfa5.jpg\n\n\nAny improvement over the previous image was due to the higher direct \njittering setting (0.65 vs 0.3). The last method I tried was increasing the \ndirect jittering parameter to 0.85. Here is the result:\n\n\nhttp://pg.photos.yahoo.com/ph/marcdevon/detail?.dir=b3e9&.dnm=5814.jpg\n\n\nThere is a noticable improvement although not completely natural. There were \nno failures with the illums (there were created as perfect squares) but all \nmy other light sources generated \"aiming failure\" error messages so this \nisn't a good solution.\n\n\nDoes any know of any ways that I maight improve the reflection? Please help.\n\n\n\n\nMarcus\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-September/002000.html).</sup>", "attachments": [], "created_by_name": "Marcus Jacobs", "created_at": "September 07, 2004 at 12:52AM", "created_by": "Marcus_Jacobs", "parent_id": "radiance-general_001998", "id": "radiance-general_002000"}