{"body": "On Wed, Dec 29, 2010 at 10:23 AM, Milan Cakanovic\n<milan.cakanovic at hotmail.com> wrote:\n> Hi Marija,\n>\n>> To render illuminance on a work plane, no need to input additional desk\n>> geometry into the scene. Everything you add in the scene has influence on\n>> light distribution and calculation time, so it is better to avoid adding of\n>> furniture geometry.\n>\n> Thank you for advice. I do not plan to add a furniture.\n\n\nAlthough it's not quite what you are concerned with right now\nthere is an alternative method to calculate illuminance values\non a (theoretical) surface thanks to Radiance's \"lego bricks\"\narchitecture:\n\n\nhttp://sites.google.com/site/tbleicher/radiance/stencil\n\n\n(Warning: Content may not be suitable for beginners. Guru guidance advised.)\n\n\n\n\n>> You can define sensor point on the workplane area.\n>\n> My first plan was to define a few sensor points, but when I use rtrace with -ab\n> 6 or 8 (for more accuracy), calculation takes a long time. For now, I will\n> define just one sensor point.\n\n\nThe value you choose for -ab depends on the complexity of your\nscene geometry and lighting conditions. From what you have\nwritten so far you have an empty room with one window and\nexterior blinds. I assume there is no outside obstruction to the\nwindow.\n\n\nWithout the blinds you can cover the light distribution within the\nroom accurately with an -ab value of 3 or 4. If you add the blinds\nyou will need additional \"bounces\" to account for the light reflected\nfrom the blinds. I assume you will need at least a value of 6 to\nachieve reasonable accurate results.\n\n\nBefore you do your evaluation calculations you should do some\ntests to find parameters which are accurate enough for your situation:\n\n\n1) Use one typical scene setup and a sky definition without sun (only\n    skylight and ground) and calculate the illuminance on one point with\n    increasing values for -ab. You can use the other parameters as given\n    by Marija in her email; it's a good start.\n    Your results should show smaller variations the higher -ab is set.\n\n\n2) With a reasonably accurate setting for -ab use the same scene and\n    sky but define a sequence of 10 or more points from the window to\n    the back of the room. Calculate these points and make a diagram\n    of the results with the distance to the window on the x-axis and the\n    illuminance on the y-axis.\n    Your graph should show a smooth curve falling in illuminance with\n    increasing distance from the window. If you can't make out a clean\n    curve in your plot your \"-ab\" value is too low (or other values need\n    adjusting).\n\n\n\n\nYour main concern about using multiple points is the processing time.\nHowever, if you pass all the points to rtrace in one call rtrace will cache\nintermediate results from the first point to calculate the next. This will\nspeed up your calculation time so you won't spend four times as much\ntime calculating four points. If you call a separate rtrace process for\neach individual point you will see no speed up, though.\n\n\nRegards,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-December/007586.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "December 29, 2010 at 07:57AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_007574", "id": "radiance-general_007586"}