{"body": "Hi Rob,\n\n\nMy two cents on the subject.\n\n\nHave you tried raising -ab?  I typically use -ab 5 when doing rtrace \ncalcs - and this just comes from case studies I've done and read, it \nseems to get the calc within a 1% for most cases.\n\n\nAlso, the -av setting, for such a low light level calc seems like it \ncould have the impact you are seeing, as has been discussed.  Have you \nrun this with a -av 0 0 0 setting yet?\n\n\nAre the interior illuminances you are reporting an average using a grid \nof points or a single point?\n\n\nFinally, the average workplane illuminance will only be linear (ie. half \nthe Tvis = half the workplane illuminance) to the combined Transmittance \nof the skylight/shade system if the interior reflectance of the system \nis constant.  I only briefly looked at how you defined the shades and \nnoticed the reflectance is slightly different (although it doesn't seem \ndifferent enough to give an 100% error).  I also noticed the shades are \nmostly specularly transmissive.  If the skylight is not completely \ndiffuse transmittance, then you are getting some sort of sun patch on \nyour workplane.  If you are doing an average calc using a grid of \npoints, a sun patch could cause the average workplane to seem off, \nalthough it may be off the same for each of your runs.\n\n\nAlso, perhaps a rendering of the room will reveal any oddities that are \noccuring.  Whenever I get unintuitive results, a rendering will often \nshow me whats happening.\n\n\nHope this helps.\nZack\n\n\n\n\nZack Rogers\nStaff Engineer\nArchitectural Energy Corporation\n2540 Frontier Avenue, Suite 201\nBoulder, CO 80301 USA\n\n\ntel (303)444-4149 ext.235\nfax (303)444-4304\nhttp://www.archenergy.com\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000752.html).</sup>", "attachments": [], "created_by_name": "Zack Rogers", "created_at": "May 14, 2003 at 03:09PM", "created_by": "Zack_Rogers", "parent_id": "radiance-general_000733", "id": "radiance-general_000752"}