{"body": "Hi Germán,\nThank you for your reply.The annual energy consumption goes from e.g. 100 kWh/m2 to 108 kWh/m2 when going from an installed lighting power from 5W/m2 to 10 W/m2.It is the 8% increase I do not quite understand.Any input is much appreciated.\n\n\nBest regards\nPer Haugaard \n\n\n\n\n     Den 15:01 onsdag den 2. september 2015 skrev Germán Molina Larrain <germolinal at gmail.com>:\n\n\n\n\n Hello, \n\n\nI think that might make sense. Imagine a room that is perfectly well daylit, where you never need to turn the lights on. It will not matter weather you installed 1W/m2 or 100W/m2, the energy consumption will always be 0kWh/m2.\n\n\nI would expect that, since you doubled the Lighting Power in the room, the energy consumption also doubled. Does that make sense?\n\n\nOtherwise... I am not quite sure how Daysim works.\n\n\nBest, \n\n\nGermán\n\n\n2015-09-02 8:05 GMT-03:00 Per Haugaard <perhaugaard at yahoo.dk>:\n\n\nDear userSorry to post my question in this forum, but since it deals with daylight I think that it's ok.\nA brief question about Daysim and results.I have made an analysis of a room where I compare the energy savings for artificial lighting by changing the ceiling reflectance. I look at two types of installed effect - 5 W/m2 and 10 W/m2. which is the only difference between the two calculations. There is no solar shading in the model.\nI use the same model for both analyzes. This means that I only make a one calculation of daylight coefficients. The light is controlled in both analyzes via photo sensors with dimming (photo-sensor control).\nThe for my question. Why is there a smaller increase in energy consumption of approximately 1 W/m2 by going from 5 W/m2 to 10 W/m2 installed power? Here I compare 2 x the energy consumption for 5 W/m2 with the energy consumption of 10 W/m2\n\n\nI look forward to hearing from you\n\n\nBest regards\nPer Haugaard\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-September/011230.html).</sup>", "attachments": [], "created_by_name": "Per Haugaard", "created_at": "September 02, 2015 at 06:12AM", "created_by": "Per_Haugaard", "parent_id": "radiance-general_011228", "id": "radiance-general_011230"}