{"body": "Lars O. Grobe wrote:\n\n\n> Why not continuing one of the existing projects?\n\n\nMost existing projects have one or several disadvantages:\n- platform specific\n- limited scope of functionality\n- obsolete technology (eg. tcl)\n- not available for free\n\n\n\n\n> And, first, define the project's goal...!\n\n\nObviously, various people may have different goals.\n\n\nMy own goal in this context is very simple: Have a cross-platform\nreplacement for rview/rholo/ximage. Whether that's one single\napplication or several is irrelevant (and trivial to have both\nways when the frontend is implemented in Python).\n\n\nOnce the basic functionality is in place, the \"nice to have\"\nfeatures like realtime preview with textures and camera paths for\nrview can be added.\n\n\n\n\n> BTW, to throw one more into the language-box, many Mac OS X apps use\n> Java for the GUI... which would help to keep things portable...\n\n\nWrite once, debug everywhere?\n\n\nOpinions vary about this, but I can't see any advantages of Java\nover Python. Java is much harder to write and uses a lot more\nmemory for the same tasks. And while the Java bytecode is in\ntheory portable like with Python, the Java VMs come in many\nsubtly incompatible varieties, each with its own bugs that need\nto be taken into account. The good ones are usually also closed\nsource, so that you can't compile them yourself on less popular\nplatforms.\n\n\n\n\n> and there are even 3d-classes for Java... ;-)\n\n\nGraphics should be done with OpenGL in either case. Or maybe with\na higher level toolkit like VTK, which again uses OpenGL.\n\n\nAgain, if anyone wants to seriously look into those things, the\ndetails will be more appropriately discussed on the dev-list.\n\n\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-July/001905.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "July 09, 2004 at 02:18PM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_001894", "id": "radiance-general_001905"}