{"body": "Hi John,\n\n\nMore likely you will want to look into the BRTDfunc material type which \nwould allow for this type of control of material reflectance and \ntransmittance. Also, it would be worth searching through the mailing \nlist archives for \"dicrhoic,\" I am pretty sure that this has been done \nin radiance before, so rather than starting from scratch it would \nobviously be better to see what has already been implemented.\n\n\n-Jack\n\n\nJohn An wrote:\n\n\n> Hi all,\n>\n> I have a somewhat complex problem defining a material.  With the \n> introduction of \"smart\" materials (that are able to exhibit different \n> behavior under different conditions) into the architectural context, \n> I'd like to experiment with defining such a material.  The mixfunc \n> material seems promising in that it allows one surface to display two \n> different behaviors.  What I would like to achieve is to use an \n> \"if-then\" condition to determine which of the two material properties \n> should be exhibited in the rendering.  More specifically, I'd like to \n> define two different behaviors (rgb, reflectance, and transmittance), \n> and use mixfunc to determine which one of the two behaviors will be \n> used for the rendering (on a each pixel) along the surface depending on,\n> 1. the angle of the light ray from the point of view to the surface \n> normal; and\n> 2. the angle of the light ray from the light source to the surface normal\n>\n> If this is possible, then would it be possible to eventually define \n> more than two behaviors (by modifying a mixfunc with another mixfunc) \n> to get a more gradual gradient between the different behaviors?\n>\n> Thanks.\n>\n>\n> John An\n>\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n>\n\n\n\n\n#\tJohn E. de Valpine\n#\tpresident\n#\n#\tvisarc incorporated\n#\thttp://www.visarc.com\n#\n#\tchanneling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-March/001487.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "March 01, 2004 at 02:54AM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_001486", "id": "radiance-general_001487"}