{"body": "f) If you compile with SPECIAL=\"ogl\", you'll get OpenGL drivers for\nthe holodeck stuff. This makes it much faster and nicer. There will be\nadditional device files. Here are mine:\n\n\nglx1.hdi   ogl.hdi   oglo.hdi   ogls.hdi   oglso.hdi   x11.hdi\nglx1h.hdi  oglh.hdi  ogloh.hdi  oglsh.hdi  oglsoh.hdi  x11h.hdi\n\n\nDownside would be the additional dependency on the Mesa libs.\n\n\nb) (again). I did not mean to suggest that Radiance is not Free. What\nI simply do not know is whether it's Free Enough to be included in\nDebian proper. It certainly is free enough for me.\n\n\nI already pointed out the potential click-wrap problem, which you\nsimply patched away.\n\n\nIf the click-wrap is there for no reason at all, then a better\nsolution would be to get it removed up-stream. Since I don't know what\nGreg has to say about this, I shall make no further assumptions.\nGenerally speaking, however, you only need to agree if somebody takes\nsomething away from you (e.g. your right to distribute the software,\nlike it was in those old days), not if somebody gives you something\nfor absolutely and unconditionally free.\n\n\nAnother interesting phrase is para 5 of the Radiance Software License:\n\n\n\"5. Products derived from this software may not be called \"Radiance\",\nnor may \"Radiance\" appear in their name, without prior written\npermission of Lawrence Berkeley National Laboratory.\"\n\n\nNo problem with me. However, what it would stop me from doing is to\ncreate something like radiance-ng (as in next-generation), or\nradiance-nt (as in new technology) or nu-radiance (as in new).\n\n\nYou will be aware that there is syslog and syslog-ng, both GPLd, I\nbelieve, so this kind of naming is not unheard of.\n\n\nThe question is whether this teeny weeny restriction of my freedom to\nname a derived package anything-radiance or radiance-anything is\nenough for the very strict rules of the DSC to render it non-free.\nProbably not, but I thought I'd throw in my 2 Escudos, anyhow.\n\n\nI trust that you as a seasoned Debian developer with >30 packages\nunder your belt know all the ins and outs of all sorts licenses and\nSocial Contracts, so having your assurance that Radiance is\nFree-as-in-Debian will make me sleep comfortably at night.\n\n\nThanks for your time\n\n\nAxel\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2007-October/004464.html).</sup>", "attachments": [], "created_by_name": "Axel Jacobs", "created_at": "October 14, 2007 at 12:30PM", "created_by": "Axel_Jacobs", "parent_id": "radiance-general_004452", "id": "radiance-general_004464"}