{"body": "Hi Andy,\n\n\nInteresting rule. Could you recommend further reading for my interest on how to get to the number 179? I would like to get a tiny grasp on the underlying principle to better understand.\n\n\nThanks a lot,\nAksel\n\n\n\n\nAm 02.01.2013 um 20:23 schrieb Andrew McNeil <amcneil at lbl.gov>:\n\n\n> Hi Ji,\n> \n> 179 is the efficacy of white (equal energy) light over the visible spectrum.  \n> \n> Daylight is composed of a broader spectrum, so the efficacy (visible light per watt of energy) is lower.  Usually around 90 for the sun and 110 for the sky, but changes based on various factors. \n> \n> 179 is used in Radiance as a convention since we are simulating visible light.  So when you're defining you sky using gensky with weather data you need to either use the measured illuminance values and divide by 179 to get radiometric units for the visible spectrum, or use the measured radiance values (for solar spectrum), multiply by an approximate efficacy, then divide 179 to get radiometric units for the visible spectrum only.\n> \n> If you use gendaylit all the conversions are done for you.\n> \n> Best,\n> Andy\n> \n> \n> On Tue, Jan 1, 2013 at 8:36 AM, Ji Zhang <hope.zh at gmail.com> wrote:\n> Dear list, Happy New Year! \n> \n> I have a simple question related to conversion from irradiance value to illuminance value, and pls correct me if I'm wrong:\n> \n> Usually we can estimate the illuminance (lux) for a given point by multiplying the irradiance (w/m2) for the point as simulated via Radiacne by 179 (lm/w) which is the luminous efficacy used in Radiance, or more strictly (R*0.265+G*0.670+B*0.065)*179. \n> \n> However, it seems that in a epw weather file the \"global horizontal illuminance\" value is not equal to but smaller than the \"global horizontal radiation\" value multiplied by 179. \n> \n> May I ask:\n> 1. why there's such a large discrapency? \n> 2. Will this lead to over-estimation of illuminance when using cumulative sky derived from \"global horizontal radiation\" ? \n> \n> Thanks in advance!\n> \n> - Ji\n> \n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n> \n> \n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\n\n\n\n\nAksel Groß\nDipl.Ing.Arch., Dipl.Szeno.\n\n\nElectric Gobo\nSchönhauser Allee 182\n10119 Berlin, Germany\n\n\nT +49 30 559 531 75\nM +49 179 394 30 92\naksel at gobo.io\n\n\nhttp://gobo.io\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2013-January/009148.html).</sup>", "attachments": [], "created_by_name": "Aksel Groß", "created_at": "January 04, 2013 at 10:34AM", "created_by": "Aksel_Groß", "parent_id": "radiance-general_009135", "id": "radiance-general_009148"}