{"body": "Hi Stefanie,\n\n\nYou might want to check out the answers to a similar question posted on\nunmethours.com here (\nhttps://unmethours.com/question/627/daylight-simulation-for-leed-v40-ieqc7/\n).\n\n\nIn summary, people indicate that IES-VE, SPOT, Daysim (or potential fork of\nDaysim by CBEI), and Openstudio are either capable of doing what you ask or\nwill be soon. Note that I believe most if not all of these tools use\nRadiance in the background.\n\n\nThanks,\nAlex\n\n\n*Alex N. Chapin, LEED AP BD+C, BEMP, LEED Project Reviewer*\n\n\n*Principal*\n\n\n*3R Building Sustainability*\n\n\nwww.3Rsustainability.com <http://www.3rsustainability.com/>\n\n\nachapin at 3Rsustainability.com\n\n\nT: (724) 741-9900 x619\n\n\n\n\n\n\n*High-Performance Building Consulting*\nThis message and any included attachments are from 3R Building\nSustainability, and are intended only for the addressee. The information\ncontained herein may include privileged or confidential information.\nUnauthorized review, forwarding, printing, copying, distributing or using\nsuch information is strictly prohibited and may be unlawful. If you have\nreceived this message in error, or have reason to believe that you are not\nauthorized to receive it, please promptly delete it and notify the sender\nby e-mail with a copy to info at 3Rsustainability.com.  Thank you.\n\n\nTo: <radiance-general at radiance-online.org>\nSubject: [Radiance-general] Radiance for Spatial Daylight Autonomy\nHello,\nMy name is Stefanie, I work in the Green Building sector in Mexico with\nLEED project certification. This year we are trying to take our daylight\nmodels to the next level and be able to achieve all options of LEED v4 EQ\nCredit: Daylight. For Option 1, we have to prove a Spatial Daylight\nAutonomy of 300lx for 50% of occupied hours per year as well as analyze the\nAnnual sunlight Exposure of 1000lx for 250h (ASE1000,250).\nWe are familiar with working with RADIANCE but we are not sure if it is\npossible to carry out this analyses and get both results needed. Could you\nhelp me with this doubt?\nHope to hear from you soon.\nRegards,\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-January/011447.html).</sup>", "attachments": [], "created_by_name": "Alex Chapin", "created_at": "January 08, 2016 at 06:26AM", "created_by": "Alex_Chapin", "parent_id": "radiance-general_011445", "id": "radiance-general_011447"}