{"body": "Hi Chantal,\n\n\nit would be great of we could point you to the book \"Rendering with \nRadiance\", which has a chapter on material data aquisition. \nUnfortunately it has been unavailable for a while, and you need a lot of \nluck to find an old copy in some library. Maybe you still try.\n\n\nYou question was not 100% clear to me as what data you have:\n\n\n> of materials (RGB plus roughness and specularity). If I want to simulate\n> an existing material in Radiance I need to\n> decompose it in the 3 primary colours.\n\n\nYou need that ONLY if you are interested in color in your simulation \nresults, too. Photometric units are typically not aware of color \n(luminance, illuminance) as they are the weighted integral over the \nperceived wavelength range of light.\n\n\n> As I understand Radiance uses Hemispherical Reflectance (ratio of flux\n> leaving the surface to the incident flux). I have this\n> data from the site...but how to get it to RGB in the case that I dont\n> have an spectrophotometer to measure. One way I know\n> could be using a grey scale chart, but then I also need to know under\n> which light source were those reflectances calculated\n> in order to compare them to my luminances.\n\n\nYou should compare your grey chart with the sample under daylight or \nincadescent lighting condition. As long as you have a continous source \nspectrum, the grey chart should(!) perform rather stable, and unless you \nuse a green LED to lid your sample :-) you should get acceptable \nresults. Keep in mind that the idea is not to get reflectance data in \nhigh accuracy ranges, but to find out whether your wall is bouncing back \nlight more like 30 or more like 60% here...\n\n\nYou should take a grey chart with you. In many cases, there is measured \ndata available by manufacturers, so it is always a good idea to take \nyour notebook and write down any material/product information on site. \nOne other way is to try using calibrated photographs (there is a tool \ncalled macbethcal coming with Radiance) if you have a color chart. This \nis useful if you need color and not just integrated reflectance. Still \ntake the chart and write down a rough guess of the reflectance and \ncompare to what you get from your calibration efforts.\n\n\nThe objective of all this is\n> to obtain illuminance calculations.\n\n\nAgain - for this, you typically need no color information, just \nreflectance - all surfaces will be grey, all sources white.\n\n\nCheers, Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2011-July/007962.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "July 11, 2011 at 07:46AM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_007949", "id": "radiance-general_007962"}