{"body": "Hi Lars,\n\n\nIf you mirror a marker triangle in cad (for example autocad), then the \nnormal ends up pointing the opposite direction. Thus in radiance if you \nuse a set of markers that include mirrored and unmirrored triangles then \nsome of your instance objects will actually point down. One way to \nresolve this is to use two sets of markers (as previously pointed out in \nanother email). If you create a mirrored instance of the object, then \nyou are actually reusing the object geometry and conserving memory. The \nway to do this is create an compiled octree version of the object and \nthen create an instance that mirrors it appropriately around x y or z as \nfollows:\n\n\nvoid instance foo.mirror\n6 foo.oct -m<x,y, or z> -t xt yt zt\n0\n0\n\n\nSince you are simply resuing foo.oct then you conserve the memory. I \nmust admit that I have to play around with -m<x,y,z> to figure out how \nthe object mirrors correctly and you may need to transform the object to \nget the position to work out with respect to your marker.\n\n\n-Jack\n\n\nLars O. Grobe wrote:\n\n\n> Hi,\n>\n> yes, of course you are right. However, the idea is to reuse geometry \n> when possible (and I have hundreds of objects which are placed by \n> replmarks) and stay as close as possible to the cad packages. I wanted \n> to ask as replmarks seams to be just for that goal ;). The integration \n> of CAD and radiance without the need of writing radiance scene files \n> manually is sometimes important... That's why I wonder if it would \n> make sense to use surface normals of the triangles in replmarks - and \n> add mirroring functionality that way.\n>\n> Thanks+CU Lars.\n> -- \n> Lars O. Grobe\n> grobe at gmx.net\n>\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n\n\n\n\n#\tJohn E. de Valpine\n#\tpresident\n#\n#\tvisarc incorporated\n#\thttp://www.visarc.com\n#\n#\tchanneling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-May/001668.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "May 10, 2004 at 03:45PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_001663", "id": "radiance-general_001668"}