{"body": "I might as well throw in my 2 Cents' worth of guess-work...\n\n\nOur experience in LEARN show (and this is also what CMS/Wiki gurus out\nthere on the big 'Net have to say) that CMS systems will only work if and\nonly if:\n- there is an existing resource\n- the admin of this resource gets so many requests for updates and\nadditions that it is more than he/she can handle\n\n\nWhat CMSs will NOT do is:\n- Create an active community if there isn't one already\n\n\nIMHO, the 'failure' (excuse this harsh word -- I'm not blaming the admins\nat all) of ye old RAD Wiki is that although there is quite a lot of stuff\nout there, and it would have been nice for the 'information consumers' of\nus to have it all nicely presented on one site, the 'information\nproviders' obviously:\n- didn't see the need for this\n- didn't have time\n- didn't want to learn how to use a Wiki/CMS.\n\n\n>> My own view was more relying on a small number of people each\n>> being /responsible/ for one (or two) subjects and keeping that\n>> sub-tree of the docs up-to-date.\n\n\nI do like the idea of having subject moderators.\n\n\nWith respect to the existing knowledge, allow me to point out another\npossible solution. Mind you, I am not saying that this is ideal for our\nparticular problem.\n\n\nhttp://dir.webring.com/rw\nThere is a thing called 'webring'. For a particular subject, maintainers\nof websites may join and register their site. Consequently, at the bottom\nof each of their pages, they include a little footer saying something like\n\n\n\"This site is part of such-n-such webring\". You also have 'previous',\n'next', and 'up' buttons taking you to the previous or next site of the\nrelevant ring, or to a list of all subscribed pages.\n\n\nWhat I personally dislike about it is that it relies one some company's\nserver.  Two solutions:\na) have the page footers and index page static\n  + independence of third parties and server availability\n  - any changes would potentially require some of the ring members to\nupdate their links, and it certainly would so from the maintainer of the\nindex page\nb) create our own indexing server\n  + gives us flexibility and independence of third parties\n  - relies on the availability of the server\n\n\nWhile I'd be happy enough to cobble together some cgi script, I am not in\na position to throw in a server as well. Our network is rather unreliable,\nand every time there is some substantial rain, the power trips on us.\n\n\n'Nuff said\n\n\nAxel\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-May/003645.html).</sup>", "attachments": [], "created_by_name": "Axel Jacobs", "created_at": "May 05, 2006 at 03:30PM", "created_by": "Axel_Jacobs", "parent_id": "radiance-general_003643", "id": "radiance-general_003645"}