{"body": "Hi Lucio,\n\n\nI am working with Radiance since 1993 and over the years I have collected quite a few documents that might be of interest to you. If you want I can send you a list or download links (or the actual documents since some of them have disappeard from the net in the meantime).\n\n\nIn 2004/2005 I initiated a research project which was funded by the EU and the Tyrolean government and together with Bartenbach (a lighting designer and developer) and the University of Innsbruck, Department for Mathematics and Informatics we did a benchmark between the Radiance simulation package and conventional methods, i.e. building a 1/10 model of a real/existing room. The goal was to eveluate the strengths and weaknesses of both methods under different aspects. The benchmark included evaluating/comparing both visual and numerical results.\n\n\nUnfortunatly this publication is only available in German language but I guess it could be translated to English quite easily. On the other hand I can't promise that I would have time to do this myself any time soon.\n\n\nHowever, if you decide to go through a comparison process yourself I would advise you to use an existing room/building as a basis. This way you can measure real world data to use as a reference. Then you would build both, a conventional and a computer model and mesure the results again and compare them with your real world data. I hope I am making sense? There a many aspects which will come up (like how for instance you scale your luminaires or certain materials in a 1/10 model) but I dont want to take away all the fun - in the end it's your thesis ;-)\n\n\nWhat I dont quite understand is why your university would pay for an existing publication that already covers what you want to do? Or did I misunderstand that part completely?\n\n\nRegards,\n Erwin\n\n\n-------- Original Message --------\nSubject: [Radiance-general] Looking for some pubblications for my thesys. (30-Okt-2007 12:58)\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2007-October/004534.html).</sup>", "attachments": [], "created_by_name": "Erwin Zierler", "created_at": "October 30, 2007 at 07:21AM", "created_by": "Erwin_Zierler", "parent_id": "radiance-general_004533", "id": "radiance-general_004534"}