{"body": "Everybody,\n\n\nThank you for fast responses/tools and suggestions!\n\n\nGreg,\n\n\nThank you for your suggestions and files!\nI am new to Radiance, and I assume that this is what I need to have\ninstalled on my computer in order to use suggested Perl scripts.\nIf you can provide me with the link/info how to run it, that would be\nreally helpful!\n\n\nLet me restate the question about the compression of the curve in\nPhotosphere.\n1. Do manufactures compress the response curve or maybe it is limited by\ncamera/optics/sensor saturation itself on the upper end?\n\n\n2. And I'm still curious, how CF is applied in Photosphere?\n\n\nI've been using ND filter t=0.0094 on the luminance meter, because\notherwise it is impossible to measure such high luminances. I assume, you\nsuggest to use it on the camera as well.\n\n\nI'm looking forward to analyze my images with the suggested\nhdrgen. Luckily, I've been taken them in both formats jpeg and raw.\nGreg, will you recommend to have regular calibration scene calibrated at\nthe grey card instead of using brighter scene?\n\n\nThank you,\nYulia\n\n\nHello Yulia,\n\n\nSeems your question has spawned quite a bit of interesting discussion...\n\n\nMy main recommendation is to use camera RAW images for critical photometry,\nespecially when there are saturated colors involved.  It is impossible to\ncorrect the color of JPEG images and undo what the camera maker has done,\nso you need to start from the sensor data.\n\n\nPhotosphere does not accept camera RAW as input, but I have written a Perl\nscript that uses dcraw with the command-line HDR image builder hdrgen to\novercome this limitation.  It also requires the use of another third-party\nprogram, exiftool, which I have packaged together for you at:\n\n\n       http://www.anyhere.com/gward/pickup/raw2hdr.tgz\n\n\nUnfortunately, I don't have a good set of documentation to go with it.\n Typing \"raw2hdr\" by itself shows the basic syntax:\n\n\n       Usage: raw2hdr [hdrgen opts][-h][-w][-C calib][-c cspace] -o\noutput.hdr input1.raw ..\n\n\nIf your images are taken on a tripod (aligned exposures), you can use the\ndefault settings:\n\n\n       raw2hdr -o output.hdr expos1.cr2 expos2.cr2 expos3.cr2 ...\n\n\nThe hdrgen settings can be found in the included HTML man page, and so can\nthe -h and -w option meanings in the included dcraw man page.  The -C\noption is to provide a linear factor to correct the overall exposure based\non previous calibrations.  The -c option is to specify an output color\nspace.  The default is \"sRGB\" which is actually linear CCIR-709 primaries.\n The only other output color space I would recommend is AdobeRGB.  There is\na CIE XYZ space supported by dcraw, but I have found it to be somewhat\nunreliable, and I don't know where the fault lies in this.\n\n\nRegarding Axel's mention of camera flare, this is less of an issue for\nsources that are brighter than the rest of the scene.  It mostly affects\ndarker, surrounding regions.  The -f option will attempt to estimate the\ncamera/lens PSF and remove it, but it cannot be relied upon to remove this\nsource of error completely.  Your problem with the accuracy of the LED\nsources is due no doubt (as others have said) to limitations in your short\nexposures combined with the color issues inherent to JPEG processing.\n\n\nOther responses inline....\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2012-February/000364.html).</sup>", "attachments": [], "created_by_name": "Yulia Tyukhova", "created_at": "February 20, 2012 at 12:48PM", "created_by": "Yulia_Tyukhova", "parent_id": "hdri_000401", "id": "hdri_000364"}