{"body": "> I want to be able to test the daylight and sun penetration in the mall \n> space during different sky conditions eg 9am 12pm 3pm sunny sky and \n> also an overcast sky. So in hindsight I should've used the CIE \n> overcast. However, when I simulate with sunny sky conditions I get the \n> same resolution and rendering problems.\n>\n> Any more thoughts?\n>\n> Paul.\nHi Paul,\n\n\nusing not the uniform sky does not solve the problem, I guess that John \nasked because the uniform sky is not really a model of what you could \nobserve in nature, so few people use it for anything but testing.\n\n\nTo solve your problem, several comments and hints have been given, and I \nwould suggest that you try these. As a note, the mkillum tool is \nactually a way to get useable results without setting ambient parameters \ntoo high, a performance boost so to say, In your case, you would have to \nexpect really high rendering times without such techniques.\n\n\nIf you wonder why you see the splotchy shades, look into how Radiance is \nrendering the ambient. The problem is the limited number of sample rays \nsent out for each bounce, to random directions. So for one point, most \nrays may hit the shade, while for a point just a cm aside, which should \nreceive more or less the same irradiation, you may be lucky enough to \nhit the sky with all sampled rays. And than, this calculation is not \ndone for each point in space, but only if the variation exceeds limits, \nthe ambient resolution enforces it, .... and so on. So you COULD set ar, \nas very high, increase the ar setting, set a low aa, and wait.\n\n\nThe mkillum tool will optimize the calculation a lot, as it replaces the \ncomplex geometry outside the scene by a light source, so that is why I \nrecommended it. It is always useful in cases of so-called complex \nfenestration, and your sun-shades are. If you think very creative, you \ncould even consider the layer of internal sunshades as 'complex \nfenestration' (ok, no glass, but similar problems here), so I added the \nidea to have a mkillum surface here, too. But I guess that mkillum for \nthe vertical clerestory windows, skyfunc for the horizontal skylight, \nand moderate ambient settings for the scene than should give acceptable \nresults.\n\n\nDo you have the book \"Rendering with Radiance\", as well as Axel Jacobs \ntutorials? These should give you an idea why you experience problems \nwith you scene, as well as strategies how to solve these. And you should \nfind examples on how to use mkillum, too.\n\n\nCU Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-May/005995.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "May 19, 2009 at 04:01AM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_005989", "id": "radiance-general_005995"}