{"body": "Hi Marcus,\n\n\n-lr limits the reflections form any 'normal' specular surface (e.g. a plastic \nwith fourth parameter greater than zero). If light from sources hits such a \nsurface, its reflection doesn't get considered in the direct calculation \nanymore (you need the mirror material which produces virtual sources \ninstead). However, the reflected light gets considered within the ambient \ncalculation, so the -lr setting has an indirect influence on the accuracy of \nthe ambient calculation. \nOtherwise, -lr is completely independent from the ambient settings and the \nvirtual source settings, i.e. it doesn't interfere with -ab or -dr (number of \nrelays from virtual sources)\n\n\nOften the additional specularity of normal room material surfaces doesn't \ncontribute that much to the illuminance, with exception perhaps of direct \nsunlight shining on a polished tabletop with glossy finish or the like. I \nremember this because of my experiments with the direct cache. In such a \nspecial case like above, for example, I observed relative errors of around \n10-12 % occuring when ommiting the specular part completely (as if one would \nset -lr = zero).So setting -lr = 2 shouldn't do much harm normally (I think \nthe default is 6 ). A different thing however is the generation of those \ntypical weird images with opposing specular surfaces where you see the \nreflection of the reflection oft the ... etc, in this case -lr needs to be \n(almost) infinite, of course. ( I once saw something on a website of one guy \nplaying around with this feature, I forgot the url, you may ask pillo, I \nthink he gave me the link..\n\n\nAnother hint: if you set a very high -lr, beware of -lw (weight), too, which \nis lurking in the background, often unnoticed...:), and cuts off every ray \nwhich doesn't contribute more radiance than the -lw setting to the \ncalculation.\n\n\n-Carsten\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-August/000942.html).</sup>", "attachments": [], "created_by_name": "Carsten Bauer", "created_at": "August 23, 2003 at 10:04PM", "created_by": "Carsten_Bauer", "parent_id": "radiance-general_000941", "id": "radiance-general_000942"}