{"body": "Hey German,\n\n\nCool. I don't have time (or licenses) to do this testing, but I did want to comment on the images. It looks like you're wrapping those track fixtures with illum geometry. The spill of light on the ceiling appears to be emanating from an illum sphere, as it's too close to the base of the luminaire to be coming from the edge of the fixture itself. This is a case where it would make more sense to translate the ies file to a ring. The illum \"wrapper\" is more suited to large glowing luminaries, not so much for directional fixtures like track heads.\n\n\n- Rob\n\n\nOn 3/2/16, 10:52 AM, \"Germán Molina Larrain\" <germolinal at gmail.com<mailto:germolinal at gmail.com>> wrote:\n\n\nHello everyone,\n\n\nAs some of you might have heard, it has been a while since I started developing Groundhog (www.groundhogproject.org<http://www.groundhogproject.org>), an OpenSource SketchUp extension for performing Radiance Simulations.\n\n\nI am writing you because one of the latest additions to the LATEST VERSION correspond to the capability of simulating Luminaires from IES files. During this process, I had to reproduce the IES2RAD to respect the policies of \"if you only want to export, then you do not need Radiance\" and \"you barely need post-processing before performing a simulation\".\n\n\nWhat is missing, now, is to compare the results of this simulations with some obtained from other tools (i.e. Dialux, Relux, AGi32, etc). Since I do not have any of those programs, or a WINDOWS machine and is hard for me to find the time for performing these comparisons, I decided to ask for this awesome community for help.\n\n\nIs there anyone who is willing to help me with this? I cannot really pay you for it, but I can guarantee that you will get the require training and support (remotely, probably).\n\n\nHERE IS A LINK TO SOME SAMPLE IMAGES<https://drive.google.com/folderview?id=0B2NfkTSl19hQYUNZOFliMHp2dXc&usp=sharing>\n\n\nIn any case, you are welcome to download and try and use Groundhog as mucha as you want.\n\n\nBest,\n\n\nGermán Molina, www.IGD.cl<http://www.IGD.cl>\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-March/011550.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "March 02, 2016 at 11:46AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_011549", "id": "radiance-general_011550"}