{"body": "We are running a .oct through rpiece and we get the 'resolution mismatch in\nrpict' error.  We have removed -x and -y settings from the .vf files.  We\nhave set the horizontal and vertical angles at 80 degrees and 80 degrees.\nOur .opt file sets -x and -y at 2048 and 2048.  The only other thought we\nhave is that the .oct file has been created through adding up various oct\nfiles which have been created using different -r settings in oconv.\n\n\nAny help appreciated.\n\n\nRegards\n\n\nAndrew\n\n\nAndrew Bissell B.Eng (Hons) C.Eng MIEE\nLighting Consultant \nBuro Happold LiT\nCanal Suite\nChurchgate House\n56 Oxford Street\nManchester\nM1 6EU\n\n\nThis transmission is confidential and intended solely for the person or\norganisation to whom it is correctly addressed. If you are not the intended\nrecipient of this transmission, you should not take any action in reliance\non it. Further, this transmission may contain confidential design and other\ninformation owned by Buro Happold. You should not copy, distribute, use,\noffer for sale or hire such information or in any way infringe the design\nand intellectual property rights of Buro Happold.\n\n\nIt is intended that communication by email from Buro Happold or its\nemployees is limited to communications connected to the services provided by\nBuro Happold. Buro Happold accepts no liability for any communications not\nconnected to the services it provides.\n\n\n\n\n\n\n\n\n________________________________________________________________________\nThis e-mail has been scanned for all viruses by Star Internet. The\nservice is powered by MessageLabs. For more information on a proactive\nanti-virus service working around the clock, around the globe, visit:\nhttp://www.star.net.uk\n________________________________________________________________________\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-November/001242.html).</sup>", "attachments": [], "created_by_name": "Andrew Bissell", "created_at": "November 26, 2003 at 06:15PM", "created_by": "Andrew_Bissell", "parent_id": "radiance-general_001244", "id": "radiance-general_001242"}