{"body": "Hi Greg!\n\n\n> If you lights are clustered together, you might be able to put them  \n> in an enclosing sphere and use mkillum to determine their collective  \n> output distribution, using only as many spherical illum's to light  \n> your space.  (Spheres are in general faster to use as lights because  \n> there is only one sphere per source.)\n\n\nGood point, so I save 3 faces per cluser.\n\n\n> What is the exact configuration of your oil lamps?  Are they all the  \n> same?  Do you have any close-ups you can post somewhere?\n\n\nAt the moment, one lamp is represented just as one sphere with modifier\nlight, and all are the same. Maybe I will add some basic geometry later\n(using instances), but as the lamps are so small compared to the room, that\nis not urgent.\n\n\nI do the following at the moment:\n\n\n1) I have a file conataining one lamp (that is only one modifier and one\nsphere description at the moment.\n\n\n2) I build my clusters by !xform statements in one file per cluster. E.g. I\nhave conical arrangement (a bit like christmas trees), so the corresponding\nfile has some !xform-arrays to create circular groups of lights in differemt\nheigths and radius. I would put the mkillum-sphere in here, too.\n\n\n3) The clusters are placed by markers and the replmarks tools.\n\n\nAs I wrote this, I found how stupid it is to have the light modifier\ndefinition IN the lamp file (1), as this means that I have some thousand\ndefinitions of my lamp modifier now (after xforming them to arrays)... all\nthe same. The first I will change tonight!\n\n\nI think a close-up of a lght sphere is not interesting? ;-) But there have\nbeen nice flames for oil lamps modeled before with radiance. I will post an\nurl tonight to a paper describing it.\n\n\nCU Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-March/003495.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "March 13, 2006 at 10:30AM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_003493", "id": "radiance-general_003495"}