{"body": "Hi Zack!\n\n\n\n\n> My two cents on the subject.\n\n\nMost appreciated.  Thanks to you and all the others who have weighed in. \n  We'll figure this out!  First off, I haven't been able to test \nanything else today; right after I told Jack I would look at the \nrelationship of reflectance to all this the phone rang, and a client \nchanged my entire afternoon.  You know how it goes.\n\n\n> Have you tried raising -ab?  I typically use -ab 5 when doing rtrace \n> calcs - and this just comes from case studies I've done and read, it \n> seems to get the calc within a 1% for most cases.\n\n\nOK, another thing to try.  My tests on the gallery space showed that -ab \n4 was sufficient, but the light levels were higher in those spaces. \nMaybe for these new areas I'm studying, I need to bump it up a notch. \nGod, they're going to take forever to run, but it I get the \"truth\" as a \nresult, it'll be worth it.\n\n\n> Also, the -av setting, for such a low light level calc seems like it \n> could have the impact you are seeing, as has been discussed.  Have you \n> run this with a -av 0 0 0 setting yet?\n\n\nNo, I must try this.\n\n\n> Are the interior illuminances you are reporting an average using a grid \n> of points or a single point?\n\n\nSingle point, again in the interest of time.  Maybe I can try an average \nfor this test model though.\n\n\n> Finally, the average workplane illuminance will only be linear (ie. half \n> the Tvis = half the workplane illuminance) to the combined Transmittance \n> of the skylight/shade system if the interior reflectance of the system \n> is constant.  I only briefly looked at how you defined the shades and \n> noticed the reflectance is slightly different (although it doesn't seem \n> different enough to give an 100% error).  I also noticed the shades are \n> mostly specularly transmissive.  If the skylight is not completely \n> diffuse transmittance, then you are getting some sort of sun patch on \n> your workplane.  If you are doing an average calc using a grid of \n> points, a sun patch could cause the average workplane to seem off, \n> although it may be off the same for each of your runs.\n\n\nYes, see my reply to Jack about that.  It may be part of the cause, but \nas you say the differences in reflectance are not as great as the error. \n  Yes, the shades have a large specular component, but they are \nsandwiched between two very diffuse pieces of glass, so no sun patch.\n\n\n> Also, perhaps a rendering of the room will reveal any oddities that are \n> occuring.  Whenever I get unintuitive results, a rendering will often \n> show me whats happening.\n\n\nYeah, Alex suggests the same thing.  Perhaps...\n\n\n> Hope this helps.\n\n\nYup, thanks.  Hopefully tomorrow I can try all these new ideas you all \nhave proffered.  I can tell from these replies that you are really \nlooking at my material definitions; I appreciate your time and thoughts, \neveryone!\n\n\nP.S.  Didn't I see an ArchEnergy rendering in Architectural Record a few \nmonths ago?  I meant to post something to the list about it.  I can't \nremember the issue or the context, but there was a rendering of that \nPhipps project you have on your website.  Congrats!\n\n\n\n\n\n\n\n\n      Rob Guglielmetti\n\n\ne. rpg@rumblestrip.org\nw. www.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000754.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "May 14, 2003 at 05:43PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_000733", "id": "radiance-general_000754"}