{"body": "Hi Jack, Tarik, y'all,\n\n\nJack de Valpine wrote:\n> Hi Tarik,\n> \n> The .unf finished files are the rendered images pre any filetering \n> operations. The .pic image have been filtered and perhaps some other \n> operations depending on your rif settings. The .pic images are your \n> final frames. To view the animation like a movie you will need to \n> convert your .pic images to tifs or some other format and then from \n> there into an animation format. There are a few options to view:\n> \n>    1. convert final pic frames to jpg and use \"animate *.jpg\" to view\n>       the animation (this presumes linux)\n\n\n... and ImageMagick installed as well, I believe.\n\n\n>    2. to generate an avi or other format (again presuming linux) you can\n>       convert the frames to tifs and then use \"ffmpeg\" to generate an\n>       avi or mpeg. Note this tool can be a little tricky. It is\n>       powerful, but the documentation really presumes a fair amount of\n>       knowledge about codecs, encoding and decoding.\n\n\nThanks for this, I've been looking for a good encoder.\n\n\n>    3. otherwise you can load up the converted frames into something like\n>       adobe premier and generate an animation.\n\n\nTwo other options that I use:\n\n\nMakeAVI\n\n\nMakeAVI is a nice simple Windows-based GUI for taking a bunch of stills \nand squirting them into an AVI movie.\n\n\nPro: GUI-based.\nCon: GUI-based.\n\n\nInfo: http://sourceforge.net/projects/makeavi\n\n\nGIFsicle\n\n\nThis one I just found recently; great for using in scripts as it's \ncommand-line based.  Takes a bunch of stills and makes an animated gif. \n  Quick & dirty, as you please.\n\n\nPros: scriptable, runs on Windows and unix.\nCon: animated gifs aren't really interactive.  I tend to do animations \nof the sun, and it's nice to be able to stop the action and study \nparticular times of day, something you can't do with an animated gif, so \nthanks again for the ffmpeg reference, Jack-o.\n\n\nInfo: http://www.lcdf.org/~eddietwo/gifsicle/\n\n\n\n\n\n\n      Rob Guglielmetti\n\n\ne. rpg at rumblestrip.org\nw. www.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-October/002062.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "October 20, 2004 at 06:42PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_002059", "id": "radiance-general_002062"}