{"body": "Hi Axel,\n\n\nAxel Jacobs wrote:\n\n\n>> > I believe the latest iteration of pmap is the module Carsten \n>> integrated\n>> > with his Radzilla, yes.  Haven't heard from Roland in a while...\n>\n>\n>> I found that there is even no pmap for 3.8? The learnix-distribution\n>> mentions that pmap is not supported any more in their radiance set-up\n>> and available only in radzilla (which is in learnix)\n>\n>\n> I contacted Jan over pmap when I started working on the latest LEARNIX\n> around September last year. He was very busy at the time (and probably\n> still is) with his PhD. He was about to talk to their programmer about\n> some minor changes he liked to see implemented in pmap on top of the\n> obvious adjustments necessary to move it from Radiance 3.7 to 3.8. Seems\n> that Jan has just been too busy.\n>\nYes,  I'm really sorry for that! I'm still working on my PhD, now \nparallel to projects, which is really difficult.\n\n\nWe had to develop a virtual goniophotometer for pmap in order to \ngenerate btdfs for special materials. At the first stage, we thought, \nthat we had to make some changes to pmap to realize that project. Then, \nit would have been no big deal to make the changes to 3.8. But then it \ncame out, that we didn't have to make changes for that. And besides \nthis, at that time we got some new (non-radiance related) projects for \nour programmer and therefore the \"upgrade\" of pmap from 3.7 to 3.8 \nunfortunately sloped down in the priority list.\n\n\nFor us it is really difficult to maintain software, when no related (and \nfinanced) projects are available. Additionally the author of  pmap, \nRoland Schregle, is not at the institute any more, which increases for \nus the needed effort to make changes on the code.\nBesides the financial aspects,  our programmer is \"loaded\" at the moment \nwith more than 120% with other projects until fall of the year, so I \ndon't see a quick solution for that.\nSo in the next months, we can  maintain pmap only , if bugs encounter.\n\n\nI really support your and Lars'  wish to include it in main tree!\nThe question is, how? We need a volunteer, who is maintaining it.\nThis is the main issue. License is absolutely no problem.\n\n\nJan\n\n\n\n\n> Carsten Bauer was kind enough to tweak the 3.7 pmap so it would compile\n> with 3.8. I did, however, decide not to ship it with LEARNIX since it was\n> not officially endorsed by the maintainer. This tough decision was\n> eased by the fact that one or two of the test routines shipping with pmap\n> failed.\n>\n> As regards to Radzilla (radzilla/RADZILLA ???) -- There are three \n> types of\n> photons in pmap, of which Carsten implements two. Don't ask me what they\n> are and when you need them. I guess that the third, unimplemented type is\n> not used very often, otherwise it would probably be there in Radzilla.\n>\n> Because of LEARNIX, I have been following the progression of RZ very\n> closely and am pleased to report that it has improved tremendously over\n> the last 6 months. However, one thing that you always must remember is\n> that RZ is a complete re-write of Radiance 'classic' in C++. While the\n> algorithms are obviously the same, RZ has not seen as much bug-testing \n> and\n> validation as 'Classic' has enjoyed over the years. This is also true for\n> the pmap plug-in. I am not saying that RZ is buggy, but it might be an\n> issue. Carten actually considers RZ 'alpha'.\n>\n> So, to cut a long story short: Unless you go back to R 3.7, there is no\n> 'official' pmap for Radiance. I would personally very much like to see\n> pmap integrated into the main Radiance tree and available with the same\n> download, but there are probably issues (license, maintainership, coding\n> style etc.) that have prevented this from happening. So far, anyhow.\n>\n> Axel\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\n\n\n\n\nDipl.-Ing. Jan Wienold\nProject Manager\nFraunhofer-Institut für Solare Energiesysteme\nThermal Systems and Buildings, Lighting and Daylighting\nHeidenhofstr. 2, 79110 Freiburg, Germany\nPhone: +49(0)761 4588 5133 Fax:+49(0)761 4588 9133\njan.wienold at ise.fraunhofer.de\nhttp://www.ise.fraunhofer.de\n\n\nIn office: \nMo,Tue: 9:00-18:00\nWe-Fr:  8:30-14:00\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2007-May/004354.html).</sup>", "attachments": [], "created_by_name": "Jan Wienold", "created_at": "May 24, 2007 at 05:20AM", "created_by": "Jan_Wienold", "parent_id": "radiance-general_004334", "id": "radiance-general_004354"}