{"body": "Hello Zhe,\n\n\nIt's unfortunate that at the moment, we have only incomplete or withdrawn tutorials covering the 3-phase method.  I hope we will be able to remedy this at some point.  You are actually better off using rfluxmtx instead of rcontrib in most cases, as it simplifies operations and incorporates a more generalized version of genklemsamp.\n\n\nFor example, your first command, which must be the basic daylight coefficient (2-phase) method:\n\n\n\tcat data/photocells.pts | rcontrib -h -I -fo @rtc.opt -e MF:1 -f reinhart.cal -b rbin -o results/sensors/p%03d.dat -m sky_glow -w restroom_whitesky1.oct\n\n\nwill run if you add the option \"-bn Nrbins\" near the \"-b\" option above, but can be replaced with the simpler call to rfluxmtx:\n\n\n\trfluxmtx -I @rtc.opt -w - sky.rad -i restroom_nosky.oct < data/photocells.pts\n\n\nDo not forget the lone hyphen ('-') above -- it tells rfluxmtx to read the sender positions from stdin rather than generating them itself.  Also, the receiver file \"sky.rad\" should not be included in the octree \"restroom_nosky.oct\", but should look like this:\n\n\n##############\n#@rfluxmtx o=results/sensors/daycoeff.dat\n\n\n#@rfluxmtx h=u\nvoid glow groundglow\n0\n0\n4 1 1 1 0\ngroundglow source ground\n0\n0\n4 0 0 -1 180\n\n\n#@rfluxmtx h=r4 u=+Y\nvoid glow skyglow\n0\n0\n4 1 1 1 0\nskyglow source sky\n0\n0\n4 0 0 1 180\n##############\n\n\nThe special comments are very important, as they tell rfluxmtx how to handle each hemisphere and what to do with the data.  (You could also have used the -o option on the command line as before in this case.)  Note that I have removed the \"%d\" from the file name, because you would have ended up with two sets of coefficients for each sensor point in bin #0.  I am not sure about the rest of the commands in your sequence, so you'll have to figure out how to work with the rearranged output, which will now be in columns of triplets, one triplet for the ground followed by a triplet for each of the 145 sky patches.  Each sensor will thus be represented by 146x3 coefficients in each row of the output matrix \"results/sensors/daycoeff.dat\".\n\n\nSome of this is explained in my 2014 \"What's New\" talk from London:\n\n\n\thttp://www.radiance-online.org/community/workshops/2014-london/presentations/day1/Ward_WhatIsNew.pdf\n\n\nYour second command can also be replaced with a simpler rfluxmtx version, but the actual problem appears to be your substitution of single quotes (') in place of the special back-quote character (`) when you call vwrays with the -d option to set the output image dimensions.\n\n\nBest,\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-September/011896.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "September 29, 2016 at 11:20AM", "created_by": "Greg_Ward", "parent_id": "radiance-general_011895", "id": "radiance-general_011896"}