{"body": "Gregory J. Ward wrote:\n\n\n> \n>> Is there a patch for current radiance that allows an alternative\n>> modifier (like void) for the indirect calculation? That is available\n>> in Radzilla and might be very helpful, as I have colorpict maps on\n>> most surfaces.\n> \n> There is no such hack.  It's not really physical, is the problem.\n> \n\n\nHi Greg,\n\n\nSince a long time already I have come to the conclusion that its better\nto stay out of the discussion. I simply do some work based on and\ninspired by the enourmous power and flexibility offered by Radiance,\nincluding of course the fact that it is Open Source, and  quite\nevidently this also means moving away form the original path, having a\ndifferent focus in mind, probably adressing a different group of users,\nwhatever.\nSo, to repeat myself, I normally avoid bothering the Radiance community\nwith my thoughts.\n\n\nBut being misunderstood is not a very nice feeling, so for an\nexceptional case I dare to make a comment on this small example.\nPlease everyone don't feel offended :-) :-)\n\n\nIn the current example you have\na) a surface made out of a material with a complicated pattern, produced\neither by a function or by mapping a photo. Its an architecture scene,\nso the pattern is a common building material, marble, stone, wood,\nwhatever, showing a fine grain color modulation in the rage of some\nmillimeters or centimeters\n\n\nb) you have a scene with bounding cube of some 10 meters to probably 100\nmeters, and an -ad setting of e.g. 1000. So ambient rays send out from\none point e.g. at the floor hit walls and other objects in the big room\nat points maybe several 10 centimeters apart. How much of that fine\ngrain resolution of the applied pattern can really be sampled by this\n'few' (1000 ambient rays *are* still few in a general sense) rays?\n\n\nIf you now specify an average color for that material, with correctly\ndetermined values, I dare to state that this will be equally physical\ncorrect in the limitations of the applied algorithm and general range of\naccuracy the whole stochastic ray tracing method can provide.\n\n\nI of course do not mean to set a blue paint as alternative ambient\nmaterial for a red painted wall. :-)\n\n\nregards\n-Carsten\n\n\nPS: a lot of words for just one example, but this shows quite good how\ndifficult it is to avoid getting misunderstood.\n\n\nPPS: unfortunately, experience has shown that the performace increase by\ncircumventing complicated pattern evaluations for the ambient rays is\nonly noticable for high ambient settings and scenes with lots of\npattern-modified surfaces (especially patterns which make heavy use of\nthe time consuming noise functions), then it can reach 10-15%, for low\nambient settings it is sometimes not noticable at all, so one really\ncannot expect too much from this hack in this respect.\n\n\nPPS: but there are other cases in which the alternative ambient material\ncan be useful, e.g. the topic of color bleeding (see the work of Marcus\nJacobs). Here it is a crude means to simulate the white balance adaption\noccuring in the human visual system within the machine by simply\nreducing the amount of color bleeding 'forwarded' by the ambient\ncalculation.\nBut this is a pure image generation issue, not a scientific one, so it\ndoesn't belong here in this list. Also, it is only an 'intuitive'\napproach (probably there is even a way of performing this based on some\nphysio-psycho-physical model, but evidently I have by no means at all\nthe resources to pursue such an approach)\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-September/003999.html).</sup>", "attachments": [], "created_by_name": "Carsten Bauer", "created_at": "September 15, 2006 at 02:53PM", "created_by": "Carsten_Bauer", "parent_id": "radiance-general_003983", "id": "radiance-general_003999"}