{"body": "Greg, according to different ASTM measurement standards, a hemispherical reflectance meter is deemed as accurate for highly specular and non-specular materials.  ASTM standards encourage the use of multi-angle measurements for materials that have medium gloss.  So it is quite possible, per a given test standard that usage of the hemispherical meter may not yield accurate data.\n\n\nA multi angle meter is analogous to a BRDF measurement, just less angles.  With respect to Radiance terms for Total Reflectance, Total Specular Reflectance, and Total Diffuse reflectance, is there anything we could extract from test data from a multi-angle meter that would allow us to determine terms for Total Specular and Diffuse reflectance, aside from using a BRDF function?\n\n\nFor instance, per Radiance, what angle range around the specular angle constitutes the definition of a specular reflection?  For Radiance, what angle range from the specular angle defines the diffuse reflectance?  Please see attached image.  Here, I am thinking that the definition of Total Specular Reflection should constitute some range of angles around the specular angle.  All other angles should fall within the Total Diffuse Reflection category. For instance if I define the Total Specular reflection as the flux that reflects +/- 15 degrees from the specular angle would that be a good definition?  Alternatively can we use an analogy from the lamp world for the definition of beam angle (% drop off by angle from maximum relative intensity)?\n\n\nThank you for your thoughts as we attempt to reconcile differences in measurement techniques and definitions for parameters for Radiance material classification.\n\n\nToni Clark, P.E.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-October/011310.html).</sup>", "attachments": [], "created_by_name": "Toni Clark", "created_at": "October 22, 2015 at 12:23PM", "created_by": "Toni_Clark", "parent_id": "radiance-general_011299", "id": "radiance-general_011310"}