{"body": ">\n>\n>Zack, you mention that you have\n>a bounding box for the illum, but you don't mention that you have applied\n>lboxcorr.  \n>\n\n\nThe bounding box illum was made by ies2rad, so it's been correctly \nscaled, using boxcorr and everything.  So I don't think the problem is \nrelated to this.\n\n\n>In the standard case, Rayfront will automate all this for you,\n>including the decision whether to use xform or instances for\n>the geometry.  Just that each of your 4 elements must be treated\n>as a seperate luminaire, by actually placing 4 markers instead of\n>just one.\n>\n>But then, I'm not sure which surface in your example is supposed\n>to serve as an emitter, so it may be too tricky for the builtin\n>mechanism to handle it correctly. Is that the reason why you're\n>trying the manual approach?\n>\nI am using Rayfront for most of this, I just go into the files when \nneeded, ie. to take out the sky when creating the lum geom octree.  I \ntried, within Rayfront (my 2nd attempt), to have 4 markers for each of \nthe ies files + 1 marker for lum_geom (overlap between octree bounding \nand ies cubes) and did not get any light output.\n\n\nThanks for all the feed back.  I have alot of alternative methods to \nplay with now.  Jack, your example makes sense and seems to be \nessentially what I tried for my 3rd attempt.  I will try reorganizing \nsomewhat and see if I can get it to work.\n\n\nThanks!\nZack\n\n\n\n\n\n\nZack Rogers\nEngineer / Daylighting Designer\nArchitectural Energy Corporation\n2540 Frontier Avenue, Suite 201\nBoulder, CO 80301 USA\n\n\ntel (303)444-4149 ext.235\nfax (303)444-4304\nhttp://www.archenergy.com\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-June/002766.html).</sup>", "attachments": [], "created_by_name": "Zack Rogers", "created_at": "June 23, 2005 at 09:51PM", "created_by": "Zack_Rogers", "parent_id": "radiance-general_002756", "id": "radiance-general_002766"}