{"body": "Hi Jasper,\n\n\nyou definitely should use a newer version of evalglare.\nIf you go to the website:\nhttp://www.ise.fraunhofer.de/radiance\nyou can at least download the 1.11 version-which doesn't have this bug.\n\n\nThe will be a new version of evalglare coming out in the next days/weeks \n(version 1.17) - this will be announced separately here in that group.\n\n\nRegarding your image: Your calibration must span the luminance-range you \nwant to measure.\nIf you calibrate between 1cd/m2-1000 cd/m2 it does not tell you anything \nhow accurate you are when measuring 100000cd/m2!\nSo if you want to measure the luminance of the sun, then you have to \nmake sure your camera is calibrated for such high luminances as well.\nI guess when you want to measure several million cd/m2 you might need a \ngrey filter. At ISE we had several filters down to 0.0001 transmittance, \nso it was easy to measure also towards the sun and the increase of noise \nfor the lower luminaces doesn't hurt so much.\nYour coating on the window play a minor role in that case... honestly \nfor the sun you can be lucky to measure with one or 2 orders of  \nmagnitude, so if your glazing is 0.75 or 0.4 in light transmittance is \nnegligible compared to the difference between 5000 and 200000000 cd/m2 !\n\n\nThe picture you have in dropbox is also difficult to check with an \nilluminance meter when you integrate the values to an illuminance value, \nbecause the sun is so much on the side and has a very flat angle of \nincidence to your measuring plane. For example when your angle of \nincidence for the light source (here sun) is 80° and your \"uncertainty\" \nfor putting the sensor in the right plane wold be 2.5 degree (it is very \ndifficult to put it more accurate), then you have automatically an \nuncertainty in your sensor reading of 25% (of the illuminance)! (because \nilluminance is cos-weighted and a difference in angle for large angles \nis big for the cosinus).\n\n\nGood luck!\n\n\nbest,\nJan\n\n\n\n\n\n\n\n\n\n\n\n\nAm 8/12/15 um 3:21 PM schrieb Jasper Overduin:\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-August/011193.html).</sup>", "attachments": [], "created_by_name": "Jan Wienold", "created_at": "August 13, 2015 at 07:23AM", "created_by": "Jan_Wienold", "parent_id": "radiance-general_010867", "id": "radiance-general_011193"}