{"body": "Greg,\n\n\nThanks for the valuable feedback!\n\n\nConcerning the limited dynamic range of paper-like based prints, we've moved\nto using transparencies and lightboxes for our output. We've been producing\nthis output with Durst Lambda printers, which use the same kind of colour\ninterpolation as the Lightjet printer.\nDeep black is difficult to produce in this manner, since the material is\nindeed quite reflective, and the backlit nature of lightboxes inherently\ndoenst do justice to pure black. The most beautifully printed black I've\nseen so far was done with Gyclee printers, using up to 11 'ultra wide\ngamuth' inks. These prints were done on matte paper, what's beautiful about\nit is that the black is almost like powder, the detail and depth in the\nblack is nothing but astonishing. (see http://www.colorspan.com)\n\n\nThe idea of working with a Hollywood based company is an option in the sense\nthat its sure they have the technology to do it, but the size of ouput is\nfor the film industry is rather different than what I'm looking for (35mm\nfor ordinary film, 70mm for IMAX). Still I'll see if this could be an option\nwe could pursue.\n\n\n\"Ultimately, I think HDR displays are the best way to appreciate \nlighting simulations.  Until then, we're kind of stuck with low \ndynamic-range, tone-mapped prints and displays.\"\n\n\nI couldn't agree more. Somehow I have the feeling hacking a 32 bit colour\nDurst lambda driver could be an option. Since I'm not a programmer/physicist\nI'm not sure if this suggestion is valid, but what if one could produce\nmultiple exposed lambda prints? Could building up the exposure increase the\ndepth of the printed output.\n\n\n--- I realize discussing the particulars of a machine for output is somewhat\noff-topic for this list... ---\n\n\nSorry for my uninformed openEXR bashing... consider it an over enthousiastic\nexpression for my affection of Radiance ;-)\nThanks for the link/paper considering this topic, it's a wealth of\ninformation to get to the bottom of this! Looking forward for this book!\n\n\nCheers,\n\n\nJelle.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-December/002212.html).</sup>", "attachments": [], "created_by_name": "Jelle Feringa", "created_at": "December 02, 2004 at 07:39PM", "created_by": "Jelle_Feringa", "parent_id": "radiance-general_002190", "id": "radiance-general_002212"}