{"body": "On 14.01.2006, at 16:59, william reynolds wrote:\n\n\nWelcome to Radiance.\n\n\n> hi there\n>\n> As I said in my other question today (spliting a render by light  \n> sources)\n> I am quite new to radiance, and I am having some issues setting  up my\n> renderings. I have radiance installed and working fine, but I dont  \n> quite\n> understand how I make sure the brightness of the final render is  \n> realistic.\n> There are a few reasons for this:\n\n\nYou don't have to worry much about the \"brightness\" of images. The  \nRadiance\nimage file format can store a much greater dynamic range than your  \nmonitor\ncan display or your eyes can see.\n\n\n> I'm not sure what exposure setting to use with pfilt - is it as simple\n> as setting '-e 1' so as not to adjust the exposure? I have tried this\n> and my images all come out very dark, but this might be because I  \n> don't\n> have enough light in the scene (see next paragraph, below).\n\n\nThe information within the images is not lost until you convert\nthe Radiance image (traditionally called *.pic, more resently *.hdr)\nto *.tga (or similar) format which may loose all the details. You can\nconvert to some *.tif formats that support the full range but this\ndepends on the application you will use to process these images\nafterwards.\n\n\nAnd yes, using ra_t16 (for *.tga) or ra_tiff (for *.tif) it is as\nsimple as \"-e +2\" or \"-e -2\" to make the image brighter or darker.\nYour images may in fact appear dark at the first glance when you render\na scene designed for 100 sources with one active source only.\n\n\nOpen your rendered image in \"ximage\" which is designed to handle\n*.pic images. Hit the \"a\" key or \"h\" key to perform an adjustment\nof the image exposure on screen, which should give you a better\nrendering (on screen) of the image information. Read the man-page\nof ximage for further details on the controls. Then read the man-page\nof \"pcond\" which will create an new addjusted image.\n\n\nPlease note that most image manipulation tools bundled with Radiance\nwill work as filters and dump their output to your terminal window\nwhen not told otherwise. Usually you will redirect the output to a\nnew file or \"pipe\" it into another program. These are basic Unix\nconcepts you should know to get the most out of your new Linux box.\n\n\nExamples:\n\n\n     pcond -h+ oldimage.pic > newimage.pic\n\n\n     pcond -h+ oldimage.pic | ra_t16 -3 > newimage.tga\n\n\n> Has anyone used radiance with any theatrical light fixtures?\n> and would they be prepared to share the .rad files for them?\n> I have found the .rad descriptions of architectural fixtures,\n> but i'm not familiar with any of them, and even if I was I need\n> to be able to use accurate models of the specific instruments\n> I'll be using in theatres. I would simply build my own files,\n> using the iestorad utility, but rather unhelpfully the instrument\n> manufacturers dont seem willing to give out ies data.\n\n\nRob Shakespeare, coauthor of \"Rendering with Radiance\" (see below)\nhas experiance in this field, as have some others here on the list.\n\n\nIIRC there was a post a few weeks ago about theatrical lights.\nI'm not shure if the poster was willing to share his homemade\nmessurments of some fixtures. Hope he will answer personally.\n\n\n> Has anyone made any more materials information available to the\n> public? I have looked through the material.rad list of materilas\n> in the lib folder, but I'm specifically looking black paint and\n> heavy black cloth type materials. If not, then does anyone have\n> any recomendations of how to go about determining good values to\n> use in my own materials definitions? I dont have access to any\n> way of measuring reflected light levels in an experiment.\n\n\nYou can find a short introduction to the radiance materials\nat other things here:\n\n\n     http://radsite.lbl.gov/radiance/refer/usman1.pdf\n\n\nand here (follow link \"Documentation\" and start with the\n\"radcourse_basic.pdf\" document)\n\n\n     http://luminance.londonmet.ac.uk/learnix/\n\n\nWhile browsing for the link to Axel Jacobs more resent tutorials\nI found this overview of materials:\n\n\nhttp://www.learn.londonmet.ac.uk/student/resources/radiance/ \nmaterial_db.shtml\n\n\nEveryone highly recommends \"The Book\" about Radiance:\n\n\n     http://radsite.lbl.gov/radiance/book/\n\n\nIt even includes a chapter about \"Dramatic Lighting\" (stage lighting).\n\n\n> Thanks for your help with my probably rather basic questions\n> Will\n\n\n\n\nEveryone has his/her share of problems with Radiance ;)\n\n\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-January/003260.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "January 14, 2006 at 08:06PM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_003256", "id": "radiance-general_003260"}