{"body": "Axel has some key points here, which bear repeating:\n\n\n> Our experience in LEARN show (and this is also what CMS/Wiki gurus out\n> there on the big 'Net have to say) that CMS systems will only work  \n> if and only if:\n> - there is an existing resource\n> - the admin of this resource gets so many requests for updates and  \n> additions that it is more than he/she can handle\n\n\nThis relates to an existing resource that someone is charged with  \nmaintaining, and is looking for an easier way to do so.  In other  \nwords, there is an active source of information that people have come  \nto rely on, and it is in everyone's interest to maintain it.\n\n\nIn the case of Radiance, we are fortunate to have an active user  \ncommunity, but no one here has a wealth of time to devote to side  \nactivities that may or may not benefit others.  A Wiki or any set of  \nmaintained web pages that require substantial effort to put together  \nis similar to a public mural.  Other than the satisfaction you get  \nfrom participating in the assemblage, there is no motivation to  \nmaintain the work other than personal pride as leisure allows.  A  \nmural deteriorates unless there is an active community caring for it.\n\n\nThe problem with a Wiki is that no one knows if pages they create are  \nbeing read or by whom, and even if they knew, they would have no  \nfeedback as to how helpful the material is, how to improve it for  \nothers, or whether they are simply wasting their time.  The feedback  \nmechanisms are lacking, unlike a mailing list, where when you post,  \nothers (usually) respond.\n\n\nI see similar problems with resource pages using Plone.  Other than  \nmoderated access, it sounds a lot like a Wiki to me.  What would  \nmotivate volunteers to be responsible for particular topics?  What is  \nto keep them from losing interest in short order?  I like the notion  \nof having experts in particular domains, but there needs to be some  \nbenefit corresponding to the level of effort required.  It also seems  \nlike a lot of work up front.\n\n\nIf we get a line up of volunteers and some momentum in this  \ndirection, $1.4K plus a few hundred for a new motherboard seems very  \nlittle to ask to get this going.  I'm sure I could wrangle that out  \nof unnamed sources without too much difficulty.  It's just a question  \nof convincing everyone to participate.  I would be more convinced  \nmyself if there was some feedback mechanism involved, Radiance  \ndollars or some nonsense that benefactors of information on the sites  \nwould donate to maintainers, who could use them to subsidize their  \nnext workshop attendance(??).\n\n\nWe're bright people.  I'm sure we can figure out something that would  \nwork!\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-May/003646.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "May 05, 2006 at 05:44PM", "created_by": "Greg_Ward", "parent_id": "radiance-general_003643", "id": "radiance-general_003646"}