{"body": "Bleicher, Thomas wrote:\n> I think your looking for high quality renderings of the interior, so\n> you definitely want to use mkillum to restrict your scene to the interior.\n> If it's just a crude rendering I'd create a sky and wouldn't bother\n> much about the windows as light source.\n>   \nThat's what we've got going, it's a building with lots of glass and \nskylights and such. So do you think just having the windows be glass \nwould be enough to get somewhat-close numbers? I fear that not making \nthe glass a secondary light source, and just having it be, well, glass \nand only having the ray of sunlight bouncing around is going to give me \nbad numbers.\n> You could write a script to delete polygons with material glass based\n> on their area (reduce 6 sides to 2) and vicinity to already checked\n> polygons (reduce 2 to one) but that's not going to be easy. You might\n> be able to edit the windows in MAX to get a Radiance friendly geometry. \n>   \nThat's what I'm doing, I can edit them in Max via the 'Edit Poly' \nmodifier, but I'll need to research this more. I want to stay away from \nhand-editing much of anything, for I want to be able to go back and edit \nthe Revit model, re-export to Max, and from there re-export to OBJ2RAD \nfor quick revisions. So far, so good on that front, but this glass thing \nis leaving me stumped.\n> Please see the man page for obj2rad. The top section describes\n> material mapping based on the context (or material) of the face\n> in the obj file. If you use the same set of materials in all your\n> models you could create a material library and a corresponding\n> mapping file. Obj2rad then assigns the correct Radiance material\n> name (as far as I understand this point, never used it much).\n>   \nI saw that. I was hoping there was a way to use the .MTL file that's \nalready generated by Max. Basically, I'm just being lazy, and hoping \nthere was an existing solution out there.\n> You're welcome! If you can provide Radiance geometry we might\n> offer a discount ... ;)\nNow that doesn't sound like a bad idea! ;-)\n\n\n\n\n\n\nJeffrey McGrew\n\n\nBecause We Can, LLC\n(415) 505-4689\nwww.becausewecan.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-May/003665.html).</sup>", "attachments": [], "created_by_name": "Jeffrey McGrew", "created_at": "May 11, 2006 at 05:37PM", "created_by": "Jeffrey_McGrew", "parent_id": "radiance-general_003659", "id": "radiance-general_003665"}