{"body": "Hi Greg,\n\n\n>>> Just to clarify, gensky ALWAYS produces an accurate CIE sky \n>>> distribution.  Adjusting the turbidity or these other factors only \n>>> affects the absolute levels and the ratio between solar and sky \n>>> components.  It does not change the distribution of skylight.\n>>\n>>\n>> I don't doubt the relative luminance distribution of the sky is \n>> accurate, I'm just questioning how Radiance determines the correct \n>> overall level.\n>\n>\n> In my opinion, and others may differ, there is no \"correct overall \n> level\" for daylight.  You can come up with a ballpark value, but \n> getting within 50% without some more specific weather data is overly \n> ambitious.\n\n\nHuh, I've always seen a little better correlation between these \ncalculations and both weather data and measurements I've taken in \nColorado (when taking into account elevation factors).  I know you can \nnever count on it to be exact but from the limited data I've looked I \nsay it was always atleast within 20% both + and -.  And I guess all I'm \nlooking for is a good average - so half the sites at that lat. might \nhave higher and half, lower.\n\n\n>> I should clarify what I mean when I say the CIE sky function tells \n>> me....I am refering to both the sky and sun calculations laid out in \n>> the latest IESNA lighting handbook which uses Kittlers CIE adopted \n>> sky function (which I understand is from his 1967 studies) to \n>> determine the sky component.  So I probably should have said that \n>> IESNA sky/sun functions tell me.  I am not sure if this is the \n>> accepted method used by others.  The direct component is calculated \n>> as this;\n>>\n>> Edn = Ext * e ^ (-cm)\n>>\n>> where;\n>> Edn = direct normal solar illuminance\n>> Ext = extraterrestrial solar illuminance = Esc * (1 + 0.034 * cos ( \n>> (2pi/365)*(J-2)))\n>>                where;\n>>                Esc = solar illumination constant = 127.5 klx (11,850 fc)\n>>                J = julian date\n>> c = atmospheric extinction coefficient (given as c = 0.21 for clear ; \n>> c = 0.8 for partly cloudy)\n>> m = optical air mass = 1 / sin (solar altitude)\n>>\n>> and Direct Horizontal (Edh) would then be;\n>> Edh = Edn * sin (solar altitude)\n>>\n>> This gives the Direct Horiz to be 8,821 fc on a clear summer solstice \n>> at 40 lat.  This is what I would like Radiance to give me without \n>> having to specify with the -r parameter.  Currently it is giving me \n>> 6,836fc.\n>\n>\n> The formula above for Ext must be specific to the northern \n> hemisphere.  I don't see how the same seasonal correction factor could \n> apply everywhere on the globe.  I don't think this is the declination \n> angle, as the solar altitude includes that.  I'm not sure what this is \n> about.\n\n\nI'm confused.  What seasonal correction factor, c?  The declination \nangle does go into the solar altitude angle calc, but it is not used \nelsewhere in this calc.\n\n\n>\n> The variation of atmospheric extinction is quite large.  I wouldn't \n> trust this, either.  In other words, this gives you a value, but I'm \n> not sure it's any better than the guess provided by gensky.  It's \n> still just a guess.\n\n\nI'm sure this atmospheric extinction factor was derived from weather \ndata.  I don't think IES would publish unless there was atleast some \nverification.  I think this variable is trying to take into account the \ndifferent turbidities for clear and partly cloudy skies.\n\n\n>\n>> The IESNA recommends calculating the diffuse component like this;\n>>\n>> Ekh = A + B * (sin (solar altitude))^ C\n>> where;\n>> Ekh = horiz. sky illuminance\n>> A = sunrise/set illuminance = given as 0.8 for clear sky\n>> B = solar altitude illuminance coef. = given as 15.5 for clear sky\n>> C = solar altitude illuminance exponent = given as 0.5 for clear sky \n>> (all in terms of klux)\n>>\n>> This gives a diffuse horiz of 1484.2fc.  Radiance gives me this with \n>> a turbidity of 3.22.  But as I illustrated before it can range \n>> dramatically.  Ekh is then fed into the CIE sky distribution function \n>> like so;\n>>\n>> Lz = Ekh * ZL\n>> where;\n>> Lz = zenith luminance\n>> ZL = zenith luminance factor - given as a table of values\n>>\n>> Then Lz is part of Kittlers distribution function.  I am not going to \n>> attempt to type this function but I think we are on the same page \n>> here. Although I understand they, CIE, are about to adopt a new sky \n>> function with 15 different sky types (Thanks Karen for the info!).  I \n>> have not attempted to wrap my head around this yet...for now I am \n>> happy enough with the old function.\n>\n>\n> What is the table based on?  Is Kittler's function the same as the CIE \n> clear sky?  I'm confused.  This all seems a bit arbitrary to me, \n> especially in the slection of constants for clear vs. overcast skies.\n\n\nI'm not sure what the ZL table is based on, again I am guessing it is \nderived from weather data.  Yes, from what I understand the CIE clear \nsky is Kittler's function from the 1967 studies.  Yeah, I'm not sure \nwhere the A, B, and C variables are derived from either.  I just do what \nIES tells me to.  Actually, I tend to trust these calcs for several \nreasons; 1) they have never seemed to be off more than 20% from weather \ndata and measurements I've looked at (but I've done no extensive study \nby any means) and 2) while I'm not one to question master Greg Ward, I \nam also not one to question David DiLaura or the IES.  One of the other \nsky calculation programs I'm using for these comparisons is one he wrote \nbased on these equations, it was discussed as one of the best \nmethodologies to estimate daylight levels, given that exact predictions \nare always impossible.\n\n\n>\n> However, if you like this calculation, you could certainly add it as a \n> wrapper to gensky using a simple shell script that computes the -r and \n> -b options based on these factors and I'd be happy to add it to the \n> distribution.  To my sensibilities, it seems like a lot of effort for \n> what must be a pretty crude estimate.\n\n\nI do like this calculation.  If it is not too much trouble, I for one, \nwould like to see it added to gensky.  Otherwise, I can always apply a \nmultiplier outside of gensky to adjust.  BTW - I think what this has \nshown is that it is dangerous to apply the -r option without applying \nthe -b options or adjusting the turbidity and vice versa.  Since that \nwould change the sky to sun ratio and give you a false sky/sun \ncondition?  When I was only specifying a -R the change in the sky \nilluminance was less than a 1 fc while the change in the solar \nilluminance was roughly 2000fc.\n\n\n>\n> It seems that the correct input to these equations is every bit as \n> difficult as turbidity to obtain, if not moreso, and just using the \n> values in the book is equivalent to using some rule-of-thumb value for \n> turbidity in most respects.  It's just as likely to give you a \n> reasonable value, not!\n\n\nWell, I guess since the difficult input has be done for us with the \nconstants, and if you trust the constants its not as difficult.  \n\n\n>\n> I really think TMY data is a better starting point than the IES \n> handbook or gensky's default calculation.\n\n\nYeah, I agree.  And when it matters (for annual calculations) I use TMY \ndata.   Just sometimes in daylighting design you want to show those \nworst case conditions - a sunny summer solstice and a cloudy winter \nsolstice.  These are all theoretical studies where it is okay to use an \naverage sky and not actual data, since TMY weather data might not give \nyou those conditions.  Also, with TMY data, I have never found the \ndirect normal (converted to horiz.) and diffuse horiz. data to add up to \nthe global data reported, they are typically close but never exact.  And \nit seems like the global measurement must be the most accurate of the \nthree.\n\n\n>\n> Bottom line is that the calculation of absolute levels is suspect in \n> gensky and also suspect in the equations you've listed.  Weather data \n> is more reliable, and that will show you that absolutes vary quite a \n> lot even in a particular locale, especially for overcast skies.  If \n> there is a consensus as to what the default calculation should be in \n> gensky, I'd be happy to implement it.  However, a change to the output \n> from one version to the next can throw people off just as badly as \n> leaving a slightly wrong calculation in there.\n\n\nPerhaps if you do the change, it could just be an add on specified by a \n-ies switch or something.\n\n\nThanks so much for the quick responses and helpful information!\nZack\n\n\n\n\nZack Rogers\nStaff Engineer\nArchitectural Energy Corporation\n2540 Frontier Avenue, Suite 201\nBoulder, CO 80301 USA\n\n\ntel (303)444-4149 ext.235\nfax (303)444-4304\nwww.archenergy.com\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-October/001075.html).</sup>", "attachments": [], "created_by_name": "Zack Rogers", "created_at": "October 16, 2003 at 11:25PM", "created_by": "Zack_Rogers", "parent_id": "radiance-general_001063", "id": "radiance-general_001075"}