{"body": "Hi Greg,\n\n\nI am sending you a simple test with my results, so you can have a look\nif you have the time. I have included a small batch file to run the\ncalculation under MS-DOS (I had to change the extension to bat2 in\norder to avoid the attachment to be blocked).\n\n\nIn answer to your questions:\n\n\n1- I was testing different sun positions, but the test attached\nincludes only one. This should suffice to try different angles of\nincidence, since every reflector has a different orientation.\n\n\n2- I am not sure if I understand this point. I do see different values\nwhere direct and reflected components converge, is that the question?\n\n\n3- I checked the normals and they point outwards, but I guess that was\nexpected since I can see the reflections and the camera is located\noutside the buildings.\n\n\nI greatly appreciate your help, this issue is really puzzling me.\n\n\nMany thanks,\n\n\nRioboo\n\n\n\n\nHi Rioboo,\n\n\nYour definition looks correct to me.  What different conditions are\nyou using to make this determination?\n\n\n1) Do you change the angle of the sun?  This is the only way to test\ndifferent angles on the mirror, since the sun is a collimated source\nof light.\n\n\n2) When you change the solar angle, do you move your point or at least\nensure that it remains in the reflected beam?  If it sees sunlight\ndirectly as well, you will need to look for variation in the 8-80%\nthat is reflected (depending on angle).\n\n\n3) Are you sure your mirror surface normal faces outwards?  If it\nfaces inwards, like most windows in Radiance, then the mirrored\nsources will only happen on the interior.\n\n\nCheers,\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-June/011793.html).</sup>", "attachments": [], "created_by_name": "goodriver laurus", "created_at": "June 13, 2016 at 11:56AM", "created_by": "goodriver_laurus", "parent_id": "radiance-general_011789", "id": "radiance-general_011793"}