{"body": "On Sun, 25 Oct 2015 00:26:38 +0200, Chris Kallie <kallie at umn.edu> wrote:\n\n\n> Fellow Renderers,\n>\n> I wish to account for all scattering events (i.e., specular reflections  \n> and refractions) that eventually make it to the viewpoint, and I wish to  \n> render (or at least account for) scattering events incrementally, in  \n> order to visualize the unfolding (and hopefully the order) of  \n> contributing events. I have been successful (to some degree) when the  \n> environment has a non-zero reflectance, but mkpmap fails when I set the  \n> surrounding environment reflectivity to zero.\n\n\nHi Chris,\n\n\nglad to hear you're trying this out! Photons only account for indirect  \nirradiance on surfaces with non-zero diffuse component, which explains  \nyour failure case with the black surround.\n\n\n> I have also been able to render 1+ scattering event(s) with mkpmap, plus  \n> 1+ scattering event(s) with rpict, when including a non-zero reflectance  \n> Lambertian environment, but I don't think those images are useful  \n> because I don't think they describe any realistic physics\n\n\nWell, basically you'll get a biased (underestimated) solution. With mkpmap  \nyou can limit the number of photon bounces with the -apm option. Normally  \nthis parameter is only relevant for pathological cases, i.e. when using  \nsurfaces with absurdly high reflectance.\n\n\n> In summary, I would like to use a combination of mkpmap and rpict to  \n> incrementally build the photon array, and perhaps use pcomb or some  \n> other statistical or combinatorial technique to analyze the  \n> contributions of scattering events as they relate to the viewpoint.\n\n\nWithout modifying the code, I believe you can only separate out the  \nambient component via commandline arguments (correct me if I'm wrong,  \nGreg). To only get the ambient component, you can subtract a run with -ab  \n0. This isn't specific to photon map tho.\n\n\nThe alternative is rcontrib, but the photon map only accounts for light  \nsource contributions, so that's no help in your case.\n\n\nBest regards,\n\n\n--Roland\n\n\n\n\n\n\nDr. Roland Schregle\nSenior Research Associate\n\n\nLucerne University of Applied Sciences and Arts\nSchool of Engineering and Architecture\nCC Envelopes and Solar Energy (EASE)\nwww.hslu.ch/ccease\n\n\nT direct: +41 41 349 36 26 (New)\nroland.schregle at hslu.ch\n\n\nTechnikumstrasse 21, CH-6048 Horw (Correspondence)\nEbenaustrasse 20, CH-6048 Horw (Office)\nT +41 41 349 33 11, F +41 41 349 39 60\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-October/011321.html).</sup>", "attachments": [], "created_by_name": "Schregle Roland HSLU T&A", "created_at": "October 25, 2015 at 08:04AM", "created_by": "Schregle_Roland_HSLU_T&A", "parent_id": "radiance-general_011318", "id": "radiance-general_011321"}