{"body": "alex summerfield wrote:\n> OK Rob,\n> \n> I mean if you generate a CIE overcast sky with horizontal diffuse\n> illuminance of 10,000 lux <snip>\n> \n> Anyway check that this test is running OK with the diffuser that is\n> 'working' - then move onto the problem diffuser.\n\n\nOh, now I get it.  Thanks for explaining that to me.  I will try that. \nI'm swamped with other things at the moment, so my investigation into \nthis has stalled, but I will try your technique soon enough.\n\n\n> If it doesn't show the proportional relationship then perhaps some of your\n> settings at these low lighting levels mean that absolute rounding may be\n> having an undue effect. At low light levels small absolute errors will\n> produce large percentage errors in the quantitative results.\n\n\nThat was my fear.\n\n\n> As you may be relying on a relatively few measurement points in very low\n> light levels - i reckon it would be worth doing some small renderings so you\n> can 'see' what is going on - for instance observing the distance between the\n> ambient calculation points causing light leakage problems (that appear as\n> splotches in images) or detecting modelling errors that are not significant\n> at the higher illuminance levels.\n\n\nGood point.  They just take forever with all the bouncing and all.  Byt \nmaybe it's warranted.\n\n\n> The renderings could be used like an overture calculation - ie reuse the\n> ambient file to recalculate your illuminance values and compare with\n> previous results. Again there should be consistency in the results.\n\n\nGood point (again), though I thought that rtrace didn't really benefit \nfrom an overture calculation.  Perhaps that's YAM (yet another \nmisunderstanding).  Hmmm....\n\n\n> hope this helps\n\n\nYeah, I think it does, thanks!  I appreciate your replies.\n\n\n\n\n\n\n      Rob Guglielmetti\n\n\ne. rpg@rumblestrip.org\nw. www.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000749.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "May 14, 2003 at 03:02PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_000733", "id": "radiance-general_000749"}