{"body": "Dear Jan,\n\n\nThank you very much for your answer and suggestions.\n\n\nI had illuminance value also at camera level, because I had spots of high\nluminance. I have an fish-eye lens, the specifications said that it gets\n180º but it catches 160º. I hope that it can work. Ok, first I will check\nif calculated illuminance is the same as measured.\n\n\nI understand that perhaps DGP is not the best option to describe glare in a\nrestaurant, excuse me. However, we have problems with highly glazed façade\nthat provides very high luminance values to achieve good concentration on\nthe taste and calm quality atmosphere, as well as, privacy. We have done\nsurveys and usually people tolerate more visual discomfort in this\nactivity, due to the habit probably, but when you show atmospheres with\nless out luminance values, they prefer. I am not sure if I am ok, but, the\nperception results are quite similar to the DGP results. Anyway, thank you\nagain and I will listen to you and check all variations to demonstrate this\nproblem.\n\n\nYours sincerely,\nUrtza. \n\n\nJan Wienold <jan.wienold at epfl.ch> escribió:\n\n\n> Dear Urtza,\n>\n> it is not 100% clear to me what you have measured besides your image. Do\n> you have an illuminance value also at camera level? This is very much\n> needed to check the validity of the image, especially when you have\n> spots of high luminances (e.g. the sun or reflections of it) in the\n> field of view. Do you have an fish-eye lens?\n> So the first step is to check compare the calculated illuminance from\n> you fish-eye image with this value to check if you have problems with\n> pixel overflow/saturation. This would explain big differences between\n> image calculated illuminance and measured. If you don't have a fish-eye\n> lens you cannot make this simple check. Then you need to measure with a\n> spot luminance meter the highest luminance in the field of view and\n> compare it with the value in the image.\n>\n> If you have measurements of the Direct and Diffuse Irradiation, then it\n> is better to use gendaylit, where you can provide both values.\n>\n> For your simulated data, there must be an mistake in your workflow. If\n> you calculate the illuminance by \"rtrace -I\"  you should get the same\n> value for the illuminance than calculated from the image (you can\n> calculate the illuminance with evalglare -V . If you use the -I option\n> in evalglare, it is just replacing the internal calculated illuminance\n> value by the external one, all other algorithms are the same. So if you\n> get different values, then you have a problem either with your image or\n> with the illumiance calculation. So check first the difference in the\n> illuminance. In case you are simulating a trans-material (e.g. for a\n> fabric), pixel sampling, limit weight ect. might play a big role and\n> could cause huge differences between image and rtrace calculations. But\n> there could be many other reasons, depending on you scene you are\n> simulating. Then parameter settings play a big role.\n>\n> And another important comment is, that I don't believe that the DGP is a\n> metrics to describe glare in a restaurant. The needs are very much\n> different between an office and a restaurant. In a restaurant you are\n> dealing mainly with disability glare, I'm not sure if discomfort glare\n> is perceived so much for this kind of usage. Of course with the DGP you\n> can compare different variants and judge which variant has more often\n> glare than other ones. But I would say you cannot make a distinct glare\n> evaluation in a restaurant using DGP.\n>\n> Jan\n>\n>   Am 11/26/15 um 9:30 AM schrieb urtza.uriarte at upc.edu:\n>\n>>  \n\n\n  Dear experts,\n \nI am testing glare at restaurants of Barcelona for my thesis. I am using\nEvalglare v 1.11 with real illuminance (-I Ev) data for photographs\nconverted to hdr by WebHDR and for visualizations got by Radiance.\nFurthermore, I am testing glare by DIVA. I have tested with both, Evalglare\nand DIVA’s Evalglare with Clear Sky without Illuminance data and with\nilluminance data.\n \n# gensky 7 22 11 +s -a 41 -o -2 -m -15\n \n# gensky 7 22 11 +s -a 41 -o -2 -m -15 -B 458.100\n \nI have taken photograph’s Daylight Glare Probability index with real\nilluminance data as reference. Therefore, without Ev data, DGP’s with\nClear Sky without illuminance data is more similar than Sky with\nilluminance data (-B):\n \ndgp photographs= 71%\ndgp DIVA Sky without illuminance data= 63%\ndgp DIVA Sky with illuminance data (-B)= 100%\ndgp (just Radiance-Evalglare) Clear Sky without illuminance data= 62%\ndgp (just Radiance-Evalglare) Clear Sky with illuminance data (-B)= 100%\n \nMy illuminance data has both, direct and diffuse irradiance. Could someone\nconfirm if –B parameter is only for diffuse radiance? I think, that is\nexplained in the program specifications.\nThank you in advance.\n \nKind regards,\nUrtza.\n\n\n\n\n_______________________________________________ Radiance-general mailing\nlist\nRadiance-general at radiance-online.orghttp://www.radiance-online.org/mailman/listinfo/radiance-general\n--  Dr.-Ing.  Jan Wienold Ecole Polytechnique Fédérale de Lausanne (EPFL)\nEPFL ENAC IA LIPID  http://people.epfl.ch/jan.wienoldLE 1 111 (Office)\nPhone    +41 21 69 30849\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-November/011369.html).</sup>", "attachments": [], "created_by_name": "Urtza Uriarte", "created_at": "November 26, 2015 at 07:59AM", "created_by": "Urtza_Uriarte", "parent_id": "radiance-general_011367", "id": "radiance-general_011369"}