{"body": "Hi Germán,\nThank you very much for explanation. Now I have more idea of the\nThree-Phase Method.\nI do not know how the sky rotate, but, I will check Sky Vector's\nparameters.\nKind regards,\nUrtza.\n\n\nGermán Molina Larrain <germolinal at gmail.com> escribió:\n\n\n> Urtza,\n>  \n>     REGARDING QUESTION 1.\n>      \n> The CIE Overcast sky is simetric and independent of the date and\n> location. That means that it does not matter if you rotate your model\n> and the sky or change the location and the date, it will always return\n> the same vector when fed into genskyvec.\n>  \n> Genskyvec approximate the sky as \"finite elements\" of constant Radiance.\n> I understand this is done using Ray-tracing. That means that each patch\n> (element of the sky vector) will have a different value that correspond\n> to this approximation.\n>\n>    Finally, the sky vector does not depend on the model just as the\n> sun's position does not depend on the orientation of your apartment.\n> However, I understand it is possible to calculate a rotated sky vector.\n> This is faster than performing all calculations again with a rotated\n> model (i.e. if you rotate the sky clockwise, it is the same as rotating\n> the model counter clock wise).\n>\n> REGARDING QUESTION 2.\n>  \n>    Klems divition is always the same divition. However, the direction\n> used to trace rays (for sampling and calculating the View matrix) will\n> depend on the orientation of the window. This is the same as saying that\n> the same camera will give you different images if pointing on different\n> directions.\n>\n>  \n>    I hope I understood your questions and that my answers help\n>  \n>    Best,\n>  \n>    Germán\n>\n>\n>    2015-07-03 6:44 GMT-03:00 <urtza.uriarte at upc.edu>:\n>\n>> _Dear experts,\n>>\n>> I am trying to learn three-Phase Method for Simulating Complex\n>> Fenestration.\n>>\n>> I have two questions of Sky Vector and Klems divisions of Daylight\n>> Matrix:\n>>\n>> 1) Sky Vector:\n>> I am trying with Overcast Sky. I have done as following for Windows (I\n>> have Ubuntu 14 now, but, I am checking the first steps done by Windows):\n>>\n>> gensky 12 21 15 -c -B 0.55866 | perl c:/radiance/bin/genskyvec.pl[1] -m\n>> 4 -c 1 1 1 > review/skies/12_21_15.skv\n>>\n>> (I do not know if is good) So, I am sure that for each time during the\n>> year it generates the same Sky Vector. However, I think that the\n>> \"genskyvec\" calculation divided the sky in different parts in contrast\n>> with \"gensky\" command that generate void brightfunc material.\n>> Therefore, the skyvector does launch different values for each sky\n>> division? If I rotated my model I get different illuminance date for\n>> only Sky Vector variable?\n>>\n>> 2) Klems divisions of Daylight Matrix:\n>> When there is a definition of \"kbin(Nx,Ny,Nz,Ux,Uy,Uz)\", is it because\n>> for each orientation there are some different values? I suppose that\n>> for each orientation it uses the same divisions.\n>>\n>> Excuse me, but, I am trying with a rotated model and I want to ensure\n>> that I understand well the method. Sorry for the inconvenience. Thank\n>> you in advance.\n>> Your faithfully,\n>> Urtza._\n>>\n>>  \n>>\n>> ________________________________________________\n>> Radiance-general mailing list\n>> Radiance-general at radiance-online.org\n>> http://www.radiance-online.org/mailman/listinfo/radiance-general_\n>>  \n\n\n\n\n\n\nVínculos:\n\n\n[1] http://genskyvec.pl\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-July/011089.html).</sup>", "attachments": [], "created_by_name": "Urtza Uriarte", "created_at": "July 04, 2015 at 12:31PM", "created_by": "Urtza_Uriarte", "parent_id": "radiance-general_011083", "id": "radiance-general_011089"}