{"body": "Hi Frederic,\n\n\nI'm not sure what you are asking, exactly, but pcond should work\nfine as long as you give it a valid Radiance picture.  The\ncommand syntax is simple:\n\n\n% pcond input.pic > output.pic\n\n\nThere are a bunch of options for simulating human visibility, etc.,\nbut you probably should avoid them if your input image isn't\ncalibrated (i.e., if it doesn't have a valid EXPOSURE= line\nin the header, which you can read with the getinfo command).\n\n\nAnother program that performs a simpler, faster histogram adjustment\nis normtiff, which takes a Radiance or LogLuv TIFF input and produces\na 24-bit RGB TIFF output.  It's syntax is:\n\n\n% normtiff input output.tif\n\n\nThe minimum value in the image will be mapped to the minimum value\nof the display, which is determined by the dynamic range given in\nthe -d option (default is 32).  This comes out as 0 in the 0-255\nrange.  If you don't want black output values, then you will have\nto use a different algorithm or modify the source code of this one.\nBut why wouldn't you want to use the full display range available?\nDo you have a specific application need you aren't telling us about?\n\n\n-Greg\n\n\n\n\nFrederic Drago writes:\n\n\nI am trying to map a scene (not rendered with Radiance, but saved as RGBE \npic)using the histogram method with pcond.\nWho can I map luminance values not from black to white but from dark\nto white. Clearly shadows areas are not black, the output of pextrem is like \nthat:\n469 73  5.702972e-04 5.702972e-04 5.702972e-04\n311 652 7.402344e-01 7.402344e-01 7.402344e-01\n\n\nI can do it with linear mapping, but my purpose is really to use\nthe histogram method!!\n\n\nThis problem seems to be relevant to almost any scene.\n\n\nThanks for any advice.\n\n\nFrederic Drago\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-March/000170.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "March 13, 2002 at 07:41AM", "created_by": "Greg_Ward", "parent_id": "radiance-general_000169", "id": "radiance-general_000170"}