{"body": "Some very quick replies and clarifications within:\n\n\nOn 7/9/15, 10:26 AM, \"Ikrima Amaireh\" <ezxia at nottingham.ac.uk> wrote:\n\n\n>Hi G. Larrain,\n>\n>Thanks for your detailed clarification (below).\n>\n>I wonder if you kindly can help me toward better understanding and\n>answering the following:\n>\n>We agreed that for daylight modelling of spaces with CFS, Radiance is a\n>suitable tool as it applies ray-tracing method. And for annual and/or\n>climate-based daylight calculations, as calculation time becomes a\n>critical factor, using BSDF data for CFS is highly recommended to tackle\n>the task with radiance (using phases methods). However:\n\n\n\n\nBSDF data in an annual simulation context is generally limited to Klems\nbasis BSDF data, which may not be high enough resolution for some CFS. And\nthe 5-phase method, which can circumvent this, is not necessarily \"quick\".\nThis is all still very much a quandary and the newest daylight metrics\nhave added confusion to all of this, IMO.\n\n\n\n\n>\n>- if someone needs to perform daylight calculations for given space with\n>different CFS (different cases for comparison purposes) to get\n>illumination levels for horizontal grid points (and not pictures nor\n>scenes), is Radiance still the most convenient option?\n\n\n\n\nAbsolutely. The lack of an image-as-output requirement does not change the\nfact that ray tracing is a good/convenient algorithm option for daylight\nsimulation problems, especially when dealing with diffusing media and CFS\nin general. BSDFs allow you to do lots of \"what-ifs\", relatively quickly,\nbut are beholden to the limitations of the resolution of the BSDF.\n\n\n\n\n>- is it still needed to use any of the phase methods (2, 3 or 5)?\n\n\n\n\nIs what still needed? BSDF data? Ray tracing? I don't know of other\nlighting simulation tools that can employ the multiphase methods. I would\nsay BSDF data is optional for 2-phase, required for 3-phase, and optional\nfor 5-phase. \n\n\n>- most importantly, is it still needed to get BSDF data for CFS or just\n>can model the detailed CFS in Radiance (and, if yes, how?)\n\n\n\n\nAgain I'm confused as to what \"it\" is. A couple of approaches are\navailable to you in general. If you have a geometric model of the CFS you\ncan use Radiance (genBSDF) to make a BSDF of the CFS and use that in a 3-\nor 5-phase context. However in an annual/climate-based simulation context,\nyou will be stuck with a Klems basis BSDF and that will not be very good\nresolution for a lot of CFS; here you may want to use the 5-phase method\nand stick the actual CFS geometry in the building model.\n\n\nSome things to consider here are the photon map, now a part of Radiance\nproper, or using the 2-phase method where appropriate. By 2-phase method I\nmean generating a daylight matrix for your calculation points (or view),\nand modeling the window material as-is. If the \"CFS\" is a shade cloth, you\ncan approximate that with a Radiance \"trans\". Same for translucent panels.\nWith this single daylight matrix, you can throw a vector of sky matrices\nat it and get an annual climate-based result very quickly. Problem is, we\nwant to do stuff to the windows, sometimes at the time step level, so:\n\n\nBlinds and compact daylight redirection devices (e.g. Lightlouver) are\nbest represented as BSDF, and if most of the redirected flux is headed up\nand away from the points of interest, a Klems basis BSDF is good enough\nIMO. In these cases you could use the 3-phase method. Problem is when you\nhave a BSDF for blinds, and you also want to simulate the blinds-up\ncondition (i.e. clear, specularly transmitting glass). Using a Klems basis\nBSDF for this is sub-optimal. You end up needing to do two annual\nsimulations, one as 2-phase for the clear glass scenario, and again as a\n3-phase (with a blinds BSDF for the transmission matrix) for the blinds\ndown condition. If you have a lot of different window groups, your\nsimulation space can get large in a hurry. But it's still do-able and you\ncan get results that tell a story you simply couldn't tell 5 years ago,\ninforming the newest daylight metrics as well.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-July/011107.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "July 09, 2015 at 10:29AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_011104", "id": "radiance-general_011107"}