{"body": "Hi Greg,\n\n\nthank you for giving some insight on hdrgen...!\n\n\n> There are no units for the sensor response function, which isn't  \n> luminance, but individual responses for the three color channels  \n> (red, green, and blue).  Sadly, even these are mixed up, since there  \n> is a non-linear (and unknown) color transform between the sensors RGB  \n> and the image RGB values.\n\n\nI understood the graphs / curves that I see response dependant on\nluminance? If I draw the curve as a graph, and I write \"response\" to the\ny-axis, what is the label for the x-axis in this case?\n\n\n> BTW, most of the accuracy from HDR sequences is unrelated to the  \n> derived camera response.\n\n\nI can confirm this, as even the most awful response data gives only\nslightly different results when taking pixel values from the generated\nHDR, as far as I could experience ;-)\n\n\n> Rather, it's from the proper combining of  \n> closely-spaced exposures with accurately reported ISO, speed, and  \n> aperture.  If those things are not reported correctly by the camera,  \n> then all bets are off.  Other things that undermine accuracy are lens  \n> flare (trying to measure a dark area near a bright one or with direct  \n> light entering the camera), and vignetting for wide apertures.   \n> Absolute response is also a big issue, which is why you should  \n> probably have at least one luminance reading from each captured scene  \n> if the actual values (and not just relative values) matter to you.\n\n\nI have a fixed lense (no zoom etc), I am trying to correct for\nvignetting, aperture is fixed, flare should not appear on the images\ntaken (rather uniform gradients), and I created a HDR of a known\ncalibrated light source under the same settings, allowing me to estimate\nthe factor between reported luminance from the HDR and \"real\" luminance\n(according to the calibrated light source used). So I try to handle\nthese uncertainties. I wanted to document the differences in the tools\nused, and one of the main differences between hdrgen and pfstools seams\nto be the response-curve fitting. So it would be great to be able to\noverlay the curves (six curves all in all, three channels for both tools\neach). But I do not really know how the function is applied to which\ndatasets.\n\n\nCU Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2008-June/000192.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "June 11, 2008 at 12:25AM", "created_by": "Lars_O._Grobe", "parent_id": "hdri_000187", "id": "hdri_000192"}