{"body": "On Oct 23, 2007, at 12:39 PM, Rob Guglielmetti wrote:\n\n\n> Yeah, I got two models recently, one built in SketchUp and the  \n> other in Revit (same project, same model extents), and the Revit  \n> one was literally unusable in AutoCAD, much less Radiance.\n\n\nBest way to get a Revit model into Radiance is to use 3D Studio Max  \nor Viz.\n\n\nWhen you export a Revit model to DWG, the material information is  \nburied in there but not easily accessible to AutoCAD. This is because  \n99% of the exports to AutoCAD from Revit are meant for drafting  \nbackground to send off to other people. So it groups things by what  \nthey are based upon the AIA layer standard by default. While you can  \nedit that, you can't make it do a 'by material' export to AutoCAD  \nlayers. Well, at least not easily.\n\n\nIf you file link the same DWG into Max or Viz, all the materials come  \nalong, and you get a very usable model. You then in turn export that  \nto .OBJ, and then use OBJ2RAD to make it into a Radiance file. I've  \ndone it several times with good results: http://www.becausewecan.org/ \nnode/190\n\n\nAll in all the Revit models themselves tend to be very clean and  \n'watertight' so they work pretty well.\n\n\nSucks that you have to use Max or Viz as a file converter to get from  \nRevit to Radiance. But I beleive that in the near future more file  \nexport options will be included in Revit, so that might change soon.\n\n\nAs for BIM being disruptive, I agree wholeheartedly. As someone who's  \ndone a lot with it over the last six years, I see potential there for  \nit to change a lot of how our industry works.\n\n\nHope this helps,\n\n\nJeffrey McGrew\nwww.becausewecan.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2007-October/004526.html).</sup>", "attachments": [], "created_by_name": "Jeffrey McGrew", "created_at": "October 25, 2007 at 10:56AM", "created_by": "Jeffrey_McGrew", "parent_id": "radiance-general_004494", "id": "radiance-general_004526"}