{"body": "Hey Rob,\n\n\nAccording to RwR (p. 325), actuallly the one place Rd has impact is on \nArgument 6 of the trans parameters. Based on some reverse calculations \nto figure out what you might have been doing, I also came up with 30% \ndiffuse reflectance for the 10% shade and 20% for the 5%, 1%, 0.1% and \n0.5% shades, thus my question. Based on my calculations here is what \nwhat you get:\n\n\n10% shade at 30% reflectance:\nRd = 0.3\nRs = 0\nTd = 0.005\nTs = 0.095\nthus the following trans parameter line\n7 0.4 0.4 0.4 0 0 .25 .95\n\n\n10% shade at 20% reflectance:\nRd = 0.2\nRs = 0\nTd = 0.005\nTs = 0.095\nthus the following trans parameter line\n7 0.3 0.3 0.3 0 0 .33 .95\n\n\nFYI:\nA6 = (Td+Ts)/(Rd+Td+Ts)\nA7 = Ts/(Td+Ts)\n\n\nI hope that I have done all my calcs correctly here. I expect others can \npoint out if I am incorrect. I am not sure if this ends up pushing your \nstudy in the right direction. I will be interested to hear.\n\n\nAlso, I am quite interested in hearing about your methodology and \nexperience measuring the glazing materials.\n\n\n-Jack\n\n\nRob Guglielmetti wrote:\n\n\n> Jack de Valpine wrote:\n>\n>> Hey Rob,\n>>\n>> Do the shades all have the same reflectance or (Cr, Cg, Cb)?\n>\n>\n> No, and this is one of the things I have been wondering about.  It was \n> my understanding that when specifying trans, that transmittance was \n> soley determined by the Td and Ts parameters (talking about the \n> \"Ehrlich assumptions\" that Chas has set up in RwR).  But perhaps \n> that's it, the net transmission of the trans is calculated *after* the \n> reflectance has been taken into account?  I did a test of that while \n> testing all these shades, where I had a 5% transmissive shade, and ran \n> it once with the reflectance at 20%, and another where the shade was \n> 70% reflective, but the results were very similar, so I thought that \n> my original assumption was true, that transmission was unaffected by \n> reflectance.  But in looking at the data from the second pass of these \n> tests, where Greg suggested the -lw bit, the values for the 70% \n> reflective shade are much lower than the values for the 20% reflective \n> shade.  Hmmm...\n>\n> However, the difference in reflectance of my shades is not that great. \n> the 10% shade has a 30% grey reflectance, and the 5% and the 1% shades \n> are 20% reflective.  I don't see how a 10% change in reflectance could \n> affect the calculated values by 100%, which is what's happenning.  \n> Hmmm, again.\n>\n> Still, thinking about it right now, it seems like that might be it.  \n> It seems obvious.  Now.  I will test it out right now.  If this is the \n> culprit, I owe you a beer.\n>\n>> I think you indicated that the glass is translucent, what is the \n>> makeup? How are you measuring it?\n>\n>\n> The glass is another story, I won't bore you with the details, I'm \n> already way over my bandwidth limit on this list this month, but it \n> was extensively measured and validated against a 1/2 full scale \n> physical mockup, and inspected by Greg.  I'm confident in my glass \n> material definitions, at least.\n>\n> ----\n>\n>      Rob Guglielmetti\n>\n> e. rpg@rumblestrip.org\n> w. www.rumblestrip.org\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general@radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n>\n\n\n\n\n#\tJohn E. de Valpine\n#\tpresident\n#\n#\tvisarc incorporated\n#\thttp://www.visarc.com\n#\n#\tchanneling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000753.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "May 14, 2003 at 05:32PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_000733", "id": "radiance-general_000753"}