{"body": "Hi Jacob.\n\n\nI've not exactly used IES in our office to create Radiance input\nbut I have looked at it's scene description files once. There is\nsomewhere in your IES project directory are folder called 'obj' which\ncontains all the radiance input files. I think the material library\nfiles are simply copied into that directory where you can modify the\nmaterial descriptions after you have exported/rendered your scene.\nAfter you made your changes you can use the Radiance binaries\ndirectly from the command line or a script to do your simulations\nwith the new materials.\n\n\nI think you can change the library files (edit with text editor)\nor even import an external material file. That allows you to assign\nyour material in the IES interface and control the rendering from\nthe interface (for very small values of control ...).\n\n\nNow, what do you need to write into your files:\n> Here’s the question:\n> What is the best way to model the glass blinds in Radiance?\n\n\n> The glass that I’ll be using for the project has the following  \n> characteristics:\n> Visual properties\n> Ext. Reflectance, LR [%]        31\n> Int. Reflectance, LR [%]        31\n> Transmittance, LT [%]   59\n> RA-index        97.3\n>\n> Solar properties\n> Solar reflectance [%]   32\n> Direct solar transmittance [%]  40\n> Solar Absorption [%]    20/8\n> g-vl/solar factor       0.48\n\n\nI'm not an expert in material definitions. This thread from 3 years ago\nsuggests to use a BRTD material to define the glass and get a proper  \nincident\nangle dependent refraction:\n\n\nhttp://www.radiance-online.org/pipermail/radiance-general/2004- \nJanuary/001396.html\n\n\nThere is now a script that allows you to\nconvert Optics5 glass descriptions to Radiance BRTDfunc based materials.\nSo if your department has Optics5 running somewhere you could look\nfor a material that matches your glass for the blinds and try to\nconvert it (the script needs a Unix system, i think).\n\n\n\n\nIf you are interested in sun patterns created by reflections on the\nblinds you have to use a 'mirror' material. Otherwise the ray tracing\nis likely to miss the sun and therefore will not create a bright\nspot where you expect it.\n\n\n> I have been trying to use the material types “trans” and  \n> “dielectrica”, in order to benefit from the angular dependent  \n> properties of the glass, I would prefer to use a matrial type which  \n> includes the refraction index.\n>\n> Here comes my dilemma:\n> The material type “glass”: in IESve the type does not include the  \n> refraction index which means that the only input is the  \n> transmissivity of the glass.\n'glass' is a specialized form of dielectric with a preset refraction\nindex of 1.52. It's refraction/reflection does not depend on the angle\nof incident light, though, which is what your looking for. It was  \ncreated\nto avoid the calculation of reflections between the two sides of a glass\npane and you have to convert your 'Transmittance' value to the  \n'transmittivity'\nneeded for the glass primitive definition if you go that way.\n\n\n[Note: that's what I understand about glass reading the 'usman.pdf'\n        document. Someone should correct me if I'm wrong.]\n> The “trans” material type: same problem but at least I’m able to  \n> define the reflectance of the glazing.\n'trans' materials don't have an index of refraction (not that I know  \nof).\n> The “dielectrica” material type: IESve only allows me to enter  \n> values between 1 and 2 for the refraction index which in this case  \n> have no significant effect.\nIf you know how to define the Radiance 'dielectric' material (you can  \nlook\nup the man pages and other texts on the web) you can define your own  \ndielect\nmaterial in the IES library.\n> I’m sure that the best thing I could do is to model the whole thing  \n> over again in the “original” Radiance – but as I have a short  \n> deadline, I prefer to get it done in IESve!\nThe IESve Radiance files are very simple (as the geometry tends to be).\nYou just have to redefine the material descriptions to suit your needs.\n\n\n\n\nRegards,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2007-January/004157.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "January 06, 2007 at 07:43PM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_004155", "id": "radiance-general_004157"}