{"body": "Hi Rob,\n\n\nSo this is interesting. I have been working with Revit for awhile now, \nboth in terms of taking Revit models that clients have developed as well \nas using Revit for developing models from scratch. By far the best \nworkflow that I have worked out is to use Revit->Max Design->Radiance \nvia obj export from Max Design and obj2rad in Radiance.\n\n\nThere are a couple of workflow options from Revit to Max that are pretty \ntightly coupled in the software. There are also a variety of scripts \nalready developed for exporting from Max to obj format in a variety of \nways. The presumption here is that people who use Revit are in fact \nusing one of Autodesk's Suites, such as the Building Design Suite which \nat one level includes Max. If you are using Revit within a suite via \nAutodesk subscription the cost for moving up to get access to Max is \nincremental.\n\n\nIn my mind the big challenge for workflow from Revit to Radiance is the \nfact that glass in Revit is modeled as a volumetric object (eg it has \nthickness). There are work arounds to this that leverage Revit's Family \nsystem however they are not without their catches. In brief, a Revit \nmodel that is going to be exported for use in Radiance must give careful \nconsideration to how glazing elements are handled through a set of \ncustomized families that allow for extracting selected faces from the \nglass to create the surface glass geometry that Radiance requires. Again \nthis can be done with some thought to modeling methods in Revit and \ncoupled with an export pipeline that includes  Max and exporting to obj \nformat.\n\n\nAnother issue that requires some thought is managing lights that are \ndeployed in Revit, which would be nice to manage as instances in \nRadiance. There are some similar strategies that can be used with \ncareful thought to using the Family model in Revit.\n\n\nThis has been something I have been thinking about doing a blog post on, \nso perhaps this would be a good time assuming I can find the time....\n\n\nAs far as writing a custom exporter from Revit, I think this would \nreally be dependent on what the desired functionality would be. If the \nfunctionality is really one way geometry export then, I think the \n(annual) incremental cost for upgrading from the standard building \ndesign suite to the premium suite is ~$250.\n\n\nBest,\n\n\n-Jack de Valpine\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-November/011340.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "November 12, 2015 at 07:47AM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_011337", "id": "radiance-general_011340"}