{"body": "On 20.02.2006, at 21:12, Kirk Thibault wrote:\n\n\n> Interesting thing - I recently started using Blender 2.41 (from  \n> 2.37) and I hadn't gotten around to reinstalling b/rad.  So I  \n> downloaded the latest and copied brad.py into the ./blender/scripts  \n> folder and cp -R copied the \"brad\" directory into the ./blender/ \n> scripts directory as well, per the install instructions.  Now, when  \n> I go to Blender's \"Scripts\" interface to update the menus, the only  \n> scripts that appear in the scripts menus are the ones that are  \n> alphabetically before brad.py, (brad is not included).  As soon as  \n> I rm brad.py and the brad directory, the Blender Scripts menu is  \n> back to normal, with all of the available scripts as before.\n>\n> Any thoughts on why this happens?  if I manually load brad.py in  \n> Blender (into the test window) from the Scripts directory and then  \n> Alt-P (well, Option-P on the Mac) I get a console error telling me:  \n> ImportError: No module named brad_i18n - etc.\n\n\nHi Kirk.\n\n\nI know Francesco did not have much time to keep b/rad in sync with\nBlender development. I expect that the problems with the menu\nare the result of a failed \"import\" of brad. The bundled scripts\nare tested with Blender 2.41, brad is not.\n\n\nI made b/rad work recently with an explicit \"brad_path\" setting.\nI have made a few changes to the original file as well but i don't\nthink they are important.\n\n\nAs first step try to set \"brad_path\" to the directory where you\nkeep the \"brad.py\" and the \"brad\" directory, i. e.\n\n\nbrad_path = \"/Users/kirk/blender/scripts/\"\n\n\n(around line 101 in brad.py; line count may differ but it is well\ncommented). That did the trick for me on OS X 10.4.4, Python 2.3.\n\n\n> Mac OS X 10.4.4, G4 dual 1.25, Blender 2.41, Python 2.4 -\n\n\nWhen your at Python 2.4 I think you know your way around Python\nand OS X. Keep an eye on the imports in the script. If they fail\nany error message could be the result. Perhaps add\n\n\ntry:\n     import ...\n     import ...\nexcept ImportError, err:\n     print \"ERROR\", err\n\n\nto the import section to check this explicitly.\n\n\n> brad.py is Rev 1.8 from Aug 11, 2005 (from CVS) and the rest is from\n> brad 0.1b.  The same thing happened with the brad.py file original\n> 0.1b release, etc.\n\n\nI got my version sometime after September 2005 from Francesco's web\nsite (tar ball, not CVS).\n\n\n> Thomas - pretty neat interface to brad from within Blender -\n> I'm interested to see how this turns out.\n\n\nMe too ;)\n\n\nYou can download the snapshots here:\n\n\nhttp://home.arcor.de/tbleicher/blender/bliff/download.html\n\n\nThere is no tutorial and they are not tested much. I have not\nyet separated the brad parts from the GUI toolkit so it's one\ndownload. The zip file is fresh and contains today's texture\nmapping update.\n\n\nDon't get frustrated,\n\n\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-February/003431.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "February 20, 2006 at 09:42PM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_003417", "id": "radiance-general_003431"}