{"body": "Hi All,\n\n\nUnder contract with LBNL, I have written an HDR capture program that  \nworks with the Canon EOS 5D camera under Mac OS X, and should work  \nwith other Canon EOS cameras as well.  When open from the Finder, the  \napplication triggers a sequence of image captures, saving them to the  \nlaptop across a USB or Firewire connection.  Setting the camera in  \nmanual mode, the sequence begins at the fastest available shutter  \nspeed and works its way down until it finds the first exposure with  \nover-exposed pixels in its thumbnail.  It saves this image along with  \nthe previous one, and continues downward in the exposure range  \n(longer shutter times) for the number of stops and images you specify  \nin a configuration file.\n\n\nUnfortunately, CanonHDRcap does not work from the command line, as  \nthe Canon software requires building with CodeWarrior and an outdated  \nCarbon application package model, which doesn't support command-line  \noperation.  However, using the OS X \"open\" command, you can run it  \nfrom a batch file and determine when it finishes based on another  \noutput file it creates, specifying the names of the image files it  \nhas created.  (My next task is to build a script that runs hdrgen  \nautomatically afterwards, which should be easy enough.)\n\n\nI've put the app. on my website for any masochistic beta testers who  \nwant to have a go with their Canon EOS camera.  It produces beautiful  \nresults, so long as you don't mind lugging a laptop and a tripod with  \nyou; it eliminates all camera movement and does a much better job  \ncapturing the full range than auto-bracket mode.  The link is below:\n\n\n\thttp://www.anyhere.com/gward/pickup/CanonHDRcap.tar.gz\n\n\nMost of the camera settings are left as set on the camera, including  \naperture, white balance, JPEG/RAW mode, etc.  The one thing I'm sure  \ndoesn't work is storing both JPEG and RAW images at the same time,  \nbut let me know if you run into any other problems.\n\n\n-Greg\n\n\nP.S.  The correct mailing address for the list is <hdri at radiance- \nonline.org>, not <hdri at www.radiance-online.org> as we originally  \nannounced.  (Thanks to Rob Guglielmetti for pointing this out.)\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2006-January/000016.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "January 20, 2006 at 10:01PM", "created_by": "Greg_Ward", "parent_id": "hdri_000017", "id": "hdri_000016"}