{"body": "I tried sending this yesterday, but used the wrong sending address and \nhad it rejected...\n\n\nDuring my hiatus from physically-based rendering in 1999-2001, I was \nemployed as a software engineer at Shutterfly, Inc.  I worked \nintimately with their digital photographic printers, which went \ndirectly from 24-bit RGB images to photo paper via LED and fluorescent \nline-exposure units.  From this experience, I can assure you that the \nbest printers cannot reproduce a black darker than 1%, which doesn't \ninclude the 3% reflection you get off the surface coating.  In other \nwords, a glossy print, angled so that the specular reflection mirrors \nsomething black, produces a maximum contrast no better than 100:1.  In \nan uncontrolled environment where the glossy reflection is not black, \nthe maximum contrast can degrade terribly, to as little as 2:1 or \nworse.  (That's why people looking at high contrast prints always angle \nthem to minimize reflections.)\n\n\nAlthough it is theoretically and physically possible to produce prints \nwith better than 100:1 contrast, the surface reflection described will \nundermine this contrast to where there is little point in improving it \nfurther.  This is most likely why no one has bothered.  Viewers in a \ntypical ambient environment simply cannot appreciate additional depth \nin the shadows.  As Mark pointed out, there is nowhere to go on the top \nend, as the best photo paper has a maximum reflectance around 90%.  So \nmuch for reflection prints.\n\n\nHowever, it is possible to get excellent dynamic range out of film \ntransparencies.  A well-made transparency, viewed through a slide \nprojector or light table, can have a dynamic range of 1000:1 or better. \n  What's more, you can actually SEE the detail in the shadows and \nhighlights with a transparency, unlike a reflection print where you're \nconstantly fighting with the background.  Unfortunately, I haven't \nfound any reasonably priced digital film recorders or services that do \na good job of taking higher resolution pixel data and converting it to \na wide range of densities, and this is largely a problem with the D/A \nconverters they employ.  There is no reason I know why they couldn't do \nbetter, and there are probably Hollywood post-production labs that \nacheive much better image depth, but they are quite expensive and not \nwidely used at this time.  In the consumer market, there is nothing.\n\n\nAround the corner -- in the next year or two -- you can expect to see \nhigh dynamic range display devices enter the commercial market.  I am \nworking with a Canadian company, Sunnybrook Technologies, that has made \ngreat strides in this direction.  For more information, you can check \nout this year's Siggraph paper on the topic:\n\n\nSeetzen, Helge, W. Heidrich, W. Stuezlinger, G. Ward,  L. Whitehead, M. \nTrentacoste, A. Ghosh, A. Vorozcovs,  \"High Dynamic Range  Display \nSystems,\" ACM Trans. Graph. (special  issue SIGGRAPH 2004), August \n2004.  <http://www.anyhere.com/gward/papers/Siggraph04.pdf>\n\n\nUltimately, I think HDR displays are the best way to appreciate \nlighting simulations.  Until then, we're kind of stuck with low \ndynamic-range, tone-mapped prints and displays.\n\n\nIf anyone knows of a digital path to high-contrast transparencies, I'd \nlove to hear about it.\n\n\n-Greg\n\n\nP.S.  Regarding the OpenEXR format.  It is not a cheap rip-off of \nRadiance's RGBE format by any stretch of the imagination.  It is a more \naccurate format that is valuable for post-production and special \neffects image processing, and a very well thought-out library.  For a \ncomparison of various HDR image formats, check out my web page on the \nsubject.\n\n\n\thttp://www.anyhere.com/gward/hdrenc/\n\n\nErik Reinhard, Paul Debevec, Sumant Pattanaik, and I are currently \nworking on a book for Morgan Kaufmann Publishers tentatively titled, \n\"High Dynamic Range Imaging.\"  We expect it to be out by next summer.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-December/002210.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "December 02, 2004 at 06:18PM", "created_by": "Greg_Ward", "parent_id": "radiance-general_000244", "id": "radiance-general_002210"}