{"body": "Jan Wienold wrote:\n\n\n> 1. To distribute photon and store them in files (global and caustic photons separately) \n > e.g.\n> ~/bin/radiance/pmap/mkpmap  -apg f81_z.gp 700000 -apc f81_z.cp 700000  test.oct\n> 700000 is the number of the photos emitted, gp : global photons, cp caustic photons\n\n\nActually, it's the number of *stored* photons, which is what the user \nreally wants. The resultant number of emitted photons is usually much \nlarger.\n\n\n>  Of course, the ambient options don't make really sense\n> since the ambient calculation is replaced by the forward raytracer.\n\n\nThey do to some degree: the RADIANCE pmap uses a final gather, which \nmeans *one* ambient bounce is performed (if -ab > 0, regardless of \nactual value), with pmap lookups resulting for each sample ray. \nConsequently, the -ad, -ar, -aa params are still valid. They are *not* \nused for caustics, however.\n\n\n> In many cases, the use of the photon port mechanism is extremely useful. \n> With photon ports you can define materials, through which the light \n> enters the scene. A typical example is an office scene, which is lit by \n> the sky. Using this, you can avoid huge effort, since the photons are \n> distributed mostly in \"relevant\" directions. In your case it could make \n> sense to define the entering cross section as \"photon port\". You can use \n> e.g. glass material with refraction index 1 (==air!!) without disturbing \n> the simulation.\n\n\nPhoton ports are a must for light pipes, unless you stick a light source \nright in front of the aperture (which would be a fake). An invisible \nport can simply be declared with antimatter -- see the lightpipe scene \nin the example tarball on the pmap page (URL below).\n\n\n> Good luck!\n\n\nDitto! :^)\n\n\n\n\nRoland Schregle\nPhD candidate, Fraunhofer Institute for Solar Energy Systems\nRADIANCE Photon Map page: www.ise.fhg.de/radiance/photon-map\n\n\nEND OF LINE. (MCP)\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-May/001752.html).</sup>", "attachments": [], "created_by_name": "Roland Schregle", "created_at": "May 28, 2004 at 02:36PM", "created_by": "Roland_Schregle", "parent_id": "radiance-general_001745", "id": "radiance-general_001752"}