{"body": "Hi Greg,\n\n\nThanks for the quick response.\n\n\n> I think you're making trouble for yourself by trying to adjust the \n> turbidity factor in gensky.  If you have the horizontal and diffuse \n> irradiance, or facsimilies thereof, you should be giving those to \n> gensky directly using the -B or -b and -R or -r options as we have \n> been discussing.\n\n\nYes, the turbidity does seem to be trouble since it doesn't affect the \nsun component.  I don't have measurements I am trying to match, I am \njust trying to make sure I have the correct IESNA recommended sky (CIE \nsky) and sun components throughout the year.\n\n\n> Just to clarify, gensky ALWAYS produces an accurate CIE sky \n> distribution.  Adjusting the turbidity or these other factors only \n> affects the absolute levels and the ratio between solar and sky \n> components.  It does not change the distribution of skylight.\n\n\nI don't doubt the relative luminance distribution of the sky is \naccurate, I'm just questioning how Radiance determines the correct \noverall level.\n\n\nI should clarify what I mean when I say the CIE sky function tells \nme....I am refering to both the sky and sun calculations laid out in the \nlatest IESNA lighting handbook which uses Kittlers CIE adopted sky \nfunction (which I understand is from his 1967 studies) to determine the \nsky component.  So I probably should have said that IESNA sky/sun \nfunctions tell me.  I am not sure if this is the accepted method used by \nothers.  The direct component is calculated as this;\n\n\nEdn = Ext * e ^ (-cm)\n\n\nwhere;\nEdn = direct normal solar illuminance\nExt = extraterrestrial solar illuminance = Esc * (1 + 0.034 * cos ( \n(2pi/365)*(J-2)))\n                where;\n                Esc = solar illumination constant = 127.5 klx (11,850 fc)\n                J = julian date\nc = atmospheric extinction coefficient (given as c = 0.21 for clear ; c \n= 0.8 for partly cloudy)\nm = optical air mass = 1 / sin (solar altitude)\n\n\nand Direct Horizontal (Edh) would then be;\nEdh = Edn * sin (solar altitude)\n\n\nThis gives the Direct Horiz to be 8,821 fc on a clear summer solstice at \n40 lat.  This is what I would like Radiance to give me without having to \nspecify with the -r parameter.  Currently it is giving me 6,836fc.\n\n\nThe IESNA recommends calculating the diffuse component like this;\n\n\nEkh = A + B * (sin (solar altitude))^ C\nwhere;\nEkh = horiz. sky illuminance\nA = sunrise/set illuminance = given as 0.8 for clear sky\nB = solar altitude illuminance coef. = given as 15.5 for clear sky\nC = solar altitude illuminance exponent = given as 0.5 for clear sky \n(all in terms of klux)\n\n\nThis gives a diffuse horiz of 1484.2fc.  Radiance gives me this with a \nturbidity of 3.22.  But as I illustrated before it can range \ndramatically.  Ekh is then fed into the CIE sky distribution function \nlike so;\n\n\nLz = Ekh * ZL\nwhere;\nLz = zenith luminance\nZL = zenith luminance factor - given as a table of values\n\n\nThen Lz is part of Kittlers distribution function.  I am not going to \nattempt to type this function but I think we are on the same page here. \n Although I understand they, CIE, are about to adopt a new sky function \nwith 15 different sky types (Thanks Karen for the info!).  I have not \nattempted to wrap my head around this yet...for now I am happy enough \nwith the old function.  \n\n\n> This is not to say that the CIE sky model is the best.  It is just an \n> agreed upon standard, and therefore serves as a reasonable point for \n> comparison.  The Perez sky is probably a better approximation to \n> actual skies, particularly for the intermediate case.\n\n\nAgreed, although the calcs I have outlined here have generally matched \nup well with my measurements with enough accuracy for my uses, but I am \nusually not in need of an extremely accurate sky just good average \nrepresentations.\n\n\n> As I said in the bit of e-mail you so aptly quoted, the absolute \n> values produced by gensky with the default settings are unreliable \n> because they are not based on weather data for your area.  If you have \n> such measurements, by all means use them, but don't adjust the \n> turbidity -- go straight for the horizontal and diffuse specifications \n> to gensky.  This overrides the turbidity approximation and makes it \n> irrelevant.\n\n\nAgain, I don't necessarily have measurements and I don't want to have to \ngive gensky horiz. or diffuse specifications for annual calculations. \nAlthough, I guess these could be pulled from annual weather data (TMY2). \n Is this what others do???   I guess I am just wanting Radiance to give \nme these IESNA recommended results throughout the year without having to \nspecify the correct turbidity, diffuce irradiance or solar radiance \nvalues which are not required inputs to these equations.  It would be \nnice to have an elevation factor as well or a turbidity factor that \nadjusts both the solar and sky accordingly.\n\n\nPlease give me feedback, let me know if I have misintepretted any of \nthis.  Since daylighting design puts food on the table I need to make \nsure I am confident in my results.  I am especially concerned since one \nof my current projects is getting pretty detailed discussing fc-hours \nunderneath a tree canopy in an atrium in Chicago, given all the other \napproximated variables that will be going into this model it would be \nnice to be confident I am starting with good data.  In this case though \nI am just creating DF's with Radiance and feeding that into TMY2 data. \n And so I guess as long as my sun to sky ratios are correct it should be \nfine.  \n\n\nHuh, maybe I just got it....Does the 2.75 default turbidity give the \ncorrect ratio for the lower sun component Radiance provides?  I guess \nthis is what you meant when you said they are not based on measurements \nfor my area.  But these IESNA calcs are not for my area either, they are \nfor a generic sea level site.  It seems more and more its a discrepancy \nin where the c, A, B, C values come from (these variables essentially \ndetermine the absolute magnitude for the sun and sky components)  What \nother standards are there in determing the magnitude of the sun and sky \nthroughout the year?  Is weather data just used?  I guess I could just \ngive my skies a mulitplier outside of gensky that adjusts my skies to \nthe levels I want.  Did I just answer my own questions?  Still it would \nbe nice if Radiance did this on its own.  Are people really seeing7970 \nfc on a clear summer day???? Where are you living?  I guess I am just \nused to our clear Colorado skies where we will see up to 11,000fc \nregularly in the summer.\n\n\nWell, sorry for typing your eyes off?  Just describing this problem has \nhelped me understand much better what is going on.  Hopefully others \nfind this discussion useful.  If not, I aplogize.\n\n\nThanks!\nZack\n\n\n\n\nZack Rogers\nStaff Engineer\nArchitectural Energy Corporation\n2540 Frontier Avenue, Suite 201\nBoulder, CO 80301 USA\n\n\ntel (303)444-4149 ext.235\nfax (303)444-4304\nhttp://www.archenergy.com\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-October/001072.html).</sup>", "attachments": [], "created_by_name": "Zack Rogers", "created_at": "October 16, 2003 at 06:43PM", "created_by": "Zack_Rogers", "parent_id": "radiance-general_001063", "id": "radiance-general_001072"}