{"body": "Hi Bob,\n\n\nI'll chip into what Mark and Ian indicated. First off Mark's benchmark \npage is very useful, so do make sure to take a look. All of our \nproduction render servers are dual cpu AMD machines, these range from \nsome of the first Athlon MP systems to more recent Opterons. We have not \nyet had the opportunity to look at any dual core systems, when we do AMD \nwill be the top of the list. It has been many years since I really \nlooked into it carefully. But initially the price/perfomance was pretty \nwell in AMD's favor. You might want to pole more broadly among others \ndoing scientific simulation (cfd for example) and see what kind of \nhardware they are using.\n\n\nAs far as graphics cards are concerned, this does not effect rendering \nspeed, however it may have some impact on viewing the images, perhaps \nothers can provide some good input on this particularly from the \nstandpoint of calibration...? It might also be interesting to see \nif/when (and how much) the new HDR display devices will be available and \nwhat some of the hardware requirements are.\n\n\nI would certainly suggest 2G of RAM, this should not increase the price \nvery much. If you do not want to do a dual processor system, you can \nprobably assemble a cheap system from parts for ~$800 or less (this \nasssumes a downloaded linux distribution such as Fedora Core), which I \nthink is amazing compared to what I remember paying for our first \nproduction machines back in 1996 (~$4,000 per machine, ouch).\n\n\n-Jack\n\n\nMark Stock wrote:\n> Bob,\n>\n> With 5-10 objects and 1 or two light sources, you probably won't need \n> much RAM, actually. That is, unless each object has 10^6 triangles.\n>\n> Nevertheless, I have compiled performance numbers sent in from many \n> generous Radiance users at\n>\n> http://mark.technolope.org/pages/rad_bench.html\n>\n> I hope this helps you choose your CPU, and gives you hints for custom \n> compile options.\n>\n> Mark\n> mstock at umich.edu\n>\n> On Sun, 25 Jun 2006, Robert Kentridge wrote:\n>\n>> I'm interested in using RADIANCE for visual psychophysics. I've done \n>> a little bit of experimentation with an old laptop running Linux and \n>> now want to set up a dedicated RADIANCE system. The work I'm \n>> intending to carry out involves producing fairly large numbers of \n>> short animations so rendering speed is important but, as I don't want \n>> to spend large amounts of money, I'm thinking in terms of a \n>> consumer-type PC running Linux. Am I correct in assuming that \n>> rendering performance will be almost entirely determined by CPU and \n>> memory? I'd be glad of recommendations (specifically for using \n>> RADIANCE) about CPUs (basically Pentium 4 vs Pentium D) and memory (I \n>> assume 2G is ample - my scenes only contain 5 or 10 objects and one \n>> or two light sources). Some PC graphics cards (e.g. nVidia 6800) \n>> claim to handle more that 24 bits per pixel and hence support HDR \n>> imaging - will these improve the pixel-depth of my RADIANCE renders? \n>> The system will be calibrated with a spectroradiometer so we really \n>> can exploit improved colour resolution if it is there to be had!\n>>\n>> many thanks,\n>>\n>> Bob Kentridge\n>> University of Durham\n>>\n>>\n>> _______________________________________________\n>> Radiance-general mailing list\n>> Radiance-general at radiance-online.org\n>> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>>\n>>\n>>\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n>\n\n\n\n\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-June/003795.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "June 25, 2006 at 09:09PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_003792", "id": "radiance-general_003795"}