{"body": "Greg,\n\n\nthanks for your reply.\n\n\n>> e) then there's the new rtcontrib program\n>> (http://luminance.londonmet.ac.uk/radiance_mailinglists/general/\n>> 2005-May/002710.html):\n>> \"Rtcontrib can also be used by the more adventurous among you to\n>> compute input/output relations for devices such as light pipes and\n>> shading systems, although I have yet to test such an approach,\n>> myself.\" --Greg\n>> There is a directory ray/src/rtcontutor, but the example explains\n>> rtcontrib's use for daylight coefficients, not light pipes. I\n>> personally can't quite work out how it would possibly replace a\n>> forward raytracer, so has anybody been adventurous yet used it for\n>> this?\n\n\n> It's the talk entitled, \"Applying the Radiance rtcontrib program,\"\n> but heed the warning and download the QT movie rather than hitting\n> the link on your browser, because most browsers (including Safari)\n> barf on it.  The key part you want to check out is \"Step 2\" in the\n> mirrored light pipe example.  I'm using flat surfaces, but only for\n> comparison purposes.  The rtcontrib approach should work for any\n> geometry.\n\n\nFound your talk. I also looked at the examples in the rtcontutor\ndirectory (which seems to have disappeared in the 3R9 tar ball). The\ngeometry you used for the light ducts is relatively simple. I am\nparticularly interested in round light pipes, not square light ducts.\n\n\nI noticed that in model.mat, you define the material for the duct as\nmetal, only to immediately re-define it as mirror:\n\n\n----------------8<-----------------\nvoid metal mirror_mat\n0\n0\n5 .9 .9 .9 1 0\n\n\nvoid mirror mirror_mat\n0\n0\n3 .9 .9 .9\n----------------8<-----------------\n\n\nI understand why you would prefer mirror instead of metal: it creates\nvirtual sources of the sun, dealing with the direct component. So\nwould the only option with a round pipe be to break it up into\npolygons?\n\n\nIt strikes me that this particular example of rtcontrib is useful for\ndemonstrating its use with sky components, so a large number of sky\ndistributions and sun positions may be computed rather quickly once\nthe coefficients (individual images) are generated. Guess you used the\nlight ducts simply to add some interest to the scene. The same scene\ncomplexity could as well have been simulated without rtcontrib if an\nanimation (\"input/output relations\", as you called it) was not sought.\n\n\nMany thanks\n\n\nAxel\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-August/005322.html).</sup>", "attachments": [], "created_by_name": "Axel Jacobs", "created_at": "August 22, 2008 at 05:35PM", "created_by": "Axel_Jacobs", "parent_id": "radiance-general_005319", "id": "radiance-general_005322"}