{"body": "Peter Apian-Bennewitz wrote:\n\n\n> Carsten Bauer wrote:\n\n\n>> cmyk is probably a bit out of date nowadays, it always was a rather\n>> poor standard suitable for those big printing machines of former time.\n\n\nThe pigments on a print will almost always be cymk (sometimes\naugmented with additional colors). This has nothing to do with\n\"big machines of former time\", but simply with the laws of\nphysics.\n\n\n\n\n>> As already mentioned, the best way today is to use those new fancy\n>> laser printers which use rgb directly without color space conversion.\n\n\nThe only difference is that *you* don't need the printer's color\nprofile for doing the conversion yourself. The conversion module\nof the printer has that built in. To think that there will be no\nconversion at all (not sure if you really do think so) would be\nnaive. This is even the case for machines that directly expose\nphotographic paper with rgb lasers (which of course will activate\ncym[k] pigments in the paper, introducing yet another \"conversion\").\n\n\n\n\n> not really my field of expertise, but -\n> probably one should measure the spectral reflectance of each printed\n> primary color to come with a good color calibration ? Or is that purely\n> academic ?\n\n\nIf you're really picky, then that would be the most accurate\nmethod to generate the color profile for a printer. In practise,\nvisual comparisons against a reference print may be good enough\nin most cases.\n\n\n\n\n> I had found it rather difficult to get a feel what the a laser printer\n> does internally, what happens between the RGB values in the PS or PDF\n> file and the beam intensity.\n\n\nThat's what color profiles are there for. In the times of color\nprofiles, the mechanics of how that reflectance gets on paper\nshould be irrelevant to the user.\n\n\nAll of this of course assumes that you know the color space of\nyour own data. It seems that the Radiance color space is quite\nclose to SRGB, which is highly convenient. Once you know that,\nyou either use the color profile of your printer to do a\n(SRGB->\"printer rgb\" or SRGB->\"Printer cymk\") conversion\nyourself, or you let the printer know that it will get SRGB data\nand have it do the same conversion internally. If you get bad\nresults that way, then either the color profile is wrong or the\nprinter is broken.\n\n\nAt least that's how I understand the theory... ;)\n\n\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-December/002205.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "December 02, 2004 at 04:58PM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_002190", "id": "radiance-general_002205"}