{"body": "Dear Urtza,\n\n\nthe 160 instead of 180 degree should not be a big problem, of course you \nunderestimate the illuminance a bit, but you can provide the external \nmeasured illuminance value.\n\n\nIn case you have a problem in matching the calculated illuminance of the \ncaptured image (evalglare -V) with the measured illuminance, caused by \npixel overflow, there exist since long time an undocumented option in \nevalglare to adjust the overflow pixels to match the measured \nilluminance. I could help you with that - in that case send me one \nexample image and the related measured illuminance value directly (not \nvia discussion group).\n\n\nJan\n\n\n\n\n\n\n\n\nAm 11/26/15 um 4:59 PM schrieb urtza.uriarte at upc.edu:\n>\n> Dear Jan,\n>\n> Thank you very much for your answer and suggestions.\n>\n> I had illuminance value also at camera level, because I had spots of \n> high luminance. I have an fish-eye lens, the specifications said that \n> it gets 180º but it catches 160º. I hope that it can work. Ok, first I \n> will check if calculated illuminance is the same as measured.\n>\n> I understand that perhaps DGP is not the best option to describe glare \n> in a restaurant, excuse me. However, we have problems with highly \n> glazed façade that provides very high luminance values to achieve good \n> concentration on the taste and calm quality atmosphere, as well as, \n> privacy. We have done surveys and usually people tolerate more visual \n> discomfort in this activity, due to the habit probably, but when you \n> show atmospheres with less out luminance values, they prefer. I am not \n> sure if I am ok, but, the perception results are quite similar to the \n> DGP results. Anyway, thank you again and I will listen to you and \n> check all variations to demonstrate this problem.\n>\n> Yours sincerely,\n> Urtza.\n>\n>\n> Jan Wienold <jan.wienold at epfl.ch <mailto:jan.wienold at epfl.ch>> escribió:\n>\n>> Dear Urtza,\n>>\n>> it is not 100% clear to me what you have measured besides your image. \n>> Do you have an illuminance value also at camera level? This is very \n>> much needed to check the validity of the image, especially when you \n>> have spots of high luminances (e.g. the sun or reflections of it) in \n>> the field of view. Do you have an fish-eye lens?\n>> So the first step is to check compare the calculated illuminance from \n>> you fish-eye image with this value to check if you have problems with \n>> pixel overflow/saturation. This would explain big differences between \n>> image calculated illuminance and measured. If you don't have a \n>> fish-eye lens you cannot make this simple check. Then you need to \n>> measure with a spot luminance meter the highest luminance in the \n>> field of view and compare it with the value in the image.\n>>\n>> If you have measurements of the Direct and Diffuse Irradiation, then \n>> it is better to use gendaylit, where you can provide both values.\n>>\n>> For your simulated data, there must be an mistake in your workflow. \n>> If you calculate the illuminance by \"rtrace -I\"  you should get the \n>> same value for the illuminance than calculated from the image (you \n>> can calculate the illuminance with evalglare -V . If you use the -I \n>> option in evalglare, it is just replacing the internal calculated \n>> illuminance value by the external one, all other algorithms are the \n>> same. So if you get different values, then you have a problem either \n>> with your image or with the illumiance calculation. So check first \n>> the difference in the illuminance. In case you are simulating a \n>> trans-material (e.g. for a fabric), pixel sampling, limit weight ect. \n>> might play a big role and could cause huge differences between image \n>> and rtrace calculations. But there could be many other reasons, \n>> depending on you scene you are simulating. Then parameter settings \n>> play a big role.\n>>\n>> And another important comment is, that I don't believe that the DGP \n>> is a metrics to describe glare in a restaurant. The needs are very \n>> much different between an office and a restaurant. In a restaurant \n>> you are dealing mainly with disability glare, I'm not sure if \n>> discomfort glare is perceived so much for this kind of usage. Of \n>> course with the DGP you can compare different variants and judge \n>> which variant has more often glare than other ones. But I would say \n>> you cannot make a distinct glare evaluation in a restaurant using DGP.\n>>\n>> Jan\n>>\n>>\n>>\n>> Am 11/26/15 um 9:30 AM schrieb urtza.uriarte at upc.edu:\n>>>\n> Dear experts,\n>\n> I am testing glare at restaurants of Barcelona for my thesis. I am \n> using Evalglare v 1.11 with real illuminance (-I Ev) data for \n> photographs converted to hdr by WebHDR and for visualizations got by \n> Radiance. Furthermore, I am testing glare by DIVA. I have tested with \n> both, Evalglare and DIVA’s Evalglare with Clear Sky without \n> Illuminance data and with illuminance data.\n>\n> # gensky 7 22 11 +s -a 41 -o -2 -m -15\n>\n> # gensky 7 22 11 +s -a 41 -o -2 -m -15 -B 458.100\n>\n> I have taken photograph’s Daylight Glare Probability index with real \n> illuminance data as reference. Therefore, without Ev data, DGP’s with \n> Clear Sky without illuminance data is more similar than Sky with \n> illuminance data (-B):\n>\n> dgp photographs= 71%\n> dgp DIVA Sky without illuminance data= 63%\n> dgp DIVA Sky with illuminance data (-B)= 100%\n> dgp (just Radiance-Evalglare) Clear Sky without illuminance data= 62%\n> dgp (just Radiance-Evalglare) Clear Sky with illuminance data (-B)= 100%\n>\n> My illuminance data has both, direct and diffuse irradiance. Could \n> someone confirm if –B parameter is only for diffuse radiance? I think, \n> that is explained in the program specifications.\n> Thank you in advance.\n>\n> Kind regards,\n> Urtza.\n>\n>\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n>\n> -- \n> Dr.-Ing.  Jan Wienold\n> Ecole Polytechnique Fédérale de Lausanne (EPFL)\n> EPFL ENAC IA LIPID\n>\n> http://people.epfl.ch/jan.wienold\n> LE 1 111 (Office)\n> Phone    +41 21 69 30849\n>\n>\n>\n>\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\nDr.-Ing.  Jan Wienold\nEcole Polytechnique Fédérale de Lausanne (EPFL)\nEPFL ENAC IA LIPID\n\n\nhttp://people.epfl.ch/jan.wienold\nLE 1 111 (Office)\nPhone    +41 21 69 30849\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-November/011371.html).</sup>", "attachments": [], "created_by_name": "Jan Wienold", "created_at": "November 26, 2015 at 09:38AM", "created_by": "Jan_Wienold", "parent_id": "radiance-general_011367", "id": "radiance-general_011371"}