{"body": "Rob Guglielmetti wrote:\n\n\n>   I struggled with LINUX many\n> times, but never got a totally functional system; I was\n> rpicting all over the place after a week on OS X.  =8-)\n\n\nHi Rob,\n\n\nI recommend SuSe as an Linux distribution that is relatively easy\nto install and configure. Other people seem to get good results\nwith Mandrake. Don't even think about RedHat if you're not very\nfamiliar with Linux already.\n\n\n\n\n> Philip Thompson, way back in '94, inquired about the\n> ability to show surface normal orientation in rview.  Was\n> this ever developed?\n\n\nThis may not be exactly what you wanted, but if you use the -bv-\nboolean switch, then all faces will become invisible from the\nback...\n\n\nMy personal philosophy about this point is (so far anyway), that\nthis is the task of the modeller you're using. Once you're\nrunning rview (or any similar program), it's really a bit late\nto do anything about flipped orientations. The fact that the\norientation doesn't matter at all for most material types in\nRadiance has helped me to stick to this position.\n\n\nOf course, there is the rshow program by Peter, which works on\nmost unix systems with OpenGL. I don't know if anyone has tried\nto port it to OS X though, nor if it can do anything about\nsurface normals.\n\n\n\n\n> Greg in one of the digests said windows can be modelled\n> using a single plane of glass.  (I'm used to Lightscape's\n> requirement of two opposite-facing planes, lest you get\n> refraction errors in a raytrace.)  Does this hold true for the\n> rest of the building?  IOW, a simple room can be modelled\n> with a single genbox?  I have been creating an inner\n> room and an outer \"shell\".\n\n\nRadiance normally does fine with thin boxes. There *may* be light\nleaks in low quality simulations when the ambient density is too\nloose. But with tougher settings, you will rarely see this.\n\n\n\n\n>   I have seen some\n> special sky textures available for mapping to a sphere for\n> more realistic environments.  How do these work?  Are\n> they transparent placeholders, which merely display a\n> picture of the sky but allow the sun & sky luminance to\n> \"pass through\", or do they actually modulate the sky\n> luminance as a function of the chromacity of the pixels in\n> the sky image?\n\n\nThe latter is the case, as it's a simple colorpict pattern.\nYou will lose the accountability of the CIE sky model when you\nmap a picture onto the sky sphere.\n\n\nBtw: Rayfront has a simple drop-down box in the sky configuration\ndialog to select sky maps... ;)\n\n\n\n\n>   It would be great if\n> there was a way to substitute autocad blocks for\n> instanced rad files!  One could export the blocks as\n> separate rad files, but is there a way to take a series of\n> insertion point coordinates and build a rad file that\n> instances the \"block\" rad file at those\n> coords/orientations?\n\n\nIn theory, this sounds easy. In practise, it would open a\npandora's box of consistency problems, not to mention the\nquestions about how to assign materials to subentities within\nsuch blocks that are placed on different layers. I have been\npondering those issues for years, and haven't come up with a\npractical solution yet.\n\n\nI think there was some talking about doing this for Desktop\nRadiance, but I have no idea if they actually got around to\nimplement anything of the kind. Since DR never looks back at the\nRadiance data it has written, but simply overwrites it when you\nchange anything within Autocad, it can avoid many (but not all)\nof the consistency questions.\n\n\nIf you're feeling adventurous and know some Autolisp, then you\ncould try to hack my old torad.lsp translator. If you manage to\ncome up with a fool proof solution, then I'll immediately\nintegrate it into Radout.\n\n\n\n\n> Along those lines, is there a way to create a grid or really\n> any series of points in autocad (via nodes, or blocks or\n> whatever) and then have the coordinates of those points\n> be fed to rtrace for lighting analysis?  I know you can feed\n> rtrace the points, but I'm interested in a way to have\n> autocad export the information rather than me figure out\n> the points manually.  I like to draw the stuff and have\n> CAD keep track of all the math, ya know?\n\n\nBoth DR and Rayfront can do this for you.\n\n\n\n\n> I found a nice collection of materials online (Kevin\n> Matthews, Design Workshop).  Some of the cal files are\n> missing, but many of the materials are usable.  Does\n> anyone else have material & light libraries they are willing\n> to share?  I'm also really interested in obtaining\n> definitions of translucent materials, such as one would\n> find in a light fixture (sandblasted glass, acrylic, etc).\n\n\nIf anyone wants to share their creations, I'd be more than\nwilling to establish and maintain an online repository.\nOf course, if you use materials that others have created and\nexpect them to be physically meaningful (beyond just looking\nnice), then you'll have to run some sanity checks on them\nyourself, especially if you're thinking about procedural\ndefinitions.\n\n\n\n\n> Paul Bourke offers some great tree examples.  Again,\n> does anyone have other blocks they are willing to share\n> (vegetation, furniture, you name it)??  =8-)\n\n\nIf you buy DesignWorkshop, then I think you also get a tree\ngenerator program, which produces data that can be exported to\nthe Radiance scene file format.\n\n\n\n\n> I tried the first one and my PowerBook G4 550 rendered it\n> in 582 secs, which is almost exactly three times as long as\n> the render time for a 1.5 GHz P4 (see the site for more\n> times).  Is it just coincidence, or is there a fairly direct\n> correlation between CPU speed and render time,\n> regardless of processor type?\n\n\nThere's something wrong either with your machine, or with the\nOS X port of Radiance. There is no direct relation of processing\npower and clock speed between different CPU types.  In general,\nPowerPC CPUs require about half the cycles for the same results\n(ie. your 550 MHz G4 is roughly aequivalent to a 1 GHz P4). If\nyou get only the same performance per cycle on your G4, then\nyou're probably running into a system bottleneck of some kind\n(disk access, RAM size etc.).\n\n\nDoes your HD go to sleep when it isn't accessed for a few\nminutes, or do you have any other power saving features turned\non? Were the Radiance binaries compiled with comparable\noptimization flags? It may also be that a laptop simply has a\nrelatively slow HD installed to preserve energy. If you're low on\nRAM, then this could stall a Radiance simulation to some degree.\n\n\n\n\n> Makes Apple's ad copy\n> about the \"Velocity engine\" in the G4 seem like a load of\n> bunk (which I suspected in the first place).\n\n\nNo, this must have something to do with your specific system.\nThe G4s *are* faster than most Pentiums out there.\n\n\n\n\n>   Interestingly, there is a benchmark for a dual 2GHz\n> PC, which was only 50% faster than the single 1.5 GHz.\n> I'm interested in parallel processing, but this seems to\n> make a case against it.  What are your experiences out\n> there in the field?\n\n\nLinux isn't optimized for multi-CPU systems yet, although it's\ngetting better. It is even more difficult to directly equate\nclock speed with processing power on multi-CPU system than it\nalready is with normal boxes. The overall architecture of the\nsystem (both in hardware and software) can influence the result\nup to a factor of 50% or more. If the amount and type of your RAM\nor the configuration of your HD isn't carefully balanced against\nthe CPU specifications, then you'll get quite surprising results.\n\n\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch.com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-May/000231.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "May 09, 2002 at 02:16PM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_000230", "id": "radiance-general_000231"}