{"body": "Greg Ward wrote:\n\n\n> It seems certain that we need to rename \"rview,\" and from the responses \n> I received, also \"gencat,\" \"lam,\" \"neat,\" and \"calc.\"  Here are my \n> suggestions for these others, along with my reasoning:\n> \n>     \"gencat\" -> \"gencatenary\"\n> \n> This is a little-used, optional generator for catenaries.  I see nothing \n> against making the name longer and more explicit.  I don't think anyone \n> expected it to generate a feline, but I imagine quite a few users \n> wondered what the heck it did generate, as there's no man page for it.  \n\n\nActually, a feline generator could come in handy... (along with Rob's \nPam Anderson generator). Consider it for the next release! :^)\n\n\n/usr/bin/gencat was the only collision found by your script on my \nMandrake 9.1 distrib.\n\n\n>     \"neat\" -> \"neaten\"\n> \n> I also thought to rename it to \"tidy,\" but that seemed a too big change \n> for an obscure little utility.  If you've never checked this one out, \n> you might give it a look.  I thought it was a cute little program, which \n> is how I named it.\n\n\nHow about \"kleen\"? :^)\n\n\n> OK, finally to the subject of this message, which is coming up with a \n> new name for an old friend.  Below are listed some numbered \n> alternatives.  I want you to write back with your favorite (pick just \n> one, please) and explain your reasoning.  Consider it a chance to \n> contribute to the next release even if you've never written a line of C \n> code.  Here are the candidates.\n> \n> 1.    \"rvu\"\n> \n> Possibly my favorite, because it's short and unique, and if you say the \n> letters, you get back the original.\n\n\nI was just gonna suggest that myself.\n\n\n> 3.    \"rviewer\"\n> \n> This is better, because it stays close to the original meaning of the \n> command, which is \"ray viewer,\" and also has the two extra letters added \n> at the end rather than the beginning, so you can remember the new \n> command name at the last minute, right as your fingers are leaving the \n> word and saying, \"Hey -- you forgot something!\"\n\n\nThere's always file name completion, Greg. At least when you're running \na *real* OS. :^)\n\n\n> 5.    \"your_name_here\"\n> \n> Your own suggestion if you don't like any of the others.  (Not really \n> your personal moniker -- we aren't naming the command after you, sorry.)\n\n\n(Damn...)\n\n\nI'd consider \"rpreview\". Yeah, it's longer, but I imagine a lot of users \nuse it specifically just to get an idea of their scene (although you can \nof course do your final renderings with it too).\n\n\n> Well, those are my ideas.  They're all included in the new \n> \"radcollisions.csh\" attached to this message.  If you haven't run it on \n> your system yet, please do so and send me the output.  It would be a \n> real shame to rename a command to conflict with yet another Unix \n> program, so even if you ran the last one, please indulge me again.  (Do \n> it quickly, before \"vim\" takes over the world!)\n\n\nI think we have a concesus on shoving this editor where the sun don't \nshine. :^)\n\n\n--Roland\n\n\n\n\nRoland Schregle\nPhD candidate, Fraunhofer Institute for Solar Energy Systems\nRADIANCE Photon Map page: www.ise.fhg.de/radiance/photon-map\n\n\nEND OF LINE. (MCP)\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-December/001289.html).</sup>", "attachments": [], "created_by_name": "Roland Schregle", "created_at": "December 08, 2003 at 02:13PM", "created_by": "Roland_Schregle", "parent_id": "radiance-general_001288", "id": "radiance-general_001289"}