{"body": "Hi Nithya,\n\n\nI think noone answered this so far.\n> 1.As evalglare software requires hdr images of 800x800 pixels, i tried \n> to get the pixel information using getinfo in DOS window from the \n> START button-> run->cmd. And while using pfilt command to divide x and \n> y by a number, it says pfilt is not recoznised as an internal or \n> external command. Is there another command to resize the image that \n> can be used with DOS window?\nPfilt is a program coming with Radiance (www.radiance-online.org). It \nallows you to filter images in Radiance RGBE format, an HDR image format \nstoring a wide range of radiance (or, sometimes, irradiance) values \nmaintaining acceptable file sizes. However, it applies algorithms to the \nfile that go beyond scaling the image size. I would thus propose to use \npcomb instead, again, part of Radiance.\n\n\nBoth tools provide a command-line interface, no graphical user \ninterface. The syntax for pcomb to generate a 800 by 800 pixel version \nof big.hdr would be\npcomb -x 800 -y 800 -o big.hdr > small.hdr\n\n\nThe -o will revert any exposure-adjustments that may have been applied \nto your image before. small.hdr would be the image to be processed by \nevalglare.\n> 2. How shall i install the evalglare application? When i run evalglare \n> application by right clicking the setup file,a plain dos screen \n> appears.How shall i start with it?\nEvalglare is just one program that should be located in a directory \nincluded in your operating system's search path. No need for any kind of \n\"installer\".\n> 3. Will evalglare work well with hdr images other than fish-eye?\nYes. However, you need to know the vertical illuminance than, which can \nbe calculated from the pixel values in case that you have a 180 degrees \nfisheye.\n\n\nI guess you are working in some Windows environment. I have no \nexperience with this, so my answers are pretty generic. You will need to \nknow how to work on the command-line if you want to start using \nevalglare and Radiance HDR tools. This is not specific to HDRI, but to \nknowing your operating system. Many do not find Windows to be a very \ncomfortable environment for such applications, I would rather go with a \nLinux or Mac OS installation, however it is not impossible.\n\n\nGood luck, cheers, Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2013-October/000490.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "October 05, 2013 at 09:06AM", "created_by": "Lars_O._Grobe", "parent_id": "hdri_000487", "id": "hdri_000490"}