{"body": "Hello Bei.\n\n\nOn 25 Nov 2008, at 16:49, bei.xiao at gmail.com wrote:\n\n\n> Hello,\n>\n> I am trying to render an image using only ambient light.  I noticed  \n> that the reflected light appears to be non-uniform across the  \n> objects in the scene.  The scene is a open box with the open part  \n> facing the viewer and only surfaces inside the box are lit (outside  \n> of the box is dark).  It appears that the light has some  \n> directionality to it.\n\n\nThe ambient light setting in Radiance is different to other renderers\n- or maybe it's not if I think about it. Anyway, it's not supposed to  \nreplace\na proper light source in your scene (a 'light' or 'source' material for\nexample). It's just there to 'take over' when the proper ray tracing\ndoes not produce a light source in an acceptable time. That means\nit's only applied it the renderer has not found a light source after\ntracing a ray for '-ab' bounces through the scene.\n\n\nIn your case with a box open to the dark void every ray that leaves\nthe box adds nothing to the illuminance level of a point. The closer\nyou are to the (front) edge the more rays escape the box and the\ndarker this point will be in the image.\n\n\nThe points at the back of the box are only 'bright' because the\nrenderer assigns an artificial brightness to the ray after the first\nbounce (-ab 1). You can probably achieve a smoother gradient\nin your image by increasing the -ab value.\n\n\nIf you enclose your open box and the camera with another\nclosed box you will probably see that there is no directionality\nto the ambient light and everything will be uniformly grey (if\nthere is only one material). Every ray not hits a surface and\nthe brightness is only modified by the reflectance of the\nmaterial.\n\n\nRegards,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-November/005529.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "November 25, 2008 at 09:55AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_001662", "id": "radiance-general_005529"}