{"body": "On May 18, 2004, at 7:07 PM, Mark de la Fuente wrote:\n\n\n> I've been having a discussion with the people at my office about the \n> differences between Radiance and 3D Studio Viz & Lightscape.  (They \n> are used to using Lightscape and don't know anything about Radiance)  \n> And I was hoping some of you might have some comparison or contrasting \n> comments on this subject since I'm sure most of you have had some \n> experience with this sort of discussion.\n\n\nPeter A-B's paper, mentioned in his reply to you, is an excellent \nresource.  Print out Section 5.4 and hand it out to your co-workers, \nand then point them toward the radiance-online.org website.  =8-)\n\n\nI used Lightscape heavily for a number of years and beta tested both \nthe last version of Lightscape and Viz4 (the first time Lightscape's \ncode was used in Viz).  But I was always looking toward Radiance and \nwishing I had the time to learn its many nuances.  The demise of \nLightscape (Viz is horrid) and the aquisition of a complex project \nfinally conspired to push me into the Radiance learning mode full-time. \n  (P.S. I'm still in that mode, three years later!)  At this point, I \nuse Radiance for all our calculations that require more than a simple \nzonal cavity or point calc.\n\n\n> Even though we are specifically talking about Radiance Vs Lightscape & \n> Viz, I think this is in part more a comparison about radiosity Vs \n> raytracing.  From what I know, the big problem with radiosity is that \n> it simplifies things and assumes lambertian reflections. \n\n\nRight.  Again, Peter & Kurt's paper is an excellent resource on all of \nthis.\n\n\n> This is obviously a deviation from reality, but I assume it's still \n> possible to achieve a pretty accurate calculation of some sort \n> depending on the situation.  (I know the person I'm having this \n> discussion with is certainly convinced you can).  Therefore what I am \n> more interested in, is knowing what type of calculation you really \n> CAN'T do with radiosity (Viz or Lightscape) that you could do with \n> Radiance. \n\n\nI think some confusion stems from the fact that Lightscape & Viz have a \nray-tracing capability that you can apply, as a post-process.  When you \napply that to a Lightscape/Viz model, the specular reflections are \n*rendered*, but not *calculated*.  So you have a rendering that looks \nsomewhat accurate, but at that point that's all you have.  You cannot \nderive quantitative luminance/illuminance information from the image at \nthat point.  That data always comes from the radiosity-calculated \nmodel, and that's fundamentally flawed because of the lack of specular \nreflections (and in Lightscape's case, no diffuse transmissions \neither).\n\n\n\n\n    Rob Guglielmetti\nwww.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-May/001714.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "May 19, 2004 at 03:27PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_001706", "id": "radiance-general_001714"}