{"body": "Hi Peony,\n\n\nThe four images that you uploaded have the following exposure values:\n\n\n0.jpg ISO68  F2.8 0.0666667s 6.32EV\n1.jpg ISO199 F2.8 0.0666667s 7.87EV\n2.jpg ISO200 F2.8 0.125s     6.97EV\n3.jpg ISO200 F2.8 0.125s     6.97EV\n\n\nYou need a wider range of exposures to cover the dynamic range of the \nscene. Visually, the images appear to have almost the same brightness. \nThey need to noticeable different. See\nhttp://www.jaloxa.eu/webhdr/demo.shtml\nfor an example exposure-bracketed sequence.\n\n\nIt is recommended to vary only the exposure time, although in principle, \nplaying with the ISO sensitivity should work, too. Just make sure the \naperture is fixed, which it is in your example shots.\n\n\nThe last two images (I don't have your original file names) have exactly \nthe same exposure. Visually, however, one is a little darker than the \nother. This can mean that the EXIF information (aperture, ISO, shutter) \nis unreliable.\n\n\nYou must also mount your camera/smart phone on a tripod. hdrgen can do \nsome magic trying to align the frames, but it's better to not rely on \nit. For accurate results, a tripod is a must.\n\n\nYou will also need to get hold of a luminance meter against which you \nneed to calibrate the HDRs. Note that the calibration factor depends on \nthe white balance setting with which the images were taken.\n\n\nI don't know how you can control the exposure times on a smartphone, but \nmy recommendation would be that you borrow a decent camera and get some \nexperience with HDR photography before attempting to do this on a smart \nphone. Alternatively, invest in a second hand Canon PowerShot and put \nCHDK on it: http://chdk.wikia.com/wiki/CHDK. Make sure your model is \nsupported. This will allow you to take exposure-bracketed sequences \nwithout touching the camera. For most PowerShots, it will also give you \nthe option of saving in RAW format for when you need the results to be \nVERY accurate.\n\n\nHope this gets you started. Good luck\n\n\nAxel\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2012-August/000432.html).</sup>", "attachments": [], "created_by_name": "Axel Jacobs", "created_at": "August 26, 2012 at 04:13AM", "created_by": "Axel_Jacobs", "parent_id": "hdri_000418", "id": "hdri_000432"}