{"body": "Hi Milan!\n\n\n>> Perfect. Plus: if most ambient bounces are expected to happen in between\n>> diffuse blinds, you need the high setting of -ab only for mkillum.\n>\n> Bravo Lars, I forgot to ask you about -ab for mkillum. But, when you say \"high\n> setting of -ab\", what is high? Is that maybe -ab 8, or maybe more?\n\n\n-ab sets the number of bounces in the diffuse indirect calculation after \nwhich Radiance will stop spawning further rays. When you run mkillum, \nthis means that you need to set ab to a value that ensures that rays hit \nthe sun or sky unless the number of reflections led to that little \nRadiance left that you can safely skip. I doubt that you will see much \nchanges at ab higher then 3 in your case, but there is a safe way to \nfind out. Run a couple of simulations varying -ab for mkillum, and plot \nirradiance against ab. Use a sunless sky for that. In the case of open \nblinds, this will lead to a very low requirement for ab. In the case of \nmostly closed blinds, where the sky cannot be seen from the glass pane, \nab would lead to an irradiance reading of 0, but will stabilize at \nhigher ab. So the requirement will change according to the blinds tilt \nangle, and you will probably have to go with the worst case of almost \nclosed blinds to determine the ab for your scene. I still doubt that you \nwill see much changes when reaching high values for ab such as 8.\n\n\n>> When running rtrace, you can probably stay at ab set to about 2, and that means\n>> you can follow previous advices to calculate irradiance for more then one point\n\n\nAgain, important to imagine what this means. The ab value used by rtrace \nafter the mkillum surface has been generated needs to ensure that the \nmkillum-generated source is hit during diffuse indirect calculation. As \nit is probably directly visible from the sensor location, most of the \nirradiance received will be directly transported from the source to the \nsensor, and only a very little fraction by one or more bounces over \nwalls and ceilings. You will also be able to use relaced ad and as here, \nif the source surface is rather large and not hidden behind geometry.\n\n\n>> By the way, you are looking at diffuse reflective blinds, right?\n> Yes.\n\n\nImportant detail, all the responses you got would not be true for highly \nspecular blinds...\n\n\nCheers, Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-December/007593.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "December 30, 2010 at 04:17AM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_007574", "id": "radiance-general_007593"}