{"body": "Hi Stephen,\n\n\nThis would probably be a little easier to set up using transdata, which is meant for this kind of input.  However, none of the older types handle soft-specular interactions from non-sources.  This is a big caveat with these material types and one of the main motivations for implementing the more general BSDF framework.\n\n\nSince you already have this function implemented, you can use it to create an XML file for the BSDF primitive (see refman.pdf pp.10-11) using either bsdf2klems or bsdf2ttree, which take functional descriptions.  To given an example, we can define the following wgmdiso.cal file:\n\n\n{ Ward-Geisler-Moroder-Duer isotropic BRDF model }\n\n\nrho_d = 0.095;\nrho_s = 0.05;\na = 0.08;\n\n\nexfunc(hx,hy,hz) = exp(-(hx*hx + hy*hy)/(hz*hz*a*a)) *\n\t\t\t(hx*hx + hy*hy + hz*hz) /\n\t\t\t(PI*a*a*hz*hz*hz*hz);\n\n\n{ Note that we assume i and o vectors are normalized }\n\n\nwgmdiso(ix,iy,iz,ox,oy,oz) = if( -iz*oz, 0,\n\t\t\trho_d/PI + rho_s*exfunc(ix+ox,iy+oy,iz+oz) );\n\n\n\n\nThis can then be passed to bsdf2ttree to create an XML representation:\n\n\n\tbsdf2ttree -t3 -f wgmdiso.cal wgmdiso > wgmdiso.xml\n\n\nThe \"-t3\" option tells bsdf2ttree that the function is isotropic.  There's no such choice for the Klems representation, where you would use:\n\n\n\tbsdf2klems -f wgmdiso.cal wgmdiso > wgmdisok.xml\n\n\nIt's a homework assignment to convert your function into one that takes incident and exiting vectors (both pointing away from the surface), and remember that you need to include same-side vectors for reflection, which should return 0.2*0.9 for the diffuse portion in your case.\n\n\nThe reward should be a BSDF description that does proper sampling of the transmitted light!\n\n\nBest of luck!\n-Greg\n\n\nP.S.  Apropos to this discussion, Peter Apian-Bennewitz wrote an excellent review of different Radiance materials and how best to apply them a few years back, including the transfunc type.  His paper is available as at <http://arxiv.org/abs/1307.4214>.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-May/011735.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "May 17, 2016 at 11:23AM", "created_by": "Greg_Ward", "parent_id": "radiance-general_011734", "id": "radiance-general_011735"}