{"body": "John An wrote:\n\n\n > First off, de-triangulating the illums did the trick; no more aiming\n > problems.  I'm curious to know how inaccurate the calculations are\n > when there are aiming errors.\n\n\nAFAIK, error could potentially be quite large.  Since you now have RwR \nin your posession, head over to page 511 for the juicy bits about this \ndilemma.\n\n\n > Secondly, while I had searched the Harvard libraries for Rendering\n > with Radiance, I hadn't searched the MIT libraries.  Low and behold,\n > MIT has a copy, which I quickly snatched up.  And unfortunately, it\n > seems as if Rendering with Radiance is no longer in print.  I found a\n > used copy of it on sale at Amazon for about $150 ...\n\n\nThat's only about 50% over list price, certainly the cheapest I've seen \nit in a while.  :\\\n\n\n > Now, to my next question.  I've flipped through Rendering with\n > Randiance the last 30 minutes, and haven't found what I needed.  I\n > will be reading through it more carefully, but I haven't seen\n > anything regarding setting up a reference grid.  In Desktop Radiance,\n > there is an option to create a reference grid.\n >\n > So, how does one go about setting up a reference grid or reference\n > point in the \"regular\" Radiance?\n\n\nThis thread might be useful for ya.  Be sure to read the entire thread \nbecause (surprise!) I made some errors along the way...\n\n\nhttp://www.radiance-online.org/pipermail/radiance-general/2002-May/000258.html\n\n\nAlso, Georg Mischler's Rayfront will generate these grids for you \nautomatically.\n\n\n\n\n\n\n      Rob Guglielmetti\n\n\ne. rpg@rumblestrip.org\nw. www.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000680.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "May 01, 2003 at 02:23PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_000672", "id": "radiance-general_000680"}