{"body": "Hi Axel,\n\n\nThanks for sending me your model off-list.  Indeed, it is the source obstructor cache initialization that is taking up most of the start-up time.  It's tracing about 8.5 million rays, which would normally be done in about 10 minutes, but seems to be taking longer due to the preponderance of triangle mesh geometry in your model.\n\n\nThe Radiance triangle mesh (.rtm) format was designed to handle complex geometry in the smallest possible memory footprint.  To achieve this, I had to compromise a little on execution time.  In addition to the ray vector transformations that are also required by the \"instance\" primitive, tracing rays into a triangle mesh is maybe twice as expensive as rendering straight geometry.  If simple geometry is stored in a mesh, then you are paying this price unnecessarily.\n\n\nTo reduce start-up time, I would recommend putting the geometry into octree instances rather than triangle meshes if it's not too complicated, or just use xform if you aren't making multiple copies of the geometry throughout your model.  Having a single instance is wasteful of resources and costs overhead during rendering.\n\n\nAnother thing that will speed up the initialization is to use a frozen octree.  Your 7000 light sources mean 7000 calls to the shell to run xform, and there's no reason to do that except the first time, during octree creation.\n\n\nCheers,\n-Greg\n\n\nP.S.  More information on mesh primitive from 2003 workshop:  http://www.radiance-online.org/community/workshops/2003-berkeley/presentations/Ward/Tutorial1.html\nDownload the PowerPoint tutorial and skip to Section II around slide 42.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2017-February/012043.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "February 21, 2017 at 01:33PM", "created_by": "Greg_Ward", "parent_id": "radiance-general_012038", "id": "radiance-general_012043"}