{"body": "Yes, I am also in favour of a somewhat formal organization in\ncharge of the further development of Radiance. I'm not sure if\nthe ITC is the optimal role model, though, as their membership\noptions can involve significant amounts of money. There are a\nnumber of more open software consortiums around, all of which\nseem to be organized in a similar way. Examples are the Python\nSoftware Foundation (http://www.python.org/psf/), the Apache\nSoftware Foundation (http://www.apache.org/), and others. For\nsome reason (probably tax related), those organizations are all\nincorporated in the state of Delaware. I'm sure that we could\nask some of the members of the existing organizations for more\nspecific information about the potential pitfalls of this and\nother options (I have some connections to the Python community,\nso that might be a useful starting point).\n\n\nKostas didn't say anything about the topic in his announcement,\nso it is likely that LBNL plans to keep the copyright on the code\n(\"Open Source\" is not the same thing as \"public domain\"). This\ndoesn't necessarily conflict with the establishment of a seperate\norganization of developers, although it would be more elegant to\nassign all the rights to a formally independent legal entity.\nSince LBNL is still awaiting approval by the DOD, it may be\npremature to discuss this in public in great detail, but since\nthere was a request for feedback, here it is.\n\n\nI don't have a full list of the current and past licensees, but I\nassume that most of them would be interested in some kind of\nparticipation. This is certainly the case for me!\n\n\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch.com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-June/000297.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "June 09, 2002 at 11:23AM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_000294", "id": "radiance-general_000297"}