{"body": "I might agree with you, but I think if it was the window, then not only\nthe ceiling, but also the right and left walls would probably have dark\nspots on them as well (maybe also the backwall?). It should be noted that \nthe dark spot is always directly above the highlight on the floor as the\ntime of day changes. I don't really understand what you mean by coupling, \nbut I don't believe that the shadow is related to the window, rather it\nis related to the highlight on the floor. If I change the shape of the\naperture to an asymmetrical shape, such as a square with a triangle on\ntop, then the shadow on the ceiling seems to be a mirror image of the\nhighlight on the floor, rather than a projection of the window. Note that \nthe two would have the triangle shape on opposite sides of the ceiling\nshadow. I'm not sure if that helps answer your question.\n\n\nThe radiosity program I am using does not create a shadow in that\nlocation, (or on other walls either). I believe if anything, radiosity\nmight simply be darker/lighter in general.\n\n\n--John\n\n\n==============Original message text===============\nOn Mon, 17 Aug 2009 13:24:46 EDT \"Zack Rogers\" wrote:\n\n\nHi John,\n\n\nEven without this funny sampling behavior I think there could be a\nslightly darker patch on the ceiling due to the 1/3 x 1/3 square on the\nadjacent wall that has a 0% reflectance.  That dark portion of the\nceiling could just have a stronger coupling to the 0% reflectance surface \nthan the other surfaces around.  Do your radiosity renderings show any\ndarker spots on the ceiling?\n\n\nCheers,\nZack\n\n\n\n\n________________________________\n\n\n  ZACK ROGERS, P.E., LEED AP, IESNA \n\n\nINTEGRATED DESIGN ASSOCIATES, INC\n437 Main Street\nLongmont, CO 80501\ntel: 303.848.8299, fax: 303.848.8290 \nwww.ideasi.com \n\n\n-----Original Message-----\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-August/006182.html).</sup>", "attachments": [], "created_by_name": "John Schwartz", "created_at": "August 17, 2009 at 10:52AM", "created_by": "John_Schwartz", "parent_id": "radiance-general_006145", "id": "radiance-general_006182"}