{"body": "On Fri, 19 May 2006 17:30:51 +0200\n\"Lars Grobe\" <grobe at gmx.net> wrote:\n\n\n> I do not know about any good free 3d-CAD packages for Linux. There are\n> good modelers (AC3d, Blender, ...). Also there are some commercial\n> modelers free for private or education use, like Houdini, Maya etc. In\n> general, real CAD has to be paid under Linux. And as you mentioned your\n> boss, it is not clear to me if you work on a school project or a\n> commercial one.\n> \n> I did most work on formZ (Mac, but is available for Windows, too). Great\n> tool, but expensive.\n> \n> Whatever you choose, exporting obj is really valuable, all other formats\n> have drawbacks. Dxf is still well supported by Georg Mischler's dxf2rad,\n> but some advanced features of Radiance are bound to obj.\n\n\nI've had a good time modelling with Wings3D, which is far from CAD. It's\nprimarily a polygonal modeller for creating sub-divisional meshes. I create\nsome weird shape and when I'm happy with it I hit 's' a few times to\nsub-divide the mesh and save as an OBJ file. Then it's off to obj2mesh and\nputting the object into a scene.\n\n\nHere's my latest work, including an iridescent colorfunc:\nhttp://www.deviantart.com/view/33287687/\n\n\nI'm currently slogging through rendering an animation of this object and\nits colourful material.\n\n\nI'd steer clear of DXF unless you're using AutoCAD. AutoDesk has refused\nto document the file format and has stated that their software is the only\nsoftware that can handle DXF properly. So I'd avoid it if I could.\nAlthough I guess running ToRAD or whatever within AutoCAD is probably\nalright.\n\n\nAutoDesk have also hitched their wagon to Microsoft's, ruling out any\nnon-Windows ports of their software. So personally, I've given them the\nbig middle finger and am ignoring them. Others have provided names of\nother CAD packages, some of which are available on Linux.\n\n\nHope this helps,\nbye\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-May/003701.html).</sup>", "attachments": [], "created_by_name": "Ian Tester", "created_at": "May 20, 2006 at 03:17AM", "created_by": "Ian_Tester", "parent_id": "radiance-general_003692", "id": "radiance-general_003701"}