{"body": "I wouldn't jump to any conclusions about overall \"popularity\" from the\nfew responses to this thread. Of the people out there who have actually\nwritten and published tools for Radiance, most did not respond.\n\n\nOn the other hand, Python versions of a number of the common scripts\nin Radiance will be added to the distribution in the near future.\nThat will simplify a few things, especially for Windows users.\nOf course that still doesn't mean that anyone has to learn the language\nwho doesn't otherwise care about it.\n\n\nCheers\n-schorsch\n\n\n\n\nAm 2016-04-19 00:16, schrieb Christopher Rush:\n> I had recently been assuming python would become our go-to for data\n> manipulation based on popularity, but I'm learning that shouldn't be\n> my assumption within the Radiance community - which I bet was\n> Randolph's original intent in this thread.\n> \n> Maybe I'll attempt Ruby for the next solution I need to sort out.\n> \n> For me personally, I'll probably never really \"learn\" any of these,\n> I'll just Google search snippets to cobble together whatever I need -\n> but only when bash can't do it well and the internet can present a\n> better solution   : )    I suppose I could say I've \"learned\" bash\n> because I've examined enough snippets and written enough from scratch\n> for multiple years, but unless I attempted to abandon bash and tried\n> to do all of my six-scripts-per-year in python/ruby/etc I'll remain a\n> newbie in each one.\n> \n> Sorry - didn't mean to hijack the thread - just throwing in an extra\n> perspective. I don't really need any specific guidance at the moment.\n> \n> -Chris\n\n\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-April/011707.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "April 19, 2016 at 03:04AM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_011683", "id": "radiance-general_011707"}