{"body": "Greg Ward wrote:\n\n\n> I only had a few responses to my request to run \"radcollisions.csh\" on\n> different machines.\n\n\n Conflicting executables on Linux 2.4.19-4GB\n /usr/bin/gencat\n\n\n\n\n Conflicting executables on FreeBSD 4.6-STABLE\n /usr/local/bin/calc\n /usr/local/bin/dmake\n /usr/bin/gencat\n /usr/bin/lam\n /usr/local/bin/rview\n\n\nThe only new one here is dmake, which I can't even find anywhere\nin Radiance... How did it end up on your list?\n\n\n    http://www.scri.fsu.edu/~dwyer/dmake.html\n\tDmake (Distributed Make) is a generic parallel make utility\n\tdesigned to speed up the process of compiling large packages.\n\n\n\n\n>  \"gencat\" -> \"gencatenary\"\n>  \"lam\" -> \"rlam\"\n>  \"calc\" -> \"icalc\"\n>  \"neat\" -> \"neaten\"\n\n\nAm I the only one who had to look up what a catenary is?\nOtherwise, they all seem ok to me.\n\n\n\n\n> I'm thinking we'll want to include a symbolic link from the new name\n> back to \"rview,\" for two reasons.  First, old users like me are going\n> to have trouble with whatever we name it to because \"rview\" has become\n> so familiar to my fingers that they type it automatically.\n\n\n$> cat /opt/radiance-3.6/bin/rview\n#!/bin/sh\necho \"$0\"\necho \"please use 'rviever' instead for previewing Radiance scenes\"\necho \"or replace this file with a symbolic link to it.\"\nexit 1\n$>\n\n\nIf we want to establish a new name, we need to educate our users\nabout it. I don't think we should install it in a way that basically\nhides the fact from people who don't happen to read the release notes.\nThose who then deliberately decide to stick to their old habits have\nan easy enough way to get what they want.\n\n\n\n\n> 1.      \"rvu\"\n> 2.      \"radview\"\n> 3.      \"rviewer\"\n> 4.      \"radiance_viewer_86FQ19GZ15\"\n\n\n1. is cute, but possibly too cute...\n3. promises to be easily adopted and remembered. I think that\n\"rviewer\" would have the least practical annoyance factor (in the\ntimes of automatic command line completion and error correction).\n\n\nA little historical note: \"Radview\" was an early project name for\nRayfront. I discarded it after I found there is a software\ncompany by that name, selling a load analyzing package for\nmulti-tiered web application systems.\nAlthough there would have been no trade mark conflict (completely\nseperate and independent market segments) I wouldn't want to get\nconfused with *anyone*. ;)\n\n\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-December/001291.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "December 08, 2003 at 09:00AM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_001288", "id": "radiance-general_001291"}