{"body": "Hello Radiance community.\n\n\nI'd like to mention this page\n\n\n    http://radiance-online.lbl.gov:82/community/plone-tips/plone-notes\n\n\nfor anyone who is interested in contributing to the new radiance-online.org site.  If you have any technical issues related to posting content please direct them to me - Daniel Fuller defuller at lbl.gov.\n\n\nPlones distinct advantage - apart from its fine-grained community permissions approach, is the the fact that it recognizes normal text files and simple html pages - which means output from utilities like man2html etc can directly be imported and exported unaltered as long as the html is purely structural (no css pop-ups divs etc).  Also large media files like ISO can go directly into the system. For example, if mounted via webdav (see the link above) and entire folder hierarchy of html pages with associated files and images can drag and dropped directly into the cms.\n\n\nThe html files take the most time to upload since they are computed into the zodb - plone's database - but the best thing is that is does not alter the formatting of the original files and the can be retrieved via the webdav mount in the same drag and drop manner the way the went in.  Other non text / html files are forwarded directly on the the webservers filesystem.\n\n\nEdits in my opinion are best done using the \"external editor\" feature which can be clunky to setup (requires firefox - safari is prohibitive and I have not tried it with chrome) but once done updating the information can get quite compulsive since its so easy (we want it to be easy to encourage all you content providers to keep your pages fresh).  Getting up to speed using LibreOffice can be a little tricky (ie same page links / anchors are called bookmarks) but I think those of you who have not used it before will find it consistent with its own behavior - anyone with ms word experience will know what that means ;-)\n\n\nIn any case one can start off by copying and pasting the template.html page from the Plone-Tips \"Contents\" (directory) view (must be logged in)\n\n\n    https://radiance-online.lbl.gov:447/community/plone-tips/folder_contents\n\n\nto the directory view of where your new page is going to go - for example in your home folder \n\n\n   https://radiance-online.lbl.gov:447/Members/<your login name here>/folder_contents\n\n\nThen rename the page and use the \"Edit with external\" application function or just the edit tab to update the page.\n\n\nI know this sounds long winded - but in the long run it becomes quite automatic.\n\n\nIn in any case you can also start off by creating an html page and dragging and dropping to the plone site via webdav - again see the http://radiance-online.lbl.gov:82/archived/development/plone-notes page.\n\n\nThanks all for your patience with this new site and enjoy - if possible ;-)\n\n\nDan - 510-486-6496\n\n\nOn Mar 5, 2012, at 2:28 PM, Andy McNeil wrote:\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2012-March/008454.html).</sup>", "attachments": [], "created_by_name": "Daniel Fuller", "created_at": "March 07, 2012 at 11:47AM", "created_by": "Daniel_Fuller", "parent_id": "radiance-general_008439", "id": "radiance-general_008454"}