{"body": "Greg,\n\n\n> Specular is more difficult to measure, but you can usually guess with\n> reasonable accuracy.  If a surface is a single dielectric interface\n> (plastic or glass), it's specular reflectance will be around 4%. If it\n> is a double interface, as in a pane of glass, it will be about twice\n> that, unless the glass is very dark, where it will be somewhere between\n> 4% and 8% depending on the amount of absorption.\n\n\nIs this the so-called Fresnel reflection you're talking about? It's 4% at\nright angles. I'm with you...\n\n\n> As for roughness, I have a nice little device with LEDs and a viewport\n> that allow me to estimate this value, but I don't know how to offer it\n> to anyone as it's a piece of hardware, and requires a lot of experience\n> to use effectively.\n\n\nI wonder if it was possible to just measure the size of the hilight and\nderive the roughness from there, given a known light source diametre and\ndistance, e.g. sun? Well, it's not going to be have sharp edges, but one\ncould take an HDR image and a luminance profile through it that finds the\n50% intensity...\n\n\n>> Is this only possible through visual comparision?\n>> What are the steps to A1..A7 if given:\n>> - reflectance (luxmeter + luminance meter)\n>> - transmittance (2x luxmeter)\n>> (practical scenario, assuming grey colour)\n>> if\n>> - Lambertion properties or\n>> - clearly see-through\n>> What is the plastic equivalent to a trans without transmittance?\n>\n> I'm not sure I understand the question.  If you set A6 to 0, trans is\n> the same as plastic.\n\n\nWhat I means is almost exactly what you described above:\nTo measure the reflectance: refl = L * PI / E. Measuring the luminance and\nthe illuminance for the same spot (even illuminance assumed) gives us a\nfigure for the reflectance\nTo measure the transmittance: trans = E_behind_material /\nE_in_front_of_material, ideally taken with 2 lux meters, but under\nrelatively constant illumination and with some averaging over several\nreadings, it will work.\n\n\nQuestion is: how far does this improvisation get us with the trans material?\n\n\nAxel\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-March/002524.html).</sup>", "attachments": [], "created_by_name": "Axel Jacobs", "created_at": "March 11, 2005 at 01:56AM", "created_by": "Axel_Jacobs", "parent_id": "radiance-general_002516", "id": "radiance-general_002524"}