{"body": "Hi George,\n\n\nThat sounds like a very intriguing project - I look forward to seeing some of the results.\n\n\nTrans is its own material, like plastic or metal. It can act as a modifier to a polygon, but not to another material (as far as I know).  Here is one that I have used:\n\n\nvoid trans frosted_glass\n0\n0\n7   0.7   0.7  0.7  0 0.025  1  0.95\n\n\nfrosted_glass polygon rectangle_1\n0 \n0\n12 etc. \n\n\nThe 7 trans parameters are not extremely intuitive, but you can read about them in Axel Jacobs' excellent Radiance Cookbook (http://www.jaloxa.eu/resources/radiance/documentation/docs/radiance_cookbook.pdf). \n\n\nIn my case, I think they mean the following:\n   -0.7 0.7 0.7: the RGB values for the light that is coloured (i.e., not specularly reflected or absorbed)\n   -0: the specularity of the material (in my case 0, as I didn't want or require specular reflection) \n   -0.025: the roughness (small, in my case, to account for scatter in the transmitted light)\n   -1: trans; of the coloured light, how much is transmitted vs reflected (I didn't want or require light to be diffusely reflected)\n   -0.05: tspec: how much of the transmitted light is specular: if you choose this to be one, it would act more like a regular glass panel. I chose 0.05 because I wanted model glass with highly diffusive properties\n\n\nSo of the light that hits this trans material:\n   1. 30% is absorbed \n   2. 70% is transmitted, with no colour: 95% is scattered, 5% transmitted like a normal ray (although technically, I think Radiance uses a curve determined by these two parameters to scatter the light)\n\n\nThis is not a very realistic material, it would appear entirely black from the outside. I used it only for interior modelling with a single surface so that was of no import to me, and I wanted to avoid fiddling with both the RGB values and trans to get the final transmittance right. \n\n\nIn your case, you will probably want to pick:\n   -green RGB values, probably fairly low (weighted), as most of the non-green light is absorbed for photosynthesis\n   -low specularity (<0.07)\n   -low roughness (<0.025)\n   -low trans value (depending on leaf properties, probably more light is reflected than transmitted, so 0.2-0.5?)\n   -low tspec value (<0.1) because most of the transmitted light will be diffuse\n\n\nI don't know if these properties have been measured for different kinds of leaves / plants, but I'd be interested to hear if they are. \n\n\nHope that helps,\n\n\nReinier\n\n\n\n\nMessage: 3\nDate: Fri, 20 Sep 2013 11:51:16 +0100\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2013-September/009790.html).</sup>", "attachments": [], "created_by_name": "Reinier Zeldenrust", "created_at": "September 20, 2013 at 04:28AM", "created_by": "Reinier_Zeldenrust", "parent_id": "radiance-general_009789", "id": "radiance-general_009790"}