{"body": "Rob Guglielmetti wrote:\n\n\n> The original question remains.  Where do the defaults live?  This \n> discussion has moved toward reinventing the wheel, if you ask me.  My \n> question in July was how does one control default window sizes in X. \n> Marija may be looking to specifically override the defaults with rvu \n> (that does seem to be the question there), but the fact remains, if we \n> can determine where the defaults are stored for some of our common \n> Xen, that may be the simpest way. (?)\n>\n> ,,,\n\n\ntwo more bits to add:\n\n\nman xrdb says:\n\n\n       Xrdb  is used to get or set the contents of the RESOURCE_MANAGER \nproperty on the root window of screen 0, or the SCREEN_RESOURCES property on\n       the root window of any or all screens, or everything combined.  \nYou would normally run this program from your X startup file.\n\n\n       Most X clients use the RESOURCE_MANAGER and SCREEN_RESOURCES \nproperties to get user preferences about color, fonts, and so  on  for  \napplica-\n       tions.   Having this information in the server (where it is \navailable to all clients) instead of on disk, solves the problem in \nprevious ver-\n       sions of X that required you to maintain defaults files on every \nmachine that you might use.  It also allows for dynamic changing of defaults\n       without editing files.\n\n\nso, sticking to the X WIndow System standards, one would put lines like\n\n\n    radiance.rvu.x:800\n    radiance.rvu.y:600\n\n\nin a file and read that at start up of X. (xrdb -merge .Xdefaults would \nbe typically used in a .xinitrc file at startup)\n\n\nConcerning overriding the aspect ratio given in the view with that of \npixel dimensions: rshow had (and has) the same problem and being able to \nselect the behaviour is nice. To avoid yet another cmdline option in \nrvu, setting one pixel dimension would set the other pixel dimension \nfrom the aspect ratio given in the view file, whereas two user supplied \npixel dimensions will fix the view aspect ratio. That'll be backward \ncompatible too.\n\n\n-Peter\n\n\n\n\n pab-opto, Freiburg, Germany, http://www.pab-opto.de\n [see web page to check digital email signature]\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-November/002143.html).</sup>", "attachments": [], "created_by_name": "Peter Apian-Bennewitz", "created_at": "November 09, 2004 at 06:21PM", "created_by": "Peter_Apian-Bennewitz", "parent_id": "radiance-general_002133", "id": "radiance-general_002143"}