{"body": "Hi Rob,\n\n\nI hope you had a pleasant walk home after work yesterday...\nMaybe the East Coast is more in need of Gouvernor Arnold Schwarzenegger\nthan California ...\n\n\nback to the business:\n\n\ncompiling usually doesn't work at the first try, this is perfectly normal.\nEqually usual, it's just some minor stuff like this or that header file not\nfound because of a wrong search path, so it pays off to be patient. \nThe version mess nevertheless can be quite annoying, it's increasingly hard to \nkeep track of all the different system specifics. Was it /usr/X11/include or \n/usr/include/X11 or /usr/f...it/X11R6/... (these are still the easy ones...)\nOften links are set to redirect a lot of different namings, but just the one you need \nmay be missing...\n\n\nSee it the positive way, you learn something about your system: where's what?\nDo it like Schorsch proposed, and then look at the output file with all the compiler\nmessages. Look for 'file not found' items, then add the directory, in which these\nheaders reside on your system, to the rmake- \"MACH\" options with -I/your/specific/dir.\n\n\nconcerning rayinit.cal\nWhen you do the compiling yourself, you know the directory where this file is moved\nto, as you're asked by the script to give a name yourself (library-dir). This path then \ngets coded into the executables (but may be overriden by an environment variable setting) \nIf you're using precompiled executables, look for some info what library path is \nset for these, so you can put all the cal files in the correct directory rightaway. \nI can imagine that this info is missing, so issue a fierce complaint at the binary package\ndistributor :-)   \n\n\nThis rayninit.cal (i.e. all .cal-file) mess is certainly awkward, but on the other\nhand this allows a great amount of flexibility by enabling you to load specific\nstuff on startup, even complicated algorithms, which otherwise would have to be\ncompiled into the program. \n\n\n\n\n-Carsten\n\n\nP.S. I remember some other postings months ago dealing with installation problems, \n      have a look at the mailing list archives.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-August/000923.html).</sup>", "attachments": [], "created_by_name": "Captain Boiler", "created_at": "August 15, 2003 at 03:28PM", "created_by": "Captain_Boiler", "parent_id": "radiance-general_000921", "id": "radiance-general_000923"}