{"body": "> rpict -i -vf default.vp -x 512 -y 512 kontor.oct > irrad.pic\n> rpict -vf default.vp -x 512 -y 512 kontor.oct > rad.pic\n> falsecolor -i irrad.pic -p rad.pic -cl -n 10 -l cd/m2 > lum.pic\n> \n> I am not sure that these inputs are correct because I get  a high \n> contrast in the picture (black room with a white window). Therefore it \n> is hard the separate the objects and tell the different luminances in \n> the picture.\n\n\nStart to solve that problem step by step. It seams that the picture \nwhich you want to use as a background for the isolines is not what you \nexpected it to be. You should have that annoying high contrast picture \nif you just look at rad.pic : ximage rad.pic\n\n\nUsually, the output of rpict is filtered before being viewed. Read the \nmanpage of pfilt and maybe pcond. Here you could e.g. adjust the \n\"exposure\", whih defines how the values of your rendering will be mapped \nto the values that your screen can actually display.\n\n\nAnother problem in your case might be that in your scene, the default of \none ambient bounce will most probably not enough to model the reflected \nindirected light. Did you use a ground plan for your building (you \nmentioned surroundings)? You should try to render with -ab 2 or -ab 3, \nas light reflected from the surrounding surfaces to the ceiling and \nwalls, and from there to floor, ceiling, walls, may have a big influence \nof the result.\n\n\nForget about falsecolor until you got the previous steps in the process \nrunning. First you need the background image, before you solved that you \ndo not need to worry how to combine it with contour lines. BUT also for \nirrad.pic, you should definitely increase the ambient parameters for the \nscene as you described it.\n\n\nGood luck, Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-April/004947.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "April 23, 2008 at 07:23AM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_004946", "id": "radiance-general_004947"}