{"body": "> but Mardaljevic (are you out there?)\nI hadn't realised that I'd gone away.\n> was primarily working with overcast skies, which aren't adequate for  \n> glare models,\nIndeed. (Actually, I'd already got a climate-based implementation  \nworking by then, but the chapter would have ended up longer than the  \nbook if I'd have tried to include it.)\n> so I'm not sure how much of his advice still applies.\nDepends on what you mean. The advice re: convergence testing is  \n(still) probably applicable to most scenarios, at least for a 'naive'  \ncalc. But we need to know a little more what your goal is. The bulk of  \nthe computational effort tends to be, of course, with the prediction  \nof the indirect component. So a reasonable estimate for luminance of,  \nsay, the blinds shouldn't be too onerous since the direct component  \nand maybe 1st bounce will usually (but perhaps not always) dominate.  \nSame goes for the view to the outside.\n> Simplify the blind model; use flat rather than curved slats.\nThat might not be practicable if it changes the view of potentially  \nilluminated slat area.\nFor what it's worth, I'm still very much with the sceptics re:  \npredicting glare for deployed blinds (unless perhaps they're fabric).  \nWith venetian or vertical blinds, the experienced field of view  \nluminance is dependant on the vagaries of user operation, which, I  \nfeel, renders an evaluation all but meaningless - even for a  \nstochastic-based model of user operation (due to uncertainties in the  \nparameterisation). I'm open to be convinced otherwise if someone can  \ncome up with a sufficiently compelling argument.\nCheers\nJohn\n\n\nDr. John Mardaljevic\nReader in Daylight Modelling\nInstitute of Energy and Sustainable Development\nDe Montfort University\nThe Gateway\nLeicester\nLE1 9BH, UK\n+44 (0) 116 257 7972\n+44 (0) 116 257 7981 (fax)\n\n\njm at dmu.ac.uk\nhttp://www.iesd.dmu.ac.uk/~jm\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2011-January/007610.html).</sup>", "attachments": [], "created_by_name": "John Mardaljevic", "created_at": "January 05, 2011 at 01:19PM", "created_by": "John_Mardaljevic", "parent_id": "radiance-general_007608", "id": "radiance-general_007610"}