{"body": "On Fri, 11 Aug 2006 10:42:38 -0400, Kirk Thibault wrote\n> On Aug 11, 2006, at 4:36 AM, Geraldine Joffre wrote:\n> <snip>\n> >\n> > Photographers in general do not wish to produce photorealistic images.\n> > Geraldine Joffre\n> >\n> </snip>\n> \n> This is a very interesting statement, especially in light of 3D  \n> modelers and renderers who are trying to produce \"photorealistic\"  \n> images by using HDR photographs as radiance maps and reflectance  \n> maps.  Fascinating philosophical point of view!  I guess it comes  \n> down to one's definition of what is \"photorealistic\".\n\n\nYou are right. I should have made it clear in what sense I used the term \"photorealistic\" here. By \n\"photorealistic\", I was referring to the attempt to mimic the effects of camera limitations in order to \nmake an image (a computer generated one for instance) look as if it had been taken with a camera. \n\n\nIf you ask a photographer what the biggest limitation of today's camera is, he will probably answer \nwithout any hesitation: dynamic range. So, because of this limitation, a photo of any high or medium \ndynamic range scene will end up with blown out highlights or undistinguishable shadows or both. \nTherefore, an image that does not show this limitation, i.e. that reproduces the details in highlights \nand shadows of the original HDR scene the same way a human observer had seen it, such image \ndoes not look like what people expect a photograph to look like. In this sense, such image is not \nphotorealistic.\n\n\nPhotographers are not happy with the limitation of their camera, and this is what I meant by \n\"photographers do not wish to produce photorealistic images\". Photographers would like that their \ncamera were able to reproduce that beautiful HDR landscape that captivated their eyes, but they \nknow the camera will not collaborate... \n\n\nThis is why the promises of HDR photography are so exciting for photographers. They are all looking \nforward for a camera that will give them directly an HDR picture. (Please note that I am intentionally \nusing the term \"picture\" instead of \"image\" here, to make it clear that what photographers are \ninterested in is the final tone mapped output and not the \"raw\" 32-bit HDR image itself.) \n\n\nBy saying \"HDR picture\" a photographer would thus mean a tone mapped HDR image. Such image is \ntechnically speaking an LDR image, but for a photographer it reproduces the high dynamic range \ncaptured, and is thus referred to as HDR. A photographer will consider such tone mapped image as a \ngood \"HDR picture\" if it succeeds in reproducing the highlights and shadows as he/she saw them at \ncapture time. If the tone mapped image looks like a \"photorealistic\" blown-out image instead, it \nwon't be considered \"HDR\" for a photographer. \n\n\nLet's take this example to illustrate that\nhttp://www.hdrsoft.com/images/grandcanal/tm.html\n\n\nMost people looking at the above tone mapped image (especially when they are not photographers \nthemselves) will typically react this way: \n\"This picture does not look natural. It looks more like a painting than a photograph\". \n\n\nHowever, if you tell that to Jacques Joffre, the photographer who took the bracketed shots for this \npicture, he will reply: \n\"But I was there and this is exactly what I saw! It is precisely because it looked so beautiful that I \ndecided to shoot this scene. I would not have done it if it had looked like a dull photograph.\"\n\n\nI won't claim that the tone mapper of Photomatix always succeeds in closely reproducing what the \nphotographer saw. This depends on the image and the dynamic range, sometimes it works very well, \nsometimes it does not, and other tone mapping operators -or simply blending the original \nexposures- will work better. And of course, a user can always intentionally choose settings that \nmake the image look \"special\" and far away from what it was in reality. But the same can be done \nwith any TMO that offers sufficient user control, it is unfair to blame only Photomatix for that. \n\n\nMy point is just that, in my opinion, we should not rate a tone mapping algorithm on how \nphotorealistic its output is perceived to be, but rather on how well it reproduces what a human \nobserver has seen.\n\n\nGeraldine Joffre\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2006-August/000131.html).</sup>", "attachments": [], "created_by_name": "Geraldine Joffre", "created_at": "August 12, 2006 at 01:11PM", "created_by": "Geraldine_Joffre", "parent_id": "hdri_000115", "id": "hdri_000131"}