{"body": "On 20.02.2006, at 21:17, Jack de Valpine wrote:\n\n\n> While you guys (Thomas and Kirk) are on the topic. Would you mind\n> sharing your opinions on the capabilities of Blender as a modeling\n> tool and exporting to Radiance? How would you compare it to something\n> like Autocad (if you have the experience).\n\n\nI would not recommend Blender to people new to 3D graphics. It's\ninterface is and will ever be very 'unique'. Now there are good\nguides available (even for download, see \"Blender 2.3 Guide\" at\n\n\nhttp://www.blender.org/cms/Documentation.628.0.html\n\n\n) to help you get over the first shock but Blender keeps changing\nand the documentation unfortunately not or not as fast (some\nfeatures presented in the Guide are not available in the current\n2.41 version or have been moved or renamed).\n\n\nCompared to $$$$ software like 3D Studio MAX you see and feel that\nit's a community project. Some features that could be considered\nessential are not available or very limited (i.e. solid modeling).\nIntegration or exchange with other commercial applications (AutoCAD)\nis on the basis of community maintained Python scripts.\n\n\nNow, why bother with Blender?\n\n\nCompared to other open source 3D apps it _is_ very powerful and\nhas a lot of feature: 3D editing, animation, rendering, sequence\n(video) editing, game engine and others.\n\n\nBlender can deal with large data sets and it has import/export\nto DXF, OBJ and a lot of other formats. The support may be basic\nsometimes but even commercial applications may only provide a\nsmall subset of the DXF format.\n\n\nThe GUI is \"dated\" by todays standards but very flexible. You\ncan subdivide and define your layout as you like and store it\nfor later access (one layout for editing, one for export, etc.).\n\n\nThe big advantage from my point of view is the Python scripting\nAPI. Blender makes nearly the complete OpenGL commands available\nfor scripts which can be used to present and display arbitrary\ndata to the user (like I do in the GUI toolkit/brad interface\nwith 3D graphs). You have to do a lot of programming to get\nsomething suitable for complex tasks but I have done it and we\nnow can built on this with future Radiance export scripts.\n\n\nWhenever Blender's own features are not enough you can use the\nPython Standard Library and other Python modules to extend the\nfunctionality (database access, networking, PDF output etc.).\n\n\n\n\nWRT Radiance I think Blender has some features that make it\na perfect scene setup tool:\n\n\n- separate entities for object instances and object data\n   (data = *.rad file; instance = \"!xform ...\" of this file)\n\n\n- hierarchical object relations\n   (nested \"!xform ...\" commands in Radiance)\n\n\n- multiple scenes in one file with shared data\n   (scene \"building\", scene \"office day\", scene \"office night\")\n\n\n- different object types for objects(mesh), camera, lamps\n\n\n- DXF import, grid/object snap and numeric input for editing\n\n\n\n\nSome day in the (near) future I hope to be able to:\n\n\n  1) load polygon data from DXF into Blender\n  2) assign materials from library to polygon objects\n  3) add lamps as desired, assign luminaire data to lamps\n     get lampdata (*.ies, *.ltd) from network db or local files\n  4) define viewpoints and animation for walkthroughs\n  5) define fields/grids for rtrace calculations\n  6) set up object animation (i.e. moveable blinds)\n  7) set up sky settings and animations\n     based on gensky, gendaylit or HDR images\n  8) set preprocess options like mkillum etc.\n  9) check scene setup in rvu\n10) export to manually editable Radiance scene input for\n     rad, ranimate, make or our own control scripts\n11) upload export to render daemon on BIG server\n12) follow render process in process monitor while editing\n13) load images and rtrace results for visualization/evaluation\n14) combine\n      * scene images (rpict or Blender)\n      * scene stats (materials, number and type of lamps, etc)\n      * rtrace results (table, graphs)\n      * evaluation (graphs again, falsecolor, contour images)\n     to project reports\n15) export scene to alternate \"nice picture\" renderer like\n     YafRay for visualization if Radiance is not enough\n16) die late, health, happy and rich ;)\n\n\n\n\nAt least that was the plan.\n\n\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-February/003433.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "February 20, 2006 at 11:02PM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_003430", "id": "radiance-general_003433"}