{"body": "Georg Mischler wrote:\n\n\n> Russell Maunder wrote:\n>\n> > I was hoping someone on this list might be able to help me. I am using\n> > rayfront 1.02 and I cant seem to get the colourpict pattern to work\n> > correctly as a pattern.\n> >  ....\n>\n>\n> Russell,\n>\n> Has the the explanation I sent through the Radiance-Support\n> mailing list not arrived downunder yet? Modifiers just multiply\n> their values with the material values. And a multiplication based\n> on blue/green material values of zero will simply give zero again.\n> You want to use a white base material, and a red logo picture.\n\n\n\n\nLooking from a more general point of view:\n\n\nIf you want a *full color* picture without a tint from the\ncolor of the surrounding wall, then you have two basic choices.\n\n\nOne would be to add a polygon to your model for holding the\npicture, which gets a white material.\n\n\nIf you want to avoid the modelling effort, then you'll have to\nmanipulate your picture, so that it's color values compensate for\nthe color values of the base material.  Of course, this only\nworks if the rgb values of the material are all non-zero, or you\nwill run into the multiplication-by-zero dilemma. Seems like the\npolygon solution will be simpler in most cases.\n\n\nActually, you could combine the two approaches, by defining\na mixfunc which selects the red plastic for the surrounding\narea, and a white plastic with the colorpict in the picture\narea. Mixtures are the exception to \"normal\" modifiers, in that\nthey can actually replace material values according to their\nfunctional criteria, instead of just modifying (sic!) them.\n\n\nRayfront makes the use of mixtures exceptionally easy, after all,\nand the function for this task is trivial:\n\n\n  if(and(inside(X0,Px,X1),inside(Z0,Pz,Z1)),1,0)\n\n\nIf you replace X0, X1, Z0, Z1 with the lower and upper X and Z\nboundaries of the image, then you can write this directly into\nthe expression field of the mixfunc dialog. If the image is\naligned to the YZ-plane, then you'll have to adapt accordingly.\nThe white plastic and colorpict will now go into the foreground\nslot, and the red plastic becomes the background.\n\n\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch.com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2001-July/000022.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "July 26, 2001 at 01:09PM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_000021", "id": "radiance-general_000022"}