{"body": "Thanks for clarifying.\n\n\nOn Thu, Jan 20, 2011 at 10:39 AM, Brajesh Lal <brajeshlal at yahoo.com> wrote:\n> Hi Thomas,\n> Sorry for ambiguity. I need shadow pixel ids of the scene.\n> I am wondering if i can disable or enable the shadow casting feature\n> of a particular object or scene ( like any other 3D packages).\n\n\nRadiance is not like a typical 3D engine where lighting effects and\nsurface qualities are synthetic. In Radiance you have some \"physical\"\nrestrictions for what you can model and render. However, Radiance is\nalso very flexible so that with some extra effort you may be able to\nachieve your desired result.\n\n\n> Then i can have rendered image with and without shadow.\n> Their difference can give me shadow pixels.\n\n\nYou can render one image with only the direct light visible (no\nambient light). Everything that lies in shadow will be black. Try to\nrender an image with the option \"-ab 0\" and see if the dark areas are\nwhat you expected your shadows to look like.\n\n\nYou can then render a second image with indirect contribution and\nsubtract the two images. But the result will not be limited to the\nshadows but will also show the difference in the lighting levels of\nlit areas. To render the second image use \"-ab 1\" or \"-ab 2\".\n\n\nTo calculate the difference of the images use this command:\n\n\npcomb -e 'ro=ri(1)-ri(2);go=gi(1)-gi(2);bo=bi(1)-bi(2)' -o\nno_shadow.hdr -o shadow.hdr > diff.hdr\n\n\nYou can modify this calculation to introduce a threshold which will\nclean up the shadow image a bit. But first you have to see if this is\nin principle the right way to go.\n\n\n> Or\n> If i can render the scene with some constant background color, then i can\n> read the shadows pixel ids (low pixel value) in matlab.\n\n\nYou can also define a coloured \"ambient light\" to give the shadow a\nred or green tint.\n\n\n> my scene has only diffuse objects (diffuse reflectance can\n> be of any value, no black object) and a single direct light.\n\n\nLight sources in Radiance are not point lights but need a physical\nsurface area to attache to. You should use a small object here and set\nthe rendering parameters right to avoid a subdivision of the surface\nduring the rendering process which would result in fuzzy shadow edges.\n\n\nRegards,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2011-January/007650.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "January 20, 2011 at 08:59AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_007645", "id": "radiance-general_007650"}