{"body": "Hi there,\n\n\njust new on the list, and I'm immediatelly going to ask a question :\n\n\nI'm currently working on a project concerning visual-lighting problems in \noffice-buildings, more specifically problems concerning blinding and glare, \nso in short, visual comfort.\n\n\nNow, for the glazing I'm using Optics5 to calculate the transmittance of the \nused glazing-system.  When I get the grafs and data (spectral), I export \nthis data to Radiance, via the \"export to radiance\" option in Optics5 \nitself.  I then get the  R, G & B values in radiance.  Now, my question, \nOptics5 provides transmittances and reflectances, so after exporting the \ndata to radiance do these values remain transmittances?  The R, G & B \nvalues, are they transmittances? So for, I haven't found any reason to \nbelieve that the \"export\" function converts them to transmissivities, but I \nwant te be sure that the convertor doesn't comprise the trans.cal convertion \ntoo.\n\n\nI 've got another question that is linked to the previous one.  When you get \nthe converted data from Optics5 in Radiance, can I directly use them as \nglazing-data-input in the material file for the glazing or not?  At the \nmoment, I'm still thinking that the R G B 's are transmittances, so if I use \nthem directly without converting them to transmissivities, am I going to get \n  realistic result?  After all, Radiance uses transmissivity for the \ncalculation, so I'm risking to get a double-correction on my results.\n\n\nIf anyone can clear this out for me, I'd be very grateful.\n\n\nBirger\n\n\n_________________________________________________________________\nGeschenkideeën en e-cards voor Valentijn ! http://www.msn.be/valentijn\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-February/001473.html).</sup>", "attachments": [], "created_by_name": "Birger Van den Brande", "created_at": "February 16, 2004 at 03:33PM", "created_by": "Birger_Van_den_Brande", "parent_id": "radiance-general_000244", "id": "radiance-general_001473"}