{"body": "Hey Justin, welcome, and sorry about the list subscription snafu!\n\n\nSo, let’s see. German is right, in its current form. OpenStudio uses Radiance to do an annual daylight simulation, and runs a tool called mkschedule.rb to generate electric lighting load schedules based on the occupancy schedules and daylighting controls (and setpoints) in the OS model, and the daylight availability as calculated by Radiance. These schedules are then put back onto the OpenStudio model which is then passed to EnergyPlus, which does all the solar thermal stuff on its own. Somewhat convoluted and unfortunately linear, but all managed automatically for you by the OpenStudio application.\n\n\nWe (and others) are using the OpenStudio API to write little helper programs to link things a little bit better, so that BSDFs can be used to model CFS, dynamically, and some of these efforts are currently being integrated in to the OpenStudio application as we speak. In the very near future, a user will be able to assign generic shades to any window or series of windows in your OpenStudio model, and select from a number of the shade control algorithms available in EnergyPlus; OpenStudio will then perform a so-called dynamic daylight simulation of the model both in Radiance (for the daylighting) and E+ (for the thermal); all the shading controls are automatically applied to both the Radiance and EnergyPlus models.\n\n\nInitial support for this will be rolled out in the next month or so, and will use generic BSDFs that we will either include in OpenStudio or make available via the Building Component Library. Down the road, we will allow the user to specify arbitrary BSDFs and apply them to both the Radiance and EnergyPlus models.\n\n\n- Rob\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-openstudio/2014-March/000135.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "March 11, 2014 at 01:14PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-openstudio_000128", "id": "radiance-openstudio_000135"}