{"body": "Greg,\n\n\nFollowing up your suggestions...\n\n\nI was able to run your scripts, but now I have more questions on what's\nbehind them.\n\n\n1. I assume after combining raw images into one, I can analyze obtained hdr\nimage in Photosphere.\n\n\n>> –r *cam.rsp*\nUse the given file for the camera’s response curves.  If this file exists,\nit must contain the coefficients of three polynomials, one for each color\nprimary.  If the file does not exist, hdrgen will use its principal\nalgorithm to derive these coefficients and write them out to this file for\nlater use.\n\n\n2. So, if I will combine my images for the calibration scene, hdrgen will\nderive the coefficients to the file. Is there a way to see those\ncoefficients and to know what the response curve looks like?\n\n\n>>The -C option is to provide a linear factor to correct the overall\nexposure based on previous calibrations.\n\n\n3. How do I make the absolute calibration? Usually it is a luminance value\nof a reflectance standard measured with luminance meter applied in\nPhotosphere. But how do I do it with the given script?\n\n\n>>The -c option is to specify an output color space. The default is \"sRGB\"\nwhich is actually linear CCIR-709 primaries. The only other output color\nspace I would recommend is AdobeRGB. There is a CIE XYZ space supported by\ndcraw, but I have found it to be somewhat unreliable, and I don't know\nwhere the fault lies in this.\n\n\n4. In order to have luminance values Photosphere has an algorithm that does\ncolor calculations from sRGB to CIE XYZ (standard illuminant D65), where Y\nis the luminance value. Here I can specify an output color space, let's say\nsRGB, but how would I get luminance values?\n\n\n>>–s *stonits*\n*\n*\n5.What is this option about?\n*\n*\n*Thank you!*\n5.\n5.\n\n\n\n\n\n\nThank you,\n*Yulia Tyukhova*\n*\n*\nFulbright Scholar, \"Intern LC\"\nArchitectural Engineering Graduate Student, UNL-Omaha, NE, USA\nB.E. and M.E. in Lighting Engineering (MPEI), Moscow, Russia\njtyukhova at yahoo.com\nytyukhova at unomaha.edu\n+1 (402) 996 0910\nPKI 247\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2012-February/000370.html).</sup>", "attachments": [], "created_by_name": "Yulia Tyukhova", "created_at": "February 21, 2012 at 01:21PM", "created_by": "Yulia_Tyukhova", "parent_id": "hdri_000401", "id": "hdri_000370"}