{"body": "Anthony,\n\n\n> I had to construct a small black box (0.5 cube) for calibrating electronic\n> sensors I am currently using to monitor a full scale light pipe\n> installation, which in turn will be compared with a Radiance model thereof.\n\n\nYep, 0.5 (m) is small compared to the bulb diameter.\n\n\n> Furthermore, Recent research (Maamari et al. 2003) shows that a cube dark\n> box with an\n> opening central to one of the walls is most appropriate for simulation\n> modelling\n> comparison because reflectance values are minimal and easily measured, and\n> modelling complexities and associated anomalies are minimised.\n\n\nActually, I believe this scenario was used becuase it was simple enough\nfor there to be an exact analytical solution.  It's not really \"appropriate\"\nat all for any real world example.\n\n\n> Anyway, I am more interested in the accuracy of the program with respect to\n> *daylight* rather than electric lighting. To date, I can only locate your\n> own work to the accuracy of the Radiance accuracy with daylight (as in the\n> RwR manual)...\n\n\nWhat can I say?  The validation I carried out is reckoned to be the most\nrigorous yet for daylight modelling.  Enough people have said so that I'm\ninclined to believe them.  Of course, this is largely becuase I had access\nto an excellent (still unique?) test dataset from the BRE.  It's described\nhere in gory detail:\n\n\nhttp://www.iesd.dmu.ac.uk/~jm/zxcv-thesis/\n\n\nThere's no question that Radiance is *capable* of high accuracy predictions\nprovided that it is driven correctly - at least for the great number of plausible\narchitectural scenarios that are not too dissimilar from the validation scenario.\n\n\nThe tricky part is determining the extent of what I call the \"domain of validity\"\nof the validation scenario.  In other words, how different from the validation scenario\ndoes a scene have to be so that we begin to question the software's capacity to\ndeliver an accurate result?  (Rather than our own ability to describe the scene\nwith sufficient precision or drive the simulation correctly.) This and other\nvalidation topics are addressed in the paper:\n\n\n\"Verification of Program Accuracy for Illuminance Modelling: Assumptions, Methodology\nand an Examination of Conflicting Findings (2004) Lighting Res. Technol. (in press)\n\n\nIt should be out in a few months.\n\n\n-John\n\n\n\n\nDr. John Mardaljevic                     \nSenior Research Fellow\nInstitute of Energy and Sustainable Development\nDe Montfort University\nThe Gateway\nLeicester\nLE1 9BH, UK\n+44 (0) 116 257 7972   \n+44 (0) 116 257 7981 (fax)\n\n\njm at dmu.ac.uk   \nhttp://www.iesd.dmu.ac.uk/~jm\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-July/001875.html).</sup>", "attachments": [], "created_by_name": "John Mardaljevic", "created_at": "July 02, 2004 at 10:38AM", "created_by": "John_Mardaljevic", "parent_id": "radiance-general_001865", "id": "radiance-general_001875"}