{"body": "Lars O. Grobe:\n\n\n> I think that is \n> why these good old atelier windows were directed to north - \n> big surface (diffuse-bright rooms), continous (non-direct) \n> light over the day.\n\n\nThey were directed to north because they had to be huge and\nyou had to avoid direct sunlight. Northern light also varies\nnot much over the day. \n\n\n> I am not sure about the sculptures, but I \n> think for working on them, the same applies (directional \n> light will be nice to present them, but while working could \n> be irritating).\n\n\nOnly directional light would indeed be irritating but you\nneed a certain directional component to render the shape.\nAgain, use big windows (for the light level) and use them\nin one side of the room (for the directional component).\nIf you can use windows, of couse. \n\n\n> I wonder if all these great new materials would not be great \n> for this kind of project... just thinking about translucent \n> insulation panels (these blocks filled with small glass \n> tubes), giving diffuse light without the thermal drawback of \n> the old atelier window idea...?\n\n\nNo! Don't use that stuff! We had an exhibition pavillion in\nmy university built with honeycomb insulation between two\nglass profiles. The profiles alone might have worked well but\nthe building inspector insisted in an insulation of the wall.\nThe honeycombs diffuse the light so much that there is hardly\na directional component left. It looks odd and the sculptures\nand architectural modells are shaded poorly even if the interior\nis rather bright.\n\n\n\n\nThomas\n\n\n***********************************************************************************\nThis e-mail, (and any attachments) is confidential and may be privileged.  It may be read, copied and used by the intended addressee only.  If you have received this in error please contact BDP immediately. \n\n\nIf you have any queries, please contact the sender.\n***********************************************************************************\nBuilding Design Partnership\nRegistered in England No 2207415:\nRegistered Office: Building Design Partnership Ltd, Sunlight House, PO Box 85, Quay Street, Manchester, M60 3JA, http://www.bdp.co.uk\n***********************************************************************************\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-May/003731.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "May 26, 2006 at 10:13AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_003726", "id": "radiance-general_003731"}