{"body": "I've heard some things about Radiance solar heat gain calculates but\nhaven't found any papers on how to integrate it within a whole-building\nsimulation yet, I'll keep looking. If anyone knows of a source it would be\nextremely helpful.\n\n\nEnergyPlus does have a nicely integrated venetian blind module, but\nunfortunately that doesn't exactly represent the system we're attempting to\nmodel. My project is similar but a bit more complicated in practice,\nalthough it does also block direct beam, I'll need to think if this is\nrepresentative. We were imagining, creating a defined number of geometries\n(representative of dynamic states), create the BSDF for each, and then\nchose between them for various states of the annual daylight\nsimulation.Following\nthe three-phase method, with the integration of results in a whole-building\nsimulation.\n\n\n>From your suggestions, it appears as though the best solution to calculate\nthe solar heat gain would be to integrate a BSDF in EnergyPlus. Use E+ to\ncalculate the solar heat gain and then use Radiance (with OpenStudio) for\nthe Daylight and Lighting Load simulations. Though I'm guessing that\nEnergyPlus cannot handle dynamic BSDFs for various CFS configurations\nwithout some form of co-simulation. I'll have to read more into the methods\nEnergyPlus uses to calculate the solar heat gain from a BSDF and determine\nif that meets my criteria.\n\n\nDoes anyone know of any articles or publications that discuss advanced\nmethods for integrating Radiance daylight and heat gain into whole-building\nsimulation from dynamic fenestration systems? Maybe I'm looking at the\nproblem from the wrong perspective.\n\n\nThank you German, I look forward to receiving your thesis. I watched your\nSketchUp plug-in video earlier, very cool stuff.\n\n\nSincerely,\nJustin\n\n\n\n\nOn Tue, Mar 11, 2014 at 2:33 PM, Germán Molina Larrain <germolinal at gmail.com\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-openstudio/2014-March/000132.html).</sup>", "attachments": [], "created_by_name": "Justin Shultz", "created_at": "March 11, 2014 at 12:06PM", "created_by": "Justin_Shultz", "parent_id": "radiance-openstudio_000128", "id": "radiance-openstudio_000132"}