{"body": "> Could someone put together a beginner level unix user step by step \n> list of how this is done. I can't wait to get this working! Thanks.\n\n\nI have done this for installing Radiance on Cygwin under Windows 2K\n& for Mandrake Linux. More because I wanted to remember how I got\nthem working, so once I did, I wrote out a little how-to.\n\n\nAnd I don't know about OS X; but will be jumping ship to it within\nnext year (gonna buy my friend's used G4 when he gets his G5). But\none thing that's a pain when installing Radiance, and a major point\nof my confusion when I first started using it, is that the command\n'rview' is already used on some systems to call upon the VI editor,\nrather than the Radiance command. Once you've got the raypath and\nsuch set, type 'rview' and see what happens. If it opens Vi, or Vim,\nthen you've got to go in and remove the symbolic links named Rview\nthat are the cause of this behavor or set your pathing different,\notherwise you won't be able to use Radiance at all.\n\n\nThis was true in both the full install of Cygwin & Mandrake. So\nsince 10.3 also uses the Bash shell, it could be possible that\nit's the same for 10.3 as well. Just a word of warning.\n\n\nAlso O'rilley has a wonderful 'Unix for Mac' kinda book, where\nit teaches you how to use your Mac's command line. A large\npart of using Radiance effectively is in understanding how\nto use the Unix command line effectively, they go hand-in-hand,\nso unless you already know a lot about it I'd recommend that\nyou get a book on it so you don't learn everything the hard\nway like I did, and be a pest to others as I was. :)\n\n\nJeffrey\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-November/001232.html).</sup>", "attachments": [], "created_by_name": "Jeffrey McGrew", "created_at": "November 24, 2003 at 09:33AM", "created_by": "Jeffrey_McGrew", "parent_id": "radiance-general_001227", "id": "radiance-general_001232"}