{"body": "Thanks Carsten \n\n\n> \n> To some extent, there is the possibility of having invisible glows. In\n> my workshop contribution (available from the workshop page on\n> radiance-online) there are patches to the standard Radiance version\n> providing some further features. One of them is the possibility to\n> assign a so called \"secondary ambient material\" (currently only to\n> plastic, metal and trans). This was originally implemented to save\n> calculation time in case of complicated mathematical textures applied to\n> the object, but it can be used for other purposes, too.\n> \n\n\nI was disappointed to be unable to attend that workshop. I'll check it out\non the web! And will be in touch regarding some of the other extensions you\nmention.\n\n\n> So, if for example you provide a blue plastic box and give a yellow glow\n> material for the secondary ambient mat., you will see the blue box and\n> the yellow shining on surfaces nearby stemming from the glow. (rather\n> freaky, though, but - why not??)\n\n\nOne possible practical use would be to communicate to students the role of\ndiffuse inter-reflection in a space due to a particular surface - without\nradically altering the perception of the space as a whole - as might happen\nif you had to change the surface colour, rather than just its indirect\ncontribution. \n\n\n>> If I understand the original question correctly, then illum is\n>> the solution.\n>>\n\n\nThanks Schorsch, continuing on from Carsten's comments regarding glow vs\nillum, I can confirm that these contextual elements form very large area\nsecondary sources and hence thought that using glow would be the correct\napproach (the situation similar to the standard use of sky and ground glow).\n\n\nI'm also referring to views from outside the proposed building  - interior\nviews are not a problem. The issue arises out of difference between the\nviewer's immediate context and the building's lighting environment - and the\nneed to minimise any unnecessary modelling.\n\n\nI have some slightly messy solutions - usually involving bits of outline\ngeometry like pieces of stage scenery near the viewer  - and these work well\nin terms of the final results. But just thought that an invisible glow would\ndefinitely be a better and more integrated way to go.\n\n\nAs a general rule i think to make visualisations more defensible some\nexplanatory imagery should be provided - in this case without the viewers\ncontext to explicitly indicate what is happening.\n\n\ncheers\nalex\n\n\n*******************************************************\nA. J. Summerfield                 alex@arch.usyd.edu.au\nFaculty of Architecture, University of Sydney\n*******************************************************\nOutside of a dog, a book is man's best friend.\nInside a dog, it's too dark to read.       Groucho Marx\n*******************************************************\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-October/000465.html).</sup>", "attachments": [], "created_by_name": "alex summerfield", "created_at": "October 25, 2002 at 02:03PM", "created_by": "alex_summerfield", "parent_id": "radiance-general_000461", "id": "radiance-general_000465"}