{"body": ">Another question.  Pcond on a luminance image mimics what\n>the eyes sees.  Pcond on an illuminance image mimics ... ?\n>\n>judy\n\n\ncan somebody tell me what is the purpose of illuminance images?  am i \ncorrect in saying that these are created by using the -i option in rpict/rview?\n\n\nquoting from the Radiance Reference manual, 'This only affects the final \nresult, substituting a Lambertian surface and multiplying the radiance by \npi'.  so the numbers you end up with in these images are simply that, the \nreflected radiance multiplied by pi.  what does this represent?  it does \nnot represent the irradiance falling on the surface.  for any \nnon-Lambertian surface, it does not represent the irradiance reflected off \nthe surface either.\n\n\nso, for Lambertian reflectors, the results are reflected irradiances, which \nare the incident irradiances multiplied by the reflectance of the \nsurface.  in a visualisation such as this, reflected irradiances are of \nvery little interest.  radiance and incident irradiance are actually much \nmore useful.\n\n\ntoo often have i seen Radiance images presented overlaid with \niso-illuminance contours.  according again to the Radiance Reference \nmanual, under falsecolor, 'If the -i option of rpict was used to produce \nthe image, then the appropriate label (for a falsecolor image) would be \n\"Lux\"'.  this means that the illuminance values displayed in these images \nare some manifestation of reflected illuminance.  from a photometric point \nof view, this is essentially meaningless.\n\n\nif this is presented to a client to show them the illuminance distribution \nwithin their space, it really tells them very little.  iso-illuminance \ncontours are meant to represent the illuminance falling onto an imaginary \nsensor at that location.  the -i option of rpict does not calculate \nthis.  the only real way of presenting illuminance information is on a \nplane, real or imaginary, horizontal, vertical or tilted, not overlaid on a \nvisualisation.\n\n\ni understand that people have a better understanding of illuminance, and so \nto present things in this manner makes it easier for clients to \nunderstand.  but they should not be led to believe that these contours \nactually represent illuminances within their room which are to be compared \nwith specifications, standards, etc.\n\n\ncan anybody correct me here?  i don't mean to ruffle any feathers, but i \nthink Radiance is generally used by people with a good knowledge of light, \nand so it should be used accordingly.\n\n\nPhil Greenup\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2001-December/000091.html).</sup>", "attachments": [], "created_by_name": "Phillip Greenup", "created_at": "December 13, 2001 at 02:45PM", "created_by": "Phillip_Greenup", "parent_id": "radiance-general_000077", "id": "radiance-general_000091"}