{"body": "Hi all!\n\n\nMy apologies if this message is much too long ...\n\n\nGreg was asking about adding the efficacy correction factors into gensky:\nas he already noticed this would cause many troubles with old scripts,\nso I think that it is better not to make this change. Moreover, as\nalready pointed out, the sun/sky luminous efficacies do vary with solar\nposition and there can't be any agreed average standards ... they also\ndepend on site location ...\n\n\nI have a few thoughts about gensky and the CIE standard skies that it models.\n\n\nFirst I'll give a description of the gensky behaviour and of the\nformulas that it uses (as far as I can understand from the gensky.c code),\nand then I'll make a short proposal about some integrations that can be\ndone. I would like to receive some feedback about my ideas.\n\n\nPart 1: gensky\n\n\ngensky at the moment behaves this way (I hope not to make any error ...):\n\n\n1. it can model uniform skies\n\n\n2. it can model CIE standard clear skies (as described in CIE 110-1994)\n\n\n3. it can model CIE standard overcast skies (as described in CIE 110-1994 and\n   previous standards)\n\n\n4. it can model non standard intermediate skies, whose definition is contained\n   inside src/gen/gensky.c and /src/gen/skybright.cal\n   (I've already asked this question 1 year ago: is it possible to give a\n   reference about where the intermediate sky definition was taken from?)\n\n\nIf it is given zenith radiance (-b) and solar radiance (-r), gensky uses\ndirectly the CIE formulas or the intermediate sky formula, since all the\nsky distribution parameters are already defined, but it is not very usual to\nhave measured sequences of such weather data (at least not in Italy where\nthere isn't any IDMP station and sky scanners have only been watched in\nphotographs ...).\n\n\nDIRECT CONTRIBUTION from the sun\n\n\nIf we provide gensky with horizontal direct irradiance (ees),\nsolar radiance (solarbr) is computed with the following formula:\n\n\nsolarbr = ees/(6e-5*sin(sunaltitude))\n\n\nIf we only specify location and time, gensky uses the following formula:\n\n\nsolarbr = 1.5e9/SUNEFFICACY*sin(sunaltitude)\n                         if (1.147 - .147/sin(sunaltitude) > .16), otherwise\n          1.5e9/SUNEFFICACY*.16\n          (could anybody give any reference about this equation?)\n\n\nwhere\nSUNEFFICACY = 208 /* illuminant B (solar dir.) */\n\n\nAdditionally, if the sky is intermediate, the previous value is multiplied\nby 0.15 (i.e the so called /* fudge factor! */)\n\n\nDIFFUSE CONTRIBUTION from the sky\n\n\nIf neither zenith radiance (zenithbr) nor horizontal diffuse irradiance (eed)\nare given, the Krochmann equation is used for the CIE OVERCAST SKY:\n\n\nzenithbr = 8.6*sin(sunaltitude) + .123 [kcd/m^2] (Krochmann)\n\n\nCIE 110-1994 also reports equations by Kittler and Nakamura, Oki et al. for this\npurpose.\n\n\nFor the CIE CLEAR SKY the LBL equation (Karayel, Navvab, Ne'eman, Selkowitz) is used\n(here the Linke Turbidity appears for the first time):\n\n\nzenithbr = (1.376*turbidity-1.81)*tan(sunaltitude)+0.38 [kcd/m^2]\n(Karayel, Navvab, Ne'eman, Selkowitz)\n\n\nCIE 110-1994 also reports a lot of equations that should be chosen according to\nthe climate condition in the location of interest (Kittler, Dogniaux, Krochmann,\nLiebelt, Gusev, Nagata, Nakamura Oki et al.), but gensky only uses the LBL one.\n\n\nFor the INTERMEDIATE SKY, gensky computes the average of the overcast and CIE clear\nzenith radiances.\n\n\nAt the end, the computed resulting value is divided by SKYEFFICACY\n\n\nD65EFFICACY = 203 /* standard illuminant D65 */\nSKYEFFICACY = D65EFFICACY /* skylight */\n\n\nIf the horizontal diffuse irradiance (eed) is provided, then gensky\ncomputes the zenith radiance by using the following formula:\n\n\nzenithbr = eed/(normfactor*PI)\n\n\nnormfactor = 7/9 for CIE OVERCAST SKY (as we all know by heart!)\n\n\nwhile for CIE CLEAR SKY and the INTERMEDIATE SKY, normfactor\nis computed by using two different polynomial approximations\n(I'd like to have some references about these approximations, too).\n\n\nFor the CIE CLEAR SKY, CIE 110-1994 suggests two different polynomial approximations\nby Kittler (as said, \"for practical purposes\") and by Gusev (for polluted\natmosphere):\nboth of them are not used by gensky.\n\n\n\n\nPart 2: proposal(s)\n\n\nA)\nAs we've seen, gensky is compliant with the CIE standard for the CIE CLEAR and\nCIE OVERCAST skies when the user gives solar and zenithal radiances.\n\n\nWhen the user only specifies time and location, gensky uses only some of the\nequations suggested by CIE. It would be useful to be able to switch between\nthose equations for practical reasons.\nAs I've already said, in Italy there is only a few directly measured illuminance\ndata:\nsome illuminance data series have been derived by using the Perez model.\nBerin and Vio (University of Venice) have shown that the Doginaux equation\napproximates very well the Italian luminous conditions, that's why I'm proposing\nthis integration inside the gensky code ...\n\n\nB)\nThere is no standardised intermediate sky luminance distribution model at the\nmoment, but\nCIE 110-1994 cites the Nakamura, Oki et al. intermediate sky (does anybody know\nabout\nrecent works of CIE commissions about this topic?)\nZack (hi Zack!) showed interest in being able to use the IESNA (Kittler) sky model.\n\n\nIt would be very useful to have a sort of \"plug in\" method to insert new sky models,\nfor instance simply via .cal files (at the moment sky definition is splitted between\na program and a .cal file).\n\n\nDoes anybody else think that this could be useful and feasible?\nProbably it would be better to develop another program to generate skies and\nleave gensky\nas it is now ... and to add a sky library of .cal files to it ...\n\n\nAny ideas?\n\n\nThank you for having the patience of reading it all!\n\n\n\n\nFrancesco Anselmo\npisuke@libero.it\nanselmo@dream.unipa.it\n\n\n\n\n\n\n\n\nThis mail sent through IMP: http://horde.org/imp/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-October/001087.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "October 18, 2003 at 05:09PM", "created_by": "Greg_Ward", "parent_id": "radiance-general_001063", "id": "radiance-general_001087"}