{"body": "Hi.\n\n\n>> (ii) it is strange that after intallion I can't findany installed\n>> files of radiance.\n\n\nrunning\n\n\ndpkg -L radiance\n\n\nwill list the files.\nYou should also install the following packages:\nradiance-doc\nradiance-materials\n- especially if you want to have a look at the examples. They're split\ninto packages on their own as they're architecture independent. Listing\nthe files works in the same way, just use the different package name.\n\n\n> \n> It's Debian/Ubuntu policy to install everything in the /usr branch of\n> the file system.\n> The binaries will be in /usr/bin/, library files in /usr/lib or a\n> subdirectory of it.\n> The advantage is that everything is in your search path after installation\n> so you won't have to adjust PATH yourself.\n> \n> The disadvantage is that there will be name conflicts with other packages.\n> For the Debian/Ubuntu packages in particular the name of the 'genbox'\n> program was changed to 'rgenbox'. If you want to follow the examples in\n\n\ngenrbox\n\n\n> old documents you have to keep that in mind and change the commands\n> accordingly.\n\n\nThe manpages have been patched, so they'll show genrbox.\n\n\n> Another frequently used command is 'rview'. It was renamed to 'rvu' a while\n> ago but there are still plenty of examples and tutorials around which\n> use the\n> old name.\n\n\nThe commands are available under the old name if you add\n/usr/lib/radiance/ to your PATH. Adding something like\nexport PATH=/usr/lib/radiance:$PATH\nto your .bashrc or /etc/profile or to the rc file of your favourite\nshell will help. Then you'll also be able to use rview.\n\n\n>> (iii) should I set environment path after installion?\n> \n> As said above you won't have to set PATH if everything is in /usr/bin/.\n> You can check if there is a RAYPATH variable set after you log in.\n> Type\n> \n>     env | grep RAYPATH\n> \n> and you should see the value of the variable (or nothing if it's not set).\n> Strictly speaking RAYPATH is not necessary if you're not referring to\n> any patterns or calculation files in your scene. Some example scene\n> do, however, so it's probably a good idea to have it set.\n\n\nThe example scenes don't need it, you need to install the\nradiance-materials\npackage, though. If RAYPATH is not in the environment,\n/usr/share/radiance will be used automatically.\n\n\n\n\nThere's a README which explains these details in\n/usr/share/doc/radiance, in case you'd like to have additional details\nadded, please send me a patch or an updated file.\n\n\n\n\nHope that helps,\n\n\n\n\nBernd\n\n\n\n\n Bernd Zeimetz                           Debian GNU/Linux Developer\n GPG Fingerprint: 06C8 C9A2 EAAD E37E 5B2C BE93 067A AD04 C93B FF79\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-June/005131.html).</sup>", "attachments": [], "created_by_name": "Bernd Zeimetz", "created_at": "June 17, 2008 at 03:15PM", "created_by": "Bernd_Zeimetz", "parent_id": "radiance-general_005120", "id": "radiance-general_005131"}