{"body": "Russell Maunder wrote:\n\n\n> I have a question about smoothing. If you add the -s switch in gensurf you\n> can get a smooth shaded surface. Is there any way I can insert this smoothing\n> to a surface that I have imported from AutoCAD? I do not want to increase the\n> polygon count but i do want to smooth out the faceted glare on the surface.\n\n\nThe \"correct\" solution would check if any normals are defined\nalready in Autocad/DXF, and use those to generate texfunc\nmodifiers similar to the ones gensurf creates from that\ninformation. I have some unproven code to add this feature to\nRadout and dxf2rad, but have never had the time to look into it\nmore deeply, in order to understand how and if it actually works.\n\n\nTheoretically, you could also try to analyze the polygons in a\nradiance scene file, find out which ones have common edges, and\nif the difference between their normals is below a certain\nmargin, apply a texfunc to them, smoothing out that difference.\nNot very elegant, but possible. Note that Rayfront removes\nall modifiers when it imports geometry data, so that you will\nhave to edit the imported files in place.\n\n\nIf anyone can point me to really solid and understandable\ninformation about how to work with the \"barycentric coordinates\"\nthat gensurf uses for this purpose, then I'll try to get it to\nwork with the next releases of Radout and dxf2rad.\n\n\n\n\n> On a side note I am also looking at modelling light redirection systems\n> (horizantal/vertical glazing) and refractive systems. I have looked at some\n> of the designs on www.schorsch.com and attempted to model them using AutoCAD\n> or a gen program then assigning a dielectric material. Does any else have\n> experience with creating these and would it be possible to use a different\n> modifier? I am looking for the most accurate calculation.\n\n\nThose illustrations are on my site because I'm currently working\non a plug-in to Rayfront that will allow a full and correct\nsimulation of (most of) those systems. Simulating them with\nRadiance alone is very exhaustive, and likely inaccurate in most\ncases. Radiance is not designed to handle multiple mirror\nreflections in tight spaces effectively. Of course, this doesn't\nhave to keep you from trying, just that you shouldn't put too\nmuch trust into the results.\n\n\n\n\n-schorsch\n\n\nPS: Didn't forget your other mail...\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch.com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2001-August/000024.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "August 03, 2001 at 02:49PM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_000023", "id": "radiance-general_000024"}