{"body": "Zack Rogers wrote:\n\n\n> Hello,\n>\n> I am modeling several fluorescent troffers and am a little confused with\n> the \"Glow\" primitive commonly used to model lamps.  I have figured out\n> that it does not pass an illum surface and cause any additional\n> illumination.  It does, however, change the luminance of the luminaire\n> when viewed directly (i think only when using the \"illum\" primitive for\n> the ies data and not the \"light\" primitive).  So, I would like to get\n> this \"Glow\" correct so that I can compare the luminance ratios of\n> various fixtures.  In Desktop Radiance's fixture library it seems to\n> typically use 53.195959 as the RGB radiance value.  I can't figure out\n> where this number came from.  First of all, what units are these\n> Radiance values in?  W/ster/m2?  If this is the true than I calculate\n> for say a T8;\n>\n> 32 W / 4*pi steradians / 2*pi*0.5 sf = 0.8105 W/ster/sf\n>\n> 0.8105 W/ster/sf * (m2/ 10.764sf) = 0.0753 W/ster/m2\n>\n> This doesn't seem right.  Please correct me if there is any error in my\n> calculation.\n>\n> If the radiance vaue is supposed to be photometric and in units of\n> lumens/ster/m2 than I calculate;\n>\n> 2900  lumens / 4*pi steradians / 2*pi*0.5 sf = 73.46 lumens/ster/sf\n>\n> 73.46 lumens/ster/sf * (m2/ 10.764sf) = 6.824 lumens/ster/m2\n>\n> Then the Rendering with Radiance book on Page 322 and 323 gives examples\n> of using the \"lampcolor\" program and for a daylight fluorescent (? not\n> sure what this is) with 2900 lumen output it gives RGB values of\n> 0.867251 1.189160 1.066163.\n>\n> I am confused.  And seeing as how this \"Glow\" primitive completely\n> effects the luminance of my parabolic troffers I do not want to continue\n> my comparison without assurance that I am modeling them correctly.  Any\n> clarification would be helpful.  Thanks!\n\n\n\n\nReality is often much less complicated than expected. ;)\n\n\n\n\nYou give a luminous flux of 2900 lm for your type of 32W T8 (this\ncan vary with color/quality). Given the standard efficacy used by\nRadiance, this amounts to 16.2 W of light energy (which can't be\ndirectly determined from the electrical consumption!)\n\n\nThe tube has a circumference of approximately 81.7 mm and a\nluminous length of around 1.198 m. This results in a luminous\nsurface of 0.0979 m2.\n\n\nThe radiance of this tube is therefore:\n\n\n  16.2W / (0.0979m2 * Pi) = 52.7 W/m2/sr\n\n\nThis is what the average rgb value of your glow material should\nbe based on. The luminance of the tube then amounts to 7684 cd/m2.\n\n\nBtw: If I feed the lampcolor program with those values, then I\nget very different results than you do:\n\n\n$> lampcolor\nProgram to compute lamp radiance.  Enter '?' for help.\nEnter lamp type [WHITE]: daylight fluorescent\nEnter length unit [meter]:\nEnter lamp geometry [polygon]: cylinder\nCylinder length [1]: 1.198\nCylinder radius [0.1]: 0.013\nEnter total lamp lumens [0]: 2900\nLamp color (RGB) = 35.450659 48.609340 43.581585\n\n\n0.265*35.450659 + 0.670*48.609340 + 0.065*43.581585 = 44.8\n\n\nThis is 0.85 of the 52.7 above. Lampcolor has a depreciacion\nfactor for each lamp type, possibly accounting for aging (the\nactual purpose of the factor is not documented).\n\n\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch.com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2001-December/000098.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "December 20, 2001 at 10:58AM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_000094", "id": "radiance-general_000098"}