{"body": "some more explanations:\n\n\nabout gendaylit:\nto understand the output you have to know what gendaylit does and on \nwhat models it is based:\nGendaylit uses\n- a sky luminance distribution model according to Perez ( details and \npublication reference see manpage),\n- a luminance efficacy model according to Perez(details and publication \nreference see manpage), because the conversion factor between solar \nspectrum units and photometric units (=luminance efficacy) is changing \ndepending on the sky type and situation (for example, close to sunset, \nthe infrared proportion of the radiation increases a lot)\n- it generates automatically the skytype based on the radiation data \n(and time and location)\nGendaylit assumes, that the input is given via the -W (direct \nnormal,diffuse horizontal) or -G (direct horizontal and diffuse \nhorizontal) is radiation in the solar spectrum.\nThe output option -O 1 does not apply any luminance efficacy model, but \nis using the Perez sky distribution.  Therefore when you \"put in\" solar \nspectrum you get also radiometric units as output. e.g. if you run \nrtrace -I , then the output is directly W/m2.\nThe output option -O 2 applies the the Perez sky distribution AND the \nluminance efficacy model. The output units are directly in photometric \nquantities. e.g. if you run rtrace -I you get directly a lux value.\nThe output option -O 0 (default) does the same as the -O 2 option EXCEPT \nthe output is divided by 179. This is mainly done to be consistent with \nthe output of gensky.\n\n\n\n\nabout gensky:\nit generates sky distributions according to the CIE model. you have to \nspecify explicitly the sky type (sunny, overcast...)\ngensky does not apply any luminance efficacy model (at least I don't \nknow any option to do so) . So you get as output unit what you put into \nit! So if you put in a solar spectrum power, then your output is also \nradiometric. If you put in only the power in the visible range, then you \nget the photometric quantities.\nBut don't put in radiometric and then expect the output to be \nphotometric quantities!! The 179lm/W conversion is not a luminance \nefficacy model, it is just a \"chosen\" convention to calculate from the \nradiation (in the visual spectrum) to the photometric quantities. It \ndoes not take into account, that for example the luminance efficacy of \nthe sun is between 80-100 lm/W (or during sunset it drops to 50 lm/W), \nwhereas an overcast sky has about 130 lm/W.\n\n\nas conclusion:\nWhen you are just interested in the solar spectrum, then the difference \nfor a specific skytype (e.g. completely sunny) between gendaylit  -O 1 \nand gensky is \"only\" the sky luminance distribution.\nWhen you are interested in photometric quantities AND your input data is \nbased on the solar spectrum(e.g. from a EPW file or measured), then you \nshould use gendaylit only (except you calculate externally the luminance \nefficacy and run then gensky).\n\n\n\n\nJan\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-April/011699.html).</sup>", "attachments": [], "created_by_name": "Jan Wienold", "created_at": "April 15, 2016 at 07:26AM", "created_by": "Jan_Wienold", "parent_id": "radiance-general_011666", "id": "radiance-general_011699"}