{"body": "Hi Raquel,\n\n\nI agree that the outer 8° contribute only a little to the vertical \nilluminance. The solid angle of that section is around 0.44sr (which is \naround 7% of the total) and the cosinus for this flat angle of incidence \nis also very low (in average around 0.07). so the overall impact of the \nouter 8 degree is less than 0.5%, assuming the luminances in that area \nare comparable to the average of the image .\n\n\nRegarding the \"filling\" option in evalglare: this was implemented, \nbecause there was a group using a fish-eye lens, where the projected \ncircle was larger in y-direction than the CCD-array. This function \n\"fills up\" the missing parts with the last known value vertically. You \ncannot use it in my opinion to fill up missing \"ring\" areas (to fill up \nbetween 172° to 180°). Actually I could implement such a feature, but \ndue to the low impact I don't think it is necessary and so far no other \nusers were missing such a feature.\n\n\nAre you really sure you have a equidistant-projecting lens with 172°?  \nThe equidistant types are  much less frequent on the market - most \nlenses cover 180° or more.\nIf you have a equi-solidangle fish-eye lens, you should correct the \nprojection as well.\n\n\nWhat you should definitely check is how close you get between measured \nilluminance with the sensor and the calculated value from evalglare. If \nyou have a deviation there, you have a problem in the calibration \n(because the influence of the outer 8% is really negligible, so you \nshould nearly match the value ).\n\n\nBTW: Are you coming to the academic forum of Velux May2nd? As far as I \nknow, there are at least three other PhD students there dealing with \nHDR-cameras, daylight and glare and as far as I heard there are still \nfree spots.  I will be there as well.\n\n\nbest\nJan\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2017-March/012072.html).</sup>", "attachments": [], "created_by_name": "Jan Wienold", "created_at": "March 15, 2017 at 11:40AM", "created_by": "Jan_Wienold", "parent_id": "radiance-general_012064", "id": "radiance-general_012072"}