{"body": "This is an interesting thread.  I just wanted to add a couple of notes.\n\n\nFirst, you should check out the products available from X-rite for \nspectral measurement:\n\n\n\thttp://www.xrite.com/product_overview.aspx?Line=24\n\n\nI have used their spectrophotometers in the past, to good effect.  I \nthink they're prices are competitive, but not what I'd call \"cheap.\"\n\n\nSecond, a quick explanation of what macbethcal does.  Macbethcal takes \na captured image (scanned, photographed, etc.) of a Macbeth \nColorChecker chart and attempts to derive a transformation that takes \nthis capture to the correct values known for the Macbeth chart.  It \nfirst computes an overall response function for each channel using the \n6 gray patches at the bottom of the chart.  Then, it computes a 3x3 \ncolor matrix based on a least squares minimization of error on the \nunsaturated colors.  Saturated colors are allowed to go \"out of gamut\" \nas needed to find a reasonable solution.\n\n\nIn my experience, this process works well for flatbed scanners and some \ncapture methods, but sometimes does poorly with certain digital \ncameras.  I do not know why.  As Alexa and Jack pointed out, macbethcal \ndoes not account for changes in the illumination source -- this is \nassumed to be part of the capture process (i.e., a scanner with a \nbuiltin source), and since the purpose is to derive a transform that \nrecovers colors under this souce, this is appropriate.\n\n\nIf you wish to simulate general reflectance spectra under different \nilluminants, I suggest you go with a full spectral measurement and \nfollow the procedure outlined in the following paper:\n\n\n\thttp://www.anyhere.com/gward/papers/egwr02/\n\n\nThird, I wanted to point Alexa and other interested readers to the \nfollowing reference, which explains the parts of human vision pcond \nattempts to simulate and the algorithms behind it:\n\n\n\thttp://radsite.lbl.gov/radiance/papers/lbnl39882/tonemap.pdf\n\n\nI'll be the first to admit that it is not a perfect simulation of human \nvision, and this is an ongoing area of research.  (Try a websearch on \n\"color appearance models\" to get an idea.)  However, I think others \nwill agree that pcond can be useful, and is an improvement over the \nstandard \"linear with clamping\" method for image display.\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-May/001687.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "May 12, 2004 at 05:57PM", "created_by": "Greg_Ward", "parent_id": "radiance-general_001679", "id": "radiance-general_001687"}