{"body": "Ron O. Dror wrote:\n\n\n> I would like to recover the surface normals of the surfaces visible in\n> every pixel of a Radiance scene.  In other words, I want to trace the\n> initial ray cast for each pixel, and find the surface normal of the first\n> surface that ray hits.  I figured out that I could do this using rtrace\n> -on, if I feed rtrace the rays corresponding to each pixel in my\n> image.  Is there an easy way to compute all of these rays automatically\n> using an existing Radiance program, or will I need to write a special .cal\n> file for rcalc?  I have the feeling that some Radiance gurus could\n> accomplish this task in one or two lines.\n>\n> Thanks in advance for any advice,\n>\n> Ron\n\n\n\n\nHi Ron,\n\n\nI don't think there's a genuinely simple way to do what you want.\nYou have already figured out the \"rtrace -on\" part, which looks\nlike a good second step. But the first step would indeed be to\nfeed all those rays to rtrace, and I don't see an automatic way\nto get that information from any Radiance program.\n\n\nOn the other hand, it's not very hard to construct that set\nof vectors with a little program of your own for a standard\nperspective. Two or three dozen lines of code will do the trick.\nYou don't even need to understand the actual view transformation.\nJust walk through a regular grid on your image plane, subtract\nthe view point from each of those grid points, and write the\nresult into a file. There's no need to normalize the vectors to\nunit lenght.\n\n\nI'm not sure if this could be done with cnt/rcalc, and frieds,\nas I have rarely used them myself. I suspect that a more complete\nprogramming language (eg. Python) will be more effective to work with.\n\n\n\n\nHave fun!\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch.com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2001-October/000061.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "October 10, 2001 at 10:47PM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_000060", "id": "radiance-general_000061"}