{"body": "Radiance and Daysim do internally not raytrace spectrally - there are \ncalculating simply in channels (RGB for Radiance, Daysim just one). That \nmeans:what you put in you will get out :\n\n\nIf you use a weather file with solar spectrum AND your material \nproperties are valid for that range (that means using solar \ntransmittance, solar reflectance) then you also get solar irradiance as \noutput.\n\n\nThat means for your last question: Yes, you should insert the \"solar \ntransmissivity\" (must be calculated from the solar transmittance). Don't \nforget to use also solar reflectance values for all your surfaces. \nUsually they are very similar to the visible, but there are exceptions.\n\n\nBut please consider, that Radiance (and daysim) are raytracers! They do \nnot consider any change in wavelength for a ray. That means they do NOT \nconsider the heating up of a surface when it is absorbing radiation and \nemitting it in the IR.\n\n\nThat's why you CANNOT calculate the \"real\" SHGC of a window system. You \ncan just calculate the solar transmittance. Depending on your glazing \nsystem the difference between the SHGC and the solar transmittance could \nsignificant (I guess more than 40% is possible in general, typically the \ndifference for a normal glazing is in a range of 10-20%)!\n\n\nE.g. if you check  a typical glazing from Interpane (Tau_vis=0.76, \nTau_solar=0.48, SHGC=0.55, see here: \nhttp://www.interpane.net/interpane2013/teweint.php?lang=de&site=10331.html), \nthe difference is 13%. For a combination of Planilux/Planitherm of St. \nGobain I calculated with Window 7 (LBNL software) Tau_vis 0.75, \nTau_solar=0.48 and SHGC of 0.59 (19% difference).\n\n\nJan\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-daysim/2016-August/000127.html).</sup>", "attachments": [], "created_by_name": "Jan Wienold", "created_at": "August 11, 2016 at 02:49AM", "created_by": "Jan_Wienold", "parent_id": "radiance-daysim_000126", "id": "radiance-daysim_000127"}