{"body": "Greg,\n\n\n> Radiation as we use it normally is not a volumetric quantity.  It can\n> be area-based, but since we report things as a proportion of area\n> (e.g., watts/meter^2), this factors out again.  I'm not really sure\n> where you're confused, since there are so many things that are\n> confusing about lighting units.  I spent months in the beginning\n> trying to get my head around them.\n\n\nBy 'volume' I mean the solid of revolution described by the intensity \nvalues. However, I've just read up on this in Walsh: \"Photometry\", 1958:\n\n\n\"It might at first be thought that the total luminous flux given by a \nsource could be found from the area of the polar curve, or the volume of \nits solid of revolution about the 0-180 deg axis. But a moment's \nconsideration will show that this is not the case.\"\n\n\nThis is where I was coming from. After a lot longer than just one \nmoment's consideration, I stand corrected.\n\n\nLet theta be the altitude (zenith, nadir) angle, and phi be the azimuth \nangle. I is the intensity.\n\n\nThe total flux, assuming rotational symmetry of the 3d curve around the \nnadir-zenith axis (I(theta) is not a function of phi), is\n\n\nintegral(zero, 2pi) integral(zero, pi) I(theta) sin(theta) d theta d phi,\n\n\nwhich is\n\n\n2pi integral I(theta) sin(theta) d theta,\n\n\nin other words, there is a simple linear relation between flux F and \nI(theta):\n\n\nF is proportional to I(theta).\n\n\nSo much to light emitters (IES data), and receivers are identical but \nthe other way 'round. Simple, really...\n\n\nq.e.d.\n\n\nOther than to myself, I hope I didn't cause too much confusion.\n\n\nCheers\n\n\nAxel\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-October/006282.html).</sup>", "attachments": [], "created_by_name": "Axel Jacobs", "created_at": "October 14, 2009 at 06:01AM", "created_by": "Axel_Jacobs", "parent_id": "radiance-general_009589", "id": "radiance-general_006282"}