{"body": "On Sunday, June 1, 2003, at 02:59 PM, Greg Ward wrote:\n\n\n> Hi Rob,\n>\n> You can certainly exclude any geometry you like from the ambient \n> calculation using the -ae option.   Each -ae value adds a material to \n> exclude from ambient calculations.  Named materials will get the -av \n> value rather than incurring any new interreflection calculations.  \n> This means that the mountains will have a rather flat appearance, and \n> the shadows will be too dark if you don't choose a reasonable outdoor \n> value for -av, which in turn could be too bright for your interior.  \n> (It's a problem.)\n\n\nI knew about the -ae trick.  I just thought that since the exterior \nwould still have values, that they could get used inside.  Now I \nrealize that the direct calculation is one thing, *computed* ambient \nvalues are another, and the *approximated* ambient values (by way of \nthe -av parameter) are another, and they all are separate.  Only \ncomputed ambient values live in the ambient cache, and only computed \nambient values can be re-used elsewhere.  Yet another concept that \nseems obvious now, but didn't an hour ago.  OK, so the easy cheat is to \nexclude all the exterior objects from the ambient calculation, and live \nwith dark shadows on the mountain.  But Carsten says that the -ar is \nbased on the scene bounding cube, so even if I exclude the exterior \nvalues I need to crank it up, yes?\n\n\n> Another option is to capture (using HDR photography) or render the \n> scenery using a fisheye lens in a separate step, then apply the \n> results to the window as a luminance distribution using a fisheye \n> perspective mapping.  The Radiance ray/lib/fisheye.cal does a lookup \n> on a 180 degree angular fisheye image (-vta -vh 180 -vv 180).  I \n> recommend using two pictures -- a high-resolution for the view out the \n> window and a low-resolution for the light distribution.  You can \n> compute the low from the high using pfilt with the -1 option:\n\n\nI just wanna make sure I understand this.  This is the correct way to \nachieve what I asked at the end of my email, yes?  A method for using \nHDR lightmaps to illuminate the scene and have a pleasant (and \nphotometrically accurate) view out the window?  This would be, in a \nword, cool.\n\n\nAs I have never used colorpict and have limited experience with illum, \nI just wanna make sure I get this:\n1. I take a hemispherical HDR image of the site.\n2. Colorpict and the fisheye.cal file takes the highres picture, and \napplies it to a plane, and is rotated into the proper orientation.  Can \nyou explain the fish_u fish_v parameters?\n3. An illum source is created from the low res version of the pic, \nmapped to the same polygon?  Why do you use a low res image for the \nillum?\n\n\nThe illum's luminous distribution function is the result of applying \nthe lightmap to the window pane, just the same as if I were to use \ngensky?  The colorpict is purely for the view out, it does not \ncontribute to the illuminance of the interior space?\n\n\nSeems like a lot of work, 'specially for this brain, but it could be \nworth it.  In the short term, I think I need to try one of the other \ntacks.\n\n\nRob Guglielmetti\nrpg@rumblestrip.org\nwww.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-June/000829.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "June 02, 2003 at 08:46AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_000818", "id": "radiance-general_000829"}