{"body": "Hi Greg\nMany thanks for the feedback -\n>\n> Actually, refraction is never ignored in Radiance, even when tracing \n> to light sources.  The sources will be missed or not depending on how \n> big they are and how much refraction goes on.  If a pane of glass is \n> modeled using dielectric, so that rays are refracted going through it, \n> they get bent back straight so they still head in the same direction, \n> albeit shifted, slightly.\n\n\nOk that's interesting - it means that refraction through parallel \nsurfaces will never fail for direct sunlight - since they will be \nheading in the right direction to hit the sun source. Great.\n\n\nSeems that for non-parallel situations refraction treatment in the \ndirect calc in Radiance is different to other raytracers in that when \nthe ray misses a direct source there is a null result - whereas i think \nthe usual treatment is to ignore refraction. I'm thinking of sunlight \nonly through a cylindrical glass of water - both packages will show the \nscene through the glass refracted - but in std raytracer the sunlight \npasses through and is cast onto the table simply changed by the \ntransmittance of the media.\n\n\nRadiance will presumably record transmission in places (small \ndeflection) and in other parts not so.  (Not a criticism, Greg - just \ngood to be aware in some situations, such as a wavey-glass brick wall, \nmay transmit less of the sunlight than anticipated by the material \nspec).\n\n\n> Spheres and lenses are a different matter of course, and caustics are \n> not modeled correctly for that reason.  You need to use the photon map \n> for that!\n\n\nIndeed -  mind you perhaps the caustics produced will ultimately split \nout just into the three primaries.\n  I'm thinking of a virtual Newton conducting his classic prism \nexperiment ;-)\n\n\n>\n>> I think refractive index also does not apply when tracing rays as \n>> part of the indirect calculation - even though missing a large area \n>> source (sky) is not likely to be a problem.\n>\n> I don't know where you heard this, but it's not true.\nI guess i got it from the (wrong) idea that refraction only works for \nview rays.\n\n\n>\n>> Reflectance - in atria there are likely to be complex and multiple \n>> glazing surfaces - eg the roof and then in large areas along the \n>> offices lining the edge....\n\n\n> That's partially true.  Interreflections of the sky and other parts of \n> the ambient calculation will consider the multiple reflections going \n> on, specular as well as diffuse.  However, you would have to use \n> virtual sources to get the pure specular reflections from light \n> sources, which can be expensive.  You're better off doing that only \n> when it really matters -- like when you have a mirrored building \n> facade or something.\n\n\nSpecular contributions are probably neglected more often than they \nshould, especially when we are dealing with direct sunlight on polished \nfloors or glazing around entrances or in atria.  It may not be \nimportant overall - but in specific areas it can be highly significant.\n\n\nThe upside is that the source is just the sun and these specular \nsurfaces often lie in the same plane so that a single expanse of \n'mirror' will do the job for many windows. By comparison with the \nambient calculation the creation of one or two extra virtual suns to \ncover these pathways in the direct calculation need not be costly.\n\n\n>\n>> (Daniel - this may have relevance for your work) it does not include \n>> the contribution of indirect sources eg bright overcast skies are not \n>> going to be specularly reflected around the atrium. The Radiance \n>> indirect calculation essentially deals with diffuse-diffuse pathways \n>> only.\n>\n> Again, these are accounted for correctly.\n\n\nOK Great! One subsequent question to clarify:\nConsider if we have no direct sources and a view ray that hits a \ndiffuse floor - we have hemisphere sampling and ambient bounce 1 - if \nany of these rays is incident on a specular surface  then the ray is \ntraced back with specular reflection and then, for instance finds the \nsky.\n\n\n  So would this pathway (where sky illuminates floor via glazing) \nrequire a setting of  -ab 3 as a minimum as would be expected from a \npurely diffuse pathway (1 ambient bounce - 2 specular reflection - 3 \nindirect sky source)?\n\n\n  If the operator decides to switch to modelling the atrium aperture as \nan illum (switching the indirect sky to a the direct source) - then \nthis pathway is no longer included  - again unless the surface is \nidentified explicitly as a mirror (modified by the reflection function \nused on the  glazing).\n\n\nThis is useful to be aware of because the notion of changing a source \nrequiring a change to the model specs is not necessarily obvious - and \nit may account for some of the differences in results between using an \nillum or relying on the ambient calculation.\n\n\n>\n>> Ok so does that mean specs and functions for reflectance changing \n>> with angle of incidence are going to effect the appearance of the \n>> scene visible in the glazing, the light transmitted, but not the \n>> light reflected?\n>\n> They affect both.\n>\n>> And what about direct sunlight and diffusing glass? Is the light \n>> transmitted - or does the random scattering cause the same problem as \n>> refraction about missing the target when tracing the ray backwards?\n>\n> The diffuse or rough specular part of transmission (and reflection) \n> gets included in the indirect (ambient) calculation.  If modeled using \n> the directional diffuse part of one of the *func or *data material \n> types, this gets lumped into the Lambertian component, which \n> admittedly is a very crude approximation.  Perhaps this is what you \n> are thinking of above -- however, it doesn't apply to the Gaussian \n> materials (plastic, metal, trans, plastic2, metal2, trans2).  These \n> all work properly, which is why you should use them whenever possible. \n>  Problems remain when you get strong caustics from a low roughness \n> surface, however.\n>\n\n\nStill not sure about this - a ray in the direct calc is traced back \ntoward the sun - but is incident on some diffusing glass and is \nscattered randomly and presumably misses its target. (?)\n\n\nI agree about using the Gaussian materials as far as possible \nespecially given the role of indirect lighting in daylighting - i'm not \nentirely convinced given the Lambertian diffuse approximation and \nnevertheless good results in most cases -  if going to the trouble of \nmeasuring and specifying BRTD materials often really make that much \ndifference.\n\n\nThe number of times i've seen lighting studies blown away because some \nsuch thing as people deciding to keep their blinds drawn so they can \nsee their computer screens clearly :-)\n\n\nMany thanks again Greg - very useful to clarify things.\ncheers\nalex\n\n\n*******************************************************\nA. J. Summerfield                 alex@arch.usyd.edu.au\nFaculty of Architecture, University of Sydney\n\n\nOutside of a dog, a book is man's best friend.\nInside a dog, it's too dark to read.       Groucho Marx\n*******************************************************\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-January/001412.html).</sup>", "attachments": [], "created_by_name": "alex Summerfield", "created_at": "January 18, 2004 at 12:51PM", "created_by": "alex_Summerfield", "parent_id": "radiance-general_001394", "id": "radiance-general_001412"}