{"body": "On Wed, 11 Dec 2013 18:15:56 +0100, Greg Ward <gregoryjward at gmail.com>\nwrote:\n\n\n> I don't think photon mapping will handle this, either.  It's really  \n> outside the scope of an architectural rendering package.  Subsurface  \n> scattering needs to be implemented at a fundamental materials level, and  \n> involves gathering contributions from nearby a hit point in a  \n> geometry-aware fashion.  Not to say that it couldn't be done, but  \n> there's no real motivation to add it to Radiance.\n\n\nHi all,\n\n\nfunny this discussion should come up, because the issue of subsurface\nscattering was recently raised in our department precisely within an\narchitectural context. Lars Grobe conducted some tests with the \"mist\"\nprimitive, but the results weren't convincing.\n\n\nWann Jensen has proposed a BSSRDF and a photon mapping approach to model\nsubsurface scattering, so it is doable, but not with the current photon\nmap implementation; it would require adding the BSSRDF itself plus the\nappropriate photon scattering routines. The flux carried within the\nmaterial would then be obtained from volume photons, which are already\nbuilt in.\n\n\nHaving said that, while we're planning a few (overdue) extensions to the\nphoton map, subsurface scattering currently doesn't have a high priority.\n\n\nSee ya,\n\n\n--Roland\n\n\n\n\n\n\nDr. Roland Schregle\nSenior Research Associate\n\n\nT direct: +41 41 349 39 77\nroland.schregle at hslu.ch\n\n\nLucerne University of Applied Sciences and Arts\nSchool of Engineering and Architecture\nCC Envelopes and Solar Energy (EASE)\nTechnikumstrasse 21, CH-6048 Horw\nT +41 41 349 33 11, F +41 41 349 39 60\nwww.hslu.ch/ccease\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2013-December/009908.html).</sup>", "attachments": [], "created_by_name": "Schregle Roland HSLU T&A", "created_at": "December 11, 2013 at 09:58AM", "created_by": "Schregle_Roland_HSLU_T&A", "parent_id": "radiance-general_009903", "id": "radiance-general_009908"}