{"body": "Lars Grobe wrote:\n\n\n> First, I have just ordered my 12\" Powerbook ;-) \n\n\nCongrats!  The new 12\" ones are so very adorable.  The aluminum cases \nare georgeous; the finish on my Ti PowerBook started flaking pretty \nearly on, I'm glad they did something about it.\n\n\nSecond: my\n> experience is that rendering speed depends on memory (nothing \n> is as stupid as a rendering process on a fast machine waiting \n> for data from the swap!!!)...\n\n\nOh definitely; I think we're all making \"rendering comparisons\" of \nmachines that are *not* relying on virtual memory at all.  At least I \nwas always talking about relatively small models.\n\n\n> However, one thing to mention - a stable 800MHz machine doing three \n> renderings over night is much more performant than a 3200MHz \n> machine which crashes three timer per rendering ;-) \n\n\nAgreed, but stability has not been an issue for me at all.  The \ncomputer, I mean. =8-)\n\n\nAlso, Greg and Jeffrey mention one BIG thing about OS X that I did not: \n  the OS is just so darn easy to administer!!  So, that should surely \nweigh in to the equation.  With OS X, all I did was load the Radiance \nbinaries and start using Radiance.  I was able to jump into Radiance \nwithout spelunking into the depths of /etc, learning enough unix to get \nby, and experimenting as time allowed.  It's like unix with training \nwheels.  It's just that for me, speed is king and money is in short \nsupply, so I put up with Linux.  Still prefer working on the Mac tho. \nJeffrey, if you find any good CAD applications that run on OS X do let \nus know.\n\n\n\n\n\n\n      Rob Guglielmetti\n\n\ne. rpg@rumblestrip.org\nw. www.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000817.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "May 30, 2003 at 03:24PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_000813", "id": "radiance-general_000817"}