{"body": "Hi Stephen,\n\n\nPerfect -- thanks for the additional explanation and renderings.  Now I know what's happening, which I should have known had I only remembered the age-old limitation built into the indirect calculation from the beginning.\n\n\nThe basic problem is that the perturbed normal cannot be used to assign the sampling hemisphere, because this would inevitably lead to sampling behind the surface, which would introduce nasty light leaks in many situations.  This is one of the main problems with \"bump mapping\" as it is commonly referred to in graphics, and Radiance adds some special tests in the specular material sampling routines to avoid generating rays that penetrate an opaque surface.  Modeling the object as actually geometry avoids this problem, and is really the best way to get an accurate result if you don't mind all the extra polygons....\n\n\nThe trick I employ when using the ambient cache is to take the calculated \"rotational gradient\" and apply it using the perturbed surface normal to simulate the cosine effect you get with a different surface orientation.  Thus, the hemispherical ray samples are generated based on the unperturbed normal, but the perturbed normal is used to adjust the final value.\n\n\nThis trick doesn't happen with -aa 0, because I don't bother to calculate the rotational gradient, figuring that I'm not caching any values so I won't need it.  However, I *could* calculate it in cases where there is a normal perturbation, and use it in the same way I do with the irradiance cache on.  I don't think it would be that much trouble to add this capability after looking again at the code, so I might send you a version to try a little later today.\n\n\nCheers,\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-November/011961.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "November 01, 2016 at 11:34AM", "created_by": "Greg_Ward", "parent_id": "radiance-general_011951", "id": "radiance-general_011961"}