{"body": "Mark Stock wrote:\n\n\n> Hello,\n>\n> After learning quite a bit about rpict's \"other\" options\n> while working on my image for SIGGRAPH, I decided to run\n> some tests to determine optimal settings for -ab, -ad\n> paramters, and required oversampling to achieve smooth\n> ambient results on surfaces, and smooth penumbras, given\n> the -aa 0 setting for ambient accuracy.\n>\n> The page would be complete save for a few more renderings\n> that are in the works right now. Here is the link:\n>\n> http://mark.technolope.org/radiance/aa0_test/final.html\n> (59 images, ~2 MB total)\n>\n> My conclusion is that penumbras require high oversampling,\n> and at those levels, a very low number of ambient divisions\n> are required for a smooth rendering (-ad 4 to 16).\n>\n> I welcome any comments that you may have on the method,\n> results, etc. I may have forgotten some very important\n> parameter that throws all of these results askew---if I\n> did, please tell me! =0)\n\n\nHi Mark,\n\n\nit's been a while that you asked this, but I just ran into\nyour mesage when cleaning out my mailbox.\n\n\nI think the main problem with your experiments is in the default\nparameter values of rpict that you mention at the top of the\npage. As mentioned in the rpict man page, when using -ds and -dj\nfor getting penumbras, you need to set -ps to 1 or you'll get\nvery uneven results. Rendering at multiplied resolutions can\ncompensate only for a part of the pixels that are skipped in the\ncalculation with -ps 4.\n\n\nWhile you ended up needing up to 8x and more resolution, I think\nyou'd get acceptable results at no more than 3x with -ps 1.\n\n\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-September/000987.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "September 16, 2003 at 05:16PM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_000940", "id": "radiance-general_000987"}