{"body": "Hello,\n\n\n> When trying to illuminate objects with a light probe made from an indoor\nscene\n> is it best to generate a cubic cross map in HDRShop and then map each of\nthe 6\n> sides onto the room walls as 'glow' textures? Because as it is a small\nscene\n> with small intense sources, when I use genbox, I never know which is the\nbest\n> size box to illuminate the objects, i.e. get them in the right position as\nif\n> w.r.t. the light source.\n\n\nIf you are going to move the viewpoint around, the closer the geometry of\nthe light probes to the scene geometry, the better. In that case, I guess\nthe box should have the size of the room. However, this depends on where was\nthe camera (or mirrored ball, or viewpoint) when getting the probes.\n\n\n> Is the best option to use mksource? If I need to map my light probe onto a\n> distant glow source rather than a large box, what should the geometric\n> description for that distant glow source be?\n\n\nmksource can help improve results and speed, specially if you have small\nsources.\nThe description is vey similar, only you map the probe onto a source object\nlike this:\n\n\n  void colorpict sourcemap\n  7 red green blue input_image.hdr fisheye.cal fish_u fish_v\n  0\n  0\n\n\n  sourcemap glow sourceglow\n  0\n  0\n  4 1 1 1 0\n\n\n  sourceglow source source_1\n  0\n  0\n  4 0 1 0 180\n\n\nThis works for hemispheric light probes and the result will be maped in the\nhemisphere +Y.\nIf you look into fisheye.cal:\n\n\n  fish_u = .5 + Dx/fish_Rxz * fish_Ry;\n  fish_v = .5 + Dz/fish_Rxz * fish_Ry;\n\n\n  fish_Rxz = sqrt(Dx*Dx + Dz*Dz);\n  fish_Ry = acos(Dy) / PI;\n\n\nthe very last \"/PI\" works for hemispheric probes. If you are using a 360\ndeg. probe, you should change this for \"/(2*PI)\", and the last line in the\ndesciption for \"4 0 1 0 360\".\n\n\n> When creating a mask\n> to combine\n> probe images in HDRShop, since there is no reflection of a\n> camera/camerman in\n> the probe (it's a simulation picture rendered with Radiance) what other\n> artefacts is the mask needed for?\n\n\nI`m sorry I cannot help with this one, I haven`t used it.\nRegards,\n\n\nSantiago\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-June/002740.html).</sup>", "attachments": [], "created_by_name": "Santiago Torres", "created_at": "June 06, 2005 at 04:41PM", "created_by": "Santiago_Torres", "parent_id": "radiance-general_002738", "id": "radiance-general_002740"}