{"body": "Hi Robert,\nSorry for the delayed response. I think your problem is that you don't have\nthe java development environment installed, just the runtime environment.\nYou need javac and javah (part of the development environment) to create\nthe interface to the radiance library.\n\n\ntry:\n\n\nsudo apt-get install default-jdk\nand starting again from scratch.\n\n\nAs for your debugging notes, thanks. Though some of the confusion comes\nfrom me lazily including the whole radiance library directory and just\nusing the bits that I need.\n\n\n1. line 14 in Rmakefile defines LIBDIR = /usr/local/lib/ray . That's not\n> the place my radiane libs are located /usr/local/radiance/lib or whatever\n> is the users choice.\n>\nWell LIBDIR isn't actually used (again - me lazy).  install.sh simply uses\nrmakefile to compile all the objects for libBSDF.so\n\n\n\n\n> 2. line 28 in install.sh asks for libBSDF.so, which is no located in that\n> place. instead: ./lib/libBSDF.so\n>\nlibBSDF is compiled by install.sh in the BSDFViewer directory, this is the\none that it attempts to use. (you'll note that install.sh uses cd to change\nto that directory - me lazy)\n\n\n\n\n> 3. the libBSDF.jnilib is not existing at all - so there is something\n> broken.\n>\nThis is created by install.sh in the BSDFViewer directory - this fails to\ncompile because you don't have javac - part of the development environment.\n\n\n\n\n> 4. An error message about something called: ELFClass32 I tried to solve by\n> apt-getting different java platforms - as different forums told me.\n\n\nI think this is because there are compiled versions of everything included\nin the zip.  Your system is using these (which were compiled 32-bit)\nbecause they are failing to complie on your system. I should have scrubbed\nthese out before zipping the directory. This should be fixed when you\ninstall development environment.\n\n\nAndy\n\n\n\n\n\n\nOn Mon, Feb 1, 2016 at 10:24 AM, Robert Weitlaner <r.weitlaner at gmail.com>\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-February/011469.html).</sup>", "attachments": [], "created_by_name": "Andy McNeil", "created_at": "February 03, 2016 at 03:04PM", "created_by": "Andy_McNeil", "parent_id": "radiance-general_011468", "id": "radiance-general_011469"}