{"body": "Rob,\n> How would I do this with brightdata? I use a modified version of  \n> Francsco's radmap to produce the aggregated image for these types of  \n> analyses, but I'm interested in learning how to apply a brightdata  \n> method instead. Is this faster? What is the input?\n\n\nI generate the sky luminance pattern for each entry in the TMY file  \nand then read-off the luminance values for points on a pre-determined  \ngrid.  I just keep adding to the values and then write them out in  \nbrightdata format (much like was done for the measured sky luminance  \npatterns).  I settled on this scheme since it followed on from the  \nvalidation.  I doubt that it is faster, or significantly so, than the  \naggregated image method.\n\n\nThe cumulative sun contribution is provided by a pre-determined grid  \nof standard Radiance suns, where each sun contains the aggregated  \neffect of all the nearby sun positions that occur throughout the  \nyear.  Just 150-200 or so suns provides a spatial distribution that is  \nequivalent to a time-step of around 1/2 hour.  So, much better than  \ncreating a rad file with potentially several thousand suns (for a  \ncumulative annual file).\n\n\nUnfortunately, it's not code that I can share since it is part of an  \nunwieldy mass of IDL procedures and scripts that only ever gets used  \nin-house and is probably not fit to be let out of the door.\n\n\n-John\n\n\n\n\nDr. John Mardaljevic\nSenior Research Fellow\nInstitute of Energy and Sustainable Development\nDe Montfort University\nThe Gateway\nLeicester\nLE1 9BH, UK\n+44 (0) 116 257 7972\n+44 (0) 116 257 7981 (fax)\n\n\njm at dmu.ac.uk\nhttp://www.iesd.dmu.ac.uk/~jm\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-June/005107.html).</sup>", "attachments": [], "created_by_name": "John Mardaljevic", "created_at": "June 10, 2008 at 02:16AM", "created_by": "John_Mardaljevic", "parent_id": "radiance-general_005078", "id": "radiance-general_005107"}