{"body": "Hi Lars, Thanks a lot for the quick answer, but I think my question was not\nreally clear.\n\n\nWhat I want to achieve is to get the directional transmitance from\" any\"\nangle. Interpolating  would allow me getting a continuous (although not\nreally exact) value. This is mainly for visualization purposes, not really\nfor getting exact values. By increasing the number of patches I would have\na better resolution, but still I would have \"bins\" and not a continuous\nvalue.\n\n\nI hope is clear. If it is too hard (i.e. there is not any program that does\nit for me), I can just increase the number of bins, and just smooth the\nfinal image.\n\n\nThanks a lot!\n\n\nGermán\n\n\n\n\n2014-02-14 12:01 GMT-03:00 Lars O. Grobe <grobe at gmx.net>:\n\n\n> Hi German,\n>\n> there will be no light loss. However interpolation does not increase\n> resolution. Think of it as if you were taking a picture with a smartphone\n> from the 90's - the overall average luminance may be correct, but you will\n> never be able to add information on detail in between the pixels by\n> interpolation. So if you want / need high resolution, run genBSDF\n> accordingly.\n>\n> Cheers, Lars.\n>\n> > By the way, my idea would be to:\n> >\n> > 1.- genBSDF the BSDF of a product (klems basis, maybe Klems MF:N)\n> > 2.- from that matrix, interpolate and generate plots.\n> >\n> > I will also have to deal with the loss of energy due to sharp light\n> sources...? That is something that I do not understand yet.\n> >\n> > THANKS AGAIN, any comments welcome.\n> >\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n\n\n\n\n\n\n\n\n*Nota de Confidencialidad:* Este mensaje incluído los archivos adjuntos son \nconfidenciales y pueden contener informacion privilegiada protegida por \nley. Si Ud. no es el destinatario, deberia abstenerse de copiarlo, \ndistribuirlo, divulgarlo o usar la informacion contenida. Por favor, avise \ninmediatamente al emisor y borre este mensaje de su sistema. Los mensajes \nelectronicos son susceptibles de ser cambiados, infectados o adulterados \nsin autorizacion. No asumimos responsabilidad alguna por ninguna clase de \ncambios o sus consecuencias. Usted debe estar informado que la compania \npuede hacer un seguimiento de sus mensajes electronicos y su contenido, \ngracias.\n\n\n*Confidentiality Notice:* The information contained in this email message, \nincluding any attachment, is confidential and is intended only for the \nperson or entity to which it is addressed. If you are neither the intended \nrecipient nor the employee or agent responsible for delivering this message \nto the intended recipient, you are hereby notified that you may not review, \nretransmit, convert to hard copy, copy, use or distribute this email \nmessage or any attachments to it. If you have received this email in error, \nplease contact the sender immediately and delete this message from any \ncomputer or other data bank, Thank you.\n\n\nA informação transmitida é confidencial e para conhecimento exclusivo do \ndestinatário. Sua utilização, não autorizada, constitui crime passível de \nprisão. Todas as precauções possíveis foram tomadas para garantir que este \ne-mail não contenha vírus. Uma vez que nossa empresa não pode assumir \nresponsabilidade por nenhuma perda ou dano causado por este e-mail ou de \nseus anexos, recomendamos que o destinatário utilize seus procedimentos de \nantivírus antes de qualquer uso.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2014-February/010081.html).</sup>", "attachments": [], "created_by_name": "German Molina", "created_at": "February 14, 2014 at 08:17AM", "created_by": "German_Molina", "parent_id": "radiance-general_010078", "id": "radiance-general_010081"}