{"body": "Hi Cramer,\n\n\nI've done a fair amount of daylight modeling for LEED\ncertification/documentation -- more than I'd like to have done, honestly!\nAt my last job, we would use the glazing factor method if the spaces were\nsimple enough, and rely on Radiance models for the more complicated\ndesigns. There are spaces that are simply not supported by the glazing\nfactor method, and then you need to rely on better tools like Radiance or\nAGi32 to do the required simulations.\n\n\nThe sky condition is, admittedly, a gross simplification. Better than\ndaylight factors for predominantly clear climates, though. But you're\nright, neither are really adequate for quantifying the daylighting on an\nannual basis. Hopefully the emerging tools in Radiance v4.x, and planned\nimprovements to AGi32, will provide more thorough climate based daylight\nmodeling capability to more users, and that this practice will find its\nway into the emerging daylight quantity and quality metrics, and building\nrating systems.\n\n\n- Rob G.\n\n\n\n\n\n\n\n\nOn Tue, May 25, 2010 12:35 pm, Cramer Silkworth wrote:\n> Hi All,\n>\n> Has anyone out there done any daylight modeling for LEED projects? We're\n> considering it, but wondering about how the LEED process affects things.\n> Perhaps the glazing factor option is the way to go, instead of full-on\n> modeling? And what about this sky condition, clear skies at noon on the\n> equinox...including direct sun? Really? Not daylight factors under the\n> CIE 10k? Sure, neither are perfect, but...\n>\n> Thanks,\n> Cramer\n> --\n> *Cramer Silkworth\n> 212 219 2255 | silkworth at transsolar.com <mailto:silkworth at transsolar.com>\n> Transsolar Inc. | 134 Spring Street Suite 601 | New York, NY 10012\n>\n> Transsolar Climate Engineering\n> Technical consulting for energy efficiency and environmental quality in\n> buildings.\n> New York - Stuttgart - Munich*\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n\n\n\n\n\n\n\n\n Rob Guglielmetti\nwww.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-May/006908.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "May 25, 2010 at 11:46AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_006907", "id": "radiance-general_006908"}