{"body": "Hi Greg!\n\n\n> That explains the problem.  Because each new inclusion of a material \n> gets a new id, and this id needs to go into the ambient \n> include/exclude list for that modifier name, you will quickly overflow \n> your ambient exclude set if you incorporate a copy of your materials \n> for every object.\n\n\nOk, so if I define aliases, no new ids are created, right? I changed my \nscripts so that only a file (let's call it material.aliases) is cat'ed \ninto the rad-scene-file, while the actual definitions of materials \n(material.mat) and modifying patterns (material.map) are passed only to \noconv in the final processing step. I have about 20 aliases in my \nmaterial.aliases file, and a lot of objects (radiance scene files), so \nI hope that these aliases won't need to have their own ids (if I \ncalculate 200 objects, 200*20=4000 id's would already massively overrun \nall limits).\n\n\nThe next question arises with the use of obj2mesh. I use\n\n\nobj2mesh -a material.mat -a material.map -a material.alias object.obj > \nobject.rad\n\n\nfor each of my objects. I have to pass the mat and map files to \nobj2mesh, which behaves more like oconv and can't use just the aliases \n(and having the actual definitions linked later by oconv). So here I \nstill get all these definitions for each object, will this count in my \nambient list?\n\n\n> This is bad practice in general because it means that most of your \n> memory is occupied with redundant material definitions rather than \n> geometry.\n\n\nYes. I guess I could solve all this if using only obj as cad input, \nusing u/v-coordinates with obj2mesh to position and transform the maps \nand don't include any mappings into the scene files at all. However, I \nhave a mixed model with dxf and obj, which developed before obj2mesh \nwas released, and I am a bit suspicious concerning modeling apps and \nu/v.\n\n\nI am currently trying to reduce the material definitions, but as you \ncan see from my questions, I won't be able to change a lot if some of \nthe points I mentioned are like I guess. In the worst case, I'd have to \ngive up counting on speed-up by -ae.\n\n\nThank you for your answers, CU Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-July/002822.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "July 11, 2005 at 06:39PM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_002804", "id": "radiance-general_002822"}