{"body": "To confirm BSDF orientation in the 3-phase steps:\n\n\nIf I have a skylight where the CFS is rotated -45 in the plane of the glass to align w/ site rotation, the daylightmatrix command should look something like this:\n        genklemsamp -vd 0 0 1 -vu 1 1 0 dmx_surf.rad | rcontrib -c 1000 -ab 2  -ad 1024 -e MF:1 -f reinhart.cal -b rbin -bn Nrbins -m sky_glow model_3ph.oct > daylightmatrix.dmx\n\n\nI previously had the -vu as 0 1 0, but realized that setting the vu as noted above  is probably used to correctly orient the bsdf within the skylight - right? The standard application of a vertical aperture would typically be -vu 0  0 1 (or not expressed, as this would be the default) unless this has a similar orientation adjustment. I know the Direct Sun Coeff Matrix uses physical geomtry w/ the BSDF primative that is oriented in the material description. I realized that my first pass at the daylight matrices didn't account for any rotation and this seems to be the most logical case of how to apply.\n\n\nAlso, is it ok to change the number of sky divisions to MF:2 or higher? I know the klems patches are 145, but didn't know if there was something that would be incorrect in the matrix multiplication stages? I guess maybe it isn't as critical as generally you're trying to make the sun patches smaller, which is what the 5-phase method introduces. Maybe an increase in the accuracy of the diffuse calcs...? If it is acceptable, this would be both in the gendaymtx sky matrix and the daylight matrix pieces (view matrix uses klems)?\n\n\nConfirmation, or corrections, are greatly appreciated. I'm trying to troubleshoot data and looking into all aspects...\n\n\nThanks\nChris\n\n\n_____________________________________________\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2014-April/010241.html).</sup>", "attachments": [], "created_by_name": "Chris Coulter", "created_at": "April 18, 2014 at 11:15AM", "created_by": "Chris_Coulter", "parent_id": "radiance-general_010125", "id": "radiance-general_010241"}