{"body": "Marcus,\n\n\nI think the \"fractal pattern\" you refer to in the specular\nhighlights can be solved by turning on Radiance's pure Monte-\nCarlo sampling algorithm (requires re-compiling, though).\nI read about it in a text file on the old Radiance site:\n\n\n\n\nRADIANCE Compile Switches\n\n\nHere is a list of compile switches, used to customize Radiance code for\nspecific machines and users:\n\n\n-DMC\n    If set, switches from default low-discrepency sequence sampling to\ntrue (pseudorandom) Monte Carlo.  Use if the \"brushed\" appearance of\nspecular highlights and penumbras bothers you.\n\n\n\n\nTo get this to compile with the HEAD distribution, you need to\nmake a few changes to the src/common/random.h file. I can give those\nto you if you like.\n\n\nalso...\n\n\nOn Mon, 3 Nov 2003, Roland Schregle wrote:\n\n\n> Marcus Jacobs wrote:\n>\n> > As a side note, the reflections of the light sources on the floor do not\n> > seem right. I have noticed this before. Does anyone know what's causing\n> > this?\n>\n> Don't seem right as in no penumbrae? That's expected for a solar source\n> modeled with the SOURCE primitive. AFAIK these sources are immune to -dj\n> and -ds anyway. Maybe a Fully Licensed Guru[tm] here can tell you more.\n\n\nI've found that -dj works with the \"source\" primitive (again, I\nuse the HEAD distro, but I found it to work in the 3R5 distro, too).\nIt uses the last float argument, the angular disc size, to determine\nthe jittering. Go ahead and raise that from 0.5 to 5 degrees for an\nunrealistic sun with nice-looking soft shadows.\n\n\nI typically use -dj 0.6 to 0.7 for most of my scenes.\n\n\nBTW: the soft shadows will exhibit the same fractal-like pattern\nthat you see in the specular highlights. -DMC cures this, too,\nbut can require higher-resolution runs before filtering down.\n\n\nOh, and -ps 1 is almost a necessity with -DMC turned on.\n\n\nMark\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-November/001170.html).</sup>", "attachments": [], "created_by_name": "Mark Stock", "created_at": "November 03, 2003 at 11:05AM", "created_by": "Mark_Stock", "parent_id": "radiance-general_001179", "id": "radiance-general_001170"}