{"body": "Jeffrey McGrew wrote:\n\n\n> \tJust for the record, if I make a model from scratch using textfiles I\n> don't have any of these problems. Additionally, the problem crops up\n> whether I'm using Radiance on Cygwin, OS X, or Mandrake Linux, so it's\n> obviously something I'm doing or a problem with the models coming out\n> of Revit.\n\n\nIt might still have something to do with the different\ncomplexity of the two models. Maybe a simple hand crafted scene\nwill just not show the effects you're observing, because there\nis not enough context there to notice the difference.\n\n\n\n\n> \tMy problem is the fact that my buildings all appear as if they are\n> 'glowing'. Things like the site, and any Radiance-created objects or\n> instances render correctly, however the buildings, especial the large\n> flat surfaces such as walls and such, almost appear to be glowing\n> because they seem to be bouncing so much light off of them, almost as\n> if they are made of perfect white gypsum in broad daylight.\n>\n> \tThe material definitions for the walls aren't set too high, the\n> colors are typically .8 or .7 for the RGB values,\n\n\nMost likely, this is *way* to high.\n\n\nA freshly painted white interior wall typically has 0.7 0.7 0.7.\nThere are very few materials in existence with 0.8 0.8 0.8.\nAn exterior white wall will hardly ever have more than 0.5 0.5 0.5.\n\n\nRemember that our eye has a logarithmic response curve. What\nyou perceive as \"half as bright\" actually has about 10% of the\nluminance compared to the \"twice as bright\" reference. Doubling\nthe luminance of a surface will make the difference just about\nvisually noticeable, and only if both luminances are seen next to\neach other. If I remember correctly, the standard \"medium grey\"\nreference card used by photographers for calibrating their camera\nmeasurements has a reflectance of 18 %.\n\n\n\n\n\n\n>  Yet however the building will be bouncing\n> almost twice the light off of it of anything else in the scene!\n\n\nThat shouldn't surprise you anymore now...\n\n\n\n\n> \tThe way I get my models from Revit to Radiance might be the key to\n> why the models are behaving the way they are. I export the models to a\n> DWG file that I then bring into AutoCAD and then use RADOUT to produce\n> the models.\n\n\nRadout knows nothing about materials, so this is irrelevant.\n\n\n\n\n> However there are issues with this, for RADOUT or TORAD\n> don't work quite right in the latest version of AutoCAD that I'm\n> using. I've tried to use dxf2rad, but it always seems to choke on the\n> models. They are very large, very complex, and have many surfaces. So\n> I'm wondering if that's the root of my problem;\n\n\nNo, that's an entirely independent set of problems (which I'm\nworking to solve anyway, of course).\n\n\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-May/001749.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "May 28, 2004 at 12:59AM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_001742", "id": "radiance-general_001749"}