{"body": "You could just use the \"trace\" command in rvu too; it will return the coordinates of the surface, and then the modifier. But I think Andrei wants specifically to query the output HDR, not the octree. (?)\n\n\n- Rob\n\n\nOn 5/27/15, 10:24 AM, \"Thomas Bleicher\" <tbleicher at gmail.com<mailto:tbleicher at gmail.com>> wrote:\n\n\nAndrei\n\n\nGreg has developed just such a tool. rvu has a command line option that allows you to query the surface under the cursor. I don't have a Radiance installation around but you should find it in the man page.\n\n\nIt was either that or a cunning pipe between the output of rvu (view direction) and rtrace to report the modifier.\n\n\nOn Wed, May 27, 2015 at 10:53 AM, Kolomenski, Andrei (JSC-SF311)[WYLE INTEG. SCI. & ENG.] <andrei.kolomenski at nasa.gov<mailto:andrei.kolomenski at nasa.gov>> wrote:\nHello Dear Radiance Community,\n\n\nI'm curious if it is possible to identify a specific geometry primitive identifier name in a .rad file given an .hdr image of the octree that uses this geometry .rad file? I have a .rad geometry file that contains numerous polygons and it would be helpful to be able to identify a specific polygon identifier name by simply clicking on its surface within an .hdr image. This is useful for debugging purposes, where the geometry consists of a large number of geometry primitives.\n\n\nIf anybody has developed a Radiance utility that performs this task, I would greatly appreciate it you could share it or give some insight into the procedure.\n\n\nBest Regards,\nAndrei Kolomenski\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org<mailto:Radiance-general at radiance-online.org>\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-May/010967.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "May 27, 2015 at 09:33AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_010964", "id": "radiance-general_010967"}