{"body": "Hi Greg,\n\n\nAfter years of work with Radiance, I can always learn something new :)\n\n\nRelated to FAQ, is Radiance Wiki still active, or  is there some other\nknowledge database related to Radiance (beside list members :)\n\n\n\n\n>\n> *Question:* If outside environment is heavily obstructed, as it is\n> usually the case in urban areas, how should we determine -av value for\n> mkillum calculation? I think that simple usage of 'ground ambient value'\n> for -av would overestimate luminance inside of the building.\n>\n> You are probably right that it should be set lower.  You can always set it\n> to zero (the default) and accept that you will underestimate values\n> slightly.  Otherwise, you can render a fisheye image just outside the\n> window setting \"-ab 0 -dv-\" and compute the average pixel value with:\n>\n> pvalue -h -H -o -df  fisheye.hdr | total -if3 -m\n>\n> That's pretty close to what compamb does.\n>\n>  Interesting method, I'll surely try it.\nSo ambient value i get from this calculation I use -av parameters for\nmkillum?\n\n\n Rad parameters:\n> Beside setting of ambient parameters it is good idea to experiment a\n> little and find nice set of -d* parameters.\n> Example of parameters: -ab 3 -av 0 0 0 -ad 1024 -as 256 -aa 0.1 -ar 600\n> -ps 1 -ds 0.05 -dj 1 -dt 0.03 -dc 0.9 -af tmp/floor1_illum.amb\n>\n>\n> In daylighting situations, the calculation shouldn't be very sensitive to\n> the -d* settings.  You can set -dt 0 if you're worried about it, though.\n>\n\n\nFor nice luminance images of daylight spaces, I usually experiment with\nthese -d* parameters.\nCombination of -d* parameters in example above (although too high and\ncomputationally expensive) gives really nice images in most cases.\n\n\n*Question:* Why it is not recommended to use mkillum for illuminance\n> calculations?\n>\n> It's just that mkillum doesn't pay off if you are only calculating a small\n> number of points.  The only reason to use it is to reduce the error when\n> you cannot afford a difficult indirect calculation over a million or so\n> pixels.  If you are only computing a few hundred illuminance values to\n> begin with, you are better off simply cranking up the indirect calculation\n> parameters and letting rtrace deal with the window complexity.\n>\n\n\nWe usually calculate illuminance images over complete workplane and set\nrather high ambient parameters ab>=5, and calculations of an image take\nseveral hours.\nMaybe mkillum in such process can make calculation time shorter, but again\nwe should determine correct ambient value previous to mkillum running. Also\nif project has big number of windows, calculation of mkillum would take\nadditional time - so no real time saving in this approach.\n\n\nAs a conclusion: For illuminance calculations better use high ambient\nparameters and avoid mkillum.\n\n\nThanks again,\nMarija.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2012-February/008399.html).</sup>", "attachments": [], "created_by_name": "Marija Velickovic", "created_at": "February 24, 2012 at 07:45AM", "created_by": "Marija_Velickovic", "parent_id": "radiance-general_008388", "id": "radiance-general_008399"}