{"body": "On Sunday, May 18, 2003, at 05:30 PM, John An wrote:\n> Problem:\n> When I generate a falsecolor image of an office space I rendered, I \n> get a good image with a dynamic range.  The command I use is:\n> falsecolor -s 400 -i image.pic > image2.pic\n>\n> The image I rendered was a standard Radiance image that calculates the \n> radiance/luminance.\n>\n> The when I try to get luminance reading from the falsecolor image, the \n> values I get are confounding.  The brightest areas (the bright red \n> regions) always get at reading of 47.8L.  Surrounding areas typically \n> have higher values.\n\n\nOdd that areas in the image that are not red would give higher values.  \nHere's what Greg told me to do though:\n\n\nRun \"pextrem -o\" on the image.  (Read the manpage for details)  The \nsecond line of the output is the highest value pixel in the image.  \nTake the green value from that second line, multiply it by 179 and use \nthat number for the scaling (-s) factor in your falsecolor renderings.  \nThat should make the red areas in your falsecolor rendering be the \nbrightest, and allow the color range to depict the rest of the \nluminance best.  I usually use a logarithmic scale to boot, usually 2 \ndecades or three.  Hope this helps.\n\n\n> To try to test what was going on, I clicked on the color scale on the \n> falsecolor image and got readings which were not even close to what \n> the scale indicates.  The L values are maximum around the yellow/green \n> section (reading at about 120L), and decrease going toward both the \n> blue and section of the scale.\n\n\nI would seriously doubt the pixels in the scale have any basis in \nreality.\n\n\n> If anyone is reading this message on a Sunday evening, I would REALLY \n> appreciate it if you could fill me in on how to correct this problem.\n\n\nPathetic, but true, I am reading this.  =8-)  Happy Sunday everyone.\n\n\nRob Guglielmetti\nrpg@rumblestrip.org\nwww.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000778.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "May 18, 2003 at 09:34PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_000776", "id": "radiance-general_000778"}