{"body": "Georg Mischler wrote:\n> \n> Randolph Fritz wrote:\n> \n> > On Fri, Jun 07, 2002 at 12:19:58PM -0400, Georg Mischler wrote:\n> > >\n> > > Speaking more generally, I'd like to put in a strong vote for\n> > > ansifying Radiance completely. Even though this might look like a\n> > > highly tedious task (and probably is), I'd expect it to uncover\n> > > and eliminate at least a one or two dozen subtle bugs throughout\n> > > the code. In the long run, it would make all future development a\n> > > lot easier. Of course, if Radiance were to be put on public CVS\n> > > later this year, there's no reason why you would have to make\n> > > this conversion yourself...\n> > >\n> >\n> > Are there formal plans to do this at this point, do you know?  Is\n> > LBL going to continue to maintain radsite?\n> \n> >From my side, that was more like a hidden suggestion... ;)\n> It certainly would make a lot of sense though.\n\n\npositively a good idea. IMHO a full rewrite would be a better\ninvestment, timewise, than an ANSIfication, at least for the existing\ncore rendering. I'm not saying the core is badly written or\nmalfunctioning. Just that any code tends to grow over the years and\naccumulated insights are sometimes best served when starting freshly\nwith a blank sheet. - Greg ?\n\n\nPeripheral programs (practically everything apart from\nrpict/rview/rtrace) will be a lot easier to port to ANSI-C and could be\ndealed with in a parallel way.\n\n\nProblems of the technical infrastruture (like setting up and running a\nCVS server) are very certainly easily solved (e.g. on this machine which\nhandles the mailing list).\n\n\ncheers\nPeter\n\n\n pab-opto, Freiburg, Germany, www.pab-opto.de\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-June/000289.html).</sup>", "attachments": [], "created_by_name": "Peter Apian-Bennewitz", "created_at": "June 08, 2002 at 09:50AM", "created_by": "Peter_Apian-Bennewitz", "parent_id": "radiance-general_000287", "id": "radiance-general_000289"}