{"body": "Greg Ward wrote:\n> Hi Rob,\n> \n> It sounds like you're compiling under Mac OS X, not running the\nbootable \n> Linux CD -- is that right? \n\n\nYes - OSX - I Downloaded from the Radiance website\n version 3.4\nI actually DL'd both  rad3R4.tar.gz  and  radbin_osx.tar.gz\nBut it sound like I didn't need the rad3R4, since it has already been\ncompiled as radbin_osx?\n\n\nI DL'd and unpacked all the files in a radbin_osx  folder\n\n\nAre you saying I'm good to go? I didn't need to compile. (I actaully thought\nI was installing, not compiling!)\nI don't plan on doing anything groundbreaking, just poking around and\nlooking at some sample scenes.\n\n\nThanks for all the help.\nLets see if I can get it to work now.\n\n\nRob Fitz\n\n\nOh jeez, if I had studied the error messages (or the subject line) \nbetter, I'd have realized that too.  Sorry!  But I believe the main \nproblem is Terrance's CD is intended to be a free-standing unit, and \ndoes not require compilation of anything.  At least that's the idea, I \nthink.\n\n\n\n\n\n\nRob F., if you *are* in fact running OS X, then yes follow Greg's \nadvice, by all means!  I got a Mac last January specifically to run OS X\n(and in turn, Radiance), and it has changed my life.With OS X and the \npre-compiled binaries, you can quickly get to work with the tutorials \ninstead of jacking around with UNIX sysadminning.\nThat's just one of those newbie things that a UNIX guru assumes is \ncommon knowledge, but isn't.\n\n\nAs for the include files being missing, I discovered to\n> my dismay that Apple's Beta release of X11 doesn't include all the \n> header files and libraries, so it's a bitch to compile things for X11\n\n\n> you have to download these from the XDarwin org website.  I'm just\ngoing \n> to recommend that people use the precompiled binaries if they are not \n> doing development work.\n\n\nBummer.  I was never able to compile Radiance on my Mac, even before the\n\n\nadvent of Apple's X11.  Guess I'll go straight to the binaries for 3.5. \n  (and Rob F., if you go that route, it's still a good idea to grab the \nsource tree and have it around, because there's all kinds of useful \ndocumentation and stuff in there).\n\n\nPS\nGreg, you used my comcast address again!  =8-)\n\n\n\n\n\n\n      Rob Guglielmetti\n\n\ne. rpg@rumblestrip.org\nw. www.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-March/000578.html).</sup>", "attachments": [], "created_by_name": "Rob Fitzsimmons", "created_at": "March 20, 2003 at 01:11PM", "created_by": "Rob_Fitzsimmons", "parent_id": "radiance-general_000575", "id": "radiance-general_000578"}