{"body": "Greg,\n\n\nInspired by Mark Stock's semi-recent post, i am curious if HDRgen could be\ncompiled to work on the Beagle Bone?\n\n\n#####\nhttp://beagleboard.org/Products/BeagleBone\nBeagleBone is an $89 MSRP, credit-card-sized Linux computer that connects\nto the Internet and runs software such as Android 4.0 and Ubuntu. With\nplenty of I/O and processing power for real-time analysis provided by an\nAM335x 720MHz ARM® processor, BeagleBone can be complemented with cape\nplug-in boards to augment functionality.\n#####\n\n\n\n\n>From a search on the HDRI list archive, i found that:\n\n\n##################\n\n\nI managed to compile hdrgen under Lubuntu using VMWare, so if anyone else\nwants a copy, let me know.  I'll send one to Axel since it's a little more\nrecent version of the code (I think).\n\n\n-Greg\n\n\n##################\n\n\nIn summary, i plan to procure a Beagle Bone, install Ubuntu and Radiance,\nand include hdrgen to complete the setup if you can supply me with a copy.\n\n\n\n\nMy interest here is in using a CCD camera to capture bracketed sets of\nimages, composite and analyze them on the Beagle Bone (via Radiance and\nHDRgen),  then use the information to thoughtfully control lighting and\nshading systems in a physical space.\n\n\nThis plea may have more appropriately been made on the HDRI list, but i\nwanted to add it to the current topic of Radiance paired with tiny low-cost\ncomputers.\n\n\nIf others have comments or suggestions on the viability of this effort i\nwould be grateful to hear them!\n\n\n-Kyle\n\n\n\n\n\n\nKyle Konis, AIA, Ph.D\nAssistant Professor\nSchool of Architecture, WAH 204\nUniversity of Southern California\nLos Angeles, CA 90089-0291\nhttp://arch.usc.edu/faculty/kkonis\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2013-June/009556.html).</sup>", "attachments": [], "created_by_name": "Kyle Konis", "created_at": "June 19, 2013 at 05:23PM", "created_by": "Kyle_Konis", "parent_id": "radiance-general_009482", "id": "radiance-general_009556"}