{"body": "Hello Greg,\n\n\n> I tend not to use the -x option for critical work, as it's mostly a time-saver as opposed to a way to improve accuracy.\n>\n> That said, the value range I consider \"safe\" extends from 27 to 228 in the 8-bit domain.  I have found this empirically to be above the noise floor (provided the ISO setting is not too high) and below where some cameras introduce highlight roll-off.\n\n\nInteresting. Will have to update the heat map on WebHDR, then. It's\nset to 20 and 200 at the moment.\n\n\n> I cannot use a strict cut-off for image values.  Up to 0.2% of the pixels below the minimum are ignored and 0.05% of pixels above the maximum, likewise.  This avoids issues with stuck pixels, which would otherwise make the -x option useless.  This is also why it is better not to use -x for critical work, because you may lose the peak highlight in your image if it happens to be very small.\n\n\nThis is probably what happened with my sequences. Since hdrgen copes\nadmirably with completely black frames (as far as the human eye can\ntell), it's probably best to use them all, rather than make a\npre-selection.\n\n\n> Note also that hdrgen would never discard an input exposure off the end because it was \"in range.\"  Only the exposures shorter than first one below the safe maximum and the exposures longer than last one above the safe minimum that are considered superfluous.\n>\n> I have a Lubuntu installation running under VMWare with gcc version 4.6.1-9ubuntu3.  I could use it to recompile hdrgen if you like, but I'm not sure what machines it would run on....\n\n\nThat would be absolutely super-fantastic. I understand from\nhttp://www.hdrlabs.com/news/index.php?id=8369771879810293991\nthat the ghost removal in Photosphere is now second to none, and that\nit can even handle breaking waves and swaying palm trees on tropical\nbeaches. This is really exciting!\n\n\nI volunteer to update the man page, if you like.\n\n\nThank you so much\n\n\nAxel\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2012-February/000379.html).</sup>", "attachments": [], "created_by_name": "Axel Jacobs", "created_at": "February 27, 2012 at 11:42PM", "created_by": "Axel_Jacobs", "parent_id": "hdri_000377", "id": "hdri_000379"}