{"body": "Hi Jan,\n\n\nThank you for the clarifications. It all makes much sense and it¹s good to\nknow that the filling option was developed for those particular projection\nconditions. I totally understand that if I¹m the only user with this problem\nit does probably not worth your time to add that to Evalglare.\nBut that also means that there is no reason why I could not use the DGP\nformula to make the calculation of a fish-eye image with these\ncharacteristics elsewhere, correct?\n\n\nI wanted to check with TechnoTeam, again, before getting back to you about\nthe specifications of my system. And indeed according to them my projection\nis of an equidistant-type with a view angle of 172.\n\n\nI noticed that my vertical eye illuminance measurements have a bit of a time\noffset from the pictures, so really not appropriate to check for the\ndeviation. I¹ll get new values to test next week. But this also involves\nusing a newly created TechnoTeam¹s Radiance exporter which it is still under\nvalidation\u008aso there are few things to get right in order to make this test\npossible. I will get back to the list when I have a conclusion.\n\n\nI¹ll see if I can still come to Velux\u008aI had to make a choice because there\nare so many other important events that one can attend this year. But it\nwould be really important to discuss this with you and the other PhDs.\n\n\nBest Regards\n\n\nRaquel\n\n\n\n\n\n\nRaquel Viula\n\n\nPhD candidate\n\n\n\n\n\n\nTU Delft | Faculty of Architecture and the Built Environment |\n\n\nArchitectural Engineering and Technology\n\n\nJulianalaan 134, 2628 BL Delft, The Netherlands | P.O. Box 5043 2600 GA\nDelft\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2017-March/012073.html).</sup>", "attachments": [], "created_by_name": "Raquel Viula", "created_at": "March 17, 2017 at 01:05AM", "created_by": "Raquel_Viula", "parent_id": "radiance-general_012064", "id": "radiance-general_012073"}