{"body": "Hi Mark,\n\n\nI had something similar occur, however the scene was very different. In \nmy case there was a cloud moving past a building. With automatic \nalignment turned on (default behavior) I got a result similar to yours. \nIt seemed like the program was tracking on the brightest \"source\" in the \nset of exposures. I wonder during the time that you took your exposures \nwas there a big change in the daylight coming into the space? What \nhappens if you turn alignment off (-a included in the command line)?\n\n\nOr alternatively, are you sure that you are passing only the exposures \nyou want to hdrgen? I have done this in the past where I will take a set \nof exposures and part way through shooting the set I realize that I \nscrewed something up so I will start over and in the process may change \nthe camera position. However I forget to delete the previous set from \nthe folder, so they get passed along to hdrgen as well.\n\n\n-Jack\n\n\nMark Stock wrote:\n> Folks,\n>\n> I just used the Linux version of the hdrgen program, and there appears \n> to be a systematic error somwhere.\n>\n> My first attempts were handheld, and alignment always failed. My \n> attempt today was using a tripod in my living room, and the alignment \n> error is very regular:\n>\n> http://mark.technolope.org/transfer/dscn6880pfilt.jpg\n>\n> This was done with:\n> hdrgen dscn68??.jpg -o test.pic -r cam.rsp\n> pfilt -1 -x /2 -y /2 test.pic | ra_ppm | cjpeg -q 90 > dscn6880pfilt.jpg\n>\n> uname -a gives:\n> Linux localhost.localdomain 2.4.22-1.2115.nptl #1 Wed Oct 29 15:42:51 \n> EST 2003 i686 i686 i386 GNU/Linux\n>\n> Is there anything I can do about this?\n>\n> Mark\n> mstock at umich.edu\n>\n> _______________________________________________\n> HDRI mailing list\n> HDRI at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/hdri\n>\n>\n\n\n\n\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2006-August/000133.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "August 20, 2006 at 10:32PM", "created_by": "Jack_de_Valpine", "parent_id": "hdri_000132", "id": "hdri_000133"}