{"body": "Your website is not set up correctly to view the images -- I had to\ngo into the HTML source in order to get the correct URLs for the referenced\nimages.\n\n\nCarsten's suggestion of using the -DMC build option will alter the\nappearance of these artifacts, but will not eliminate them.  My guess\nis that the sampling noise you are seeing here  arises from specular artifacts\nrather than source sampling, which is why altering the -d* options did\nnot correct the problem.  Unfortunately, there are no quick fixes for\nspecular sampling noise, but I can offer some suggestions:\n\n\n1) Make sure only metallic surfaces have specular components greater than 0.06\n2) Increase the basic sampling rate (i.e., use greater initial resolutions in \nrpict and greater picture reductions in pfilt)\n3) Decrease the value of the -sj parameter.\n4) Increase the value of the -st parameter.\n\n\nThe use of low-discrepency sequences is a widely recognized means to\nimproved Monte Carlo convergence rates, and this is what Radiance\nuses by default.  The -DMC option switches over to a \"pure\" Monte\nCarlo approach, which requires longer to converge to an average but\ndoes not contain any visible patterns in its noise.\n\n\nI hope this helps.\n-Greg\n\n\n------------ Original Message -----------------\n\n\nRADIANCE RENDERING ARTIFACTS PROBLEM - SEVERE GRAIN IN INDIRECT =\nILLUMINATION\n\n\nPlease can any Radiance users assist with a rendering error on an =\narchitectural illustration project.\n\n\nSevere grain appears in a Radiance render where indirect illumination =\nstrikes an interior floor, similar to a moir=E9 pattern. Some grain in =\nRadiance images is easily corrected with PFILT using down-sampling and a =\nradial blur filter, but the artifacts encountered were too severe for =\nthis to be effective.\n\n\nPlease visit my Internet Site :\nwww.daiservices.btinternet.co.uk/Radiance/Radiance_v3_5_UNIX/Render_Tests=\n/Radiance_render_grain_error_01.htm\n to assess images of the problem.\n\n\nKind regards\n\n\nDigital Architectural Illustration Services\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000705.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "May 05, 2003 at 12:47AM", "created_by": "Greg_Ward", "parent_id": "radiance-general_000699", "id": "radiance-general_000705"}