{"body": "Hey Rob,\n\n\nWould you be willing to share experience with Revit to Radiance? What \nwhere the main problems that you encountered?\n\n\n-Jack\n\n\nRob Guglielmetti wrote:\n> Jack de Valpine wrote:\n>> Hi Thomas,\n>>\n>> Well that is interesting about Sketchup models. And to clarify, my \n>> experience has really been in trying to take client built sketchup \n>> models and get them into something useful. So my experience biased by \n>> big not very well built/organized models provided by others. I guess \n>> the thing that I am glad to hear is that like any modeling tool, if \n>> well used and controlled, you can get something useful out of it. \n>\n> Yeah, I got two models recently, one built in SketchUp and the other \n> in Revit (same project, same model extents), and the Revit one was \n> literally unusable in AutoCAD, much less Radiance.\n>> I would certainly be interested in trying your translator if and when \n>> you feel it is ready to share.\n> As a very recent licensee of SketchUp Pro, I too would be interested \n> in your translator, Thomas!  I'd also like to hear (maybe off-list) \n> your thoughts on how to model accurately in SketchUp, since it seems \n> to still lack direct coordinate input, UCSs, and the object snaps seem \n> a little lean compared to ACAD...\n>\n> - Rob\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n\n\n\n\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2007-October/004511.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "October 23, 2007 at 12:54PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_004494", "id": "radiance-general_004511"}