{"body": "Hi Jack!\n\n\nIt is a highly detailed model of an antique church with awful materials. \n  The rendering is done on the cluster, but the rendering time of 2 \nweeks is per cpu.\n\n\n> Yes, you can do this but NOT for all ambient parameters.  You should be \n> able to make some adjustments to  aa, ad and as, for example:\n> \n> overture calc: -aa .15 -ad 1024 -as 512\n> image:            -aa .25 -ad 512 -as 256\n\n\nThat was what I wanted to do, as it will save a lot of time (I have 70 \nimages to render, and if only the ouverture needs high ambient settings, \nfollowing images will render much faster.\n\n\n> How many ambient bounces are you using? I think for an interior scene \n> with illums at the window openings you should be able to set -ab 1....\n\n\nYes, I am playing with 2 bounces at the moment, but then it is \nimpossible to get results. I used -ab 1 before. I already have exlde \nlists for the ambient calculation. The glow for illumination is a nice \nidea, if I just want to see the position of light sources. But if they \nare to illuminate the scene?\n\n\nI was thinking of making even heavier use of mkillum. First, bundling \nthe light sources, so that there will be hundreds, not thousand, at \nleast in the indirect calculation. Than it may make sense to divide the \ninterior with illum panes, so that e.g. the light contributed from the \ngalleries to the main room is precomputed by mkillum. Finally I may end \nby dividing the whole scene in virtual rooms seperated by illum panes?\n\n\nIs there a patch for current radiance that allows an alternative \nmodifier (like void) for the indirect calculation? That is available in \nRadzilla and might be very helpful, as I have colorpict maps on most \nsurfaces.\n\n\nThanks & CU Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-September/003995.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "September 15, 2006 at 09:12AM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_003983", "id": "radiance-general_003995"}