{"body": "Rob Guglielmetti wrote:\n\n\n> ...\n>\n>> Then, something I always thought was a hole missing from Radiance, \n>> and perhaps is really just a limitation in my own radiance knowledge \n>> is this.  All other lighting programs that I am aware of allow you to \n>> place calculation grids, run calcs, and then display the grid point \n>> results in relation to the calculation model (though most can't \n>> do false color images).  Most programs will even export the results \n>> to DXF for incorporation into CAD programs.  It seems rshow can do \n>> some of this?\n>\n>\n> Agreed, it's a missing link.  There are a few examples of using the \n> cnt utility to create a grid, but it's not point and click.  rshow is \n> supposed to have this functionality but I have not been able to \n> compile that on my machines yet.  Certainly anyone with programming \n> savvy could rwite something to place the calculated values (derived \n> from rtrace and a supplied, cnt-generated grid of points) on a \n> Radiance image, but it would have to be written.  That PAB paper sums \n> it up the best, something about Radiance's greatest strength is also \n> its greatest hindrance.  The open, unix toolbox approach to the suite \n> allows for incredible flexibility, but you gotta roll up your sleeves \n> and build the tools yourself.\n\n\nrshow offered (offers, once I finally get the new version sorted out) a \ndisplay of 2D grid values together with the 3D Radiance scenery. It also \ngenerates such a grid inside a planar surface which is defined by an \noffset from a Radiance polygon.  There's no export to CAD format, as \nrshow is intended to be a visualization tool and tries hard to stay away \nfrom any CAD feature.\n-Peter\n\n\n\n\n pab-opto, Freiburg, Germany, http://www.pab-opto.de\n [see web page to check digital email signature]\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-May/001766.html).</sup>", "attachments": [], "created_by_name": "Peter Apian-Bennewitz", "created_at": "May 31, 2004 at 09:32AM", "created_by": "Peter_Apian-Bennewitz", "parent_id": "radiance-general_001733", "id": "radiance-general_001766"}