{"body": "Hi Thomas,\n\n\n\n\nTo compare the effect of a new design with an existing situation you could\n> just create two images (before and after) and subtract the \"before\" image\n> from the \"after\".\n>\n\n\n\n\nFirst thing that I've tried when started working on this problem is\nsubtraction of images 'before' and 'after'. It gave me nice light patch,\nbut also some other bright pixels on the edges of the area where direct sun\npatch was - because of randomness of Radiance calculation (I suppose) .\n\n\n>\n> Appart from that I think you should use a mirror material for your\n> reflector. If it's not a flat surface use a reasonable geometric\n> approximation. It will look different but probably will still give you the\n> right idea about the effect. If you are only interested in the direct\n> reflection of the sun (single virtual light source per mirror polygon) you\n> should be able to render the scene even if you have a lot of mirror\n> surfaces.\n>\n> To eliminate the sky (direct or indirect) remove the sky and ground\n> definition from the sky file (you are already doing that).\n>\n\n\n Surface is flat so I've put mirror, and I removed sky/ground.\nProblem is how to get rid of the direct sun and keep reflected one.\n\n\nI tried rtcontrib but all contribution go to the sun. Thats why I'm using\nmkillum to make my mirror deflector separate light source (with l+ option).\nAfter that I get nice light patch from deflector, but also some light\naround (which shouldn't be the case since I use -ab 0 -av 0 0 0).\n\n\n\n\n> If you are not set on a \"black and white\" footprint of the reflection you\n> could also use a coloured mirror (say red) and use only white/grey\n> materials. Your reflection will show as a red patch while direct sunlight\n> will still be white.\n>\n>\nYes good idea, I've tried it also and it works - so If I don't find some\nway to do it nicely in black-white, I'll go to solution.\n\n\nThanks again,\nMarija\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2011-December/008297.html).</sup>", "attachments": [], "created_by_name": "Marija Velickovic", "created_at": "December 15, 2011 at 12:27AM", "created_by": "Marija_Velickovic", "parent_id": "radiance-general_008289", "id": "radiance-general_008297"}