{"body": "That's right, you can use the geometry fields to describe the shape of the \"luminous opening\" as it says in the IES doc (LM-63). These change the geometry, but do not at all affect the luminous flux. By changing the geometry fields you can end up with a decent approximation of the illum bounding box or sphere you need. With the lampcolor utility, you can get reasonable values for the glow materials you need to apply to the proxy lamp or lens geometry you have contained by the illum(s). Finally with proper use of the cal files (lboxcorr et al.) you can essentially map the candelas to the illums. So there's a bit of hand editing required after the initial IES2RAD step if you really want the appearance of the luminaries to be proper.\n\n\nOn 11/13/15, 8:33 AM, \"Christopher Rush\" <Christopher.Rush at arup.com<mailto:Christopher.Rush at arup.com>> wrote:\n\n\nIf you want to try Thomas' recommendation, look in the IES file for a pair of lines just below the header that look like this. I'm borrowing the example out of Ian Ashdown's \"Thinking Photometrically Part II\" which you can easily find online.\n1 50000 1 5 3 1 1 .5 .6 0\n1.0 1.0 495\n\n\nIn that example the 50000 represents number of lumens (now sometimes noted as -1 for LED luminaires tested differently), 495 represents number of Watts, and the values 0.5, 0.6, 0 represent the X, Y, and Z dimensions of a rectangular luminaire. In some cases, certain dimensional values could be given as negative, which signifies various types of rounded shapes for interpretation by software.\n\n\nYou can freely change the XYZ values in the IES file without affecting the data. Only when you import the IES file through IES2RAD (or into Dialux, AGI, etc.) does software interpret the dimensions and apply the brightness functions across the appropriate surface areas given by the dimensions.\n\n\n-Chris\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-November/011344.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "November 13, 2015 at 07:59AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_011161", "id": "radiance-general_011344"}