{"body": "Hi Terrance,\n\n\nI remember having to deal with this a while back, but I do not recall \nexactly the solution. Nevertheless here are a couple of things to look at:\n\n\n   1. ssh - you may need to set the environment for ssh, when used this\n      way (eg ssh command_to_run) it does not use the PATH information\n      found for your standard login shell, you can set the correct PATH\n      and RAYPATH. This is done in an \"environment\" file for ssh, check\n      the man page for ssh for further information.\n   2. host specification\n         1. explicit path in hosts specification- I think that you might\n            want try specifying an explicit path (rather than ~) to the\n            location where the host needs to look for the animation\n            related files. Not sure if it makes a difference, you may\n            need to try out the following as tests:\n               1. relative to user home dir - ../../../path_to_render_dir\n               2. path from root - /path_to_render_dir\n         2. mount point - I seem to recall that the easiest thing to do\n            is have the mount point and user be the same on master and\n            slave nodes. So if you are mounting to /RENDER which is what\n            your slave (render host) nodes see then you should have this\n            in your path on the master node. This way you can just cd to\n            /RENDER on the master node and run  ranimate job.ranim and\n            have master and slave nodes seeing the same directory\n            hierarchy. And this way you do not need to specify path or\n            user in the host specification, eg host= render-host 1\n            rather than host= render-host 1 path_to_render_dir alt_user\n         3. different users - wouldn't it be easier to just have the\n            same user replicated onto the slave nodes?\n   3. samba - I am not sure about this, I have never really been clear\n      on the difference between the file locking protocols between samba\n      and NFS, I guess I will be interested to hear if this works or\n      note, however you may end up needing to use NFS.\n\n\nHope this helps.\n\n\n-Jack\n\n\n\n\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-March/006623.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "March 08, 2010 at 08:06AM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_006621", "id": "radiance-general_006623"}