{"body": "I must say that I agree with Rob, however, a short answer that might help.\n\n\nFor evaluating illuminance levels in a space with different CFS you,\nstrictly speaking, DO NOT HAVE TO do anything. You may choose between\ndifferent methods that have some pros and cons.\n\n\n\n\n*ray-tracing*\n\n\n   - Requires ray-tracing for each time-step and each system, which is slow\n   (*four systems simulated annualy in an hourly basis --> 4*8760 = 35,040\n   simulations*.)\n   - As accurate as it gets, if options are defined correctly.\n\n\n\n\n*2 phase method*\n\n\n   - Do not need the BSDF\n   - Requires ray-tracing for each CFS (*4 systems --> 4 ray-tracing\n   simulations*)\n   - After ray-tracing, annual simulation is fast.\n\n\n*3-phase method:*\n\n\n   - Requires BSDF data in KLEMS basis, which may be slow to compute,\n   unless it can be exported from WINDOW, for example, or such data has\n   already been calculated (the idea is to make a database, I think).\n   - Does not really work well for specular systems (Klems patches are too\n   big)\n   - Requires 2 ray-tracing runs, always (*4 systems --> 2 ray-tracing\n   simulations*)\n   - After ray-tracing and BSDF calculation, annual simulation is fast\n\n\n*5-phase method:*\n\n\n   - Requires BSDF data in KLEMS  basis AND/OR Tensor tree format, which\n   may be slow to compute, unless it can be exported from WINDOW, for example,\n   or such data has already been calculated (the idea is to make a database, I\n   think).\n   - Works well for specular systems\n   - Requires 4 ray-tracing runs + 1 for each system, always (*4 systems\n   --> 4+1 = 5 ray-tracing simulations*)\n   - Hard to code...?\n   - After ray-tracing and BSDF calculation, annual simulation is fast\n\n\n\n\nI would not say there is a recipe. If you have to choose between 1 or 2\nCFSs, maybe it is faster to just draw them and use the 2 phase method (or\nray-tracing if an annual simulaton is not required). On the contrary, if\nyou are going to test 10 different CFSs, 3 and 5 phases may make sense,\nsince you reduce the expensive ray-tracing calculations... However, this\nwill also depend on weather you have the BSDF data AND/OR if it makes sense\nto calculate it and store it AND/OR if you intend to simulate a dynamically\ncontrolled CFS.\n\n\nBest!\n\n\n2015-07-09 14:29 GMT-03:00 Guglielmetti, Robert <\nRobert.Guglielmetti at nrel.gov>:\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-July/011108.html).</sup>", "attachments": [], "created_by_name": "Germán Molina Larrain", "created_at": "July 09, 2015 at 11:56AM", "created_by": "Germán_Molina_Larrain", "parent_id": "radiance-general_011104", "id": "radiance-general_011108"}