{"body": "Hi Guys,\n\n\nI am continually impressed by the quality of support this group offers!  \nThey even caught the little mistake I included  in my example, which Rob \nso dutifully copied, where I forgot the second index variable:\n\n\n> as Georg has said, all your y values are the same possibly placing your\n> measuring point in the wall somewhere.  try adding a '*$2' into your y\n> definition, as below.\n>\n> cnt 15 30 | rcalc -e\n> '$1=(144-6)/(15-1)*$1;$2=(168-6)/(30-1)*$2;$3=30' \\\n> -e '$4=0;$5=0;$6=1' | rtrace -I -h [options] octree \\\n>   | rcalc -e '$1=179*(.265*$1+.670*$2+.065*$3)' >\n> output.dat\n>\n> good luck!\n> Phil Greenup.\n\n\nThe only thing we all missed is that the rillum script does exist in the \nUnix distribution -- it's just called \"rlux\".  It wasn't until schorsch \npointed out the contents that I recognized it.  I thought rillum might \ndo something more than this.  Anyway, there is also a program called \n\"dayfact\" which can generate false color images of the workplane \nilluminance (as well as daylight factor contours), and that might be \nuseful in this situation.  It's also interactive, which means a little \nless command-line coding for the \"pathetic novice.\"\n\n\nRegarding calculation options, you can use rad directly to do what \nschorsch was suggesting with cut and paste:\n\n\n% rad scene.rif OPTFILE=render.opt\n% ... | rtrace @render.opt [other options] octree | ...\n\n\nIf you like, you can put the OPTFILE definition right in your scene.rif \nfile, then you'll always have this file handy when you need it.  Rad is \ncareful only to put options that are understood by all the renderers \ninto this file, rtrace, rpict, and rview.\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-May/000270.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "May 24, 2002 at 08:07AM", "created_by": "Greg_Ward", "parent_id": "radiance-general_000258", "id": "radiance-general_000270"}