{"body": "On Feb 2, 2006, at 10:30 PM, Greg Ward wrote:\n\n\n> Hi Mark,\n>\n> I thought I had explained this at some point, but I guess not....\n\n\nSorry, you explained it in your introductory post on this software...  \nthe problem would just be me not reading everything in the archives  \nwhen I finally get the app up and running.\n\n\n> CanonHDRcap works as you surmised, but only looks at the image  \n> thumbnails, not the whole image (which would take too long).  As a  \n> result, it doesn't always pick the right exposure to start with --  \n> if your bright spot takes up less than a pixel in the thumbnail, it  \n> may choose a shutter speed that's slower than it should to start.\n\n\nHmmm... so is there any way in the Canon SDK for CanonHDRcap to look  \nat the thumnails *without* transferring the full-res files from the  \ncamera over the USB/Firewire cable? For the ones it \"keeps\" it would  \nsimply be writing them to the CF card for later conversion to HDR.  \nThis would speed things up for those of us with the low-end cameras,  \nbut also for the high-end cameras that can knock out 8+ frames a second!\n\n\n>\n> The application actually keeps the exposure right before the one  \n> that was blown out, so sometimes you can capture this by setting a  \n> *larger* search step.  This also makes the capture sequence  \n> faster.  You may end up with a bit of a jump between the shortest  \n> exposure and the next-longest, but you're more likely to capture  \n> that peak.  I wouldn't recommend a search step greater than 4, in  \n> any case.\n\n\nOkay, that explains the unusual HDRs produced from my experiments  \nwith 5 and 6 search steps! I was curious as to the 'jump\" at the  \nstart of the series.\n\n\n>\n> I could be persuaded to add a parameter for the starting shutter  \n> speed.  If set to some positive value, CanonHDRcap would then start  \n> from the specified speed rather than doing its search.\n\n\nThat sounds great for those situations where the range is already  \n\"known\" and repeatability is required (and I run into that all the  \ntime). Actually, what would be great would be for a way in the  \nCanonHDRcap.out screen to have it pause at the end of a cycle and  \nthen accept a keystroke to either \"repeat\" the series of shots it  \njust did with no searching (for multishot panoramas, stitched ultra- \nres images, or the off-axis shot of a mirrorball), or to \"restart\"  \nthe process (allowing time for on-camera adjustments like aperture,  \nISO, etc.).\n\n\nAnd then it would also be great to let CanonHDRcap do its magic and  \nfind the best starting point and proceed up until it either hits the  \n# of exposures specified, or a shutter speed specified as an \"ending  \nlimit\" (to avoid those 15 sec. exposures).\n\n\nOf course, the basics are already there (and it works great so far)  \nso really these are situation-specific requests. Thanks a lot for  \nthis, Greg. It really will be a time-saver!\n\n\n-Mark\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2006-February/000057.html).</sup>", "attachments": [], "created_by_name": "Mark Banas", "created_at": "February 03, 2006 at 05:30AM", "created_by": "Mark_Banas", "parent_id": "hdri_000055", "id": "hdri_000057"}