{"body": "Hi Zhe and Raquel,\n\n\nmy thought on this below...\n\n\nBest regards\n\n\nAxel\n\n\nOn 01/03/17 18:27, Raquel Viula wrote:\n> Hi Zhe,\n>\n\n\n> 3) Does lighting source influence the accuracy of the factor? Focusing\n> on daylighting data collection, should I take images under consistent\n> electric lighting conditions or daylighting conditions? (Daylighting\n> conditions have dynamic changes, but electric situations offer lower\n> results.)\n>\n> Different light sources will provide different calibration factors. I\n> was told by the seller of my system that a measurement under white LED\n> has errors of 5 to 12% in relation to the measurement done with a\n> halogen-based calibrated camera. But LED has a lot of flicker, doesn’t\n> it?\n\n\nI looked into flicker some time ago, and presented my conclusions in a \npresentation at the 2012 Radiance workshop:\n\n\nhttp://www.jaloxa.eu/mirrors/radiance_workshops/2012/Talks/Jacobs-AJ09-HDR_Radiance_WS-2012.pdf\n\n\nSkip to page 23 for flicker.\n\n\nIn short:  If you are seeing the actual artificial light sources in the \nphotograph, then you need to use short exposure times to capture them \naccurately.  In this case, it is safe to assume that the lights flicker \n(simply because most do, particularly LEDs), and are not accurately \nrepresented in the HDR.  If HDR glare measurement is what you want to \ndo, this is obviously a problem.\n\n\nYou probably won't have the equipment to measure flicker.  What you can \ndo is take 5 to 10 photographs with the shortest exposure time you need \nfor your sequence.  Keep all camera settings the same.  If all \nphotographs look identical in their brightness, the light source is \nflicker free, or flickers at such high frequency or with such a low \namplitude that you can ignore it.\n\n\nHope this helps\n\n\nBest\n\n\nAxel\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2017-March/000625.html).</sup>", "attachments": [], "created_by_name": "Axel Jacobs", "created_at": "March 01, 2017 at 11:42AM", "created_by": "Axel_Jacobs", "parent_id": "hdri_000623", "id": "hdri_000625"}