{"body": "John An wrote:\n> I am currently trying to install Radiance in XDarwin on a Macintosh \n> running Mac OSX 10.2.  I am completely new to UNIX, so my question may \n> be simplistic.  Please bare with me.  If this question is inappropriate, \n> then please let me know, and I will not fill your inboxes.\n\n\nTotally appropriate.  You will find some very intelligent users on ths \nlist, who gratefully don't mind the cooasional beginner question. \nBelieve me, I should know.  I was a LINUX loser for years, barely able \nto copy a file to the location I wanted.  When OS X came out, it made \nlife a WHOLE LOT easier....  and I'm still struggling.  Hang in there. \nMay I recommend \"MacOSX Unleashed\" for a lot of useful info on UNIX in \nthe OS X vein.\n\n\n> I read Greg Ward's response to Galen Burrell, and tried following the \n> direction.\n\n\nI don't have all my old email regarding this installation process, but I \n*did* install Radiance for OSX without compiling.  Twice, in fact. \nProblem is, the last time I did it was a while ago, so I forget a lot. \nI *do* need to get the 10.2 binaries going on my system since I just \nupgraded to Jaguar myself.\n\n\nAs a start may I suggest trying to re-copy the stuff to the correct \nlocations?  Note you should drop down to a shell (load Terminal) and do \nthis from the command line, and do it as root.  Type \"sudo su\", return. \n  You will be asked for the administrator password.  Now you can copy \nthe binbaries to /usr/local/bin.  You also have to copy the library \nfiles, but as Greg mentioned I think if you run the makeall install the \nscript will copy those files where they need to do for you, even if the \ncompile procedure fails.  Doesn't matter, because you can then copy \nGreg's compiled binaries to /usr/local/bin per my instructions above. \nWhen you're done you chould \"change back\" to your normal user by typing \nsudo (username).\n\n\nYou also need to add that directory to your path statement in your \n.cshrc file. Again, I can give mre details as I dig up my old emails on \nthis stuff, but the experts here may beat me to it because they can do \nthis stuff in their sleep (which I find amazing).\n\n\n\n\n\n\n\n\nRob Guglielmetti\nrpg@rumblestrip.org\nwww.rumblestrip.org\n~~~~~~~~~~~~~~~~~~~\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-September/000414.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "September 20, 2002 at 03:51PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_000412", "id": "radiance-general_000414"}