{"body": "Hi Violetta,\n\n\nThere is no \"Radiance.exe\"; there is no manageable way to provide desktop icons for all the Radiance tools. They are intended to be called from the command line interface (CLI). The whole process of getting a Radiance model to produce meaningful results is very tunable, and relies heavily on the unix \"toolbox\" model, where you pass in some stuff on one program, and take the output of that program and send it to another one in the tool chain. It's wholly different from double clicking on an icon and accessing menus, and in my opinion, it's way more fun.\n\n\nThe NREL Windows installer places all the Radiance programs wherever you ask it to. Normally, this is in \"C:\\ProgramFiles\\Radiance\\bin\", or something similar. You need to add this location to your system PATH, and also the \"C:\\ProgramFiles\\Radiance\\lib\" directory to an environment variable called \"RAYPATH\".  There are other posts on this list and on the internet(s) that describe how to set these environment variables, if you are not familiar. Once these things are done, you would call the tools you need directly from the CLI, e.g.:\n\n\noconv.exe my_model.rad > my_model.oct\nrcontrib.exe [options] my_model.oct | etc...\n\n\n- Rob\n\n\n\n\n\n\nOn 7/14/16, 11:06 AM, \"Violeta Escobar Ruiz\" <viole.esc at gmail.com<mailto:viole.esc at gmail.com>> wrote:\n\n\nHello!\nI can't run Radiance on my computer. I must be doing something wrong...\nThis is the link where I downloaded it:  https://github.com/NREL/Radiance/releases\nI have tried with this: radiance-5.0.0-win64.exe<https://github.com/NREL/Radiance/releases/download/5.0/radiance-5.0.0-win64.exe>\nIt seems like I install it normally but then I just can't find the acces to the program.\nWhen I ask fot the desktop acces it installs an acces to Autocad.\nIs that ok??\n\n\nThank you\n\n\n\n\n2016-07-01 0:20 GMT-05:00 Greg Ward <gregoryjward at gmail.com<mailto:gregoryjward at gmail.com>>:\nHi Violeta,\n\n\nUnfortunately, the command-line tools in Radiance are difficult to use if you are not used to them.  I am not sure what options Axel Jacobs uses for WebHDR, but you can try the following:\n\n\nfalsecolor -s auto -i input.hdr | ra_tiff - falsec.tif\n\n\nThis will result in a linear luminance scale.  If you want a log scale with 1000:1 range (10^3:1), use:\n\n\nfalsecolor -log 3 -s auto -i input.hdr | ra_tiff - falsecl.tif\n\n\nIf you have a Mac, you can download Photosphere, which has a more familiar application GUI from:\n\n\nhttp://www.anyhere.com/\n\n\nBest,\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-July/011853.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "July 14, 2016 at 10:25AM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_011823", "id": "radiance-general_011853"}