{"body": "Originally written by Rob Guglielmetti:\n<I>Sorry to say, but that book is not out of stock, it's out of print \n(well, OK it's out of stock too, but permanently).  The authors have \nobtained the copyright from Morgan Kaufman, and are looking for a new \npublisher, but so far no joy.  My co-worker tried ordering direct from \nMK and they told him the same \"out of stock\" thing, but no new copies \nare coming out of MK. A couple of enterprising souls were selling copies \non Amazon.com for something like $300USD!  =8-(  Hopefully, Greg will \nfind a new publisher or some other means of distrubition; it's such a \nvaluable piece of the Radiance toolkit.</I>\n\n\n\n\nI had run across some threads discussing trying to find a new publisher, but thought that the situation had been resolved, since Elsevier Science happily took my order.  When I called to inquire about my order, they confidenctly said that they would have the book in stock on May 1st.  Is there any way that I could temporarily get my hands on the book in the meantime?  Is there anyone in the Boston area that would be willing to lend me their book?  After years of hearing how great Radiance was, I finally got the courage to jump in and to learn to use this program.  The lack of availability of Rendering with Radiance has put a HUGE damper on my plans (though I am still determined to use it for my dissertation).\n\n\n\n\nOriginally written by Rob Guglielmetti:\n<I>That happens when you have an irregularly shaped polygon that is defined \nas an illum.  \"L-shaped\" polys and triangles are the kinds of shapes I'm \ntalking about here.  Break it up into more rectillinear forms and you \nshould see that problem go away.</I>\n\n\n\n\nI see.  Thankfully, I only have 4 or 5 windows in my scene.  I dxfed my model from a wondering modeling program called Sketchup (the most intuitive modeling program I've come across), and had been meaning to optimize the .rad file, but didn't realize that the excessive polygons would impact the calculations.  Does this mean that I should optimize (de-triangulate the rectangles) for all surfaces if I want accurate calculations?\n\n\nThanks for your response.\n\n\nPlease, if anyone can help me out with getting my hands on Rendering with Radiance, I would truly appreciate it.\n\n\n\n\n\n\nJohn An\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000674.html).</sup>", "attachments": [], "created_by_name": "John An", "created_at": "April 30, 2003 at 06:02PM", "created_by": "John_An", "parent_id": "radiance-general_000672", "id": "radiance-general_000674"}