{"body": "> ok, thanks for the information! I think I'll try a more professional \n> modelling tool.\n> \n> I was thinking that maybe there was a way to interpolate normals and find \n> each normal per pixel.. so I supposed that lighting would be smoother.\n\n\nHi!\n\n\nSo-called smooth rendering is a topic again and again. In fact, many\nmodeling apps provide some kind of smooth rendering, but still there are few\nways to get such smooth models from one polygon-based app to another.\n\n\nThe only way I found to work reasonable well is using \"fixed-angle\"\nsmoothing together with 3ds or obj formats. This will make most modelers\nforget all normals (also the wrong surface normals ;-) and generate the\ninterpolated normals for export if the angle between surfaces is over a\nvalue you have to specify. I am using this with success in formZ. You may\nhabe to \"mesh\" the objects before you export them, as sometimes, the\ncalculation of the interpolated normals works only on triangles, at least\nflat polygons. I usually triangulate everything, than export as obj with\n\"smoothed\" interpolated normals support from formZ.\n\n\nThe other problem that may arise is that your model's geometry is not clean.\nIn radiance, you need \"watertight\" models, that means you have to work\naccurately. If there is a gap between surfaces, even if small and almost\ninvisible, this produces errors. E.g. the interpolation described won't work\nwhen exporting, and, worse, you will have light leakage, getting light where\nit should not be in the model. So the model quality (as in all simulations)\nis really important.\n\n\nYou might find a lot of information about clean meshes if you google for\nmesh generators, as they are used in industry for building \"real\" physical\nmodels, e.g. by litografie, 3d-printing, cnc... These processes need clean,\nmeshed models, and there is a huge amount of tools available to produce and\nprocess mesh geometry.\n\n\nThe key problem is that all importers for radiance support more or less\nprimitive types. There is no support for nurbs, and many formats even reduce\neverything to polygons. Radiance itself doesn't only support \"flat\"\nsurfaces, however, this won't help if you can't import e.g. a ball as a\nball, but only as a mesh following its surface, or write the radiance scene\nwith your favorite text editor ;-) The lack of support for these more\ncomplicated objects is related to radiance's application, which is\nsimulation of buildings - and most of our built environment is made of\npolygonal surfaces ;-)\n\n\nCU Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-March/002558.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "March 27, 2005 at 09:30PM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_002556", "id": "radiance-general_002558"}