{"body": "Hi Chas,\nYou are right, I try to calculate light distribution of luminaires. I can do\nit for diffuse luminaires using Radiance. It works for luminaires with\ndiffuse reflectors and luminaires with diffusers (thanks Greg fur such\nwonderful stuff). You can see Desktop Radiance Tutorial How to Calculate\nLuminaires Using Radiance (only in Polish):\nhttp://lumen.iee.put.poznan.pl/kw/oprawy/p-opr.html\n\n\nThis tutorial is for my students. They have exercise at fifth year of study\nand make project of luminaire using Radiance. Now three of them try to take\nMaster of Science and their subjects are connected with calculation of\nluminaires using Radiance. One of them try to calculate light distribution\nof specular reflectors. It is possible to do it with Radiance. When we want\nto use backward ray tracing method we look for Figure of Bright Points at\nthe surface of reflector. This is area where we can see image of lamp (light\nsource). This is very simple to calculate but the problem is that when we\nuse Radiance we have to divide reflector's surface into very small\nelementary surfaces. Each of these elementary surfaces should be smaller\nthan dimension of lamp (light source). This is the reason why I build my\nreflector with 15750 pieces.\nParabolic mirror reflector produces parallel beam (with point source placed\nat focus) and none of polygons can see each other. Generally most of mirror\nreflectors are build in such way.\n\n\nUnfortunately I can't make my calculation with 15750 polygons. Greg, thanks\nfor your advise. I can start oconv process only at -r 389376 but after 3\nhours I get:\n\n\nOut of memory in emalloc (when I use Desktop Radiance)\n\n\noconv: system - out of octree space (when I use Radiance)\n\n\nBest regards,\nKrzysztof Wandachowicz\n\n\nPolitechnika Poznanska, Instytut Elektrotechniki Przemyslowej\nZaklad Techniki Swietlnej\nhttp://lumen.iee.put.poznan.pl/kw/\n\n\n\n\n----- Original Message -----\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-April/000662.html).</sup>", "attachments": [], "created_by_name": "Krzysztof Wandachowicz", "created_at": "April 22, 2003 at 04:21PM", "created_by": "Krzysztof_Wandachowicz", "parent_id": "radiance-general_000660", "id": "radiance-general_000662"}