{"body": "> > easier application of picture mapping\n> try to include the picture/texture mapping and the object on which it is\n> mapped in one file. When placing this file with xform to an arbitrary\n> position and orientation, the mapping function gets transformed\n> automatically as well\n\n\nMartin, have you checked out the \"arbmap.cal\" file included\nwith Rayfront? That normalizes the *orientation* of image\nmaps in space, so that they are always mapped flat onto the\nrespective surface. Of course you still need to make sure\nthat they appear at the right location in space (unless it's\na global mapping).\n\n\nIn general, the best approach for location specific mappings\n(pictures hanging at the wall) is to create a seperate file\nwith the picture sufrace, and possibly the frame etc. Peters\ngenpic program does a nice job there for most situations.\nThen transform that file to the right location, geometry,\nmapping, and all.\n\n\nRayfront includes genpic binaries, and the \"parts\" mechanism\nprovides an easy way to place external objects in the scene.\nAnd no, this is not all cheap advertizing, Martin maintains an\neducational Rayfront license at PSU (whether he actually\nuses it is another question, of course... ;)\n\n\n\n\n> > reliable smoothing functions\n> the smoothing option in e.g. gensurf (-s) works very well. I don't have\n> any experience in cases when polygon meshes are imported from CAD\n> programs, although I already thought about an independent smoothing\n> process which could be let loose on any given polygon set.\n> Question: does the smoothing generally get lost when importing stuff\n> from, say, Autocad ?\n\n\nYes. That may eventually change once I have understood how\ngensurfs smoothing actually works (doesn't seem to bee too\ncomplicated, just that I didn't have the nerve to dig into\nthe topic yet).\n\n\nIt seems that Ole Lemmings ConRAD preserves smooting when\nconverting from 3D-Max files.\n\n\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch.com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-October/000437.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "October 16, 2002 at 09:02AM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_000425", "id": "radiance-general_000437"}