{"body": "Hi Catarina!\n> My name is Catarina and I am trying to perform a lightning simulation \n> with Desktop Radiance.\nAs far as I know, Desktop Radiance has not been supported for several \nyear. This list is on Radiance, which shares some underlying code with \nthe old Desktop Radiance, but has seen continous development over the \nyears. I suggest that you stop using Desktop Radiance and either go with \n\"pure\" Radiance (which means to get into touch with the command-line \ntools Radiance is made of) or one of the various frontends. Daysim, \nRelux, the Blender-Integration as well as several integrations in more \ngeneral building simulation systems are among the options in the latter \ncase.\n> I think I followed all the necessary steps to insert my model:\n> - Design the geometry (its a simple cube, with the dimensions 5*5*2.8, \n> and a window);\n> - Attach materials to the surfaces;\n> - Insert the luminaire;\n> - Define a gride (I am using the reference grid simualation);\n> - Define the orientation.\n>\n> After that, I perform the simulation but the results are very high (I \n> obtain values for illuminance around 14000 or higher). Additionally, \n> the lightning distribution around the room does not make sense. I have \n> low values in some points and very high value in other.\nIt is almost impossible to give any useful comment here, as we do not \nknow the model (geometry), the material properties or the luminaire, \nplus we have unsupported code. From what you wrote, you do not have any \ndaylight in your scene - still, the values you observe could indicate \nthat you have a sky model that you are not aware of, and measure \nilluminance where your sensor gets hit by direct sunlight.\n\n\nStill, a very generic hint - if you observe funny results in your \nilluminance simulation, take a \"look\" using a more \"natural\" camera \nsetting with a luminance calculation. This helps to identify problems in \nthe model (missing ceilings, coordinate systems where one would not \nexpect them to be located related to the camera, funny overlaps of \nsurfaces, ...). Still - Desktop Radiance is for historical interest but \nnot for simulation work any more.\n> I read something in your site about the optics 5 software. I have \n> already install it and uninstall and the results remain awkward.\nOptics 5 is a tool to find transmission properties of multi-layer \nglazings. You can import these into Radiance - but Optics does not \nsomehow interfere with Radiance, and is a separate software.\n\n\nCheers, Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2013-February/009306.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "February 22, 2013 at 08:15AM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_009303", "id": "radiance-general_009306"}