{"body": "my two toughts:\n\n\nAndrew Bettison wrote:\n\n\n>       ( PLEASE DO NOT QUOTE MY EMAIL ADDRESS IN THE CLEAR\n>         AS I DO NOT WANT SPAMMERS TO HARVEST IT FROM THE\n>         MAILING-LIST ARCHIVE WEB PAGES.  Thank you. ) \n\n\nyou may want to switch on 'conceal email adress from subscriber list' \noption in the webinterface.\n\n\n> ....\n> I will need to make some modifications to RADIANCE for this project:\n>\n> * The first modification is a way to specify very irregular \n> subdivision of\n> the image plane so that the level of detail of and around objects of\n> interest can be wound up, while \"uninteresting\" parts of the scene can be\n> rendered in much lower detail to speed computation.  Essentially, this \n> would\n> provide a kind of selective oversampling.\n\n\nEither use rtrace as render engine and plug a point/direction generator \nbefore and an value-to-image assembler behind that, or start from rpict.\n\n\n> * The second modification is a different atmospheric propagation model \n> that\n> can accurately compute infrared as well as visible spectral path \n> emissions\n> and attenuations between any two points under specified environmental\n> conditions.  The model itself is very extensive, highly validated, and of\n> military pedigree.  The modification to RADIANCE would take the form \n> of an\n> atmospheric model \"plug-in\" scheme for rpict(1) and a gensky(1)-like \n> program\n> that would use the plug-in to compute a sky radiance map and solar/lunar\n> position+radiance. \n\n\nGendaylit (Perez sky model) is the only other sky model (gensky \nsubstitute) I'm aware of.\nSimulating IR viewing through the atmosphere would require \nfixes/changes/add-ons to the mist material.\n\n\n> ....\n> - Does anyone have any comments that might assist me to plan this \n> work, or\n>  make the outcome more useful for the RADIANCE community?  I would \n> like to\n>  know about any issues such as outstanding performance/accuracy concerns\n>  with the existing ray propagation model, or limitations to be aware \n> of in\n>  the rendering of large-scale, outdoor scenes, or any wish-list features\n>  that may dovetail into this work. \n\n\nSince Radiance uses a bounding box for the scene, a very large scene \nprobably requires adjusting some default rpict parameters (e.g. -ar).\nOtherwise, most internal variables are 'double'.\n\n\n-Peter\n\n\n\n\n pab-opto, Freiburg, Germany, www.pab-opto.de\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000736.html).</sup>", "attachments": [], "created_by_name": "Peter Apian-Bennewitz", "created_at": "May 13, 2003 at 07:33PM", "created_by": "Peter_Apian-Bennewitz", "parent_id": "radiance-general_000717", "id": "radiance-general_000736"}