{"body": "Il 11Jun 16:08, Rob Guglielmetti scrisse:\n> I was creating a light source the other day, from an IES file.  Turns \n\n\nFirst, are you sure the ies data are correct?\n\n\n[cut]\n> \n> http://www.rumblestrip.org/site-img/rad/linear.jpg\n> \n> So far so good.\n\n\nIt seems a symmetric fitting.\n\n\n> \n> Then I ran the *directional* downlight file thru ies2rad and checked it \n> in ltview, and it looked like this:\n> \n> http://www.rumblestrip.org/site-img/rad/assym.jpg\n\n\nThis time it seems an asymmetric fitting. What you meen with\n*directional*?\n\n\n> Eureka!  I have defied physics!  It was after looking at this image that \n> I re-checked the ies file, and discovered that it's the LM-63-95 spec. \n> This is a problem, because the spec calls for the 0-180 vertical plane \n> to be oriented parallel to the lamp axis, whereas it's more common to \n> orient it perpendicular.  ies2rad can't even have a check for this, \n\n\nIt's right, the 0-180 plane normally must be oriented parallel to the\nlamp axis. This is a general rule to point right the fitting.\n\n\nThe IES specifies:\n\n\n[...]\nThis integer value indicates the type of photometric web used for the\nphotometric measurements as follows:\n\n\n  Value Description\n\n\n    1   Type C photometry\n    2   Type B photometry\n    3   Type A photometry\n\n\nLuminaires are photometered by locating the luminaire at the center of\nan imaginary sphere and measuring the light intensity (candela) values\nat grid points (the \"photometric web') on the sphere's surface. The\norientation of the luminaire's axes relative to that of the sphere\ndetermines the photometric type.\n\n\nType C photometry is normally used for architectural and roadway\nluminaires. The polar axis of the photometric web coincides with the\nvertical axis of the luminaire, and the 0-180 degree photometric plane\ncoincides with the luminaire's major axis (length).\n\n\nType B photometry is normally used for adjustable outdoor area and\nsports lighting luminaires. The polar axis of the luminaire coincides\nwith the minor axis (width) of the luminaire, and the 0-180 degree\nphotometric plane coinicides with the luminaire's vertical axis.\n\n\nType A photometry is normally used for automotive headlights and signal\nlights. The polar axis of the luminaire coincides with the major axis\n(length) of the luminaire, and the 0-180 degree photometric plane\ncoinicides with the luminaire's vertical axis.\n[...]\n\n\nNormally the major axis in the type C (the most used) coincides whit\nthe lengt of the lamps. If the lamp is vertical in the fitting, like a\ndownlight, the luminous flux is normaly simmetric so is not important\nwhich is the 0-180 plane.\n\n\nIf the fitting has an asymmetric reflector, then the direction of the\nmax flux coincides at 90° (0° 3 o'clock, 90° 12 o'clock)\n\n\n> because the spec is so loosely written.  This is why checking the \n\n\nI have a good text about the IESNA Photometric Data File (about 33K).\nIf you need it, could I attach it to the ML?\n\n\n[cut]\n> Is there a better way to \"correct\" a funky IES file for ies2rad? What do \n> you all do when you encounter this?\n\n\nIf the rad is wrong most likely you have a bad IES file. \n\n\nCiao\n\n\nStefano Callegari <tecnico at omniluxlighting.it>\nOmnilux Srl\nVia Frassanedo, 2 - I 35020 Villatora di Saonara (PD)\n+39 049 8792281\nGnuPG Public Key Server: pgp.mit.edu\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-June/001807.html).</sup>", "attachments": [], "created_by_name": "Stefano Callegari", "created_at": "June 12, 2004 at 12:51AM", "created_by": "Stefano_Callegari", "parent_id": "radiance-general_001805", "id": "radiance-general_001807"}