{"body": "It's a shame about Nikon being so difficult.   I'd love to have \nsupport for my 5700 and FC-E9 spherical fisheye.  It would make \ncapturing 360 degree spherical HDRs so much easier.\n\n\nLisa\n\n\n>Yeh, that's why I was asking about a plugin API to add additional \n>cameras.  If I'm willing to do the work to get my D70 to work, \n>someone else might be willing to to do a D200.  Sure, you'd end up \n>having to tack on 2 dozen shared libraries to support every camera, \n>but I'd still say that for me to add support for my camera is less \n>effort than to reinvent everything else Greg has done.\n>\n>Trent\n>\n>On 25-Jan-06, at 8:03 AM, Jack de Valpine wrote:\n>\n>>Hi Trent,\n>>\n>>I believe one of the problems with the Nikons is that each camera \n>>uses a differint API. I quote below from an earlier post from Greg \n>>on the topic:\n>>\n>>>Rob G. asked about Nikon cameras, and we did look at them \n>>>originally,  but there were two things that led us to use the \n>>>Canon 5D.  One was  the fact that we needed to capture full \n>>>180-degree circular fisheye  images, and this requires a \n>>>full-frame sensor.  The second was the  way Nikon created a \n>>>separate SDK with a different programming  interface for every \n>>>model camera, which makes supporting more than  one a real pain. \n>>>It's a shame, though, because we have this really  awesome f/2.8 \n>>>Nikkor fisheye lens, and the adaptor ring that's  supposed to \n>>>mount Nikon lenses on Canon bodies doesn't work for this \n>>>particular lens.\n>>\n>>-Jack\n>\n>\n>_______________________________________________\n>HDRI mailing list\n>HDRI at radiance-online.org\n>http://www.radiance-online.org/mailman/listinfo/hdri\n\n\n\n\n\n\nMANGABABE MEDIA PRODUCTIONS\n1433 - 43rd Avenue, San Francisco, CA 94122 USA\nEmail: yimm at mac.com\nMobile: 415.260.9475\nhttp://www.manga-babe.com\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2006-January/000038.html).</sup>", "attachments": [], "created_by_name": "L.Yimm", "created_at": "January 25, 2006 at 09:08PM", "created_by": "L.Yimm", "parent_id": "hdri_000017", "id": "hdri_000038"}