{"body": "Hi Jia,\n\n\nHere are a few additional pointers on obj from revit.\n\n\nNORMALS\nFor whatever reason it seems that fbx converted to obj using the FBX \nconverter can for some normals report:\n\n\n    vn 0 0 0\n\n\nwhich make obj2rad unhappy.\n\n\nSo the best thing that I have found is generally to take the convert \nfbx->obj file and process it through something like Rhino, Polytrans, \nNuGraf, or Blender (other suggestions out there...). Which have \nfunctionality to recalculate normals and otherwise process meshes/polygons.\n\n\nMATERIALS\nFirst off as I believe some others have pointed. Material information \nfrom other programs is useless! They do not report valid reflectance \ninformation. The only thing that you should hope to get is that the \ngeometry is organized by material name.\n\n\nA stock conversion from fbx->obj will for what ever reason organize \ngeometry by object name! This is despite the fact that there is a valid \nusemtl statement in the obj file. This can be ok however it does mean \nthat you probably need to have some kind of parser to do some material \nmapping in a useful way (there can be hundreds of object names). I did \nthis in perl early on in my experience processing Revit models into \nsomething useable by Radiance. However, this all can be better managed  \nby processing the fbx->obj file through Rhino, Polytrans, NuGraf or \nBlender where you can process the file and send out an obj with normals \nand material groupings that make you and Radiance happy.\n\n\nBest,\n\n\n-Jack\n\n\n\n\n# Jack de Valpine\n# president\n#\n# visarc incorporated\n# http://www.visarc.com\n#\n# channeling technology for superior design and construction\n\n\n\n\n\n\nJia Hu wrote:\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-May/006825.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "May 05, 2010 at 09:10AM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_006819", "id": "radiance-general_006825"}