{"body": "Hi Alexa,\n\n\nJust a minor comment here. I have no doubt that the using a more \nsophisticated measuring device will yield more accurate results. \nHowever, I believe the method of using the machbethcolor checker card as \ndescribed in Rendering with Radiance is designed to calibrate to the \ncurrent lighting conditions, that is, assuming the use of a digital \ncamera, if we want to sample a particular material in a give lighting \ncondition, then we also sample the color checker chart under the same \nconditions with the same sampling device (digital camera) and then \nperform the calibration with macbethcal and pcomb. I do not know the \nunderlying method that Greg put together to do the calibration, so I am \nnot sure how he has accounted for varying light conditions vis a vis the \ninternal dataset that Radiance uses as part of the calibration mechanism.\n\n\n-Jack de Valpine\n\n\nAlexa I. Ruppertsberg wrote:\n\n\n> Hi Genevieve,\n>\n> I definitely would recommend a more sophisticated method than using \n> the macbethcolor checker card. Yes, it is true that the chromaticities \n> are known for those colours, BUT this is under the assumption of a \n> certain illumination source. Will you have that same illumination \n> source? Probably not.\n>\n> If you are after accuracy (rather than 'good looks')you might want to \n> buy a spectroradiometer and a white reflectance standard, too. After \n> all, what you measure with the spectro looking onto your wall is the \n> colour signal, a combination of the surface reflectance and the \n> illumination at hand (and some geometry). In order to model the \n> material properties in RADIANCE, you will be interested in the surface \n> reflectance and not in the overall colour signal. To retrieve the \n> surface reflectance, you measure the spectrum of the white reflectance \n> standard at the very same position where you measured the colour \n> signal from the wall, then divide the colour signal (spectrum) by the \n> spectrum from the white reflectance standard and you have your surface \n> reflectance (this assumes a Lambertian surface). The spectrum from the \n> white reflectance standard can be used to get the colour of the \n> illumination source.\n> This approach will yield something with a clear tint, if the \n> illumination source wasn't a natural light. If you want to have a \n> good-looks picture then don't bother with the white reflectance standard\n> and model the light source as white (as described and recommended in \n> the RADIANCE book).\n>\n> Regards,\n> alexa\n>\n>> Hi,\n>> In order to define colors for radiance models I'm looking for an \n>> instrument to measure the colors of walls and of mural paintings of \n>> archaeological sites. It should be portable, working with batteries \n>> and non destructive to the material.  (max. price, $5000 US)\n>> Any recommendation?\n>>\n>> genevieve lucet\n>>\n>\n> ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n> Dr. Alexa I. Ruppertsberg\n> Department of Optometry\n> University of Bradford\n> Bradford\n> BD7 1DP\n> UK\n> ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n>\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n\n\n\n\n#\tJohn E. de Valpine\n#\tpresident\n#\n#\tvisarc incorporated\n#\thttp://www.visarc.com\n#\n#\tchanneling technology for superior design and construction\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-May/001684.html).</sup>", "attachments": [], "created_by_name": "Jack de Valpine", "created_at": "May 12, 2004 at 03:16PM", "created_by": "Jack_de_Valpine", "parent_id": "radiance-general_001679", "id": "radiance-general_001684"}