{"body": "Hi all,\n\n\nGermán and Mehlika, thanks for introducing me to hdrscope, I’m installing it right now.\nAnd thank you Nathaniel for solving the RAYPATH problem!\n\n\nIn case it helps someone else, I was using Greg’s hdrgen and the combination of ra_xyze, pcompos and pvalue to calibrate an HDR image as described in this thread<http://www.radiance-online.org/pipermail/radiance-general/2011-April/007764.html> and I ran into the following error when applying the last line:\n\n\n(getinfo < capture.hdr ; echo EXPOSURE=$ecorr ; getinfo - < capture.hdr) > calibrated.hdr\n\n\nThe output picture reads as  a ‘bad picture format’ with ximage and a closer look reveals that the EXPOSURE line that is added in the header is just above the –Y +X resolution parameters, with the empty line (\"\\n\\n\") before it, terminating the header before this new EXPOSURE variable.\nOut of curiosity I put the empty line after the EXPOSURE (this time with no lines between the header variables), and now the HDR opens correctly with ximage with both EXPOSURE variables (original and new) but the luminance values are very low (<1L). I’m obviously doing something very wrong.\nIf I understand correctly, the error correction (and the added EXPOSURE variable) should ideally be very close to 179 based on the standard lumens/watt conversion – in my case it’s 178.02 as the ratio of measured and generated luminance values is 0.99. Is this correct?\n\n\nI’ve lent our copy of Rendering with Radiance to a student, so forgive me if I’m missing things that are explained there.\nLet me know if I should make a separate message about this, as I am hijacking my own thread!\n\n\nThanks for all your help,\nKynthia\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-June/011775.html).</sup>", "attachments": [], "created_by_name": "Chamilothori Kynthia", "created_at": "June 07, 2016 at 06:30AM", "created_by": "Chamilothori_Kynthia", "parent_id": "radiance-general_011749", "id": "radiance-general_011775"}