{"body": "Bruce Sounes wrote:\n\n\n> I am finding Linux a bit of a challenge.  How do I set the RAYPATH\n> environment variable under the Bourne Again Shell (bash), and how do I set\n> it as part of my login? I have discovered that if I change to the c-shell\n> (csh) and follow the installation instructions, it works for that session.\n> Similarly the animation scripts in the old email archives work under csh,\n> but not under bash.\n\n\nAdd the following line to the file named \".profile\" in your\nhome directory:\n\n\nexport RAYPATH=\".:/usr/local/ray/lib\"\n\n\nOf course, you need to adapt the path given to the one where\nyou actually installed the Radiance library.\n\n\n> Should/Can I set Linux to use the c-shell as standard?\n\n\nThat's primarily a matter of taste. Traditionally, the csh/tcsh\nused to be more practical for interactive use, while the sh/bash\nwas more suited for scripting. But I think those characteristic\ndifferences have become rather blurred over the  years.\n\n\nIn any case, it would probably be a good idea to get some kind\nof starters guide for unix/Linux, which will answer a whole lot\nof similar questions that are bound to come up very soon...\n\n\n\n\n> Not being familiar with either language, and because of its cross-platform\n> support, I have been reading up on Perl as an alternative for writing\n> scripts to use with Radiance. Has anyone used Perl for animations and would\n> they be willing to share their efforts?\n\n\nIf you want to get the advantages of Perl without the headaches,\nthen I'd highly recommend Python instead. There's hardly anything\nthat you can't do with either of them, just that you'll still\nunderstand your Python programs when you look at them again after\na few weeks, which is not quite as certain with Perl.\n\n\nAgain, however, this is a matter of taste to a certain degree, so\nyou might want to have a look at both of them, and make up your\nown mind.\n\n\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch.com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-July/000352.html).</sup>", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "July 19, 2002 at 10:02AM", "created_by": "Georg_Mischler", "parent_id": "radiance-general_000354", "id": "radiance-general_000352"}