{"body": "John An wrote:\n > Hi all,\n >\n > I had previously posted on this list requesting help installing\n > Radiance on Mac OS X Jaguar.  Thanks for all who helped.  I know have\n > it installed, and have started playing around with it.  I have walked\n > through the online tutorial, and have ordered Rendering with\n > Radiance, and am anxious to get it in my hands.  In the meantime (it\n > is currently out of stock), I need to get an analysis completed for a\n > project I am working on, and would appreciate some help.\n\n\nSorry to say, but that book is not out of stock, it's out of print \n(well, OK it's out of stock too, but permanently).  The authors have \nobtained the copyright from Morgan Kaufman, and are looking for a new \npublisher, but so far no joy.  My co-worker tried ordering direct from \nMK and they told him the same \"out of stock\" thing, but no new copies \nare coming out of MK. A couple of enterprising souls were selling copies \non Amazon.com for something like $300USD!  =8-(  Hopefully, Greg will \nfind a new publisher or some other means of distrubition; it's such a \nvaluable piece of the Radiance toolkit.\n\n\n > However, the following problems have occured under Linux (I haven't\n > had a chance to run this on the Mac). First, when I use rview to\n > preview my scene, everything seems to pop up normally (I get an\n > image).  However, when I use the rpict command, I always get the\n > message \"warning - aiming failure for light source [a]\" where a\n > stands for an illum object (the window in the scene).  As of now, I\n > am only analyzing daylighting, so I have no other light sources in\n > the scene.\n\n\nThat happens when you have an irregularly shaped polygon that is defined \nas an illum.  \"L-shaped\" polys and triangles are the kinds of shapes I'm \ntalking about here.  Break it up into more rectillinear forms and you \nshould see that problem go away.\n\n\n > Second, I'm sure this is covered in \"Rendering with Radiance,\" but is\n > there a way to get orthogonal and orthographic projected views in\n > Radiance?  Moreover, is there a way to make a surface invisible, yet\n > be considered in the lighting calculation?  I would like to look into\n > an interior space in an axonometric view, but look through the\n > ceiling and 1 or 2 walls to see the light distribution throughout a\n > single space.\n\n\nCheck the manpage for rpict, it explains all the view parameters.  The \nway to see \"through\" a surface is to use clipping planes in your views. \n  This way, the calculation is correct, but at view time you slice \nthrough the building with the use of these clipping planes.  These are \nalso explained in the rtrace manual page.\n\n\n\n\n\n\n      Rob Guglielmetti\n\n\ne. rpg@rumblestrip.org\nw. www.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-April/000673.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "April 30, 2003 at 06:08PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_000672", "id": "radiance-general_000673"}