{"body": "<html>\nRussell,<br>\n<br>\nWe have successfully modelled the refractive light redirection system\nknown as the 'laser cut panel'.&nbsp; It is simply a sheet of acrylic\nwith laser cuts in it.&nbsp; The cuts redirect incident illumination by\ntotal internal reflection, giving the panel very powerful light\nredirecting properties.&nbsp; The algorithm to model the device is based\non some simple geometrical calculations of directions of deflected and\nundeflected rays, and relative intensities of the rays.&nbsp; The\nmodifier used is the prism2 material.&nbsp; For more info, check the\npaper in Lighting Research and Technology:<br>\n<br>\nGreenup, P.J., Edmonds, I.R. and Compagnon, R. (2000), <i>Radiance\nAlgorithm to Simulate Laser-Cut Panel Light-Redirecting Elements,\n</i>Lighting Research and Technology<i>,</i> 32 (2), 49-54.<br>\n<br>\nI have also developed some algorithms to model reflecting light\nredirecting devices, known as light guiding shade panels.&nbsp; The\nprocess is:<br>\nmodel the flat reflective surfaces as polygons, the curved reflective\nsurfaces using gensurf<br>\nrun oconv with the appropriate room and sky definitions<br>\nset a void output surface adjacent to the inside of the light redirecting\ndevice<br>\nrun mkillum with appropriately high settings of the -s and -d parameters\nin particular<br>\nadd the resulting geometry using oconv -i ...<br>\nget your pictures, illuminances, etc as usual.<br>\n<br>\nthe results for each algorithm have been compared against measurements in\nlabs and in test buildings, and compare well.&nbsp; if you would like\nmore info, or the calculation file for the laser cut panels, let me know\nand i will be happy to send it to you.<br>\n<br>\nRegards,<br>\nPhil Greenup<br>\n<br>\n<br>\n<blockquote type=cite cite>On a side note I am also looking at modelling\nlight redirection systems (horizantal/vertical<br>\nglazing) and refractive systems. I have looked at some of the designs on\n<a href=\"http://www.schorsch.com/\" eudora=\"autourl\">www.schorsch.com</a><br>\nand attempted to model them using AutoCAD or a gen program then assigning\na dielectric<br>\nmaterial. Does any else have experience with creating these and would it\nbe possible<br>\nto use a different modifier? I am looking for the most accurate\ncalculation.<br>\n<br>\nThanks<br>\n<br>\nRussell Maunder<br>\n<br>\nBBSc (hons)<br>\nVictoria University of Wellington<br>\nSchool of Architecture and Design<br>\nNew Zealand<br>\n</blockquote><br>\n<div>Phil Greenup</div>\n<div>Centre for Medical, Health and Environmental Physics</div>\n<div>Queensland University of Technology</div>\n<div>GPO Box 2434</div>\n<div>Brisbane Qld 4001 Australia</div>\n<div>Ph (07) 3864 5362</div>\n<div>Fax (07) 3864 9079</div>\nEmail p.greenup@qut.edu.au\n</html>\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2001-August/000026.html).</sup>", "attachments": [], "created_by_name": "Phillip Greenup", "created_at": "August 06, 2001 at 11:40AM", "created_by": "Phillip_Greenup", "parent_id": "radiance-general_000023", "id": "radiance-general_000026"}