{"body": "Hi Rob!\n\n\n> --------\n> WARNING: At least one of the links in the message below goes to an IP\n> address (e.g.\n> 10.1.1.1), which could be malicious. To learn how to protect yourself,\n> please go here:\n> http://www.lbl.gov/cyber/services/suspicious-links.html\n> --------\n\n\nWhat is the meaning of these warnings - I would be surprised if the link \nadvertized by \"(...) to protect yourself, please go here:\" would not be \nresolved to an IP address... Is it possible to switch these off?\n\n\n> Yesterday even after they increased the limit and others were able to\n> hear, I still could not. I was able to ping the IP however...\n\n\nA good check is to request the file by http (which is the transport \nprotocol used). So if you get a text file names listen.m3u, everything \nis fine. If you have a firewall blocking outgoing (!) port 3389, that \nwould not make much sense and should be safe to be disabled.\n\n\nAnother question is whether your client is able to handle the m3u \nplaylist or prefers to get directly pointed to the stream.\n\n\nI have no idea why the setup was changed after yesterday, but obviously \nnow we have a configuration sending out data that cannot be used. I \nreceive a stream, but any client I point at it gives up with protocol \nerrors. E.g. VLC, which is usually very tolerant, gives me\n\n\n(...)\nmain debug: Buffering 97%\nmain debug: Stream buffering done (1201 ms in 853 ms)\nmain debug: Decoder buffering done in 0 ms\nmain warning: PTS is out of range (-9924), dropping buffer\nmain warning: PTS is out of range (-36010), dropping buffer\nmpgatofixed32 debug: libmad error: bad main_data_begin pointer\nmpgatofixed32 debug: libmad error: bad main_data_begin pointer\n\n\nso I see little hope for us to get audio back.\n\n\nCheers, Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2011-August/008133.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "August 25, 2011 at 11:21AM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_008104", "id": "radiance-general_008133"}