{"body": "Hi  Andrew,\n\n\nYou aren't really doing anything wrong, but the problem is that  \nrtcontrib reports the contribution *coefficients*, which is not the  \nsame thing as the contributions.  To get contributions, you need to  \ndownload and compile the latest HEAD release, and use the new -V  \noption to rtcontrib.  Then, you should get the results you expect.   \nThis is a subtle point that I actually missed in the design of the  \nprogram, which is why the option was only added more recently.  Here  \nis the description from the new man page:\n\n\n>        By setting the boolean -V option, you may instruct rtcontrib  \n> to  report\n>        the  contribution  from  each material rather than the ray  \n> coefficient.\n>        This is particularly useful for light sources with   \n> directional  output\n>        distributions,  whose  value  would  otherwise  be lost in  \n> the shuffle.\n>        With the default -V- setting, the output of rtcontrib is a   \n> coefficient\n>        that must be multiplied by the radiance of each material to  \n> arrive at a\n>        final contribution.  This is more  convenient  for   \n> computing  daylight\n>        coefficeints,  or  cases where the actual radiance is not  \n> desired.  Use\n>        the -V+ setting when you wish  to  simply  sum  together   \n> contributions\n>        (with  possible  adjustment  factors) to obtain a final  \n> radiance value.\n>        Combined with  the  -i  or  -I  option,  irradiance   \n> contributions  are\n>        reported  by  -V+ rather than radiance, and -V- coefficients  \n> contain an\n>        additonal factor of PI.\n\n\nHope this helps.\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-May/003713.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "May 23, 2006 at 03:24PM", "created_by": "Greg_Ward", "parent_id": "radiance-general_003710", "id": "radiance-general_003713"}