{"body": "Very nice response, Rob.  You're correct that gensky doesn't offer an \noption for specifying the direct normal solar irradiance, only the \ndirect horizontal irradiance (-R) and solar radiance (-r).  To compute \nthe solar radiance from direct normal irradiance, divide the normal \nirradiance by 5.98e-5, which is the number of steradians in a 0.5 \ndegree source like the sun.\n\n\nTo confuse matters further, you should probably consider the solar \nefficacy if you are working from true irradiance measurements and \nattempting to get absolute photometric results out of Radiance.  As I \nexplained at the workshop, Radiance uses a conversion of 179 \nlumens/watt to go back and forth between photometric and radiometric \nunits.  Since the same constant is used for the forward and reverse \nconversions, it usually drops out and is of no concern.  However, no \nsuch conversion occurs on the input to gensky, so you should probably \nintervene with your own correction if you are working from physical \ndata.  Therefore, I recommend multiplying values to the -r and -R \noptions by:\n\n\n\t208/179\t\tthe ratio between the sun's efficacy and the standard \nRadiance factor\n\n\nLikewise, values to the -b and -B options should be multiplied by:\n\n\n\t110/179\t\tthe ratio for sky radiation efficacy over the standard \nRadiance factor\n\n\nThis way, when 179 gets applied on the output conversion to photometric \nunits, you will get closer to the correct absolute results.\n\n\nIf folks think I should add these factors directly into gensky, I would \nbe happy to.  My principal hesitation in making such a correction is \nthe confusion it may cause users whose scripts have been running one \nway for years when they get different results in the next version.\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-October/001059.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "October 14, 2003 at 12:00PM", "created_by": "Greg_Ward", "parent_id": "radiance-general_001055", "id": "radiance-general_001059"}