{"body": "Richard,\n\n\nI worked with non-visible wavelengths during my Thesis. When I asked if it\nwas possible, people in here told me \"Math is Math, as long as you include\nthe correct reflectances, it will work\".\n\n\nIf you do not go to the FIR; where every \"warm\" surface is actually an\nemitter and absorber, I would say it will work.\n\n\n\n\n\n\n\n\n2014-07-22 7:39 GMT-04:00 Richard Watkins <R.Watkins at kent.ac.uk>:\n\n\n>  Dear Greg,\n>\n>\n>\n> I wonder if I could ask if it is possible to use Radiance to assess the\n> albedo of an urban setting, e.g. a street gorge, where Radiance can take\n> into account the near infra-red component of the solar spectrum as well as\n> the visible one, please? Perhaps the visible component would have to be\n> assessed first, and then the IR on a second run, after modifying the\n> surface reflectances?\n>\n>\n>\n> Many thanks\n>\n>\n>\n> Richard Watkins\n>\n>\n>\n> Kent School of Architecture  :  University of Kent  :  Kent  :  CT2 7NZ\n>\n>\n>\n>\n>\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n>\n>\n\n\n\n\n\n\n*Germán Molina L.*\nIngeniero Trainee\nHunter Douglas Chile S.A.\nCelular +569 89224445\n\n\n\n\n\n\n\n\n*Nota de Confidencialidad:* Este mensaje incluído los archivos adjuntos son \nconfidenciales y pueden contener informacion privilegiada protegida por \nley. Si Ud. no es el destinatario, deberia abstenerse de copiarlo, \ndistribuirlo, divulgarlo o usar la informacion contenida. Por favor, avise \ninmediatamente al emisor y borre este mensaje de su sistema. Los mensajes \nelectronicos son susceptibles de ser cambiados, infectados o adulterados \nsin autorizacion. No asumimos responsabilidad alguna por ninguna clase de \ncambios o sus consecuencias. Usted debe estar informado que la compania \npuede hacer un seguimiento de sus mensajes electronicos y su contenido, \ngracias.\n\n\n*Confidentiality Notice:* The information contained in this email message, \nincluding any attachment, is confidential and is intended only for the \nperson or entity to which it is addressed. If you are neither the intended \nrecipient nor the employee or agent responsible for delivering this message \nto the intended recipient, you are hereby notified that you may not review, \nretransmit, convert to hard copy, copy, use or distribute this email \nmessage or any attachments to it. If you have received this email in error, \nplease contact the sender immediately and delete this message from any \ncomputer or other data bank, Thank you.\n\n\nA informação transmitida é confidencial e para conhecimento exclusivo do \ndestinatário. Sua utilização, não autorizada, constitui crime passível de \nprisão. Todas as precauções possíveis foram tomadas para garantir que este \ne-mail não contenha vírus. Uma vez que nossa empresa não pode assumir \nresponsabilidade por nenhuma perda ou dano causado por este e-mail ou de \nseus anexos, recomendamos que o destinatário utilize seus procedimentos de \nantivírus antes de qualquer uso.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2014-July/010404.html).</sup>", "attachments": [], "created_by_name": "German Molina", "created_at": "July 23, 2014 at 11:27AM", "created_by": "German_Molina", "parent_id": "radiance-general_006033", "id": "radiance-general_010404"}