{"body": "Hi Ikrima,\n\n\nAnswers below:\n\n\nRegarding SPOT Pro, it seems that it can work out annual simulation for CFS\n> with BSDF but for grid points we still need to use command-line (as you\n> clarified).\n\n\nSPOT does automatically calculate a workplane level (height can be\nspecified) grid of points.  In you query it sounded like maybe you were\ninterested in possible other illuminance points (eye level or wall) for\nwhich you may need to go behind the scenes and work with classic Radiance.\n\n\n\n\n> Also, we still need to use command-line (radiance) to generate BSDF that\n> will be used with SPOT Pro . Is that right?\n>\nBSDF files can come from several places:  1) there is a small library of\ngeneric ones in SPOT.  2) You can generate them via genBSDF and command\nlines. 3) LBL's Window 7.3 program can generate them 4) If small enough\nsamples you can have physical goniophotometer measurements that would need\nto be converted to the Radiance BSDF format 5) use companies like mine, we\noffer daylighting performance characterization and BSDF creation for\ncomplex optical daylight systems as service.\n\n\nAlso, what is the difference between SPOT Pro and Daysim tools in terms of\n> accuracy and flexibility (as both using Radiance engine)?\n>\nThey both use Radiance for all simulation they just have two different\napproaches to annual simulation.  DAYSIM uses Daylight Coefficients,\nbreaking the sky into atleast 145 patches and calculating the contribution\nfrom each and then using this data to simulate throughout the year. 1, 2, 3\nand 5phase methods all just treat the sun and sky components in different\nways.  SPOT interpolates from a range of design day calculations to\nsimulate throughout the year.  In my opinion both have some advantages and\ndisadvantages in terms of accuracy and speed and how they can treat window\ntreatments.  The annual comparison's I have seen show very similar results\nbetween the two methods but I do feel more annual daylighting simulation\nstudies and validation is needed of all methods in general.\n\n\n>\n> Regards,\nZack\n\n\n\n\nZack Rogers, P.E., LEED AP BD+C\nDaylighting Innovations, LLC\n808 S. Public Road, Suite 200\nLafayette, CO 80026\n(303)946-2310\n\n\n\n\nwww.daylightinginnovations.com\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-May/010908.html).</sup>", "attachments": [], "created_by_name": "Zack Rogers", "created_at": "May 13, 2015 at 09:04AM", "created_by": "Zack_Rogers", "parent_id": "radiance-general_010902", "id": "radiance-general_010908"}