{"body": "Hi, Greg,\n\n\nThank you for the input. With your confirmation, I can be rest-assured\nthat I don't have to worry about taking couple more under-exposed\nbrackets for concentrated light sources, which also make the alignment\nand merging process harder.\n\n\nI am actually on Windows with HDR Shop. Really hope that there is a\nwindows version of Photoshere such that we can use its flare reduction\nfeature, which seems not available anywhere else. I have read comments\nin this mail list and other places about merging directly from RAW for\naccuracy. In my experience, it brought me more troubles than\ngenerating visually obviously better IBL results. At the end, I am not\nafter pure scientific accuracy. Hence, I just use commercial\napplications like Adobe Lightroom to convert RAW brackets to\nintermediate TIFFs, with minimum color or luminance related\nadjustments applied, for HDR merging.\n\n\nI have had this \"capturing concentrated light sources\" question for\nquite a while and did came across Stumpfel's paper/thesis and\ncorresponding section in your book (the section written by Debevec).\nMy main interest is image-based lighting for visual effects type of\nworks. As I came across a SIGGRAPH course note by Ben Snow's (ILM) and\nread about their on-set lightning acquisition workflow: Canon 1DS +\nSigma 8mm fisheye + 0.6 ND filter for exterior shot. If compared to\nStumpfel's 3.0 filter with varied aperture sizes controlled by laptop\nto shorten the exposure time for over-exposed brackets, I wonder if\nthe former is simply capturing the environment map as a high-ish\ndynamic range image (instead of fully recover light sources\nillumination) and relying on visual-based indirect approach (via 18%\ngray sphere photograph) to calibrate the light source's contribution.\nBut then what's the point of using that 0.6 ND filter if the indirect\ncalibration of light source's contribution will be conducted anyway?\nWhy not just capture an environment map without the filter and\nmanipulate the pixel values of the light source in floating point\nspace in post until whatever their calibration approach tells them\nthat the illumination of the light source is properly represented?\n\n\nbest,\nJason\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2011-January/000305.html).</sup>", "attachments": [], "created_by_name": "jason huang", "created_at": "January 26, 2011 at 08:27AM", "created_by": "jason_huang", "parent_id": "hdri_000286", "id": "hdri_000305"}