{"body": "On Mon, Jun 29, 2009 at 3:06 AM, Lars O. Grobe<grobe at gmx.net> wrote:\n> Hi Greg,\n>\n> thank you for again surprising us with a new tool. Unfortunately this one is\n> again in the good old tradition of conflicting with vi (well, I am really\n> curious how many commands I type lead me to that little editor)...\n\n\nThat's not quite correct. 'vinfo' is a true and proper Greg-style csh script\nthat strips the binary part from the image and shows you only the header\nin the editor - which is vi. If you call the tool without image all you get\nis an editor window without content. In 'vim' this shows a greeting message\nwhich you probably saw.\n\n\nIn fact if you have 'vim' I think you can edit the image headers directly,\nwithout splitting the binary bits. I think I did that before.\n\n\n> The reason I was asking is that I am working on full-frame fisheye hdr\n> images as they are expected e.g. by findglare and evalglare. These images do\n> not have any view information included, and I am trying to add this missing\n> part of information.\n\n\nUnfortunately I haven't actually done a script yet (just manual testing) but\nwhat I will need to do is adding view lines to Sketchup images. I found that\nin Ruby or Python you can just use something like\n\n\nview = \"VIEW= -vta -vp 3.5 4.5 1.5 ...\"\nimg = file(\"mypic.hdr\").read()\nimg.sub(\"\\n\\n\", \"%s\\n\\n\" % view)\nnewfile = file(\"newpic.hdr\", 'w').write(img)\nnewfile.close()\n\n\nBasically you just replace the two newline characters at the end of\nthe header with a \"VIEW=\" line followed by 2 newlines. (I hope this\nis proper Python code - haven't used it in a while).\n\n\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-June/006080.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "June 29, 2009 at 12:35AM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_006074", "id": "radiance-general_006080"}