{"body": "Hi\n\n\nDoes anyone have any suggestions for the following:\n\n\nUnder the current definition for glow\n\n\n        mod glow id\n        0\n        0\n        4 red green blue maxrad\n\n\nif maxrad is a negative value, then the glow is visible on a surface but\ndoes not participate in scene illumination.\n\n\nI would like to generate a surface with a glow that does the opposite - from\nthe viewpoint invisible or assigned to another texture but as a glow it\nstill contributes to the indirect illuminance (in the same way that an illum\ndoes with the direct calculation).\n\n\nIs there a way to do this in general (with mixfunc?) so that a surface\nappears from the viewpoint as one material, but as far as the lighting\ncalculation is concerned is another? Or more to the point how can i test if\nthe ray being traced is a view ray or not?\n\n\nTo explain an example situation - suppose there is a complicated existing\nbuilding that is simplest to represent with an image mapped onto its facade\n(and that only appears correct when viewed from the viewpoint), but in terms\nof its lighting contribution on the site in general is more accurately\ndescribed in some other way.\n\n\nAny help is greatly appreciated.\n\n\nMany thanks too to Peter, Greg, and the other regulars for their efforts in\nrevitalising the Radiance group.\n\n\ncheers\nalex\n\n\n*******************************************************\nA. J. Summerfield                 alex@arch.usyd.edu.au\nFaculty of Architecture, University of Sydney\n*******************************************************\nOutside of a dog, a book is man's best friend.\nInside a dog, it's too dark to read.       Groucho Marx\n*******************************************************\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-October/000459.html).</sup>", "attachments": [], "created_by_name": "alex summerfield", "created_at": "October 24, 2002 at 10:36AM", "created_by": "alex_summerfield", "parent_id": "radiance-general_000461", "id": "radiance-general_000459"}