{"body": "Hello everybody!\n\n\n\n\n\n\nI’ll provide the summary of my research and have questions within the\nsummary. I would appreciate any of your help!\n\n\n\n\n\n\nMy research investigates if HDRI technique can precisely capture luminances\nof small bright light sources (e.g. LED garage fixtures) with narrow light\ndistributions.\n\n\n\n\n\n\nI was able to figure out luminance values for a single LED, which can be\ncompared to the ones from HDR images. But I have a couple of\nquestions/concerns on HDRI technique and Photosphere.\n\n\n\n\n\n\nAt first, I’ve used “regular” scene to retrieve response curve of the\ncamera (large smooth gradients with very dark and bright areas, and had\nreflectance standards for the absolute calibration).\n\n\nCamera: EOS T1i Rebel with 28-105mm lens, at 28mm\n\n\nCalibrated at the grey reflectance sample 186.45 cd/m2\n\n\nCF=0.957\n\n\n*\n*\n\n\nI’ve got the following RC for RGB:\n\n\nred(r) = -6.434199e-03+ 4.518039e-01*r + 1.291426e+00*r^2 + 1.802896e+00\n*r^3;\n\n\ngreen(g) = -5.804720e-03+ 4.175837e-01*g + 1.176582e+00*g^2 + 1.721643e+00\n*g^3;\n\n\nblue(b) = -4.376831e-03+ 3.784418e-01*b + 1.075695e+00*b^2 + 1.658471e+00\n*b^3\n\n\n\n\n\n\nIf I look at the histogram of the scene, maximum luminance within the scene\nis 60,291 cd/m2.\n\n\n\n\n\n\nThen I use this RC to analyze HDRI of a captured LED. The value is 230,000\ncd/m2 for a single LED, which is low (it’s has to be around 7*106 cd/m2).\nSo, it underestimates the luminance.\n\n\n\n\n\n\nIt seems like calibration point is critical here. I’ve decided to try to\ncapture a different scene for deriving RC with a wider range. It would make\nsense that camera has to see higher luminance values in order to accurately\nmeasure them later. The dynamic range has to cover measured values.\n\n\n1.   1. How does Photosphere deals/approximates/calculates the upper end of\nthe curve? I assume it gives more weight to mid tone values? But what\nhappens with high luminance values?\n\n\n\n\n\n\nSo, the new brighter scene was picked with the direct sun! But in order to\navoid the damage of the camera’s sensor, measurements were taken before the\nsunset.\n\n\n\n\n\n\nIn the new brighter captured scene without the calibration all values for\nreflectance standards were overestimated, while the value for the sun\nunderestimated. Then I decided to calibrate my scene at the sun!\n\n\nBut when I apply absolute calibration, it simply multiplies CF to all\nvalues.\n\n\n2.     I assumed when CF is applied, it does not equally change all values,\nbut does it proportionally to RC (since it is not linear).  Why does it do\nit equally for the whole range?\n\n\nLsun=80*106 cd/m2. And of course CF is very big 391.\n\n\n\n\n\n\nNew RC:\n\n\nred(r) = 3.219064e+00+ -2.655078e+01*r + 9.351069e+02*r^2 + -2.115052e+03\n*r^3+1.594538e+03*r^4;\n\n\ngreen(g) = 2.094164e+00+ -1.468109e+00*g + 7.306838e+02*g^2 + -1.720743e+03\n*g^3+1.380693e+03*g^4;\n\n\nblue(b) = 1.049078e+00+ 1.591820e+01*b + 5.848958e+02*b^2 + -1.461635e+03\n*b^3+1.251033e+03*b^4\n\n\n\n\n\n\nBut then something interesting happened. When I analyze LED, it gives a\nvalue of 79*106 cd/m2. So, it jumps to this upper limit calibrated with the\nsun previously.\n\n\n(I had similar results for EOS 7D with the lens 16-35mm, at 16mm)\n\n\n3.     Does photosphere compress the response curve, so at the upper end\nall values above certain threshold will have the same number?\n\n\n4.     Any additional suggestions on properly obtaining and calibrating\nHDRI for this purpose?\n\n\n\n\nThank you,\n*Yulia Tyukhova*\n*\n*\nFulbright Scholar, \"Intern LC\"\nArchitectural Engineering Graduate Student, UNL-Omaha, NE, USA\nB.E. and M.E. in Lighting Engineering (MPEI), Moscow, Russia\njtyukhova at yahoo.com\nytyukhova at unomaha.edu\n+1 (402) 996 0910\nPKI 247\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2012-February/000355.html).</sup>", "attachments": [], "created_by_name": "Yulia Tyukhova", "created_at": "February 19, 2012 at 09:34PM", "created_by": "Yulia_Tyukhova", "parent_id": "hdri_000401", "id": "hdri_000355"}