{"body": "Makes sense.  I was curious about this simply because I wondered how  \nrobust the Camera Response Curves are in accounting for camera-based  \npre-processing.  Some cameras do things to the RAW data to enhance  \ncontrast, boost saturation etc. and then write the JPEG.  Some  \ncameras allow the user to define the amount of this processing (I'm  \nthinking of the Canon Digital Rebel that I shoot with, but I imagine  \nthat many cameras now offer user control of these parameters in some  \nform).  Do the camera response curves essentially account for these  \nsettings inasmuch as they affect the way the camera \"exposes\" the RAW  \nimage data from the sensor (referring to your statement below about  \nsecond-guessing what the camera is doing)?  I know that generating  \nHDR images from multi-exposure LDR images \"demands\" that auto-white  \nbalance not be used - are there similar suggestions for the camera- \nbased pre-processing parameters like contrast, saturation, etc. that  \nmay affect HDR generation or is that essentially what the curves  \ncompensate for (assuming that the same exact pre-processing camera  \nparameters are applied to each image)?  Because these pre-processing  \nalgorithms are automated, would they necessarily be applied  \nconsistently across the entire range of exposures or could they  \nintroduce some sort of changing response similar to a changing white  \nbalance that might affect the combination of the LDRs and the  \nextraction of a response curve?\n\n\nI suppose I could experiment by setting the parameters on my Digital  \nRebel to combinations of extrema in a relatively controlled lighting  \nsituation and see if it matters, but I'm not sure I would know what  \nto look for to measure any differences that might occur.  Clearly my  \nlimited understanding of the physics is being exposed here (my  \nlimited understanding has a very large apparent dynamic range) -  \nwhich may mean that in my dimwitted approach, it may not matter anyway!\n:-)\n\n\nThanks,\n\n\nkirk\n\n\n\n\nKirk L. Thibault, Ph.D.\nkthibault at biomechanicsinc.com\n\n\np.  215.271.7720\nf.   215.271.7740\nc.  267.918.6908\n\n\nskype. kirkthibault\n\n\n\n\n\n\n\n\nOn Jan 10, 2006, at 11:56 AM, Greg Ward wrote:\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-January/003228.html).</sup>", "attachments": [], "created_by_name": "Kirk Thibault", "created_at": "January 10, 2006 at 06:36PM", "created_by": "Kirk_Thibault", "parent_id": "radiance-general_003203", "id": "radiance-general_003228"}