{"body": "Hi Coralie,\n\n\nI was thinking the same thing as Jack, is it possible to have different\ntransmission for each side?  And even more puzzling, is it possible for a\nsubstance to absorb five times more light in one direction compared to the\nother?  Perhaps you could tell us how these values were measured?\n\n\nUsing your values for the exterior side I get the following trans definition\n(including sr=0.1):\n\n\nvoid trans transmat\n0\n0\n7 0.887 0.959 0.959 0.000 0.100 0.917 0.108\n\n\nIf you change your Td from 75.5 to 0.755 I think your results will agree\nwith mine.\n\n\nUsing your values for the interior side I get a trans definition with values\nfor A2 and A3 that are out of range, so something isn't quite right.  Again\nI think we could help if your shared your method for measuring your\ntranslucent panel.\n\n\nBest,\nAndrew\n\n\n\n\nOn 12/17/09 6:08 AM, \"Jack de Valpine\" <jedev at visarc.com> wrote:\n\n\n> Hi Coralie and Achim,\n> \n> A couple of comments. Optics 5 models thermal and spectral optical\n> properties of a wide range of glazing based on measured data. However it\n> does not contain a model for for diffusely transmitting materials. So\n> for modeling complex glazing systems and exporting data for use in the\n> \"glaze\" script it is a great place to start, however it will not help\n> with the kind of data that it looks like Coralie has available, which\n> suggests a material with a large diffuse transmitting component.\n> \n> There are a few things to note about the information that Coralie\n> provided. One is that it looks like one side is \"shiny\" or specular\n> while the other is \"mat\" or diffuse. The trans material will not give\n> you control over what happens on each side of the material. Based on\n> this alone it is likely that this is a material that would be better\n> characterized using the BRTDfunc material type. This allows for more\n> flexibility in describing material behavior. However, this being said\n> there is one thing that is a little puzzling (there are others who may\n> chime in on this who know more), this is that your measurments show\n> different transmittance (total) depending on the side of the material.\n> Is this possible? This certainly cannot be modeled with the \"trans\"\n> material type.\n> \n> Regards,\n> \n> -Jack de Valpine\n\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-December/006420.html).</sup>", "attachments": [], "created_by_name": "Andy McNeil", "created_at": "December 17, 2009 at 03:44PM", "created_by": "Andy_McNeil", "parent_id": "radiance-general_006415", "id": "radiance-general_006420"}