{"body": "On Wednesday, April 30, 2003, at 09:02 PM, John An wrote:\n> I had run across some threads discussing trying to find a new \n> publisher, but thought that the situation had been resolved, since \n> Elsevier Science happily took my order.  When I called to inquire \n> about my order, they confidenctly said that they would have the book \n> in stock on May 1st.  Is there any way that I could temporarily get my \n> hands on the book in the meantime?  Is there anyone in the Boston area \n> that would be willing to lend me their book?  After years of hearing \n> how great Radiance was, I finally got the courage to jump in and to \n> learn to use this program.  The lack of availability of Rendering with \n> Radiance has put a HUGE damper on my plans (though I am still \n> determined to use it for my dissertation).\n\n\nWell, I guess we'll find out tomorrow then. =8-)  I don't recall any \nannouncements from Greg about this situation getting resolved, but if \nit's true that's GREAT!  Do let us all know how you make out.  I'd \nstill like to get another copy for the office.\n\n\nCongrats on taking the plunge with Radiance.  It's a great program \n(that I am only beginning to understand), and the massive effort you \nput into learning it *will* be rewarded.  And this list is frequented \nby many of the gurus, and they are quite open and generous with their \nadvice.  It's a great bunch of people on here.\n\n\n> I see.  Thankfully, I only have 4 or 5 windows in my scene.  I dxfed \n> my model from a wondering modeling program called Sketchup (the most \n> intuitive modeling program I've come across), and had been meaning to \n> optimize the .rad file, but didn't realize that the excessive polygons \n> would impact the calculations.  Does this mean that I should optimize \n> (de-triangulate the rectangles) for all surfaces if I want accurate \n> calculations?\n\n\nIt's not the number of polys that's causing that aiming failure, it's \nthe shape.  And it's only with illum sources.  So no, you don't need to \nde-triangulate all your surfaces for accurate calcs.  Just fix those \nillum polygons and that error will go away.  That said, long thin \npolygons are not a \"good thing\", and others on here could give you a \nbetter explanation of why, but it's not the end of world if you have \nsome in there (I don't think).\n\n\nI played with Sketchup a little bit, among other modelers, but I always \ncrawl back to AutoCAD, for better or worse.  I guess once you get comfy \nwith something, it's hard to leave it.  If Skecthup works for you, use \nit.  But I find AutoCAD to be a very precise tool, and Gerog Mischler's \nradout utility is a great .DWG > Radiance exporter.  It's a good combo!\n\n\n> Thanks for your response.\n\n\nHa, it's my pleasure to be able to *answer* a question here, opposed to \nalways being the \"asker\".  (Hopefully I did not steer you wrong, but if \nI did I will surely be corrected here...)  Good luck in your pursuits \nwith Radiance!\n\n\nRob Guglielmetti\nrpg@rumblestrip.org\nwww.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000675.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "April 30, 2003 at 09:50PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_000672", "id": "radiance-general_000675"}