{"body": "Thanks for your advice Jack.  I don't know how many people on the list \nare interested in the intricacies of making nfs work on Mac OS X, but \nwith Apple hardware one of the many hardware options for running \nRadiance, I'll post updates on my experience.  So here goes...\n\n\nIn trying to get a stable Mac OS X only parallel rendering going, I \nswitched the server/client relationship.  In other words, the machine \nthat was previously the client became the server, and the server became \nthe client.  All other settings remained the same, but this time, the \nvast majority (~98%) of the processes were allocated to rpict.  I'm not \nsure why this set up is more stable than the other, but it is.\n\n\nSo then I tried mounting the nfs volume from the Linux machines, and \ntried starting an rpict process with an -af switch, and it also worked. \n  So I thought my problem was solved, but (there's always a but)...\n\n\nFile locking seems to work on the Linux machines, but not on the \nMacintosh client.  When I begin an rpict process on the Macintosh \nclient, and then attach another rpict from the Linux client, then the \noutput file always shows that the ambient values are corrupt.\n\n\nSo, once I figure out how to make the Macintoshes abide by the \nfile-locking protocols, I think all will be well.\n\n\nOne note, for anyone trying make nfs adjustments on the Macintosh, the \nshareware NFS Manager (http://www.bresink.de/osx/NFSManager.html) by \nMarcel Bresink is extremely helpful.  Unlike most UNIX/Linux \ndistributions, Mac OS X reserves files such as /etc/fstab and \n/etc/exports for system functions, and thus the settings need to be \nadjusted in the application NetInfo Manager.  NFS Manager puts a \nfriendlier GUI interface to dealing with NetInfo Manager.\n\n\nIn response to Guilio's comment about trying to use Appletalk to share \nthe ambient file, the problem arises in the file locking.  I don't \nthink Radiance knows how to deal with file locking in the Appletalk \nprotocol.  I too tried initially to see if I could share files over \nAppletalk, and Radiance always gave me an error message and then quit.  \nI did find some discussion in the developers forum on allowing Radiance \nto share files over Samba.  I haven't had a chance to explore this \noption any further, but has the Samba file sharing implementation been \nincorporated into the HEAD version of Radiance?\n\n\nI hope I'm not boring everyone with this discussion.  If so, just let \nme know, and I'll stop posting any updates.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-December/001358.html).</sup>", "attachments": [], "created_by_name": "John S. An", "created_at": "December 23, 2003 at 11:12AM", "created_by": "John_S._An", "parent_id": "radiance-general_001355", "id": "radiance-general_001358"}