{"body": "Rob Guglielmetti wrote:\n> Anthony J. Farrell wrote:\n> \n>> Hi Folks,\n>>\n>> I'm experiencing some difficulty installing Radiance onto Linux Redhat \n>> 9.0;\n>> furthermore I wish to update the classic version to that which \n>> utilising the\n>> photon map add on (pmap).\n>>\n>> Do I simply:\n>> 1. install the original radiance file  http://www.radiance-online.org \n>> onto\n>> my system first, and then\n>> 2. install the binary files for linux radbin_lnx_static.tar.gz(21 Megs) ,\n>> then\n>> 3. install the pmap patch RADIANCE photon map tarfile\n>> (http://www.ise.fhg.de/alt-aber-aktiv/radiance/photon-map/)\n>> 4. Then finally run the MAKEALL program from within (1.) above?\n>>\n>> I'm very new to Linux systems and would really appreciate any advice \n>> you may\n>> have to help me install this fine program.\n> \n> \n> I've never actually used the photon map module, so I can't give any \n> specifics on installing it.  However, Francesco Anselmo has created a \n> bunch of pre-made packages for radiance, including one that uses the \n> photon map.  Head on over to:\n> \n> http://www.dream.unipa.it/dream/pub/dot/anselmo/radiance/02.php\n> \n> ... for details.  They are based on the official release, but if you \n> wanna get started with the photon map and are new to installing & \n> compiling and LINUXing in general, these may be a good way to get your \n> feet wet.  Good luck!\n\n\nPatching is no longer necessary with the current pmap release -- you \njust dump the files into the RADIANCE source tree, clobbering those \nwhich were modified as well as adding some new ones. As far as I can \ntell, Anselmo's pmap binaries are based on an old release. Since you'll \nhave to recompile the whole suite anyway, you might as well omit step 2 \nabove. Note that RADIANCE modified with pmap behaves exactly like \nRADIANCE Classic unless you explicitly use pmap options. As such, you \ndon't need the original RADIANCE binaries anyway.\n\n\nGood luck!\n\n\n--Roland\n\n\n\n\n\n\nRoland Schregle\nPhD candidate, Fraunhofer Institute for Solar Energy Systems\nRADIANCE Photon Map page: www.ise.fhg.de/radiance/photon-map\n\n\nEND OF LINE. (MCP)\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-November/001235.html).</sup>", "attachments": [], "created_by_name": "Roland Schregle", "created_at": "November 24, 2003 at 08:23PM", "created_by": "Roland_Schregle", "parent_id": "radiance-general_001234", "id": "radiance-general_001235"}