{"body": "Dear Bayanda and Paul,\n\n\nAs indicated by Rick, the IESNA Daylighting Metrics Committee is proposing a DA-based  daylight availability/sufficiency metric.  (Last that I has seen the cutoff was 50% not 55% so I am unsure what the science behind the 55% to 75% is but Rick and Lisa may be able to clarify.) We have done a pilot study in a single building comparing student assessment of a space with DA simulations and found an encouraging correlation between the two [1]. Given that the pilot study was very limited we are currently repeating the exercise with a number of schools. I expect that we will end up with 10 to 20 spaces (http://mit.edu/tito_/www/Projects/DaylitAreaStudy/DaylitAreaStudyContinued.html). Our new study will run until the end of 2012 so if you are aware of a South African school of architecture that might want to participate, feel free to have them contact me. With the results of this new study pending, I support the IESNA 50% target level for 300lux daylight autonomy based on occupancy from 6Am to 8PM.\n\n\nIn 2009 one of our students, Cynthia Kwan, did a nice thesis on DA distributions in 31 gymnasia and concluded a 3 tier metric for this space type [2]:\n\n\n-          DA <50% = low\n\n\n-          DA< [50% to 70%]= medium\n\n\n-          DA>70% = high\n\n\n\n\nWhen it comes to DA vs. UDI I (not surprisingly) tend to favor the former mainly because (for design) I find it preferable to break daylighting into three separate metrics (availability, glare, energy) rather than combining them all in one metric which tends to be confusing to designers because then it becomes less evident how to modify the design of a space. I describe this thinking in [3]. Opinions certainly diverge on this topic.\n\n\nWarm regards,\n\n\nChristoph\n[1] C F Reinhart and D Weissman, \"The Daylit Area - Correlating architectural student assessments with current and emerging daylight availability metrics\", Building and Environment, 50, pp. 155-162, 2012.\n[2] C Kwan, MDesS thesis, Harvard Graduate School of Design, \"Towards Climate-based Metrics: A Simulation Study of  Annual Daylight levels  in 31 Gymnasia\",  (2009)\n[3] C F Reinhart and J Wienold, \"The Daylighting Dashboard - A Simulation-Based Design Analysis for Daylit Spaces\", Building and Environment, 46:2, pp. 386-396, 2011.\n\n\nChristoph\nChristoph Reinhart\nAssociate Professor\nDepartment of Architecture\nMassachusetts Institute of Technology\n77 Massachusetts Ave, Rm 5-418, Cambridge, MA 02139, USA\nt: 617 253 7714, f: 617 253 6152, creinhart at mit.edu<mailto:creinhart at mit.edu>\nSustainable Design Lab<http://mit.edu/SustainableDesignLab/> | DIVA<http://www.diva-for-rhino.com/> | Daysim<http://daysim.com/>\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-daysim/2012-October/000023.html).</sup>", "attachments": [], "created_by_name": "Christoph Reinhart", "created_at": "October 04, 2012 at 08:21AM", "created_by": "Christoph_Reinhart", "parent_id": "radiance-daysim_000021", "id": "radiance-daysim_000023"}