{"body": "Hi Paul,\n\n\nAnother tip:\n\n\nIf you are planning to simulate several sky conditions and times, you should\nconsider separating the electric light and daylight into two simulations.\nOnce you have a single rendering of the electric lighting and multiple\nrenderings of the daylight scenarios you can add the electric light\nrendering to each daylight rendering using pcomb.  This saves the time of\nrendering electric lighting with every daylight condition.\n\n\nAlso, since you are less concerned about the accuracy of the electric\nlighting you might consider adjusting the -dt parameter.  If I remember\ncorrectly the most computationally expensive part is the shadow testing.\nIncreasing -dt reduces the number of shadow tests performed and should speed\nup the simulation significantly.\n\n\nandy\n\n\n\n\n\n\nOn 5/26/09 10:08 PM, \"Rob Guglielmetti\" <rpg at rumblestrip.org> wrote:\n\n\n> \n> On May 26, 2009, at 8:07 PM, Paul Chilton wrote:\n> \n>> Hi Lars, Rob\n>> \n>> It looks like I have managed to get the mkillum surface to work for\n>> the skylight. The render times are reduced and the images displayed\n>> look different too.\n>> \n>> However, I have been testing the use of the mkillum without the\n>> artificial lighting turned on in my model. When I do turn them on\n>> and run them with the parameters set to high accuracy levels, the\n>> simulation takes a very long time. I think that any time gained by\n>> the mkillum surface is negated by the number of lights it has to\n>> simulate.\n> \n> The simulations will increase as you increase the number of light\n> sources, that is a fact of life (or virtual life, as in this case).\n> The mkillum process will help improve the speed and accuracy of the\n> lighting simulation of the light filtering in from the skylight, but\n> as you add in complexity through electric light sources, you will\n> experience a delay in the simulation times, yes.\n> \n> \n>> Is there a way of simplifying the artificial lighting of the tenants\n>> either side of the mall space? The goal of the artificial lighting\n>> in the tenancies is not to be highly accurate but rather to give the\n>> daylight in the mall space some context and to make it look more\n>> realistic as I¹m only concerned about the daylight in the mall.\n>> Ideally I would like to put a mkillum surface in the position of the\n>> array of lights but I feel that this wouldn¹t help reduce the\n>> complexity of the simulation as the same number of calculations\n>> still need to be carried out, am I right?\n> \n> The electric lights probably aren't doing much in terms of\n> contribution to the overall lighting that is predominantly from the\n> skylight. In this case you can use the glow material for your lights\n> (with a small radius, see the docs) to affect a visual context as you\n> are looking for without exacting a huge penalty on the render time.\n> \n>> \n>> Is there a way in Radiance to make a planer object emit a certain\n>> amount of uniform light?\n>> \n> \n> Yep, the glow is the material you want for this. I have used it\n> infrequently but I believe this is exactly what you need to get these\n> renderings looking good and completing in reasonable timeframes.\n> \n> - Rob Guglielmetti\n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general at radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-May/006028.html).</sup>", "attachments": [], "created_by_name": "Andy McNeil", "created_at": "May 27, 2009 at 09:40AM", "created_by": "Andy_McNeil", "parent_id": "radiance-general_005989", "id": "radiance-general_006028"}