{"body": "Hi Anne, Lars, everyone,\n\n\nFun topic! Replies within...\n\n\nOn 9/15/10 12:17 PM, \"Anne Iversen\" <iversen.anne at gmail.com> wrote:\n\n\n> 1) \n> What I get out of rsensor can be illuminance readings for the specified\n> photocell?\n> The following command would generate the illuminance-level on the sensor, \n> right?\n> \n> rsensor -ab XX -i [sensor view] sensor_file scene.oct > illsensor.dat\n\n\nActually, rsensor computes photosensor response on the sensor -- which WOULD\nbe illuminance assuming the sensor's response was a perfect cosine one, but\nthe final output of rsensor ultimately is photosensor response. So your\ncommand above would send the sensor response to STDOUT.\n\n\n> 2)\n> From Axel Jacobs tutorial on rtcontrib I can see how I can obtain illuminance\n> readings from photocells defined as points - but how should I do it if I am\n> not interested in the point illuminance reading, but interested in the\n> illuminance level falling onto the sensor that doesn't see an hemisphere?\n> Can I somehow replace the\n> $ cat workingplane_photocell.pts | rtcontrib .........\n> \n> with\n> $ cat [sensor view] sensor_file....| rtcontrib...??\n\n\nLars proposes an image based approach to evaluating what the sensor \"sees\"\nand integrating a weighted response. This in effect is what psens (Chas\nEhrlich's project) does, on a single image. This is the tool Zack Rogers\nused in SPOT's initial versions, and it was SPOT that led to the development\nof rsensor in the first place. What you are trying to do above is to apply\nthe daylight coefficient approach to deriving the photosensor response, and\nI think it's no secret to anyone watching this mailing list over the last\nyear or so that this is a subject of great interest to us all and some of us\nare working on this to some degree. The reason for the interest is that with\ndaylight coefficients, we can do annual simulations with hourly resolution\n(and even incorporate occupant response (blinds, etc) and complex\nfenestration systems), in a reasonable timeframe.\n\n\nThe promise here is being able to leverage new tools in the Radiance toolkit\nto not only calculate annual daylight availability and quality metrics, but\nto carry that capability through to the ever-crucial follow-through on the\nelectric lighting side -- the daylight-responsive lighting control response\n-- and to study this at an annual/hourly resolution. This would allow us to\ninform whole building energy simulation tools and really start to understand\nthe energy impacts of daylighting in a holistic way.\n\n\nWe at last have tools to get us partway there. These would be rtcontrib,\ngenskyvec, and dctimestep. With these we can compute DCs for task plane\nilluminance, but also -- critically -- sensor points on the ceiling or some\narbitrary location/aiming. But we still want to be able to weight the\ncontributions by the photosensor response. For this, I could imagine a cal\nfile inserts itself into this workflow, maybe dctimestep accepts an\nadditional argument for a cal file and there's a \"signal\" option for passing\nall this to rsensor. (?)\n\n\nKung Fu Feature Request:\nOR, as we gather up all the DCs and weight them by the sky luminance, could\nwe ALSO weight them by photosensor response, BEFORE summing and computing a\nsignal? My sense is that this is not possible but I don't fully understand\nall the ray accounting that is possible in rtcontrib. Perhaps this could be\na new feature? (???) (!!!)\n\n\nWe are working on rtcontrib-based tools here at NREL and are basically at\nthis very crossroads. I believe others out there are \"there\" too, and I\nwanted to file this reply since it will have to serve as a proxy for my\nattendance at the Workshop next week. =(\n\n\nVery exciting times.\n\n\nRob Guglielmetti  IESNA, LEED AP\nBuilding Energy Efficiency Engineer\nNational Renewable Energy Laboratory\n1617 Cole Blvd, MS-5202\nGolden, CO 80401-3393\nT. 303.275.4319\nF. 303.384.7540\nE. robert.guglielmetti at nrel.gov\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-September/007276.html).</sup>", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "September 15, 2010 at 12:49PM", "created_by": "Rob_Guglielmetti", "parent_id": "radiance-general_007271", "id": "radiance-general_007276"}