{"body": "Hi Oskar,\n\n\nThe formatting of your post is rather messed up, but I'll try to  \nreply in-line:\n\n\n> thanks for your reply - as I have no reservations using the 3.1.11\n> ximage on pics created with 3.7.2, that's fine for me.\n>\n> However, although in my original post I'd reported that compilaton\n> of 3.7.2 on my SGI FUEL under IRIX 6.5.28/MipsPro 7.4.4/V12 works\n> \"ok\" [since I'd only looked at the tail of the file into which I'd\n> re-directed the output from <makeall install> and I'd read 'Done.'\n\n\nRadiance compiles with the rmake -k option, which means that  \ncompilation continues even when errors are encountered.  You can take  \nthis off in the makeall script if you like.\n\n\n> there, I'd not bothered further to wade thru all messages], upon\n> closer inspection I did indeed find a few entries worth of comments\n> - please bear with me for the nonce. First, here is my rmake command:\n...\n> 1. In directory px...\n> \trm -f [...]\n> \tcd tiff; make distclean\n> don't know how to make distclean (bu42).\n> *** Error code 1 (bu21)\n>\n> Right now it escapes me why this doesn't work, as <Makefile> in tiff\n> \"does\" have a target \"distclean\" indeed.\n\n\nI've seen this problem before, but I don't know where it comes from.   \nI suspect that the latest TIFF library is using some non-standard  \nfeatures of make that aren't supported on your system.  Not much I  \ncan do to fix it because I don't understand the build on libtiff at all.\n\n\n> 2. There are a number of\n>\n> sh: ranlib:  not found\n> *** Error code 127 (bu21) (ignored)\n>\n> as IRIX doesn't have/need ranlib at all.\n\n\nThis should be no cause for concern.\n\n\n> 3. More seriously, however,\n>\n> In directory hd...\n> cc-1020 cc: ERROR File = rhd_ogl.c, Line = 367\n>   The identifier \"d\" is undefined.\n>\n>   \td = eyesepdist / sqrt(nv->hn2);\n>   \t^\n>\n> 1 error detected in the compilation of \"rhd_ogl.c\".\n> *** Error code 2 (bu21)\n>\n> So I wonder why compilaton hasn't just stopped there in the first\n> place???\n\n\nThe compilation continued because of the -k option, as mentioned  \nabove.  This is a bug introduced some years ago no doubt in one of  \nGeorg Mischler's code clean-ups.  Almost no one uses -DSTEREO, which  \nis why it wasn't noticed before.  Just add a \"double d;\" declaration  \nat the top of the routine and it should be OK.  Let me know if you  \nrun across anything else -- I've checked in a fix for the next release.\n\n\n> 4. Although I've quite rarely seen a package which produces almost\n> no warnings [Radiance is a very satisfactory exception - applause\n> to you!!!],\n\n\nActually, you have Georg to thank for that.  I used to just ignore  \nwarnings, which accumulated over the years as C compilers got more  \nand more finicky.   Schorsch went in and fixed most  of them.\n\n\n> I do get a whole bunch of them when\n>\n> In directory px...\n>         cd ../libtiff ; make install\n>\n> While you seem to use tiff-3.7.3 in Radiance 3.7.2, I've gotten\n> most of these warnings also when I compiled the stand-alone tiff-3.8.2\n> before - so, I can live with them [and I don't blame you at all\n> there :-)]. On the other hand, though, I see\n>\n> Libtiff is now configured for mips-sgi-irix6.5\n>\n>   Installation directory:             /usr/local\n>\n> although libtiff is indeed later installed in src/lib as wanted...\n\n\nLike I said, I don't understand libtiff compilation, and I just  \nstruggle to get it to do anything reasonable at all.\n\n\n> 5. BTW, upon installation of Radiance 3.7.2, I get a directory\n>\n> <...>/test/test data/\n>\n> [note the blank in the dir name], and I can't access files in there  \n> at all:\n>\n> IRIS 121 $ cd /disk03/mephisto/source/radiance_3.7.2/test/test data\n> ksh: /disk03/mephisto/source/radiance_3.7.2/test/test:  not found\n\n\nThis is part of Georg's test suite, which is another thing I don't  \nunderstand.  I think he has the spaces in there for a reason, but I  \ndon't recall what it was.\n\n\n> OK, I'd run <makeall clean> - this time I got no error (!) with\n>\n> In directory px...\n> \trm -f [...]\n> \tcd tiff; make distclean\n>\n> [although .o/.lo are not cleaned out in tiff/libtiff at all - I  \n> deleted\n> them\n> manually], but I got a new error:\n>\n> Making distclean in man\n> make: file `Makefile' line 292: Syntax error\n> *** Error code 1 (bu21)\n> *** Error code 1 (bu21)\n> *** Error code 1 (bu21)\n>\n> which I didn't have when compiling the stand-alone tiff-3.8.2.\n\n\nLibtiff again.  Dunno.   Dunno.   Dunno.\n\n\n> Anyway, prompted by 3) above, in <...>/src//hd/rhd_ogl.c, I added\n>\n> 326a327\n>>         double d;\n> [guessed from similiar usages of d in the same .c], and this error  \n> went\n> upon a fresh <makeall install>.\n\n\nYeah, that's the right thing to do -- didn't read this far before my  \nresponse.\n\n\n> However, as my original ximage problem was still there, I installed\n> 3.7.2 also on my SGI INDIGO2 [IRIX 6.5.22/MipsPro 7.4.2/GR2] and\n> afterwards the 3.7.2 ximage worked on it fine! So, I copied the\n> 3.7.2 ximage as generated on the INDIGO2 to the FUEL - but I got\n> only the original problem again. Then I copied the 3.7.2 image as\n> generated on the FUEL to the INDIGO2 but understandibly it didn't\n> run there at all:\n>\n> ksh: ximage: Program not supported by architecture\n>\n> So, my conclusions are:\n>\n> 1. There is something wrong on my FUEL, or\n>\n> 2. Radiance 3.7.2 doesn't work properly anymore on the FUEL [to  \n> repeat:\n>    ximage after recompilation of 3.1.11 on the FUEL works quite  \n> well there]...\n\n\nI wish I could follow what you just said.  What do you get if you cd  \nto ray/src/px and just run \"rmake ximage\" there?\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-May/003712.html).</sup>", "attachments": [], "created_by_name": "Greg Ward", "created_at": "May 23, 2006 at 03:20PM", "created_by": "Greg_Ward", "parent_id": "radiance-general_003677", "id": "radiance-general_003712"}