{"body": "Hi Per!\n\n\nThis is a translucent, diffusing panel. There have been lots of \ndiscussions on this on the mailing list, as well as a bunch of \npresentations on workshops and even papers. The basic answer would be - \nuse the trans material in Radiance.\n\n\nHowever, the material model for trans is very generic, while translucent \npanels are made applying very different approaches. There is volume \nscattering, scattering by etching / sanding / ... a surface (outer or \ninner), laminating films on or in between panes, ... and all show \ndifferent characteristics. In your case, it is probably volume \nscattering, so I would guess reflection to have a strong specular peak \ndue to the clear, smooth surface, with a strong diffuse component from \nlight scattered back, and probably a nice diffuse transmission. However, \nit is difficult to know before having any data on it. Can you see a \nlight source through it, when holding it in fron of e.g. a strong lamp? \nOr does the brightness appear more or less flat? Peter is offering \nmeasurements using his goniophotometer, as well as others do. Christoph \nReinhart described modeling a translucent panel in his paper:\n\n\nReinhart C F, Andersen M, \"Development and validation of a Radiance \nmodel for a translucent panel\", Energy and Buildings 38:7 pp. 890-904, 2006\n\n\nwhich can be found at EPFL:\n\n\nhttp://infoscience.epfl.ch/record/88112/files/Development%20and%20validation%20of%20a%20Radiance%20model.pdf\n\n\nand presented on a workshop:\n\n\nhttp://www.radiance-online.org/community/workshops/2005-montreal/PDF/TranslucentPanelValidation.pdf\n\n\nSo a wide field to work on... Cheers, Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2012-October/008946.html).</sup>", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "October 10, 2012 at 02:39AM", "created_by": "Lars_O._Grobe", "parent_id": "radiance-general_008945", "id": "radiance-general_008946"}