{"body": "I did some validation measurements, some years ago, for my thesis... (not as\ngood as some others did before me... )\nThe values I had were quite different from the expected (radiance\ncalculated).\nAt the time I had not reliable information on the value of the turbidity\nfactor for the area I was studying.... what happened then it is another\nstory...\nbut going back to your problem:\n\n\nI think that calculated illuminance can be the same only if you have a way\nof measuring the sky luminance distribution.... (not CIE standard but\nreal...)\nI think that the best paper you can find on it is the Mardaljevic PHD\nthesis...\n(http://www.iesd.dmu.ac.uk/~jm/sg98.htm)\n\n\nThe values that you have aren't so bad... compared to mine (I remember\nsomething like 30% RER..)  \n;-((\n\n\nPS - a recent post pointed out the limits of simulating low altitude sun\nskies... (Perez sky model have the same limitation with low angles, where\nuncertainty is really high) ... so the only way is to override the sky\ndefinition and constrain it to a known illuminance value... I guess... but\nyou have still no way of knowing the luminance dist...\n\n\nabout the falsecolor images you should try to use on the dos terminal:\nfalsecolor -s maxvalue -n numberof intervals -l label -m multiplier -i\nyourpicture > finalimage\n\n\nif gives you an error try this:\nfalsecolor -s maxvalue -n numberof intervals -l label -m multiplier -ip\nyourpicture > finalimage\n\n\nwhere multiplier is:\n179 for illuminance and luminance (depending on the type of image)\n179/external_illuminance for daylight factor plots\n\n\ncheers,\ngiulio\n\n\n\n\n\n\n-----Original Message-----\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-April/001575.html).</sup>", "attachments": [], "created_by_name": "Giulio Antonutto", "created_at": "April 06, 2004 at 04:39PM", "created_by": "Giulio_Antonutto", "parent_id": "radiance-general_001573", "id": "radiance-general_001575"}