{"body": "Hi Cramer.\n\n\nOn Fri, Mar 12, 2010 at 10:11 PM, Cramer Silkworth\n<silkworth at transsolar.com> wrote:\n> Hi Thomas & All\n>\n> I'm experimenting with su2rad as a new way of doing our daylight studies\n> (second time actually, hopefully i get a good workflow fully developed this\n> time). I don't have it fully working yet, but I do have useful radiance\n> geometry exports that i can use with our existing radiance (linux) setup.\n\n\nGreat. Exporting geometry is more or less what su2rad is all about. If\nthat works you can use any common way to run the actual calculations.\n\n\n> Now I just need to get results back into SketchUp. I see that su2rad can\n> import \"numeric results,\" but what format are these supposed to be?\n\n\nThe data files have to be in a plain ascii format that can be produced\nby rtrace and rcalc. Records are stored in the file one per line. The\nlines can be of the format \"x y z value\" or \"x y z dx dy dz value\".\nYou can produce this output with the \"-oodv\" option for rtrace and a\nbit of rcalc:\n\n\ncat field.fld | rtrace -ab 4 ... -I -oodv scene.oct | rcalc -e\n'$1=$1;$2=$2;$3=$3-1;$4=$4;$5=$5;$6=$6*-1;$7=($7*0.265+$8*0.67+$9*0.065)*179\n> field.lux\n\n\nThe corrections for $3 and $6 is necessary because rtrace with -I\noption reports origin and direction differently.\n\n\n> I'm not running radiance from sketchup yet, but I ought to be able to\n> reformat the results I do have to view in SketchUp (if it's plain text).\n\n\nIf you prefer a shorter command line you can calculate only lux (or df\nor whatever) values in a separate file and then use rlam to combine\nthem:\n\n\nrlam field.fld field.lux > field_import.lux\n\n\n(that last one is untested).\n\n\n> Or do I really need to get the windows-based radiance side of things up\n> and running? I may be trying to put a square peg into a round hole...\n\n\nsu2rad doesn't offer an option to run Radiance from within SketchUp\n(yet). I do my programming on a Mac so things get developed and tested\non a Unix type system first and then I work on making them work on\nWindows. su2rad will also always export data in a format that can be\nused with the basic Radiance tools.\n\n\nCheers,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-March/006640.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "March 12, 2010 at 02:49PM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_006637", "id": "radiance-general_006640"}