{"body": "I was wondering if I could get some input from the experienced Radiance \nusers out there regarding rendering parameters.  I am currently \nrendering an extremely basic room (13.5'x13.5'x14') with one indirect \nlight fixture.  However, accuracy is extremely important.  So I am in \nthe process of running test runs to see what would be the optimal \nrendering parameters within the time limit I have.\n\n\nI had been getting blotchy results, so I have been doubling the -ad \nparameter.  My most recent rendering parameters were:\n\n\n-i -t 600 -dt 0.04 -dc 1 -ds 0.01 -dj 0.6 -dr 3 -dp 4096 -st 0.01 -sj 1 \n-av 0 0 0 -aw 0 -ab 3 -ad 4096 -as 2048 -ar 256 -aE ../ambient_exclude \n-ms 2.7 -lr 12 -lw 0.0005 -aa 0.04 -af b_b_m.amb -ps 1 -pt 0.04 -x 512 \n-y 512 -pa 0\n\n\nI did an overture rendering at -x 64 -y 64 prior to creating the image \nat 512x512.\n\n\nI am, still getting what I feel to be significant blotchiness.  The \nimage can be seen at:\nhttp:/homepage.mac.com/jsan\n\n\nSo, my questions are:\nAre there any immediate red-flags you see in my rendering parameters \nthat seem incorrect?\nDo I simply need to keep increasing the -ad to get better results, or \nwould lowering the -pt help both the visual and calculation accuracy?\nIf I pfilt the image with -x /2 -y /2, will that merge the values of \nthe pixels enough to make the values at each pixel relatively accurate?\n\n\nJust as background, this image took about 12 hours to render (with the \noverture calculations) using rpiece on a dual G5 Macintosh with 1.5 GB \nof RAM and a 2.24 P4 with 1 GB of RAM.  I have about 200 similar \nsituations to run (more light fixtures, larger room, etc.)  So \nincreasing the -ad to 8192 seems to be prohibitively expensive at this \npoint.\n\n\nThanks.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-January/001372.html).</sup>", "attachments": [], "created_by_name": "John S. An", "created_at": "January 04, 2004 at 12:25PM", "created_by": "John_S._An", "parent_id": "radiance-general_000593", "id": "radiance-general_001372"}