{"body": "> if you want my arogant two-cent thoughts after some years of IT life: \n> the only reason for doing it by email is what the name of your domain \n> says: becausewecan.org\n\n\nI love the input, that's why I posted it out to the list! ;-)\n\n\n>   1. You'll be moving a couple of dozen megabytes for any serious work,\n>      email gateways typically block very large emails, not to mention\n>      folks with slow links. A sysadmin may rip out vital parts out of\n>      someone using the system mail spool area as intermediate\n>      octree/image storage.  ftp/http/scp is just better by design for\n>      large volume\n\n\nA: See No. 3 below\n\n\n>   2. the server has to set up everything the specific job needs\n>      (version of binaries, environment variables, libraries, ...),\n>      which needs a bit of care with any method\n\n\nA: I was thinking that this would be a part of the solution, a .zip or \n.tar file is sent to the 'RRS' (thanks for that) and then it's \nunpacked, and any user-defined .cal's and such will be included within \nthat archive. The basic assumption is that everyone using this (which \nwould be my company, which right now consists of me ;-) ) would be on \nthe same page, Radiance-wise.\n\n\n>   3. web-based leaps to mind before email does (the latter probably\n>      never leaps anyway...). Marc Fontoynont's group sat up something\n>      for their Genelux program long ago (sorry, don't have any further\n>      references to it)\n\n\nWeb stuff and FTP are all well and good, and a great way to go, if I \nwant to pay extra for a static IP and the task of managing my own \nserver. I'm mobile, working from a laptop, and while I can run stuff \nunder Cygwin (and do) it would be cooler/better/more feasible to have \nthe RRS do this while I'm working on something else and/or in transit.\n\n\n>   4. how do your users pack their jobs ? zip,tar ? How do they verify\n>      they have everything included ?\n\n\nI've got a flowchart that I worked out, that makes it e-mail back \nerror messages if something is left out or if there is an error.\n\n\n>   5. why setting up a server anyway? For an occasoanl user the various\n>      boot-radiance-from-cd concepts are probably much quicker (right on\n>      their machine), for bulk processing a render farm with file\n>      sharing is approx 3 orders of magnitude faster and easier to manage\n\n\nTwo things: When rendering, I would like to work on my computer for \nother things too, and those other things require Windows. Currently I \nrun Cygwin on my laptop, and use Radiance within there. This is \nworking well, but I would love to be able to hand these jobs off to a \nfaster computer, and a desktop/server gives a lot more bang for the \nbuck than a laptop in raw processor speed. It would also allow for the \nRRS to run whatever OS is best on whatever hardware I can afford, and \nthen I can move the RRS to whatever platform I need, or in the future \nto a cluster...\n\n\nSecond is that it would be cool. No, Seriously. I work in Revit, dump \nmy models to AutoCAD, tweak layers and such, export to Radiance, send \nthe job off, and then keep working in Revit while my job 'bakes' on \nthe RRS and is sent back to me when done. How cool would that be? My \nlittle RRS working away, day and night... Makes animations much more \nfeasible too!\n\n\n>   6. for public usage the server would have to implement some resource\n>      management, otherwise any job may block the resources for an\n>      unpredictable time\n\n\nThis would primarily be for my own use, so I'm gonna start out small.\n\n\n> if you still want to go and dig in (good!), my personal recommendation \n> would be PHP scripts on a webserver (very preferably Apache).\n\n\nYeah, if I go with a web-thing it would probably be Apache on \nMandrake, using Python (just because it's what I'm a little familiar \nwith) or something.\n\n\nThanks again, keep it coming!\n\n\nJeffrey McGrew\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-April/001620.html).</sup>", "attachments": [], "created_by_name": "Jeffrey McGrew", "created_at": "April 21, 2004 at 12:35AM", "created_by": "Jeffrey_McGrew", "parent_id": "radiance-general_001615", "id": "radiance-general_001620"}