{"body": "Hi Mark\n\n\n>...\n>\n>I first tried pdfblur, which outputs a series of views, each\n>of which can be rendered with rpict or created with pinterp.\n>  \n>\nI'm not quite sure I see the light here yet, but I'm interested, as \nrshow had some experimental features of generating the views (actually \nbefore realizing there are some cmdline tools buried deeply somewhere), \nthat's how the lower image at \nhttp://www.pab-opto.de/radiance/render_vergleich/intro.htx was rendered \nwith 16 single views.\n\n\nBefore decompiling the rcalc script, could you briefly say why your \nmethod is faster ?\n\n\nTo give a hint of the little bits I do understand: Out-of-focus pixels \naverage over a larger solid angle as in-focus ones. Even the solid-angle \nof in-focus pixels is truly not zero, that's why we need oversampling to \navoid aliasing. Traditional methods calculate anti-aliased images with \nshifted view points and directions which are than added to give the \nblurred final result. Do I understand correctly that your method \nincorporates the depth-of-field information into the per-pixel averaging \nover the per-pixel-solid-angle ? Speed advantage would than come by \navoiding unnecessary rays. Is there an easy way to understand how ?\nWith the old method, each of the images has the same size, so one pixel \nis effectively oversampled by the number of images. Whether in-focus or \nnot. Are you saying that the out-of-focus ones need more sampling than \nthe in-focus ones ? And the in-focus don't gain much from the higher \nsampling ?\n\n\nTIA\nPeter\n\n\nPS: nice Radiance webpages of yours\n\n\n\n\n pab-opto, Freiburg, Germany, http://www.pab-opto.de\n [see web page to check digital email signature]\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-August/001974.html).</sup>", "attachments": [], "created_by_name": "Peter Apian-Bennewitz", "created_at": "August 16, 2004 at 10:53PM", "created_by": "Peter_Apian-Bennewitz", "parent_id": "radiance-general_001973", "id": "radiance-general_001974"}