{"body": "Jia.\n\n\nThe current official release is 4.0 from radsite.lbl.gov. This package\ncontains all files for the core tools. It does not contain source\nfiles for libtiff which is only required if you want to compile the\ntool ra_tiff which allows conversion from and to TIF images. However,\nthere is a small bug in the makeall script: if it can't compile\nra_tiff it will not install any of the other converters. It will\nreport errors instead.\n\n\nTo avoid these errors you need to download an additional package,\nrad3R9supp.tar.gz (or any other archive). This file contains the\nlibtiff sources and a lot of other material (example scenes, images,\nmesh objects). It's a pretty big file and because it's not essential\nfor the core Radiance tools it was spit out in a separate package.\nDon't worry about the version number. The \"supp\" file should work with\nthe new 4.0 Radiance from radsite.lbl.gov. All other files on\nradiance-online.org need to be updated. The official 4.0 release of\nRadiance is only a couple of days old so there was no time yet to\nupdate that site, too.\n\n\nThe best way to compile is:\n\n\n1) Download and unpack rad4R0all.tar.gz. This will create a \"ray\" directory\n2) Download and unpack rad3R9supp.tar.gz. Unpack this in the same\ndirectory. This will extract its files in the same \"ray\" directory\nthat was created before.\n3) cd into \"ray\"\n4) compile with \"sudo ./makeall install | tee makeall.output\"\n\n\nThis will create a file called \"makeall.output\" with all the stuff\nthat's scrolling by on your terminal during the process. You can check\nit for errors later. If you see the message about errors again send\nthis file and we can see what was going wrong.\n\n\nRegards,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-March/006688.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "March 27, 2010 at 01:13PM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_004434", "id": "radiance-general_006688"}