{"body": "On 13 May 2008, at 13:51, Per Haugaard wrote:\n\n\n> 6.216 0.00 1.8 0 -1 0 (window)\n> 6.216 0.05 1.8 0 -1 0 (black wall located 0.05 m behind the window  \n> - in fact all walls are black)\n>\n> The Window (LT=0,72):\n> void glass window_glass\n> 0\n> 0\n> 3 .78 .78 .78\n>\n> cat IllumKoordinater.pts | rtrace -I -ab 4 -h -w -oov kontor.oct |  \n> rcalc -e '$1=$2;$2=179*(.265*$4+.670*$5+.065*$6)' > lux.dat\n>\n> Output\n> -1       4883.69\n> -0.95  3049.70\n\n\nIf I understand the above correctly you are calculating two points:\none in front of the window, one behind it. The black walls are used\nto swallow all light reflections on the inside so you will only have the\ntransmitted light left.\n\n\nTwo improvements:\n\n\n1) Move the wall further back or place your second point at ie. 0.04. If\nthe calculation point coincides with the wall everything is possible.\n\n\n2) Don't use a box at all. At the perimeter there is a dark horizon  \n(black\nwalls) which is taken in into the calculation. You could create a sphere\nof the material around your calculation point instead.\n\n\n> Two things worth noticing here. The output coordinates are not  \n> listed correctly which gives me the suspicion that lux-values are  \n> is not calculated for the correct coordinates. Furthermore the  \n> ratio between the output are not according to the entered LT-value  \n> for the window (0,62 vs. 0,72)\n\n\nThe first is the result of rtrace's interpretation of the '-I' switch  \n(uppercase 'I'!)\nrtrace creates a 'virtual surface' at the calculation point and  \nstarts the calculation\nfrom the point of the view vector. In your case these are (6.216+0, 0 \n+-1, 1.8+0)\nand (6.216+0, 0.05+-1, 1.8+0). Your rcalc command prints only the y- \ncoordinate.\n\n\nThe second problem I can't explane but depending on the size of your\nbox the 'dark horizon' might have some influence here.\n\n\nRegards,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-May/005011.html).</sup>", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "May 13, 2008 at 12:31PM", "created_by": "Thomas_Bleicher", "parent_id": "radiance-general_005005", "id": "radiance-general_005011"}