{"topic": "Infrared outdoor scene simulation", "category": "radiance-general", "attachments": [], "created_by_name": "Andrew Bettison", "created_at": "May 09, 2003 at 05:12PM", "body": "( PLEASE DO NOT QUOTE MY EMAIL ADDRESS IN THE CLEAR\n         AS I DO NOT WANT SPAMMERS TO HARVEST IT FROM THE\n         MAILING-LIST ARCHIVE WEB PAGES.  Thank you. )\n\n\nI am currently working on a project that requires high-fidelity,\nnon-real-time, multi-spectral infrared simulation of large-scale outdoor\nscenes.  The horizon may be up to 50 km away from the focal point, and\nobjects of interest may be anywhere from dozens of metres to dozens of\nkilometres distant.\n\n\nI surveyed the available open-source ray tracers, and RADIANCE is the only\nsuitable candidate I could find.  I have read and understood most of the\nRADIANCE research papers listed on the web site, gone over the rpict(1) man\npage in detail, and have skimmed through all the archived mailing lists.  I\nhave not yet rendered anything nor spent any time reading source code.\n\n\nI will need to make some modifications to RADIANCE for this project:\n\n\n* The first modification is a way to specify very irregular subdivision of\nthe image plane so that the level of detail of and around objects of\ninterest can be wound up, while \"uninteresting\" parts of the scene can be\nrendered in much lower detail to speed computation.  Essentially, this would\nprovide a kind of selective oversampling.\n\n\n* The second modification is a different atmospheric propagation model that\ncan accurately compute infrared as well as visible spectral path emissions\nand attenuations between any two points under specified environmental\nconditions.  The model itself is very extensive, highly validated, and of\nmilitary pedigree.  The modification to RADIANCE would take the form of an\natmospheric model \"plug-in\" scheme for rpict(1) and a gensky(1)-like program\nthat would use the plug-in to compute a sky radiance map and solar/lunar\nposition+radiance.\n\n\nI would be more than happy to contribute the results of this work back to\nthe RADIANCE project, if there is interest.  I have two questions:\n\n\n- Is anyone aware of any similar work that has already been done or may be\n  ongoing?\n\n\n- Does anyone have any comments that might assist me to plan this work, or\n  make the outcome more useful for the RADIANCE community?  I would like to\n  know about any issues such as outstanding performance/accuracy concerns\n  with the existing ray propagation model, or limitations to be aware of in\n  the rendering of large-scale, outdoor scenes, or any wish-list features\n  that may dovetail into this work.\n\n\n\n\nAndrew Bettison\nAcacia Research Pty Limited\n< andrewb AT acres DOT com DOT au >\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000717.html).</sup>", "id": "radiance-general_000717", "created_by": "Andrew_Bettison"}