{"topic": "Unmet Hours-- A new Q+A resource for building energy modeling", "category": "radiance-general", "attachments": [], "created_by_name": "Neal Kruis", "created_at": "October 21, 2014 at 08:41AM", "body": "Dear Radiance community,\n\n\nIBPSA-USA <http://ibpsa.us/> and Big Ladder Software\n<http://bigladdersoftware.com/> are pleased to announce a new, free online\ncommunity resource called Unmet Hours (https://unmethours.com/), a\nquestion-and-answer (Q+A) website for building energy modelers.\n\n\nWhat is a question-and-answer website? It’s a new type of resource that has\nemerged from the programming world as an alternative to mailing lists or\nforums. But it’s super simple. You ask a question. Other modelers answer\nit. The best answer gets voted to the top. Or you can search on your topic\nand you might find that your question has already been asked and answered.\nAnd it’s always good to give back to the community (while showing off your\nexpertise and earning good “karma”) by helping other modelers with their\nquestions.\n\n\nAt Unmet Hours, you can ask questions about any modeling topic or software\ntool, including Radiance\n<https://unmethours.com/questions/scope:all/sort:activity-desc/tags:radiance/page:1/>.\nNumerous experts are standing by, eager to help, and ready to answer your\nquestions--big or small. There are already more than 240 registered users,\nmore than 90 questions, and more than 170 answers on the website.\n\n\nUnmet Hours offers many capabilities that make it a powerful resource for\nthe building energy modeling community:\n\n\n\n\n\n\n\n\n   Each individual question is kept together with its answers on one web\n   page that can be easily referenced with a unique URL.\n\n\n\n\n   Answers are peer reviewed and voted on by the community to reach a\n   consensus on which ones are most likely to be helpful or “correct”.\n\n\n\n\n   Questions are easily searchable on the website. All content is indexed\n   by Google and other search engines.\n\n\n\n\n   Questions are tagged with category labels such as ‘infiltration\n   <https://unmethours.com/questions/scope:all/sort:activity-desc/tags:infiltration/page:1/>’,\n   ‘daylighting\n   <https://unmethours.com/questions/scope:all/sort:activity-desc/tags:daylighting/page:1/>’,\n   or ‘radiance\n   <https://unmethours.com/questions/scope:all/sort:activity-desc/tags:radiance/page:1/>’\n   making it easy to find topics of interest.\n\n\n\n\n   Questions can be tagged across multiple categories for cross-cutting\n   problems, for example, ‘ashrae-90.1\n   <https://unmethours.com/questions/scope:all/sort:activity-desc/tags:ashrae-90.1/page:1/>’,\n   ‘hvac\n   <https://unmethours.com/questions/scope:all/sort:activity-desc/tags:hvac/page:1/>’,\n   and ‘openstudio\n   <https://unmethours.com/questions/scope:all/sort:activity-desc/tags:openstudio/page:1/>\n   ’.\n\n\n\n\n   Tags or individual questions can be “followed” to receive email updates\n   when there is new or changed content. You control your email update\n   preferences.\n\n\n\n\n   Comments are used to discuss or make suggestions about a question or\n   answer without distracting from the main content.\n\n\n\n\n   All content is actively moderated and curated by the community.\n   Questions and answers can be revised at any time to be clearer and more\n   helpful, or to be updated as new information becomes available. It’s a\n   living knowledge base.\n\n\n\n\n   And it all works conveniently in the web browser on your smartphone!\n\n\n\n\nYou can find Unmet Hours at https://unmethours.com/ It’s a resource for the\nbuilding energy modeling community, built by the community. We are counting\non your support and participation to continue its success.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2014-October/010561.html).</sup>", "id": "radiance-general_010561", "created_by": "Neal_Kruis"}