{"topic": "Daylighting Training", "category": "radiance-general", "attachments": [], "created_by_name": "Christoph Reinhart", "created_at": "May 09, 2013 at 08:48AM", "body": "Dear Radiance aficionados:\n\n\nAs in previous years, we will be offering a three day Executive Education program on Daylighting Buildings<http://execed.gsd.harvard.edu/programs/daylighting-buildings-1> at Harvard from July 10-12 2013.\n\n\nCourse participants will acquire a range of daylighting design analysis techniques ranging from rules of thumb to state-of-the-art computer simulations and high dynamic range photography for glare analysis. The main simulation program used will be DIVA<http://diva4rhino.com/>, a Rhino plug-in that supports the calculation of daylight availability (Radiance/DAYSIM), annual daylight glare probability maps (Radiance/Evalglare), thermal load calculations (EnergyPlus) and radiation maps (Radiance/GenCumulativeSky). The assumptions underlying these programs will be discussed in detail.\n\n\nThe first two days will consist of formal instructions, in-class discussions, hands-on software tutorials, and exercises. Participants will also be given the opportunity to calibrate their personal digital cameras to take HDR images and learn several ways to quantitatively evaluate these images. During the last day, participants will be given the opportunity to apply the newly acquired analysis techniques to ongoing projects of their own.\n\n\nIf you want to make this your \"daylighting week\" you could further join us on the following Monday, July 15, for DIVA DAY in New York. (Details to follow.)\n\n\nBest,\n\n\nChristoph\nChristoph Reinhart\nAssociate Professor\nDepartment of Architecture\nMassachusetts Institute of Technology\n77 Massachusetts Ave, Rm 5-418, Cambridge, MA 02139, USA\nt: 617 253 7714, f: 617 253 6152, creinhart at mit.edu<mailto:creinhart at mit.edu>\nSustainable Design Lab<http://mit.edu/SustainableDesignLab/> | DIVA<http://www.diva4rhino.com/> | Daysim<http://daysim.ning.com/> | mapdwell<http://www.mapdwell.com/> | umi<http://www.urbanmodeling.net/>\n\n\nUpcoming Events\nJuly 10-12  Harvard Executive Education on Daylighting Buildings<http://execed.gsd.harvard.edu/programs/daylighting-buildings-1>\nJuly 15       DIVA DAY 2013 in New York\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2013-May/009519.html).</sup>", "id": "radiance-general_009519", "created_by": "Christoph_Reinhart"}