{"topic": "DEB and RPM Radiance 3R5 packages", "category": "radiance-general", "attachments": [], "created_by_name": "Francesco Anselmo", "created_at": "March 31, 2003 at 04:19PM", "body": "Hi to all!\n\n\nI finally managed to build two debian packages for Radiance\n(1 for binaries + 1 for documentation) and I also converted\nthem to RPM packages with alien.\n\n\nThe binary packages also include glrad (special=ogl) and 3ds2mgf and\nthe binaries have been compiled on a Debian 3.0r1 woody\nLinux distribution with gcc 2.95.4. \nThis is not a static binary distribution\nbut I'm also planning to make it (in the next days).\nI also think I'm going to make a pmap package, so that it can be very easy\nto switch between the classic and the pmap radiance binaries.\n\n\nAccording to the File System Hierarchy Standard the executables are\ncopied to /usr/bin, the library files are put inside /usr/share/radiance,\nthe man files are sent to /usr/share/man and all the documentation \nis saved inside /usr/share/radiance/doc.\n\n\nThe user still has to set the RAYPATH variable, but I'm studying how to\nmake it automatically through a shell script (next release).\n\n\nOf course, since this is my very first attempt at making a package, there is\nsome problems.\nThe bigger one is this: \n  the \"vim\" package also has a \"rview\" executable:\n  since the vim package is usually quite important, I decided not to have\n  the radiance package conflicting with vim. So, on Debian based system, it is   \n  necessary to install the package by issuing the following command:\n  # dpkg -i --force-all radiance_3.5.0-1_i386.deb\n  in order to overwrite the /usr/bin/rview executable (very bad, isn't it?).\n  On different systems it may not be a problem, for instance on my\n  linux Mandrake 9.0 box rview from the vim package is put inside /bin/,\n  so no overwrite occurs and apparently everything goes smoothly,\n  but the system will always execute the vim rview binary, unless\n  somebody erases or rename it, or changes the PATH variable.\n\n\nCould anybody give me some feedback about how to solve this problem\nin the best way? I think I'm going to write a message on the debian developer \nmailing list too.\n\n\nCould we ask to add Radiance to the main or contrib Debian distribution?\n\n\nThe packages are located here:\n\n\nhttp://www.dream.unipa.it/dream/pub/dot/anselmo/radiance/packages/\n\n\nI hope to get your comments/suggestions/infos/flames soon, and I also\nhope to have done a useful job.\n\n\n\n\ning. Francesco Anselmo\nanselmo@dream.unipa.it\n\n\n[ DREAM ] \nDipartimento di Ricerche \nEnergetiche e Ambientali\n\n\nUniversità di Palermo\n\n\nViale delle Scienze\n90128 Palermo - Italy\n\n\nTel + 39 091 236 302\nFax + 39 091 484 425\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-March/000610.html).</sup>", "id": "radiance-general_000610", "created_by": "Francesco_Anselmo"}