{"topic": "Radiance - validation challenge", "category": "radiance-general", "attachments": [], "created_by_name": "Greg Ward", "created_at": "May 08, 2013 at 12:08PM", "body": "My friend and fellow lighting software author, Ian Ashdown, gave me the following message for the Radiance community.  \n\n\nIan is responsible for the creation and development of the AGi32 simulation engine, which is widely regarded in the lighting design community (for good reason).  He has suggested that it would be a good idea for one or more persons to undertake a validation of Radiance based on CIE 171:2006, a suite of sample lighting scenes with known numerical solutions.  I believe Radiance has been partially validated against this dataset.  In particular, Mike Donn posted a request for more information with a couple of references to others' work along these lines in 2011:\n\n\n\thttp://www.radiance-online.org/pipermail/radiance-general/2011-September/008173.html\n\n\n(Corrected links from post: <http://www.radiance-online.org/community/workshops/2008-fribourg/Content/Geisler-Moroder/RW2008_DGM_AD.pdf> and <http://www.ibpsa.org/proceedings/BS2011/P_1146.pdf>)\n\n\nI don't know of anyone who has gone through the entire CIE 171 test set, but this is what Ian proposes.  Note that there are some tests to watch out for, and whoever works on this will probably be talking to me at multiple points.  I look forward to learning something new in the conversation.\n\n\nOne way to approach this would be to set up a wiki or plone site where individuals could upload their validation tests and open them up for comments.  This would require some public documentation of the CIE 171 tests, and this is where it all gets a bit fuzzy.  I don't have this document and if we were to purchase it, I am uncertain as to the legality of sharing (portions of) it.\n\n\nIdeas and further suggestions are welcome.\n\n\nCheers,\n-Greg\n\n\nBegin forwarded message:\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2013-May/009514.html).</sup>", "id": "radiance-general_009514", "created_by": "Greg_Ward"}