{"topic": "Radiance Project Organization", "category": "radiance-general", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "July 10, 2005 at 03:42PM", "body": "Hello everyone.\n\n\nI'm currently developing a new interface for Radiance for the\nfree 3D modeling suite Blender. Screenshots and a very early\nversion can be found at\n\n\n    http://home.arcor.de/tbleicher/exif/index.html\n\n\nPlease note that you should know something about Blender, Python\nand Linux if you want to install the current version.\n\n\nAmong other things it supports IES data import and the import\nof Radiance material descriptions (very limited at the moment).\nBoth are organized in some sort of \"library\" backend. Now I'm\nlooking for a good idea how to organize and populate these libraries.\nI think I'll find the most experienced users here on this list so I'm\nasking the community at large: \n\n\nabout luminaire data:\n\n\n*) Which features would you like to see in a data browser?\n\n\n*) Is there a common standard for information exchange beyond\n   IES, TM14 and Eulumdat(*.ldt)? Particularly I'm looking for\n   some sort of database for luminaire, lamptype and geometry\n   data or images. It seems like every manufacturer has it's\n   own standard and presentation utility.\n   I know there is a project call \"DIALUX\" which seems to be\n   supported by a lot of manufacturers (at least in Europe) but\n   I don't know if it's actually very popular.\n\n\n*) How do you organize luminaire data in your projects?\n   Do you pre-select the files to use in the project and only\n   handle a small quantitiy of datafiles or do you use\n   (centralized) repositories (by type, by manufacturer)?\n\n\nabout materials:\n\n\n*) Do you use simple material descriptions or is there no\n   end in complexity (modifiers, *.cal files etc.)?\n\n\n*) Do you rely on CAD exporters (and how they handle the material\n   assignment) or do you hand edit materials?\n\n\n*) Where do your material definitions come from? Messurements,\n   handed down for generations and guarded carefully in the family\n   vault, fiddling until it \"looks right\"?\n\n\n*) Do you use image based textures?\n\n\n\n\nI hope some of you can share their experiences and information\non these things. If you have other ideas or a wishlist for a \nRadiance interface I'd be glad to hear about it. I try to keep\nthe parts of my code as separate as possible so libraries etc.\nmay be useable without the Blender iterface as well.\n\n\n\n\nThanks for your interest,\n\n\nThomas\n\n\nPS: I am well aware of \"b/rad\" by Francesco Anselmo. So far we\n    had different targets in developing our interfaces but in\n    the near future we hope to join our efforts. No one likes\n    to be second in inventing the wheel ;)\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-July/002814.html).</sup>", "id": "radiance-general_002814", "created_by": "Thomas_Bleicher"}