{"topic": "Opportunity to join interdisciplinary research team exploring realistic rendering and high dynamic range imaging", "category": "hdri", "attachments": [], "created_by_name": "M BLOJ", "created_at": "July 17, 2007 at 06:56AM", "body": "Application forms and more information available at:\nhttp://www.brad.ac.uk/admin/personnel/jobvacancies/fps/ROP2306.pdf\n\n\nRESEARCH ASSISTANT Post REF: ROP2306\n\n\n24,402 - 26,666 per annum, (english pounds) depending on skills and\nexperience. In first instance fixed term for 1 year (maternity cover).\n\n\nThis post is funded via the EPSRC award \"High Dynamic Range for High\nFidelity Image Synthesis of Real Scenes\". The aim of this project is to\ncompute and display the highest fidelity computer-generated images of real\nscenes.\nYou should have proven programming skills in C++ or Matlab and\nenthusiasm for problem solving and research. Under the guidance of Dr Bloj\nyou will develop a BRDF (Bi-directional Reflectance Distribution Function)\ncapture system based on digital photography, implement the corresponding\nmodel in a rendering package (preferably RADIANCE) and support the\npsychophysical evaluation of the resulting images using standard displays\nand a Brightside DR37-P High Dynamic Range Display.\nThis represents an exciting opportunity for a promising researcher to join\na vibrant interdisciplinary team with partners at the Warwick Digital Lab\nand Brightside (now part of DOLBY) working on the development and\nvalidation of High Dynamic Range capture and display systems. The\nsuccessful applicant will be based in Dr Bloj's lab in the University of\nBradford, UK.\n\n\nInformal enquires can be made to Dr Marina Bloj. Tel +44 (0)1274 236258;\ne-mail: M.Bloj at bradford.ac.uk or Dr Alexa Ruppertsberg +44 (01274 235378;\ne-mail A.I.Ruppertsberg at bradford.ac.uk .\n\n\nCLOSING DATE: 13th August 2007. We expect to interview during the week of\n20th August. Job reference ROP2306.\n\n\nApplication forms and more information available at:\nhttp://www.brad.ac.uk/admin/personnel/jobvacancies/fps/ROP2306.pdf\n\n\n\n\nMarina Bloj PhD FHEA MInstP, Senior Lecturer\nDivision of Optometry, School of Life Sciences\nUniversity of Bradford\nBD7 1DP, UK\nTel: +44-(0)1274 23 6258 Fax: +44-(0)1274 235570\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2007-July/000169.html).</sup>", "id": "hdri_000169", "created_by": "M_BLOJ"}