{"topic": "Too many questions to fit in the subject", "category": "radiance-general", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "May 09, 2002 at 11:50AM", "body": "Hello all.  Some of you know me, many do not.  But I have \nbeen experimenting with Radiance lately.  Thanks to Greg \nwho tipped me off to the power of OS X (and his pre-\ncompiled binaries for 3.4).  I struggled with LINUX many \ntimes, but never got a totally functional system; I was \nrpicting all over the place after a week on OS X.  =8-)\n\n\nAnyway, now that I'm getting a feel for how the various \nprograms work together, I have gone back and am now \nreading the old Radiance Digests.  This has been helpful. \nThose things read like a \"Who's Who in the Radiance \nCommunity\".  And to see many of the gurus, with more \nquestions than answers, makes me feel like someday I \nmay get my head around all of this stuff!  Of course, many \nof those messages are eight years old.  Hmmm...\n\n\nEnough rambling.  Questions:\n\n\nPhilip Thompson, way back in '94, inquired about the \nability to show surface normal orientation in rview.  Was \nthis ever developed?  My frame of reference is Lightscape, \nwhich has been excellent in this regard.  Surface normals \ncan be interractively viewed, and backfaces are displayed \nin a garish green color.  Incorrectly oriented surfaces can \nbe flipped with a click of a button.  It was only after my \ninitial experiments that I learned surface normal \norientation is a non-issue in Radiance (excepting windows \nvia mkillum).  \n\n\nFailing rview, what other geometry previewers are you \nfolks using?  Ole Lemming's ConRad has a useful \npreviewer, that operates similarly to the \"view setup\" \ndialog in Lightscape.  I really think this would speed \nthings along for me, the ability to interractively orbit a \nscene & check for modeling errors, normal orientation, etc, \nand most importantly, SETTING VIEWS.  THis is a real \nhassle when you have to provide vp, vd as 3D points.  Are \nthere other previewers besides ConRad?  \n\n\nGreg in one of the digests said windows can be modelled \nusing a single plane of glass.  (I'm used to Lightscape's \nrequirement of two opposite-facing planes, lest you get \nrefraction errors in a raytrace.)  Does this hold true for the \nrest of the building?  IOW, a simple room can be modelled \nwith a single genbox?  I have been creating an inner \nroom and an outer \"shell\".  Again, this may be my \nLightscape logic getting in the way of things here.  Of \ncourse for detailed renderings you *have* to model the \nwall thickness, but for daylighting analysis, would a single \nbox (with windows of course) suffice?  In Lightscape you \nwould get \"light leaks\" around the corners of the interior \nas sunlight affected the vertices unless you enclosed the \ninterior with an outer shell.\n\n\nRe: skies.  Gensky (directed by George Mischler's radout) \ncreates a description of the sky & ground luminance, and \ncreates two colored hemispheres.  I have seen some \nspecial sky textures available for mapping to a sphere for \nmore realistic environments.  How do these work?  Are \nthey transparent placeholders, which merely display a \npicture of the sky but allow the sun & sky luminance to \n\"pass through\", or do they actually modulate the sky \nluminance as a function of the chromacity of the pixels in \nthe sky image?\n\n\nI have been using George Mischler's radout to bring \ngeometry from AutoCAD to radiance.  But there doesn't \nseem to be a way to handle blocks.  It would be great if \nthere was a way to substitute autocad blocks for \ninstanced rad files!  One could export the blocks as \nseparate rad files, but is there a way to take a series of \ninsertion point coordinates and build a rad file that \ninstances the \"block\" rad file at those \ncoords/orientations?  That seems to be the key to being \nable to rapidly change scenes, and stay accurate.  Anyone \ndoing this type of thing already?\n\n\nAlong those lines, is there a way to create a grid or really \nany series of points in autocad (via nodes, or blocks or \nwhatever) and then have the coordinates of those points \nbe fed to rtrace for lighting analysis?  I know you can feed \nrtrace the points, but I'm interested in a way to have \nautocad export the information rather than me figure out \nthe points manually.  I like to draw the stuff and have \nCAD keep track of all the math, ya know?\n\n\nI found a nice collection of materials online (Kevin \nMatthews, Design Workshop).  Some of the cal files are \nmissing, but many of the materials are usable.  Does \nanyone else have material & light libraries they are willing \nto share?  I'm also really interested in obtaining \ndefinitions of translucent materials, such as one would \nfind in a light fixture (sandblasted glass, acrylic, etc).  \n\n\nPaul Bourke offers some great tree examples.  Again, \ndoes anyone have other blocks they are willing to share \n(vegetation, furniture, you name it)??  =8-)\n\n\nPaul also has a benchmark page: \nhttp://astronomy.swin.edu.au/~pbourke/radiance |\n/benchrad/\n\n\nI tried the first one and my PowerBook G4 550 rendered it \nin 582 secs, which is almost exactly three times as long as \nthe render time for a 1.5 GHz P4 (see the site for more \ntimes).  Is it just coincidence, or is there a fairly direct \ncorrelation between CPU speed and render time, \nregardless of processor type?  Makes Apple's ad copy \nabout the \"Velocity engine\" in the G4 seem like a load of \nbunk (which I suspected in the first place).   Don't get me \nwrong, I love this Mac.  But it seems that when I finally \nam ready to do production work with Radiance I'm gonna \nhave to learn LINUX once and for all.  The cheapest cpu \ncycles are with homebuilt PCs, so it seems that's the way \nto go.  Interestingly, there is a benchmark for a dual 2GHz \nPC, which was only 50% faster than the single 1.5 GHz.  \nI'm interested in parallel processing, but this seems to \nmake a case against it.  What are your experiences out \nthere in the field? \n\n\nWoah.  That got long in a hurry.  I'll leave it at that for \nnow.  More questions to follow hopefully.  I'd greatly \nappreciate any responses to my inquiries above.  \n\n\n\n\n\n\n Rob Guglielmetti <rpg777@earthlink.net>\n    http://home.earthlink.net/~rpg777\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-May/000230.html).</sup>", "id": "radiance-general_000230", "created_by": "Rob_Guglielmetti"}