{"topic": "Proxy geometry in the five-phase method", "category": "radiance-general", "attachments": [], "created_by_name": "Minchen Wei", "created_at": "December 08, 2017 at 02:11AM", "body": "Hi All,\n\n\nI have questions regarding the proxy geometry in the five-phase method.\n\n\nI tried the tutorial using a room with a glazing (no venetian blinds). The daylight coefficient and three-phase method can produce similar results, but the five-phase method produce smaller illuminance values.\n\n\nI think the problem is coming from the \"proxy geometry\". In my \"proxy geometry\" I only included a glazing geometry with the transmittance I used in the daylight coefficient method. Is that right?\n\n\nI looked at the proxy geometry included in Sarith's tutorial which included all the blinds, the glazing, and a BSDF (\"blindsT4c.xml\") for maxPoly and minPoly. How should I generate these BSDF if I have the blinds?\n\n\nThanks,\n\n\nTommy\n\n\n\n\nMinchen (Tommy) Wei, PhD\nThe Hong Kong Polytechnic University\n(+852)-3400 3606 minchen.wei at polyu.edu.hk<mailto:minchen.wei at polyu.edu.hk>\n\n\n[http://mlm.polyu.edu.hk/PolyU80_Email_Signature.png]\n\n\nwww.polyu.edu.hk/80anniversary<http://www.polyu.edu.hk/80anniversary>\n\n\nDisclaimer:\n\n\nThis message (including any attachments) contains confidential information intended for a specific individual and purpose. If you are not the intended recipient, you should delete this message and notify the sender and The Hong Kong Polytechnic University (the University) immediately. Any disclosure, copying, or distribution of this message, or the taking of any action based on it, is strictly prohibited and may be unlawful.\n\n\nThe University specifically denies any responsibility for the accuracy or quality of information obtained through University E-mail Facilities. Any views and opinions expressed are only those of the author(s) and do not necessarily represent those of the University and the University accepts no liability whatsoever for any losses or damages incurred or caused to any party as a result of the use of such information.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2017-December/012359.html).</sup>", "id": "radiance-general_012359", "created_by": "Minchen_Wei"}