{"topic": "CFP for APGV'08: FIFTH SYMPOSIUM ON APPLIED PERCEPTION IN GRAPHICS AND VISUALIZATION", "category": "hdri", "attachments": [], "created_by_name": "Karol Myszkowski", "created_at": "January 02, 2008 at 04:34AM", "body": "Hi,\n\n\nEnclosed please find a call-for-papers for APGV'08: FIFTH SYMPOSIUM\nON APPLIED PERCEPTION IN GRAPHICS AND VISUALIZATION\nAPGV'08 would be very interested in submissions from the HDRI field\nwith some perception component.\n\n\nBest wishes,\n\n\nKarol Myszkowski\n\n\n\n\n\n\nAPGV'08: FIFTH SYMPOSIUM ON APPLIED PERCEPTION\nIN GRAPHICS AND VISUALIZATION\n\n\n\n\nCo-located with ACM Siggraph in Los Angeles, USA\n9th - 10th August, 2008\nhttp://www.apgv.org\n\n\n\n\nFIRST CALL FOR PARTICIPATION\n\n\n\n\nResearch in computer graphics and visualization has great potential\nto benefit from, and contribute to, research in perception.\nSince 2004, this symposium has brought together researchers\nfrom the fields of perception, graphics, and visualization, to facilitate\na wider exchange of ideas.\n\n\nSubmissions are invited in the broad range of areas at the intersection\nof computer graphics, visualization, and perception to fulfill two goals\nof this multidisciplinary community.\n\n\nGoal 1. Use insights from perception to advance the design of methods\nfor visual, auditory and haptic representation. Specific examples include,\nbut are not limited to:\n\n\n* applications of insights from perception to the development of algorithms\nfor more efficient, effective or realistic modeling, rendering and/or \nanimation\n* applications of perception in the design and evaluation of methods for \nmore\neffective representation and communication of data\n* computational aesthetics, stylization and perceptual aspects of \nnon-photorealistic\nrendering\n* perceptual issues arising due to fusion of digital imaging, computer \nvision,\nand computer graphics techniques\n* perception-inspired interfaces for immersive activities in virtual worlds\n\n\nGoal 2. Advance and facilitate novel basic perception and cognition \nresearch that uses\nand is relevant to applications in computer graphics and visualization. \nHere specific\nexamples include, but are not limited to:\n\n\n* perception and visuomotor control in computer games, virtual\nand augmented environments\n* fundamental contributions in spatial and temporal vision\n* integration of empirical perception research with computational models\n* color vision and color appearance modeling\n* the influence of attention and eye movements on visual perception and \nvisual memory\n* statistical learning and perception of natural scenes\n* perception of shapes, surfaces and materials\n* visual illusions and perceptual organization having potential to \nenhance image depiction\n\n\nProceedings, which will include the poster abstracts, will be published by\nACM SIGGRAPH. Best papers from the symposium will be invited\nto be extended for a special issue of the ACM Transactions on Applied \nPerception.\nhttp://www.acm.org/tap/\n\n\nBy collocating APGV 08 with the thirty-fifth annual SIGGRAPH Conference\n(SIGGRAPH 08), we aim to further promote communication between\nthe core perception and the core computer graphics communities,\nand also bring APGV back to the United States.\n\n\nCONFERENCE CHAIRS\n\n\nBobby Bodenheimer, Vanderbilt University\nBetty Mohler, Max Planck Institute for Biological Cybernetics\n\n\nPROGRAM CHAIRS\n\n\nSarah Creem-Regehr, University of Utah\nKarol Myszkowski, MPI Informatik\n\n\nIMPORTANT DATES\n\n\nPaper Submission: Monday, April 7, 2008\n\n\nPoster Submission: Monday, May 12, 2008\n\n\nSymposium: Saturday, August 9, 2008 – Sunday, August 10, 2008\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2008-January/000177.html).</sup>", "id": "hdri_000177", "created_by": "Karol_Myszkowski"}