{"topic": "CanonHDRcap exposure determination", "category": "hdri", "attachments": [], "created_by_name": "Mark Banas", "created_at": "February 03, 2006 at 04:08AM", "body": "Here is one for Greg (of course):\n\n\nHow does CanonHDRcap determine the \"minimum\" exposure that is  \nrelevant for an HDR capture dataset?\n From my observations it seems to \"search\" for the darkest exposure  \nwhere a min. % of pixels are \"blown out\" and then start marching up  \nthe exposure scale from there based on your spacing and # of shots.  \nI'm sure this is an over-simplification of things, but I tried (in my  \n\"tethered-to-a-G5-tower-in-a-windowless-office\" tests) to find that  \nthreshold of minimal % where the limits of my camera's shutter speed  \nwould be hit.\n\n\nSince I'm stuck inside with my workstation, the \"best and brightest\"  \nto focus on is a 22w halogen bulb on the ceiling track lights. It  \nseemed that under certain \"ideal\" camera conditions (f/8, ISO 100)  \nthe \"searching\" would stop at 1/500 sec., regardless of the step  \namount for searching (and 1 stop search takes a while). If I shot  \nadditional images I could march down to 1/2500 sec. and still have  \nnearly the same # of blown out pixels in the image (after that I  \nstarted to resolve the bulb and reflector).\n\n\nI then checked to see if the captured image resolution has anything  \nto do with it (a strict # instead of %) and found no difference. When  \nI tested it under tungsten bulbs, it started the series at the point  \nwhere *no* pixels were blown out, but perhaps this is due to my  \ncamera settings and the dimmer bulb. Again, this is without a laptop  \nto go out and sample some serious range, but I'm working on that...\n\n\nBTW, I shot 13 HDRs in 2 hours, including a disappointing panorama of  \nthe dusty floor of my office (without being able to \"lock\" in the  \nsettings after a \"search,\" multi-shot panos are impossible - the  \nrange keeps adjusting).\n\n\n-Mark\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2006-February/000055.html).</sup>", "id": "hdri_000055", "created_by": "Mark_Banas"}