{"topic": "rtrace output searching for secondary sources", "category": "radiance-general", "attachments": [], "created_by_name": "Tim Hanson", "created_at": "June 03, 2007 at 10:01PM", "body": "Hi,\n\n\nI am using the following rtrace command :\n\n\nrtrace -dr 1 -lr 1 -dp 0 -ds 0.02 -dj 0 -lw 0 -dc 1 -st 0 -ab 0 -I+  \n-h- -w- -otopn model.oct < singlepoint.pts >> output.out\n\n\n... to output direct rays from a single gridpoint to an omni light  \nsource in a room of mirrors.\n\n\nThe intention is to find all the locations of the reflection points  \n(of the secondary sources) on each wall from the point of view of the  \ngridpoint.  I've written a routine which reads in all the rays,  \nfilters them and outputs the reflection point x y z coordinates.\n\n\nThe gridpoint is simply :\n\n\nx y z 0 0 1 indicating an upward direction for the rtrace 'receiver'\n\n\nThe problem I have is that rtrace doesn't output the reflection rays  \nif the z-coordinate of the light source is within a small distance  \nabove the z-coordinate of the gridpoint.  i.e. some reflection rays  \nare not output if they are near to, and of course above, the height of  \nthe gridpoint.\n\n\nI can understand this may be something to do with the cosine of the  \nincident angle and that a threshold isn't reached which therefore  \ndoesn't output the reflection ray, but I have set -st 0, and I've set  \nall the other parameters I can think of to their maximum accuracy.\n\n\nBy setting the property of the mirrors to :\nvoid mirror walls\n\n\n\n\n3 100 100 100  <--- i.e. reflect 100 times the incident intensity\n\n\nthis helped a little, but by increasing the 100 100 100 further and  \nfurther still didn't solve the problem.\n\n\nIf there is anyone who has any ideas, without having to set up each  \ngrid point for all directions (not just 0 0 1)  - as this produces  \nmultiple outputs for the same reflection points - any suggestions  \nwould be much appreciated.\n\n\nThanks very much,\n\n\nTim\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2007-June/004371.html).</sup>", "id": "radiance-general_004371", "created_by": "Tim_Hanson"}