{"topic": "gendaylit problems", "category": "radiance-general", "attachments": [], "created_by_name": "Marija Velickovic", "created_at": "October 26, 2009 at 06:23AM", "body": "Hi,\n\n\nWe are working on calculation of annual illuminance profile for indoor\nluminances, and we use Perez sky model (based on gendaylit program) for sky\nluminance distribution. Input data used for sky definition are based on TRY\nfile.\n\n\nDuring the tests, we've found out that for some time moments we get negative\nground luminance, which leads to incorrect final illuminace results.\n\n\nHere is the example of sky generated by gendaylit:\n# ./gendaylit 6 1 16 -s -a 44.05 -o -5.05 -m -15 -g 0.2 -W 76 16\n#gendaylit : the actual zenith radiance(W/m^2/sr) or luminance(cd/m^2) is :\n-11\n# Ground ambient level: -13.3\n\n\nvoid brightfunc skyfunc\n2 skybright perezlum.cal\n0\n10 7.339e+01 -2.651e+00 -1.278262 -0.168132 13.163915 -3.484597 0.260157\n-0.717104 -0.140157 0.682729\n\n\nYou can see that negative zenith radiance, leads to negative ambient level\nand ground brightness (2nd parameter in the skyfunc definition above), which\nthen leads to incorrect final results.\nWhen sky with this luminance distribution is visualized in rvu, it looks\nlike there is \"a black hole\" in the middle of the sky surface.\n\n\nNote that gendaylit doesn't raise any error or warnings, for this kind of\nproblem.\n\n\nJohn Mardaljevic wrote about this problem for some combination of input\nvalues in his thesis, and also there is a post on this list:\nhttp://www.radiance-online.org/pipermail/radiance-general/2002-June/000312.html\n\n\nDoes someone has information if they were some changes in original Perez\nmodel, to avoid such problems (or maybe if it is an error in gendaylit code\n- although I couldn't find it)?\n\n\n####\nFor our TRY (Carpentes, France) file this kind of problem appears for 409\ntime moments (1 year period, 1h step irradiance data), so it is approx 10%\nof total number of daylit hours, so I don't think we can underestimate this\nproblem.\nIf not possible to change sky model calculation and make it \"more correct\",\nI'm wondering what solution would give the lowest errors in final\nilluminance results?\n\n\n\n\nAny ideas?\n\n\nThanks,\nMarija, De Luminae.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-October/006298.html).</sup>", "id": "radiance-general_006298", "created_by": "Marija_Velickovic"}