{"topic": "defining an uniform sky, rgb weighted light sources", "category": "radiance-general", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "December 29, 2008 at 10:45PM", "body": "Hi Radiance-users,\n\n\nI am having problems to understand the definition of a sky source either \nusing glow or light modifiers.\n\n\nI want to model a uniform 10.000lx (horizontal) illuminance sky. To do \nso, I can either define a hemispherical light source with luminance = \n10.000/pi, or use the gensky command. Modifying the source with either \nlight or glow, plus the gensky command, give me three alternatives to \ndefine the environment. Still, the only way that gives me the expected \nresults (10.000lx when measuring in the origin) is using the \nlight-modified source. Both glow skies (defined manually or generated \nusing gensky) give me 5235lx, setting ab to 1. If I am not applying the \nmultipliers for the primaries to the set the rgb values of my glow \nmaterial, I get very close to the expected 10.000lx, but I do not \nunderstand why there is a difference in the rgb values for glow and \nlight. Also, the gensky example does not work as expected. So I am \npretty sure that there is an obvious mistake, most probably related to \nmy understanding of the light and source modifiers.\n\n\nLuminance for the source = 10.000 / pi = 3183\nRadiance corresponding to that: 3183 / 179 = 17.78\n\n\n1) light modifier, source\n    to define the light modifier's rgb radiance triplet, I multiply the \nluminance 17.78\n    by .265, .67, .065 for its rgb components and get:\n\n\n   void light sky_light\n   0\n   0\n   3 4.7117 11.9126 1.1557\n\n\n   applying this to a source, I can get the expected readings from rtrace:\n\n\n   #echo \"0 0 .01 0 0 1\" | rtrace -h -x 1 -I -ab 4 sky.oct  | \\\n   rcalc -e '$1=47.4*$1+120*$2+11.6*$3'\n   10469.3751\n\n\n2) glow modifier, source\n   to define the glow, I simply take the radiance of 17.8 for r, g, b \nwithout applying the multipliers and get\n   the expected value from rtrace with ab 1:\n\n\n   #echo \"0 0 .01 0 0 1\" | rtrace -h -x 1 -I -ab 1 sky.oct  | \\\n   rcalc -e '$1=47.4*$1+120*$2+11.6*$3'\n   rtrace: warning - no light sources found\n   9998.45491\n\n\n   BUT when using the weighted rgb radiance as in the light source \ndefinition (4.7117, 11.9126, 1.1557),\n   I get this:\n\n\n   #echo \"0 0 .01 0 0 1\" | rtrace -h -x 1 -I -ab 1 sky.oct  | \\\n   rcalc -e '$1=47.4*$1+120*$2+11.6*$3'\n   rtrace: warning - no light sources found\n   5234.70623\n\n\n   So obviously this is not the way to go.\n\n\n3) So I try what happens if I call gensky with the -B option, to use a \ngiven horizontal illuminance\n\n\n   !gensky 4 21 +10:00 -u -B 55.87 -r 0\n\n\n   (55.87 is simply 10.000lx/179)\n\n\n   As all luminances are equal in the uniform sky, this should work. \nBTW, even for an uniform sky with given\n   brightness, I have to give a time - which does not make sense, as the \ntime is ignored.\n\n\n   Using this sky, a rtrace call gives me, again, a much lower \nhorizontal illuminance then expected:\n\n\n   #echo \"0 0 .01 0 0 1\" | rtrace -h -x 1 -I -ab 1 sky.oct  | \\\n   rcalc -e '$1=47.4*$1+120*$2+11.6*$3'\n   rtrace: warning - no light sources found\n   5225.65173\n\n\nSo it is evident that I misunderstand something related to the \nrgb-weighted radiance, still I do not understand what is wrong. \nEspecially the 3rd alternative seams to be close to the standard useage \nszenario, but as I have never used the -B option of gensky before, \nchances are that I got it wrong. So if anyone having more routine in \nthese calculations could give me a hint, I might have the opportunity to \nget some more insight into the secrets of radiance before the year ends ;-)\n\n\nThank you, and have a nice new year celebration wherever you are,\n\n\nLars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-December/005635.html).</sup>", "id": "radiance-general_005635", "created_by": "Lars_O._Grobe"}