{"topic": "Silhouette detail from afar", "category": "radiance-general", "attachments": [], "created_by_name": "Daniel Lash", "created_at": "January 29, 2004 at 01:16PM", "body": "Hello\n\n\nApologies if this is trivial.  I am attempting to derive an image of the silhouette of atrium roof\nstructure (fisheye projection) when viewed from afar.  The problem I am encountering is that the\nresolution doesnt seem to be high enough, thus much of the small structural detail is lost. \nPresumabley the most obvious thing to do is increase the resolution.  I have tried this using the\n-x and -y options (I should add at this stage that  it is an interactive render, invoked by rad\nwith geometry etc. converted from Ecotect using Radtool).  I get an error message.  Changing the\n'RESOLUTION=...' setting in the *.rif file has no effect.  I have set -ps at 1.  Tinkering with the\ndirect options don't seem fruitful either.  I am running the simulation under a sunny sky acting as\na spotlight (very high zenith) with no ambient calculation (and a constant -av) so rendering is\nfast.  I have also tried turning the sky off altogether and using a large rectangular direct source\nabove my model, and also using just the sky glow.  \n\n\nIs the reason I can't seem to increase the resolution something to do with using the rad executive\nprogram? Have I reached the limit of my monitor? Am I doing something fundementally wrong?\n\n\nMany thanks,\nDan Lash\nSheffield Hallam University.\n\n\nps as an aside, does anyone have any experience with modelling generic painted white steel\nstructural members (round or square)?  I'm thinking specifically in terms off specularity and\nroughness (for quantitative accuracy).  The rules of thumb in RWR make me intuitively think about\n10% spec, 3ish% roughness.  Though perhaps this is one of those how long is a piece of string\nmoments.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-January/001447.html).</sup>", "id": "radiance-general_001447", "created_by": "Daniel_Lash"}