{"topic": "Determining average reflectance from RGB values", "category": "radiance-general", "attachments": [], "created_by_name": "Mark Steven Baker", "created_at": "July 21, 2002 at 11:59AM", "body": "I'm a new radiance user and I'm try to use the software to \ncorrelate results from measures taken using a detailed architectural model. \nThe goal is to try a number of variations using radiance\nthat would be prohibitive revising the model.\n\n\nThe reflectance values of the various surfaces in the model were\npainted a neutral color (shades of gray) and the average reflectance was \nmeasured. I don't have access to equipment that would measure the\nreflectances at different wavelengths (separate RGB reflectance \nvalues).\n\n\nIn the radiance models, the goal is to provide some color\nother than gray for these surfaces but with the same average\nreflectances. Is there an obvious way to correlate RGB values in \na radiance material description with the average relectance for a\nsurface?\n\n\nI am assuming that the following wall material would have an\naverage reflectance of 0.75:\n\n\n# adobe texture function\nvoid texfunc ad\n6 cdx cdy cdz  adobe.cal -s .1\n0\n1 .015\n\n\n# Sample stucco wall of adobe material, reflectance = 75%\nad plastic stucco_75\n0\n0\n5  .75 .75 .75 0 0\n\n\nCan you average the RGB values for a material to get\nthe average reflectance (as in the plaster_white) material below \nor do you need to use some more complex calculation? Does the\nadobe calculation function significantly affect the average\nreflectance value?\n\n\n--- excerpt from Building.mat file ----\n\n\n# adobe texture function\nvoid texfunc ad\n6 cdx cdy cdz  adobe.cal -s .1\n0\n1 .015\n\n\n# Sample wall of adobe material, reflectance = 75%\nad plastic plaster_white\n0\n0\n5  .80 .75 .70 0 0\n\n\n-------- excerpt ends -----------\n\n\nAlso, how would this apply to the average reflectance values for \ncarpet that are generated using the radiance carpet.cal function.\nFor example, how would the average reflectance value be calculated\nfor the sample carpet below (one of the book samples):\n\n\n------ material from \"Rendering with Radiance\" book sample ----\n\n\n# carpet pattern function\nvoid colorfunc carp\n6 carpr carpg carpb carpet.cal -s .0175\n0\n4 .7 .825  .9  1\n\n\ncarp plastic carpet_blue\n0\n0\n5 .9 .9 .9 0 0\n\n\n------  sample ends ---------------\n\n\nAny help understanding the conversion of RGB values to \naverage reflectance values for materials and texture (calculation)\nfunctions would be most appreciated.\n\n\nThanks,\n-Steve\n\n\nSteven Baker\nmsbaker@cs.uoregon.edu\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-July/000360.html).</sup>", "id": "radiance-general_000360", "created_by": "Mark_Steven_Baker"}