{"topic": "Tutorial and Seminar 6/7. May 2004 in Braunschweig", "category": "radiance-general", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "April 05, 2004 at 06:55PM", "body": "Hi all,\n\n\njust wanted to get rid of a short announcement:\n\n\n\n\n  Two Radiance Based German Language Training Events.\n\n\n\n\n  3D-Lighting Software Tutorial\n  Thu, May 6th 2004\n  http://www.al-ware.com/index.php?CATID=242&SUBCATID=243&LANGID=6\n\n\n  Practical Lighting Seminar\n  Thu, May 7th 2004\n  http://www.al-ware.com/index.php?CATID=242&SUBCATID=244&LANGID=6\n\n\n  Simulation Laboratory\n  Institute for Building and Solar Technology IGS\n  Technical University Braunschweig\n  Germany\n\n\n\n\nThose two events are planned by Andreas Lahme from ALWare, who\nhas been (and still is) developing 3DSolar, the building modeller\nsoftware for Rayfront/Radiance, as well as a suite of analysis\nand documentation tools.\n\n\nWe will be holding the tutorial session together. Andreas will\nteach modelling and analysis, I will teach the Radiance/Rayfront\nrelated parts. We will first introduce the simulation principles,\nand then walk the participants through projects interactively.\nThis course is meant for people who are interested to see whether\nthe presented software is suitable to solve their problems, but\nexisting users are of course also welcome.\n\n\nAndreas will teach the Seminar with Prof. Friedrich Sick.\nThe focus of this part is less on pressing the right buttons,\nbut more on solving practical problems in daylighting design.\nThe subject matter includes daylighting fundamentals, design\nprocedures, evaluation criteria, and the economical use of the\navailable software tools. The target audience are architects and\nengineers who want a to reach a better understanding on how to\nwork with daylight when designing buildings.\n\n\nBoth events are in german language. There are computers available\n(probably one per two participants) for an immediate hands-on\nlearning experience. Demonstration examples may be adapted to the\ninterests of the participants, or even fully contributed by them.\nIt is possible to participate for only one day (270.- Euro + VAT),\nor for both together (486.- Euro + VAT).\n\n\nIf you're interested, please contact Andreas Lahme for further\ndetails and registration info:\n\n\n  ALware Andreas Lahme\n  Leopoldstrasse 7a\n  38100 Braunschweig\n  Germany\n  tel: +49 (0)531 / 250 72 80\n  fax: +49 (0)531 / 250 72 81\n  e-mail: info at alware.de\n\n\n\n\nI'd be happy to see some of you there!\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-April/001572.html).</sup>", "id": "radiance-general_001572", "created_by": "Georg_Mischler"}