{"topic": "Radiance and EcoTect", "category": "radiance-general", "attachments": [], "created_by_name": "John An", "created_at": "May 14, 2006 at 05:37AM", "body": "Nick,\nChristoph Reinhart has a little script that allows you to input your desired transmissivity, and you can extract the correct Radiance definition from the output. I think that may be the way to go for your purposes. I would contact Christoph to see if you can get your hands on the script. Your other option is to select a few actual glasses with the transmissivity that you desire, and test to make sure that they all produce similar results.\n\n\nJohn\n\n\n\n\n\n\nNick Doylend wrote:\n\n\nThanks very much for your suggestions.\n\n\nI looked briefly at outputting glazing data from Optics.  It's probably the\nway to go if I want to model a 'real' glazing type.  I don't really\nunderstand how the BRTDfunc is used; it sets the surface reflectance as well\nas transmittance doesn't it?  At the moment I'm only considering a\n'notional' glazing so I'm just calculating the transmissivity and editing\nthe Radiance file output from Ecotect by hand.  For typical glass types, how\nmuch difference would using the BRTDfunc definitions make to my internal\ndaylight calculations?\n\n\nAs far as reliability of results is concerned, It seems Radiance (in the\nhands of an expert user) is more capable of realistic results than Ecotect.\nI've noticed that Ecotect's speed of calculation is influenced quite\nsignificantly by the number of windows.  It doesn't appear to make much\ndifference to Radiance's calculation time.  I guess it's down to the\ndifferences in calculation method but it does make me wonder how well\nEcotect handles models with many windows.\n\n\nOn the other hand, I find Radiance doesn't seem to behave quite as expected.\nFor example, for an equal glazed area I would expect fewer, larger\nrooflights to give the same average %DF across the whole floor as more,\nsmaller rooflights.  In this case, Ecotect seems to behave as I expect, but\nRadiance suggests fewer, larger rooflights give the better average %DF.  I\nwonder why this should be.  Maybe my assumption is incorrect.\n\n\nNick \n\n\n\n\n\n\nJohn An\nEnvironmental Designer\nAtelier Ten \n-----Original Message-----\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-May/003675.html).</sup>", "id": "radiance-general_003675", "created_by": "John_An"}