{"topic": "sky definition part 2", "category": "radiance-general", "attachments": [], "created_by_name": "Zack Rogers", "created_at": "October 16, 2003 at 12:20AM", "body": "Hello,\n\n\nGensky seems to be a hot topic these days.  My questions have to do with \nthe turbidity factor and the accuracy of the gensky in producing a CIE sky.\n\n\nMy quest started today when I noticed in the man pages that for gensky a \nlow turbidity factor corresponds to less particles in the atmosphere (1 \nbeing a completely dark sky) and a higher turbidity means more particles \nin the air.  This caused me to question the way we had calibrated some \nskies to better match some measurements taken here in Denver.  I was \nwanting to adjust the turbidity factor to account for the high elevation \nhere (higher elevations having less particles in the air).  However, I \nmistakenly adjusted the turbidity up since that was increasing my global \nhoriz. illuminance, the expected outcome since higher elevations do have \na slightly higher global illuminance.\n\n\nWhat I discovered (which I would have found documented in the archives, \nFeb, 1995) is that the turbidity only adjusts the sky component and does \nnot effect the solar component at all.  So when I was raising turbidity, \nI was increasing atmospheric particles (my sky component) while keeping \nexactly the same direct solar component.  I got the overall result I was \nlooking for but looking deeper at the sun and sky components separately, \nI realized my sun was producing 2000fc less than it should and my sky \nwas producing 1500fc more!  Here's my comparison for June 21, 40 lat, \n105 long, 12:00PM;\n\n\nThe CIE sky function tells me I need approximately 1486 fc diffuse horiz \nand 8817fc direct horiz for a total of 10303fc\n\n\nGensky w/ T=1.5\nSky = 203fc ; Sun = 6836fc ; Global = 7039fc\n\n\nT=2.5\nSky = 948fc ; Sun = 6836fc ; Global = 7784fc\n\n\nT=3.5\nSky = 1694fc ; Sun = 6836fc ; Global = 8530fc\n\n\nT=4.5\nSky = 2438fc ; Sun = 6836fc ; Global = 9274fc\n\n\nT=5.5\nSky = 3184fc ; Sun = 6836fc ; Global = 10020fc\n\n\nObviously T=5.5 is wrong but it does give the closest global value.\n\n\nSo my question now, or problem, is that I would like to be able to \ncreate true CIE skies but am not sure the best way how.\n\n\nI started by determining what Turbidity gives me the desired sky \nilluminance.  This came out to be 3.22 for summer, 3.41 for equinox, and \n3.55 for winter.  I am not sure why the variation between summer and \nwinter, it seems perhaps because more particles get trapped by cold \npockets during the winter??\n\n\nSo, using T=3.22 gives me the desired sky component during the summer \nsolstice but I still need to specify the correct direct component.  I \ndid this by specifying the radiance with the -r option.  I avoided \nhaving to mess efficacy conversions by just doing it iteratively until \nmy global illuminance was what I wanted.  A solar radiance -r value of \n9,250,000 and T=3.22 gave me very good results for the summer sky - \n1486fc sky ; 8819fc sun ; and 10305fc total to be exact. BTW changing \nthe -r value does cause a very small increase in the sky component (as \nit should, but not sure if it is accurate).\n\n\nSo, I went to see how these values, calibrated to give CIE summer sky, \nwould work for an equinox and winter sky.  I already knew the turbidity \nshould be a little different under these times but was hoping the same \nsolar radiance value would work reasonably well.  Here's those results \n(all with -r 9,250,000) ;\n\n\nEquinox, 12:00PM\nCIE tells me I need 1328fc sky ; 6894fc sun ; 8223fc global\nRadiance gives me 1223fc (T=3.22) or 1330fc (T=3.41) sky ; 7003fc sun ; \n8333fc global\n\n\nWinter Solstice, 12:00PM\nCIE tells me I need 1036fc sky ; 3421fc sun ; 4458fc global\nRadiance gives me 919fc (T=3.22) or 1041fc (T=3.55) sky ; 4114fc sun ; \n5033fc global\nThis sun produces 600fc more than it should!\n\n\nSo, these comparisons tell me that for an accurate CIE sky, I need to \nuse a Turbidity somewhere between 3.22 to 4, depending on elevation and \npollution levels, and that I need to determine separate solar radiance \nvalues for each sky.\n\n\nThis is a pain.  Why does gensky not produce a more accurate CIE sky \nmodel?  I guess Greg acknowledged this back in his 1995 post\n\"\n\n\nLet me start by saying that I have little confidence in the sky or solar\nluminance calculations of gensky.  They are based on some simple \nrule-of-thumb\ncalculations and mean sky measurements taken years ago.  If you are serious\nabout your sky model (and it appears that you are), you should insert \nyour own\nvalues for sky and solar luminance via the -b and -r (or -B and -R) options\nto gensky.  This will override the turbidity calculation for zenith \nluminance,\nwhich as you noted, does not affect solar luminance as it ought.\n\n\n\"\nSo, my suggestion is to update gensky to accurately implement the CIE \nsky model, or is it the general consensus that gendaylit based on the \nperez sky model is the more accurate model?  The CIE sky model has \nalways been resonably accurate for me when comparing with both luminance \nand illuminance measurements - I am always looking for the most average \nsky though and not a completely accurate sky for a given point in time. \n\n\nMaybe one the main issues is that the turbidity factor needs to adjust \nthe solar component as well as the sky, and the solar component seems \ndefaulted at too low of a value for a CIE sky.  Furthermore, maybe it \nwould be a good idea just to hide the turbidity factor completely and \njust let the user adjust the elevation and perhaps give a pollution \nfactor.  When I created a CIE sky model for TracePro (a highly accurate \nforward ray-tracing program),  I gave it essentially the same inputs as \ngensky (lat long month day time skytype) but instead of a turbidity \nfactor, which as I recall is not part of the CIE sky model equations, I \ndid some studies on elevation impacts and created elevation factors. \n The elevation factors were based on weather data from stations at \naltitudes varying from sea level up to 10,000ft.  The results showed \nthat the diffuse component decreases roughly 15% at 5,000fc and the \ndirect component increases 20% at 5,000fc compared to sea level (If \nanyone is interested in this elevation factor study let me know and I \ncan e-mail you the graphs).\n\n\nAnyways, I'm very interested in the groups thoughts on these issues. \n Please correct me if I have misunderstood any of these results.  BTW - \nthe \"accurate\" CIE values I reported were calculated with 2 different \nprograms - one that descretizes the sky into 1deg by 1deg blocks and \nthen summates and the more accurate TracePro macro program that \ndescretizes the sky into as many rays as you want to trace.  Both of \nthese give very similar results.\n\n\nThanks in advance!\nZack\n\n\nPS It was great meeting everybody out in Berkeley - what a wonderful \ngroup of techno geeks we are!\nPPS Sorry for the long e-mail\n\n\n\n\nZack Rogers\nStaff Engineer\nArchitectural Energy Corporation\n2540 Frontier Avenue, Suite 201\nBoulder, CO 80301 USA\n\n\ntel (303)444-4149 ext.235\nfax (303)444-4304\nwww.archenergy.com\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-October/001063.html).</sup>", "id": "radiance-general_001063", "created_by": "Zack_Rogers"}