{"topic": "testing framework (was: Deterministic calc...)", "category": "radiance-general", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "February 10, 2005 at 05:44PM", "body": "Greg Ward wrote:\n\n\n> Yes, I could see doing this.  We would of course be accepting\n> differences between versions and machines to some tolerance, but it\n> should be sufficient for spotting any major regressions in the code or\n> between releases.\n\n\nThe Python based testing framework that is already in CVS takes\nthis into account, and allows to check whether any output values\nare within a certain range (in contrast to checking for exact\nvalues). If people can come up with good test cases, I'd be very\nhappy to add them to the official test suite.\n\n\nMy previous calls for test case contributions have mostly gone\nunanswered, so I'm happy to hear that peole are now starting to\nunderstand the importance of this tool.\n\n\nDon't worry about the testing and comparison machinery if you're\nnot familiar with Python. Just give me the test data, the\ncommands to perform, and the desired results, and I'll implement\nthe rest.  There are a handful of tests already in place, but so\nfar those mainly serve to demonstrate that the framework actually\nworks as expected.\n\n\nAt the moment, the following programs get tested more or less\ncomprehensively: cnt, ev, genbeads, getinfo, histo, rlam, neaten,\nttyimage, and  xform. I just updated the tests to take the new\nexecutable names (lam->rlam, neat->neaten) into account, the\nchanges will be in the nightly HEAD dump tomorrow.\n\n\nYou can run the tests by executing the Python script\nray/test/run_all.py. The test suite assumes that Radiance was\nbuilt with scons. Check the exact requirements in the file\nray/test/README.txt.\n\n\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-February/002430.html).</sup>", "id": "radiance-general_002430", "created_by": "Georg_Mischler"}