{"topic": "Date for the 2018 Radiance International Workshop fixed: 3-5 September 2018", "category": "radiance-general", "attachments": [], "created_by_name": "John Mardaljevic", "created_at": "October 03, 2017 at 11:02AM", "body": "All,\n\n\nThe date for the 2018 Radiance International Workshop has been fixed: 3rd-5th (Mon-Wed) September 2018.  The usual 1+2 days format: 1 day of tutorial sessions followed by 2 days of workshop presentations.  Please post suggestions/requests for tutorial topics (and anything else) to this list.\n\n\nThe venue will be the Keith Green Building (KGB), School of Architecture, Building & Civil Engineering at Loughborough University, UK.  The KGB was recently refurbished in preparation for the School's new Architecture degree (hence the change of the School name).  As part of the refurb, the windows on the main facade (which faces south-west) were replaced with electrochromic glazing to tame a longstanding problem with glare and overheating in the afternoons.  See link below for a photo of the newly installed EC glass (each EC pane has three zones):\n\n\nhttps://twitter.com/JMardaljevic/status/914972200968626176\n\n\nShould be interesting for anyone who has not yet experienced a real space fitted with EC glass -- it's quite a transformation.  And, of course, a fitting place for a Radiance Workshop!\n\n\nA Workshop website should go online before too long.  As ever with the Radiance Workshop, we shall do our best to keep the costs low.  Look forward to seeing many of you in Loughborough next year.\n\n\nCheers\nThe Organising Committee (that is, Eleonora Brembilla & John Mardaljevic)\n\n\nPS.  We'll be posting regular monthly reminders/updates to the Radiance-general list.\n\n\nEleonora Brembilla & John Mardaljevic\nSchool of Architecture, Building & Civil Engineering\nLoughborough University\nLoughborough\nLeicestershire\nLE11 3TU, UK\n\n\nTel: +44 1509 222630 (Direct)\nTel: +44 1509 228529 (Secretary)\n\n\nj.mardaljevic at lboro.ac.uk\n\n\nhttp://www.lboro.ac.uk/departments/abce/staff/john-mardaljevic\n\n\nPersonal daylighting website:\nhttp://climate-based-daylighting.com\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2017-October/012280.html).</sup>", "id": "radiance-general_012280", "created_by": "John_Mardaljevic"}