{"topic": "BRTDfunc for dichroic film revisited", "category": "radiance-general", "attachments": [], "created_by_name": "John An", "created_at": "March 17, 2004 at 04:16AM", "body": "Hi all,\n\n\nI was wondering if I could enlist the assistance of some of the experts \nhere on the list.  I have been trying to figure out how do define \ndichroic films for use in Radiance, but really have not made much \nheadway.\n\n\nI have found a paper (copied below) which gives a description of the \nbehavior of dichroics.  I can make a pdf with all the figures and \nimages available.\n\n\nI realize that this may be an extremely open-ended question, but I \nwould really appreciate any guidance and/or assistance.\n\n\nThanks.\n\n\n\n\nJohn An\n\n\n\n\nTitle: GIANT BIREFRINGENT OPTICS IN MULTILAYER POLYMER MIRRORS ,  By: \nWeber, Michael F., Stover, Carl A., Gilbert, Larry R., Nevitt, Timothy \nJ., Ouderkirk, Andrew J., Science, 0036-8075, March 31, 2000, Vol. 287, \nIssue 5462\nDatabase: Academic Search Premier\n\n\n\n\nSection: RESEARCH ARTICLE\n\n\nGIANT BIREFRINGENT OPTICS IN MULTILAYER POLYMER MIRRORS\n\n\n\n\n\n\n\n\n\n\n  Multilayer mirrors that maintain or increase their reflectivity with \nincreasing incidence angle can be constructed using polymers that \nexhibit large birefringence in their indices of refraction. The most \nimportant feature of these multilayer interference stacks is the index \ndifference in the thickness direction (z axis) relative to the in-plane \ndirections of the film. This z-axis refractive index difference \nprovides a variable that determines the existence and value of the \nBrewster's angle at layer interfaces, and it controls both the \ninterfacial Fresnel reflection coefficient and the phase relations that \ndetermine the optics of multilayer stacks. These films can yield \noptical results that are difficult or impossible to achieve with \nconventional multilayer optical designs. The materials and processes \nnecessary to fabricate such films are amenable to large-scale \nmanufacturing.\n\n\n  There are two conventional ways to create a mirror: using the surface \nof a layer of metal, or using a tuned interference stack composed of \nmultiple layers of transparent dielectric materials. Metal mirrors are \ninexpensive and perform robustly across a broad range of angles, \nwavelengths, and polarizations, but they exhibit limited reflectivity. \nMultilayer interference mirrors are routinely used for optical \napplications requiring high reflectivity and wavelength selectivity. \nAlthough they can be designed to achieve a wide range of optical \ncharacteristics, each design typically performs across a limited range \nof incidence angles, wavelengths, and polarizations. A key limitation \nof multilayer mirrors stems from Brewster's law, a nearly 200-year-old \nmaxim of optics, which predicts the decrease of reflection for \np-polarized light at material interfaces with increasing incidence \nangle. Specifically, Brewster's law states that there is an angle of \nincidence (Brewster's angle) for which the reflectivity for p-polarized \nlight vanishes at a material interface. As a result, a multilayer \ninterference mirror that is designed to have a 1% loss for reflection \nof p-polarized light (99% reflectivity) at normal incidence can have \nmany times that loss at high incidence angles.\n\n\n  Using highly birefringent polymers, we have found that multilayer \nmirrors can be constructed that maintain or increase their reflectivity \nwith increasing incidence angle. The reflective characteristics of \nthese mirrors require a generalization of Brewster's law. This \ngeneralization has enabled the development of a new class of multilayer \ninterference optics with design freedoms that can result in \nunprecedented means for transporting, filtering, and reflecting light.\n\n\n  Optical birefringence describes the difference of a material's \nrefractive index with direction. When birefringence is on the order of \nthe change of the in-plane refractive index between adjacent material \nlayers, surprising and useful optical effects occur. We refer to these \neffects as giant birefringent optics (GBO). A central feature of GBO is \nimproved control of the reflectivity of p-polarized light. With the \nadditional design freedom allowed by GBO, Brewster's angle can be \ncontrolled to any angle from 0 Degree (normal incidence) to 90 Degrees \n(grazing incidence), to imaginary values for light incident from media \nof any index of refraction. For imaginary values of Brewster's angle, \nthe reflectivity at material interfaces (referred to as Fresnel or \ninterfacial reflectivity) for p-polarized light increases with angle of \nincidence in a similar or identical form to that for s-polarized light. \nBy comparison, isotropic materials have no substantial optical \nbirefringence; that is, their refractive index values are equal for all \ndirections. Interfaces of these conventional isotropic materials \nexhibit a limited range of Brewster's angles.\n\n\n  Because the optical effects presented are based on the fundamental \nphysics of interracial reflection and phase thickness and not on a \nparticular multilayer interference stack design, new design freedoms \nare possible. For example, designs for wide-angle, broadband \napplications are simplified if optical elements with no Brewster's \nangle are used, particularly if immersed in a high-index medium such as \na glass prism. Color filters can be designed that provide high color \nsaturation at all incidence angles and polarizations. Alternatively, a \nmirror or reflecting polarizer can be designed to have a Brewster's \nangle that is accessible in air.\n\n\n  Conventional polymer film-making processes have been enhanced to \nfabricate a wide array of GBO films from commercially available \npolymers and monomers for use in a range of applications. These \napplications include high-efficiency mirrors for piping visible light \nover long distances or uniformly lighting small optical displays. GBO \nmultilayer films have been used to create reflective polarizers that \nmake liquid crystal displays brighter and easier to view. Other \napplications include decorative products, cosmetics, security films, \noptoelectronic components, and infrared solar control reflectors for \narchitectural and automotive glazing. After a review of birefringent \noptics, we discuss the relations describing GBO and show the \nimplications of GBO on optical film performance and applications.\n\n\n  Background.  Multilayer interference optics can generally be described \nas the use of the amplitudes and phases of light reflected at planar \nmaterial boundaries to produce constructive and destructive \ninterference effects. Pairs or groupings of adjacent layers (termed \nunit cells) can produce constructive interference effects when their \nthicknesses are properly scaled to the wavelengths of interest. These \ninterference effects in multilayered structures result in the \ndevelopment of wavelength regions of high reflectivity (reflection \nbands) with adjacent wavelength regions of high transmission (pass \nbands) (1).\n\n\n  Much of the design effort in multilayer interference optics is devoted \nto controlling the angular dependence of reflection bands, which is \ncomplicated by polarization effects. These effects have long been \nknown, with publications dating to before the mm of the century [see, \ne.g., Drude (2,3)]. Sir David Brewster empirically deduced the law \nnamed for him by observing that light reflected from an air-glass \ninterface is highly polarized at a specific angle (4). The same \nphenomenon occurs for all interfaces between isotropic materials. Aside \nfrom the well-known MacNeille polarizing beamsplitters (5) and \nmagneto-optic materials (6), such polarization effects are typically \nundesirable, as they limit the angular performance of multilayer \ninterference stacks. Various researchers (7-10) have developed a \nvariety of limited solutions to the problem. In addition, modern \ncomputer optimization codes have dealt admirably with the problem. \nHowever, the basic phenomenon associated with Brewster's angle still \ncontinues to constrain ire angular and wavelength performance of \nmultilayer interference stacks fabricated from materials having \nisotropic indices of refraction.\n\n\n  Multilayer polymeric interference mirrors were pioneered in the late \n1960s (11), and even though the large birefringence of oriented \npolyethylene terephthalate (PET) was known at the time (12), the use of \nmaterials with large optical birefringence in a multilayer mirror \n(polymeric or otherwise) has not been reported. Numerous other works \nhave been published on birefringent optical materials (13-18), but none \nof these discuss the use of birefringence to control (or eliminate) \nBrewster's angle effects and phase thickness relations among interfaces \nin multilayer interference stacks.\n\n\n  Giant birefringent optics.  The coordinate system used to reference \nthe material axes and the incident electric field for different linear \npolarization states is shown in Fig. 1. For GBO, each birefringent \nlayer is either uniaxial, with its z-direction index different from the \nequal in-plane indices (equal x-y direction indices), or biaxial, with \nthe x-, y-, and z-direction indices all being unequal.\n\n\n  Part of the optical behavior of a multilayer interference stack \noriginates in the angular dependence of the Fresnel interface \nreflection coefficients, including the nature of the Brewster's angle \nThetaB. Figure 2 compares the magnitudes of Fresnel reflection for \nvarious internal interfaces (that is, between materials 1 and 2 in Fig. \n1) as a function of angle of incidence (from the external medium). For \nconvenient comparison of material pairs having a range of index \ndifferences, all of the reflectance values plotted for a given material \ninterface have been normalized to their value at normal incidence. An \nexternal medium with a refractive index n0 = 1.60 (e.g., a glass prism) \nis chosen so that a wide range of propagation angles can be explored. \nSnell's law requires that the larger the external medium index, the \ngreater the range of propagation angles that can be achieved within the \nfilms. For most isotropic material pairs, ThetaB is not accessible for \nlight incident from air.\n\n\n  Curve c in Fig. 2 shows the interfacial reflectivity for a common \nmaterial pair used in the multilayer interference film industry, \nSiO2-TiO2, which in this case has ThetaB = 52 Degrees. The range of \nThetaB for other commonly used isotropic material pairs that are \ntransparent in the visible portion of the spectrum is indicated by the \nshaded portion of the plot (about 40 Degrees to 70 Degrees in a n0 = \n1.60 medium); the lower bound of 40 Degrees occurs for a material pair \nwith indices 1.35 and 1.50 and the upper bound for a pair with indices \n1.95 and 2.4. Tellurium-polystyrene, an interesting material system \nthat is transparent only at mid-infrared wavelengths, was recently \nreported by Fink et al. (19) and is represented by curve d; in this \ncase it has ThetaB = 71 Degrees (similar to ZrO2-TiO2).\n\n\n  These examples illustrate behavior that is indeed a \"law\" for \ninterfaces between two isotropic materials, regardless of the incident \nmedium index. From its value for normally incident light, the \ninterfacial reflection for p-polarized light decreases monotonically \nwith increasing incidence angle up to ThetaB (20). Whether ThetaB is \nobserved depends on the range of propagation angles that are accessible \nin the materials, as determined by Snell's law of refraction and the \nincident medium index.\n\n\n  Curves a, b, e, and f in Fig, 2 represent interfacial reflection of \nvarious birefringent material pairs from which we have fabricated \nmultilayer interference stacks. Curve e is for the special case of \nmatched z-direction indices where reflectivity is constant with angle \nof incidence. When the interface materials have a z-direction index \ndifference Delta nz of opposite sign relative to the in-plane index \ndifference Delta ny, the interfacial reflection behavior for \np-polarized light is similar to that for s-polarized light (curve f). \nThe material pairs used for curves a and b demonstrate that ThetaB can \nbe reduced to any value, including 0 Degree, by the appropriate choice \nof z-direction index values relative to the in-plane indices.\n\n\n  The quantitative relations that provide the basis for GBO offer \nphysical insight into the optical effects that are achievable with \nbirefringent multilayer stacks. These are discussed below.\n\n\n  Fresnel coefficients and phase relations for GBO.  At the boundary \nbetween two birefringent materials 1 and 2 that have their orthogonal \noptic axes, coincident with the film axes (see Fig. 1), the Fresnel \nreflection coefficient for p-polarized light propagating from material \nlayer 1 into material layer 2 can be found in textbooks (21) and is \ngiven by\n\n\n\n\n(1) rp = (n2zn2y square root of n2, sub 1z -n2, sub 0 sin2 Theta0 - \nn1zn1y square root of n2, sub 2z - n2, sub 0 sin2 Theta0)/ (n2zn2y \nsquare root of n2, sub 1z - n2, sub 0 sin2 Theta0 + n1zn1y square root \nof n2, sub 2z -n2, sub 0 sin2 Theta0)\n\n\n  where n0; and Theta0 refer to the index and angle in the external \nisotropic medium, respectively. In the limit of isotropic indices, Eq. \n1 reduces to that given by Born and Wolf (22). For such a material \nsystem, s-polarized light interacts only with the in-plane indices and \nthe Fresnel coefficient is the same as for isotropic materials:\n\n\n\n\n(2) rs = square root of n2, sub 1x - n2, sub 0 sin2 Theta0 - square \nroot of n2, sub 2x - n2, sub 0 sin2 Theta0 / square root of n2, sub 1x \n- n2, sub 0 sin2 Theta0 - square root of n2, sub 2x - n2, sub 0 sin2 \nTheta0\n\n\nIn Eqs. 1 and 2, the plane of incidence (see Fig. 1) is taken to be \nalong they axis. If the plane of incidence were along the x axis, the \nvalues of nx and ny, would be exchanged in Eqs. 1 and 2. For uniaxial \nmaterial systems, nx = ny.\n\n\n  By inspection, we can arrive at the effective interfacial indices for \nthe ith layer of a birefringent material:\n\n\n\n\n(3) nint, sub is = square root of n2, sub ix - n2, sub 0 sin2 Theta0 / \ncos Theta0\n\n\nfor s-polarized light and\n\n\n\n\n(4) nint, sub ip = niyniz cos Theta0 / square root of n2, sub iz - n2, \nsub 0 sin2 Theta0\n\n\nfor p-polarized light. Effective indices are useful in that they \ncombine angle and polarization effects into a simple expression with \nthe form of a refractive index. Equation 4 leads to a generalized \nversion of Brewster's law that can be used to solve for ThetaB, the \nincidence angle for which\n\n\n\n\n(5) nint, sub 1p = nint, sub 2p\n\n\nThere are some interesting limits to Eq. 1. For the case of materials 1 \nand 2 having equal z-direction indices n1z = n2z (Delta nz = 0), Eq. 1 \nreduces to\n\n\n\n\n(6) rp = n2y - n1y / n2y - n1y\n\n\nwhich is independent of angle (shown by curve e in Fig. 2).\n\n\n  For a broader class of materials, when the z-direction index \ndifference (n1z - n2z) is nonzero and has the opposite sign from the \nin-plane index difference (n[sub 1y - n2y), the fractional bandwidth of \na multilayer stack reflection band and its reflectivity can actually \nincrease with angle of incidence. Also, consider the special case where \nthe two sets of index differences in materials 1 and 2 are equal with \nopposite sign, and n1y = n2z, or n2y = n1z. Equation 1 then reduces to\n\n\n\n\n(7) rp = -rs\n\n\nfor all angles of incidence. A quarter-wave multilayer interference \nreflector constructed with this material combination has identical \ns-and p-polarization reflection bands at all angles.\n\n\n  Multilayer interference optics depend not only on the interfacial \nreflections but also on the phase thickness relations that govern \ncoherent interference. For example, reflection bands centered about a \ngiven wavelength Lambda0 develop from a multilayer stack composed of \nalternating materials of high and low index, where the phase thickness \nof each of the layers in the structure is Lambda0/4. The center \nwavelength Lambda0 for a reflection band follows from a simple \nrelation:\n\n\n\n\n(8) Lambda0 = 2(nphz, sub 1d1 + nphz, sub 2d2)\n\n\n  where d1 and d2 are the physical thicknesses and nphz, sub 1 and nphz, \nsub 2 are the effective phase thickness indices of each material. The \neffective indices that are used to determine the phase relations of \nbirefringent materials are\n\n\n\n\n(9) nphz, sub is = square root of n2, sub ix - n2, sub 0 sin2 Theta0\n\n\nfor s-polarized light and\n\n\n\n\n(10) nphz, sub ip = niy / niz square root of n2, sub iz - n2, sub 0 \nsin2 Theta0\n\n\nfor p-polarized light (21). Equations 1 to 4 and 8 to 10 are sufficient \nto describe the optical behavior of reflection bands developed from \nmultilayer interference stacks, whether they are composed of \nconventional isotropic materials or from materials exhibiting large \noptical birefringence.\n\n\n  Reflection band examples.  Reflection bands have characteristic \nfeatures that describe their optical behavior. A reflection band is \npositioned about a particular wavelength, the center wavelength (Eq. \n8), and the bandwidth, which refers to the span of wavelengths of high \nreflectivity. These characteristics are determined by the interfacial \nreflectivity and phase thickness of the layers constituting the \nmultilayer stack. Each of these has its own dependence on the incidence \nangle and polarization. The details of a multilayer stack structure \n(the sequence of unit cells) also affect reflection band \ncharacteristics. Generally, the greater the number of unit cells in a \nstack and the larger the index difference between adjacent layers, the \ngreater the reflectivity at and around the center wavelength. The \nsimplest reflection band designs use many repeats of identical unit \ncells. Other designs may use a sequence of unit cells that have a \ngradation of thicknesses so as to increase the overall bandwidth of the \nreflection band (23).\n\n\n  The reflection band characteristics of a pair of isotropic materials \nare compared to those for a hypothetical pair of birefringent materials \nin Fig. 3. The inset in Fig. 3A shows the material configuration, with \nthe length of the arrows along the x, y, and z directions representing \nthe magnitude of each material's indices along the respective \ndirections. The magnitude of the reflection at the interface between \nmaterials 1 and 2 versus incidence angle for p-polarized and \ns-polarized incident light (Fig. 3A) for this pair of isotropic \nmaterials shows the typical behavior of interfacial reflection for \np-polarized light. At 55 Degrees, the value of the Fresnel reflection \ndrops to zero (ThetaB) for light incident from an external medium with \nn0 = 1.4. Figure 3B shows reflection bandwidth versus incidence angle \nfor a tuned (quarter-wave at normal-angle incidence) interference stack \ncomposed of alternating layers of these isotropic materials 1 and 2. As \nincidence angle increases, the centers of the s-polarized and \np-polarized reflection bands move to shorter wavelengths as the \neffective phase thickness of the layers decreases. The reflection band \nbehavior is calculated using the four effective indices with the \ncharacteristic matrix method (24) and locates the band edges for a \ndesign with a large number of unit cells. In this instance, the \nreflection band edges are plotted. Note that the reflection band \n\"disappears\" for p-polarized light at the ThetaB values for these \nisotropic material interfaces.\n\n\n  In Fig. 3, C and D, both materials 1 and 2 are birefringent. Material \n1, with the higher in-plane index, is negatively birefringent; its \nz-direction index is lower and matched to the in-plane index of \nmaterial 2. Material 2 is positively birefringent, with its z-direction \nindex higher than its in-plane index and nearly matched to the in-plane \nindex of material 1. As before, the external medium has an index of \n1.4. In this instance, the Fresnel reflection of p-polarized light at \nthe interface between materials 1 and 2 actually increases with \nincidence angle (Fig. 3C), much the way it does for s-polarized light. \nFigure 3D shows how the p-polarized light reflection band of a \nmultilayer quarter-wave stack of these materials has an increasing \nfractional bandwidth with increasing incidence angle, in a manner \nnearly identical to the s-polarized light reflection band.\n\n\n  Another important parameter affecting the behavior of multilayer stack \nreflection bands is the relative phase thicknesses of the material \ncomponents in a unit cell. A measure of relative phase thicknesses, \ntermed the f-ratio, is the ratio of the phase thickness for each layer \nrelative to the aggregate phase thickness of the repeating unit cell. \nIt determines how the Fresnel reflections of each layer interface are \ncoherently summed across the unit cells in the optical stack, which in \nturn determines reflection band behavior with changing incident angle. \nIn many optical stack designs, suppression of higher order reflection \nbands (harmonics of the primary, first-order reflection band) is an \nimportant consideration (25). For p-polarized light, GBO provides an \nincreased level of control of f-ratio with changing incidence angles. \nBy using effective phase indices (Eq. 10), it can be shown that the \nf-ratio for a z-direction index-matched unit cell for p-polarized light \nis unchanged with angle. This control of the f-ratio can lead to \npass-band designs (pass filters) that are very robust with incidence \nangle.\n\n\n  The reflection bandwidth of a multilayer interference mirror made from \na sequence of repeated, identical unit cells is determined by the \neffective interfacial indices (Eqs. 3 and 4) of the materials and their \nf-ratios. To create a wider reflective band, a standard technique is to \nuse a graded unit cell thickness profile. A 60-unit cell interference \nmirror with a 25% thickness gradient was fabricated from a birefringent \npolyester and polymethylmethacrylate (PMMA) [see, e.g., (12,26-28) for \noptical properties]. A cross section of this multilayer interference \nstructure was characterized with an atomic force microscope (AFM) (Fig. \n4).\n\n\n  The layer thickness distribution developed from the AFM \ncharacterization was used in conjunction with measured dispersive \nvalues n1x, n1y, n1z, n2x, n2y, and n2z as input for a multilayer \ninterference optical film model. These refractive index values were \nmeasured for thick monolithic films of both PMMA and birefringent \npolyester that had undergone the same film fabrication process as the \nmultilayer mirror. These measurements indicate that the PMMA and \nbirefringent polyester constituting the unit cells are matched in their \nz-axis refractive indices, with a substantial mismatch for their \nin-plane indices (GBO). Curve e in Fig. 2 shows the expected behavior \nof the interfacial reflectivity (p-polarized light) versus incidence \nangle for these GBO material interfaces.\n\n\n  The measured and calculated spectra for this mirror sample are \ncompared in Fig. 5. For ease of comparison, optical density \n[essentially -log(1-reflectance) for these low-loss, low-scatter \npolymers] is plotted. With the AFM-measured layer profile and \ndispersive refractive index values, the measured transmission spectra \nat normal incidence are well matched by spectra modeled using either \nthe GBO refractive indices or isotropic refractive index values (set to \nthe measured in-plane values). Using the same measured indices and \nlayer thickness profile, the GBO calculations agree very well with 60 \nDegrees incidence (from air) p-polarization measurements, but the \nagreement is very poor for the isotropic refractive index calculation. \nBoth the details of the reflection band and the band edge positions are \nfaithfully reproduced with the model calculation incorporating the GBO \nrefractive indices. Indeed, as expected for a GBO system with matched \nz-axis refractive indices, all of the characteristics of the normal \nincidence reflection band are maintained for high-incidence p-polarized \nlight. Calculations using the isotropic refractive index values in the \nmodel result in a substantially weaker reflection band that is easily \ndifferentiated from the mirror using z-axis index-matched materials.\n\n\n  The refractive index values measured for the thick monolithic films of \nboth PMMA and birefringent polyester are consistent with the GBO \neffects shown in Fig. 5 for the mirror sample with individual layer \nthicknesses ranging from 90 to 120 nm. This result supports recent work \non the optical and physical properties of thin polymer layers (29).\n\n\n  Applications.  The enhanced control of p-polarized light enabled by \nGBO allows different multilayer interference stack designs to be \ndeveloped for numerous optical applications. GBO multilayer \ninterference stacks can be fabricated with a variety of manufacturing \nmethods. One economical method is polymer coextrusion (11). With this \ntechnique, we have produced a variety of optical films having between \n100 and 1000 layers. With no rigid substrate, they are thin and \nflexible.\n\n\n  GBO broadband mirrors. As shown above (curve e in Fig. 2), a \nz-direction index-matched multilayer interference stack exhibits \nreflection band behavior for p-polarized light that enables previously \nunavailable performance. One optical application that can take \nadvantage of this characteristic is a broadband mirror, intended to be \nan efficient transporter of visible light. The measured spectra in Fig. \n6A illustrate the angular behavior of such a GBO broadband mirror \ncontaining 448 layers of birefringent polyester and PMMA. The normal \nincidence reflection spectrum is compared with the reflectance spectra \nmeasured for p-polarized light incident at 45 Degrees from air and from \na glass prism. Note how the p-polarized light reflection stays very \nhigh at high incidence angle, particularly that demonstrated by the \nspectra for the mirror \"immersed\" in a glass medium.\n\n\n  Broadband mirror applications that use multibounce reflections are \nvery sensitive to reflectivity levels and color changes upon \nreflection. Figure 7A shows a set of three circular cylinders, each of \nwhich is lined with a high reflectivity mirror. A broadband, \"white\" \nlight source is obliquely illuminating each tube's entrance aperture. \nTube a is lined with a multilayer GBO film with matched z-direction \nindices. Tube b is lined with a high-quality, second-surface aluminum \nmirror, and tube c is lined with a high-quality second-surface silver \nmirror. The light exiting each tube has undergone a large number of \nreflections across a range of high incidence angles. The resulting \nlight intensity and color fidelity of the exiting light provide a \nmeasure of the level of omnidirectional reflection quality. As can be \nseen in the photograph, the light exiting the GBO broadband mirror tube \nhas both high intensity and good color fidelity. The silver mirror tube \nshows an obvious \"yellowing\" of the exit light, and the aluminum tube \nhas markedly lower exit-light intensity.\n\n\n  GBO color mirrors. A nonpolarizing color mirror that operates over a \nrange of incidence angles and wavelengths is a difficult task for a \ndesigner using conventional optical materials (30). For non-normal \nincidence, polarization effects limit band edge sharpness, which can \ngreatly affect color purity. GBO techniques can be used to construct a \ncolor mirror that has a matched band edge at all angles for both p- and \ns-polarized light, eliminating these difficulties.\n\n\n  The importance of the use of GBO for color mirrors is illustrated in \nthe following example. Transmission spectra for a GBO stack with all \nlayers having matched z-direction indices near 1.5 are shown in Fig. \n6B. Measurements for normal incidence and 60 Degrees angle of incidence \nfor s- and p-polarized light are shown. Note that the small midband \nleak at normal incidence is reproduced with its intensity unchanged in \nthe 60 Degrees p-polarization measurement. Because the air-polymer \ninterface does not meet GBO criteria, typical Brewster's law behavior \nis observed for wavelengths outside the reflective band (transmission \nlevels of 60% for s-polarization and 98% for p-polarization). Although \nthe long-wavelength band edges are substantially different, the \nshort-wavelength band edges for s- and p-polarization are nearly \nidentical.\n\n\n  The range and intensity of colors that are created in a film cavity \nmade of these materials is shown in Fig. 7B. In this photograph, the \ncavity is externally illuminated with a \"white\" light. The multiple \nbounces produced in a cavity with high reflectivity over a portion of \nthe visible spectrum accentuate the reflected intensity variation at \ndifferent wavelengths, creating intense color. The highly saturated \ncolors seen at all observation angles are a result of the matched s- \nand p-polarization band edges at all angles, combining light \ntransmitted through and reflected from the cavity surfaces.\n\n\n  GBO reflective polarizers. GBO multilayer interference stacks can be \nfabricated with a high refractive index difference developed along only \none in-plane axis, creating a reflecting polarizer. A schematic of a \nunit cell with appropriate indices is shown in Fig. 8A, indicating a \nbiaxial refractive index for at least one of the layers. Figure 8B \nshows reflection measurements along the two principal axes (see Fig. \n1). With the use of GBO techniques, the ultimate omnidirectional \nreflective polarizer can be made where the index differences between \nlayers are zero along both the x and z axes. In such a system, light \npolarized along the reflective axis (y direction) behaves according to \ncurve e in Fig. 2 for p-polarized light. For light polarized along the \npass axis (x direction), neither s- nor p-polarized light is reflected \nby the multilayer stack for any angle of incidence, as the relevant \nindex differences are zero.\n\n\n  Although more complex than a mirror with uniaxial symmetry, GBO design \nconcepts for reflective polarizers can be applied separately for light \npolarized along each axis. The Fresnel and phase thickness equations \ngiven above hold for light incident with its polarization direction \nparallel to either the x axis or y axis. Reflective polarizers \nconstructed with the polymers discussed above have a demonstrated \nextinction ratio of 300:1 averaged across all visible wavelengths at \nall angles of incidence.\n\n\n  3M Film/Light Management Technology Center, 3M Center, St. Paul, MN \n55144, USA.\n\n\n  DIAGRAM: Fig. 1. The normal conventions for polarization are followed \nhere, with p-polarized light having its electric field in the plane of \nincidence and s-polarized light with its electric field perpendicular \nto the plane of incidence. They and z directions in the layer are \nshown. Note that only p-polarization interacts with the indices along \nthe z axis of the layer. For clarity, only the resultant reflected \nwaves are indicated in the right-side diagram.\n\n\n  GRAPH: Fig. 2. In order of increasing ThetaB, curves a through f \nillustrate p-polarized interfacial reflectivity for the following sets \nof indices: (a) GBO n1y = 1.63, n1z = 1.5, n2y = 1.63, n2z = 1.63 \n(birefringent polyesterisotropic polyester), ThetaB = 0 Degree; (b) GBO \nn1y = 1.54, n1z = 1.63, n2y = 1.5, n2z = 1.5 (syndiotactic \npolystyrene-PMMA), ThetaB = 30 Degrees; (c) Isotropic n1y = 2.4, n1z = \n2.4, n2y = 1.46, n2z = 1.46 (TiO2-SiO2), ThetaB = 52 Degrees; (d) \nIsotropic n1y = 5.0, n1z = 5.0, n2y = 1.58, n2z = 1.58 \n(telluriumpolystyrene), ThetaB = 71 Degrees; (e) GBO n1y = 1.8, n1z = \n1.5, n2y = 1.5 n2z = 1.5 (birefringent polyester-PMMA), ThetaB is \nimaginary; and (f) GBO n1y = 1.8 n1z = 1.5 n2y = 1.56, n2z = 1.56 \n(birefringent polyester-isotropic polyester), ThetaB is imaginary. The \nshaded portion indicates the range of ThetaB for isotropic material \npairs that are transparent in the visible portion of the spectrum.\n\n\n  GRAPH: Fig. 3. Angular dependence of (A and C) interfacial reflection \nand (B and D) the long- and short-wavelength band edges for an \nisotropic layer pair and a GBO layer pair, respectively, of low and \nhigh in-plane indices of refraction. In (A), the p-polarization ThetaB \nis near 55 Degrees and the reflection band disappears at that angle in \n(B). For (A) and (B), n1x = n1y = 1.8, n1z = 1.8, n2x = n2y = 1.5, n2z \n= 1.5, and n0 = 1.4 For the GBO material pair, the low and high indices \nof refraction in the x-y plane have the opposite sign index difference \ncompared with that along the z axis. In (C) and (D), the p-polarization \nreflection is higher than the s-polarization reflection with angle. For \nthis GBO example, n1x = n1y = 1.8, n1z = 1.5, n2x = n2y = 1.5, n2z = \n1.9, and n0 = 1.4.\n\n\n  GRAPH: Fig. 4. An AFM image of a GBO stack (31); the dark-colored \nlayers are PMMA and the light-colored layers are birefringent polyester \n(polyethylene naphthalate). Layers on the left side of the image are \nabout 25% thicker than those on the right.\n\n\n  GRAPH: Fig. 5. Comparison of measured and modeled results for light \ntransmission (T) at normal incidence and for 60 Degrees incidence of \np-polarized light. The plot shows good agreement between measurements \nand high-incidence p-polarized GBO model calculations, and poor \nagreement for an isotropic materials calculation at high incidence \nangles with p-polarized light.\n\n\n  GRAPH: Fig. 6. (A) Measured broadband visible mirror reflection for \nvarious incidence angles. The p-polarized light measurements show no \nloss of reflection, only an increased band shift upon immersion in a \nglass incidence medium (n0 = 1.52). (B) Measured spectrum for a GBO \ncolor mirror at normal and 60 Degrees angle of incidence, for s- and \np-polarizations. In (A) and (B), the sequence of unit cells has a \ngradient in thickness to increase the reflection bandwidth.\n\n\n  PHOTO (COLOR): Fig. 7. (A) Light transport tubes using (a) GBO \nbroadband mirror, (b) commercial aluminum mirror, and (c) commercial \nsilver mirror. The ratio of length to diameter of the tubes is 17, and \nwhite light is used to illuminate the open aperture. (B) A GBO film \ncavity that is illuminated from the front aperture with white light. \nNote the change of highly saturated color with observing angle.\n\n\n  GRAPH: Fig. 8. Measured reflectance for a GBO multilayer reflecting \npolarizer whose indices consist of alternating layers that are matched \nalong both the x and z axes and mismatched along they axis. For this \nexample (A), n1x = 1.57, n1y = 1.86, n1z = 1.57, n2x = 1.57, n2y = \n1.57, n2z = 1.57, and n0 = 1.0. (B) When measured in the y direction, \nreflection shows a strong band at near 100% intensity. Along the x \ndirection, there are only air interface reflections.\n\n\n\n\nReferences and Notes\n\n\n  (1.)  P. Baumeister and G. Pineus, Sci. Am. 223, 58 (December 1970).\n\n\n\n\n(2.)  P. Drude, Wied. Ann. 43, 146 (1891).\n\n\n\n\n(3.)  -----, Ann. Phys. Chem. 38, 865 (1891).\n\n\n\n\n(4.)  D. Brewster, A Treatise on Optics (Lea & Blanchard, London, 1839).\n\n\n\n\n(5.)  M. Banning, J. Opt. Soc. Am. 37, 792 (1947).\n\n\n\n\n(6.)  P. Lissberger, Rep. Prog. Phys. 33, 197 (1970).\n\n\n\n\n(7.)  V. R. Costrich, Appl. Opt. 9, 866 (1970).\n\n\n\n\n(8.)  A. Thelen, Appl. Opt. 15, 2983 (1976).\n\n\n\n\n(9.)  -----, J. Opt. Soc. Am. 70, 118 (1980).\n\n\n\n\n(10.)  T. Ito, U.S. Patent 5,579,159 (26 November 1996).\n\n\n\n\n(11.)  T. Alfrey, E. F. Gurnee, W. J. Schrenk, Polym. Eng. Sci. 9, 400 \n(1969).\n\n\n\n\n(12.)  C. J. Heffelfinger and K. L. Knox, The Science & Technology of \nPolymer Films (Interscience, New York, 1971), p. 587.\n\n\n\n\n(13.)  D. A. Holmes and D. L. Feucht, J. Opt. Soc. Am. 56, 1763 (1966).\n\n\n\n\n(14.)  R. M. A. Azzam and N. M. Bashara, Ellipsometry and Polarized \nLight (Elsevier, Amsterdam, 1987), p. 119.\n\n\n\n\n(15.)  D. W. Berreman, J. Opt. Soc. Am. 62, 502 (1972).\n\n\n\n\n(16.)  P. Yeh, J. Opt. Soc. Am. 69, 742 (1979).\n\n\n\n\n(17.)  I. Hodgkinson and Q. H. Wu, J. Opt. Soc. Am. A 10, 2065 (1993).\n\n\n\n\n(18.)  J. Lekner, J. Opt. Soc. Am. A 10, 2059 (1993).\n\n\n\n\n(19.)  Y. Fink et al., Science 282, 1679 (1998).\n\n\n\n\n(20.)  Optical stack designs with isotropic materials often compensate \nfor this reduction of p-polarization reflectivity with incidence angle \nby increasing the number of unit cells in the multilayer stack to such \na level that the reflectivity falloff is minimized. This approach can \nbe quite successful for isotropic multilayer interference layers with \nair as the external medium, but has limited utility when the external \nmedium allows for larger propagation angles to be present in the stack.\n\n\n\n\n(21.)  R. M. A. Azzam and N. M. Bashara, in (14), p. 357 (corrected \nequation).\n\n\n\n\n(22.)  M. Born and E. Wolf, Principles of Optics (Pergamon, New York, \ned. 5, 1975), p. 40.\n\n\n\n\n(23.)  O. S. Heavens and H. M. Liddel, Appl. Opt. 5, 373 (1966).\n\n\n\n\n(24.)  M. Born and E. Wolf, in (22), p. 66.\n\n\n\n\n(25.)  A. Thelen, J. Opt. Soc. Am. 53, 1266 (1963).\n\n\n\n\n(26.)  J. C. Kim, M. Cakmak, X. Zhou, Polymers 39, 4225 (1998).\n\n\n\n\n(27.)  J. C. Seferis, Polymer Handbook (Wiley, New York, ed. 3, 1989), \np. 45.\n\n\n\n\n(28.)  M. Cakmak and J. L. White, Polym. Eng. Sci. 29, 1534 (1989).\n\n\n\n\n(29.)  R. L. Jones, S. K. Kumar, D. L. Ho, R. M. Briber, T. P. Russel, \nNature 400, 146 (1999).\n\n\n\n\n(30.)  H. A. Macleod, Thin-Film Optical Filters (Macmillan, New York, \ned. 2, 1986), p. 334.\n\n\n\n\n(31.)  AFM image and layer thickness analyses were provided by V. W. \nJones of 3M Corporate Analytical Technology Center.\n\n\n  25 October 1999; accepted 15 February 2000\n\n\n  ~~~~~~~~\n\n\nBy Michael F. Weber; Carl A. Stover; Larry R. Gilbert; Timothy J. \nNevitt and Andrew J. Ouderkirk\n\n\n  Copyright of  Science is the property of American Association for the \nAdvancement of Science and its content may not be copied or emailed to \nmultiple sites or posted to a listserv without the copyright holder's \nexpress written permission. However, users may print, download, or \nemail articles for individual use.\nSource: Science, 03/31/2000, Vol. 287 Issue 5462, p2451, 6p, 1 diagram, \n6 graphs, 1c.\nItem Number: 3010032\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-March/001518.html).</sup>", "id": "radiance-general_001518", "created_by": "John_An"}