{"topic": "Visiting scholarship at Lucerne University of Applied Sciences and Arts: \"Climate-based modeling and performance assessment of daylight redirecting components\"", "category": "radiance-general", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "October 09, 2015 at 04:30AM", "body": "Dear daylighting enthusiasts,\n\n\nthe Centre of Competence Envelopes and Solar Energy (CC EASE) at Lucerne University of Applied Sciences and Arts [1], in the centre of Switzerland, is looking for a motivated visiting scholar, willing to support ongoing research on the performance assessment of daylight redirecting components [2] starting from January 2016 for a duration of five months.\n\n\nApplicants shall be familiar with\n\n\n- complex fenestration systems such as daylight redirecting components,\n- climate-based daylight modeling and\n- the application of daylight metrics for\n- the evaluation and comparison of daylighting devices and designs under different climatic conditions.\n\n\nProficiency in the development of simulation models is expected, experience with advanced modeling in Radiance a plus. Working languages at CC EASE are English and German.\n\n\nThe successful applicant shall work in our team, employing an in-house software based on Radiance [3] within a project funded by the Swiss National Science Foundation. The research shall contribute to the ongoing project and lead to joint publications. CC EASE offers an international and multi-disciplinary working environment, supporting the research with laboratory facilities including a scanning goniophotometer, software developments such as the ongoing work on the Radiance photon map extension and access to a cluster for computational simulation.\n\n\nThe research visit is limited to five months. Remuneration will be as for a research associate. Applications will be accepted until 23rd October 2015. For any questions regarding the details of this vacancy, please contact me as soon as possible by email.\n\n\nPlease distribute this announcement among your colleagues and to potential applicants.\n\n\nBest regards,\nLars.\n\n\n[1] http://www.hslu.ch/ccease\n[2] http://p3.snf.ch/project-147053\n[3] http://www.researchgate.net/publication/282662869_EvalDRC_A_Tool_for_Annual_Characterisation_of_Daylight_Redirecting_Components_with_Photon_Mapping\n\n\n\n\nLucerne School of Engineering and Architecture\n\n\nDipl.-Ing. Lars O. Grobe\nSenior Research Associate Competence Centre Envelopes and Solar Energy\nwww.hslu.ch/ccease\n\n\nT direct +41 41 349 36 32\nlarsoliver.grobe at hslu.ch\n\n\nTechnikumstrasse 21, CH-6048 Horw (Mail)\nEbenaustrasse 20, CH-6048 Horw (Office)\nT +41 41 349 33 11, F +41 41 349 36 11\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-October/011290.html).</sup>", "id": "radiance-general_011290", "created_by": "Lars_O._Grobe"}