{"topic": "Solar Heat Gain Coefficient (SHGC) Calculations in OpenStudio's Coupled Radiance and EnergyPlus Simulations", "category": "radiance-openstudio", "attachments": [], "created_by_name": "Justin Shultz", "created_at": "March 11, 2014 at 10:42AM", "body": "Hello Radiance and OpenStudio users and developers,\n\n\nI'm new to the radiance and daylight simulation. Sorry if this is a basic \nquestion. I have used EnergyPlus for many basic projects, but my most recent \none is studying a dynamic glazing system. My partner and I have determined \nthat the three-phase method is probably going to be our best option. We're \nlooking to model the effects the dynamic glazing system would have on the \nelectrical lighting loads, as well as, the solar heat gain into the building \nzone. \n\n\nI've been reviewing the tools and methods at are currently available to do \nthis and found \"Challenges of Integrated Daylight and Electrical Lighting \nSimulation Methods in a Whole-Building Energy Simulation Context\" by Rob \nGuglielmetti to be tremendously helpful. OpenStudio appears to be one of the \nmost integrated and streamline options available for coupled daylight and \nwhole building simulation. \n\n\nThe question I have, that I haven't been able to find, is whether the \nOpenStudio coupled Radiance and EnergyPlus method transforms the solar heat \ngain? The daylight is well studied and discussed, but I haven't been able to \nfind out whether this method will discount the solar heat gain through the \nfenestration systems. \n\n\nAdditional side question: When running genBSDF is there a command or \nsomething material property that needs to be added to get the factors for the \nSHGC? We have only been able to get the daylight coefficients.\n\n\nThank you for your help,\nJustin Shultz\nPhD Student\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-openstudio/2014-March/000128.html).</sup>", "id": "radiance-openstudio_000128", "created_by": "Justin_Shultz"}