{"topic": "Radiance-general Digest, Vol 84, Issue 6", "category": "radiance-general", "attachments": [], "created_by_name": "Caria Roberto", "created_at": "February 07, 2011 at 04:50AM", "body": "Ciao Thomas,\nthank you for your reply.\n\n\n>So you really want to know internal illuminance values?for a given\n>scene for the whole year? (I hope you know?you can get the external\n>illuminance from the epw file.)\n\n\nR: I know I can get the external illuminace from epw file but no all \nlocations have these data values (if you open ITA_Cagliari Elmas you \ncan see it is that)\n\n\nI think if I consider the Illuminance values taken from epw file I \ncan use gensky and insert them as -B and -R parameters (dividing them \nto 179, before) and add +s when I have both values and -c when I have \nonly the diffuse Illuminance. (Can you confirm it?)\n\n\n\n\n\n\n>My summary of your problem:\n\n\n>Your idea is to use Daysim (or Radiance) with a climat data file to\n>calculate the internal illuminance values and plug these into E+ or\n>whatever. Your first step is to calculate external values in an \nempty\n>scene to \"validate\" your sky model. Doing this in Daysim and \nRadiance\n>(with gendaylit) you got two sets of results with significant\n>differences.\n\n\nI did it as you write.\n\n\n>I hope you did have a -I option in there some where. You also only\nneed to increase your \"-ab\" to 1 to get the \"diffuse\" part.\n\n\nI used -I option. \n\n\n>Now the interesting bit:\n>\n>If you look at your results or the global horizontal values you \nwill\n>see that the Daysim values are roughly 25%-30% higher than those\n>calculated in Radiance. However, they are consistently higher \n(which\n>is good). I would expect that the difference is a result of the\n>approach the two applications have:\n\n\nWhy is good to get higher values? \n\n\n\n\n>1) Daysim calculates a sky component and just maps the sky onto \nthis\n>distribution to get a particular result.\n>\n>2) Radiance used the sky directly in it's raytracing calculation.\n>\n>Both sets of results are bound to be different from the actually\n>observed illuminance on the ground. You can extract the illuminance\n>values from the EPW file and compare them to the calculated \nresults.\n>If you find that one of the sets is reasonably accurate go with \nthat.\n\n\nI did it and there is a small difference between epw and daysim data \nilluminance (about 2-3%), so I suppose I can use illuminance values \nprovided by Daysim.   \n\n\nSo, using the same input (Irradiance values comes from epw file) the \nsky created by Daysim works better than a sky generated by gendaylit? \nIin which conditions can I use gendaylit?\n\n\nSo, if i want to show particular illuminance condition in radiance (i.\ne. 12:00 on 21 March) by mean a falsecolor image with illuminace \nvalues, is better to use gensky with +s or -c \ndepending on if there is direct and diffuse illuminance or only \ndiffuse one, using the illuminance data values from daysim or epw (if I \nhave it)?\n\n\nIf my weather file has not illuminance data values, I must use Daysim \nto generate the illuminace external values and use them in Radiance to \nmake analysis (by means gensky); I can`t use gendaylit (starting from \nIrradiance value provided by the weather file) because it provides \nilluminance values are not correct compared to measured ones.\n\n\nCan you confirm it?\n\n\n>You can also use the measured values to 'calibrate' your \ncalculations\n>and scale the internal results according to a reference calculation\n>outside. If your reference point value is different from the EPW\n>record you increase or decrease the calculated illuminance to\n>compensate for the overall difference.\n\n\nOk, I can do it if I have measured data. \n\n\n\n\nSorry for many questions and thanks a lot in advance.\n\n\nCiao\n\n\nRoberto\n\n\n\n\n\n\n\n\n\n\n\n\n_______________________________________________\nRadiance-general mailing list\nRadiance-general at radiance-online.org\nhttp://www.radiance-online.org/mailman/listinfo/radiance-general\n\n\n\n\nEnd of Radiance-general Digest, Vol 84, Issue 6\n***********************************************\n\n\n\n\n\n\n\n\n\n\nSupera i limiti: raddoppia la velocità da 10 a 20 Mega! Risparmia con Tutto Incluso: telefono + adsl 20 mega a soli 29,95 € al mese per due anni!SCONTO DI 240 EURO!http://abbonati.tiscali.it/telefono-adsl/prodotti/tc/tuttoincluso/?WT.mc_id=01fw\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2011-February/007676.html).</sup>", "id": "radiance-general_007676", "created_by": "Caria_Roberto"}