{"topic": "rtrace values too low compared to 3-phase method", "category": "radiance-general", "attachments": [], "created_by_name": "Marouane Boudhaim", "created_at": "December 08, 2017 at 08:08AM", "body": "Hello,\n\n\nI’m trying to calculate vertical illuminance with 3-phase method and \nvalidate it against rtrace results.  My results are very different. \n3-phase method has illuminance values two order of magnitudes higher. I \ncan only see the the direct solar illuminance on the floor. I suspect that \nmy rtrace command fails to find the sky, because of the complexity of the \ngeometry of my fenestration system. I was wondering if anyone here has \nalready had such a problem in the past with rtrace giving too low \nilluminance values.\n\n\nMy CFS geometry consists of uniformly spaced boxes of 5 cm (picture in the \nend). The gap between the boxes allow 4%  normal transmittance (tested \nwith 20% too and it’s still dark, 30% start giving some light).\nHere are the parameters used to calculate the vertical illuminance (and \nwhich I suspect may be wrong)\n\n\n1st way : 3PM : View matrix of the picture (on which I use evalglare to \nget the vertical illuminance) :  -n 35 -ab 10 -ad 65536 -lw 1.52e-5 -c 9\n\n\n2nd way : Vertical illuminance with rtrace :  rtrace -h -I -n 40 -ab 10 \n-ad 8192 -ar 1024 -as 4096 -aa 0.1\n\n\n3rd way : Rtrace picture (I use evalglare on it) :  rtrace -n 40 -ab 5 -ad \n512 -ar 128 -as 256 -aa 0.15 -dc 1\n\n\nNeedless to say I made the parameters vary many times before contacting \nthe mailing list, but there are so much parameters and simulation times \nincrease a lot (I mainly increased ab and ar). I have already tried the \nparameters on the old and new 3pm/5pm tutorials to be sure my 3-pm results \nare not wrong. Has anyone else had similar experience with rtrace and know \nhow to solve it ?\n\n\nSincerely,\nMarouane.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2017-December/012361.html).</sup>", "id": "radiance-general_012361", "created_by": "Marouane_Boudhaim"}