{"topic": "Radiance on bootable CDROM using Linux", "category": "radiance-general", "attachments": [], "created_by_name": "Terrance Mc Minn", "created_at": "March 06, 2003 at 11:02AM", "body": "Hello All,\n\n\nBeing a frustrated radiance user in a Microsoft operating system preferred\nuniversity, I have struck out. As part of my teaching load in the Faculty\nand the Department of Architecture and Interior Architecture, I have\ndeveloped bootable PC CDROM containing Linux and Radiance 3.4.1 (patched).\nThis CDROM is distributed to undergraduate students taking my third year\nBuilding Science unit in the Architecture and Interior Architecture courses.\nThe students are able to boot from CD in the Faculties computer laboratories\nplus use the CD on home computers. There is zero software loaded on the\ncomputers hard drive, in fact no hard drive is required  + no need for\nancillary software eg AutoCAD to be loaded. The faculties computers do have\nAutoCAD but would the students home computers?\n\n\nAfter prompting from Greg Ward, I have made available a copy of an\nunpublished paper at\nhttp://puffin2.curtin.edu.au/restricted/mcminn/papers/Flexible-Learning.pdf\n\n\nThis paper outlines the development of a bootable CDROM that contains a full\noperating system plus all required software for the teaching of Radiance, a\nsophisticated lighting simulation package. Lighting simulation programs are\nvital tools for Architects and Interior Architects to visualise lighting\nschemes for projects. The Radiance \"package is a capable of producing\nphysically correct results and images that are indistinguishable from real\nphotographs\" (Jacobs &  Solomon 2002, pg 3) This combination of application,\noperating system and CDROM allows students to gain experience, via a\nrealistic simulation of the physical reality of the building project without\nneeding to install new software and applications.\n\n\nThe CDROM method of delivery is in its second year, we had 80+ students\nusing it in 2002. In 2003 the numbers are currently 96 students. The\nproducts of their submissions were equal or better than previous years using\ninstalled partitions, etc. Comments from the tutor, indicate that the class\nexperienced less computer related problems than previous years.\n\n\nI would be interested in comments on my project. There are many avenues yet\nto be explored. \n\n\nRegards\n\n\nTerry Mc Minn\nFaculty of Built Environment, Art and Design\nCurtin University of Technology\nGPO Box U 1987\nPerth 6845\nWestern Australia\nEmail: T.Mcminn@curtin.edu.au\nCRICOS Provider Code: 00301J\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-March/000568.html).</sup>", "id": "radiance-general_000568", "created_by": "Terrance_Mc_Minn"}