{"topic": "Reminder: Call For Papers - Special Issue on High Dynamic Range Imaging", "category": "hdri", "attachments": [], "created_by_name": "Guoping Qiu", "created_at": "September 22, 2006 at 07:55AM", "body": "Special Issue on High Dynamic Range Imaging\nJournal of Visual Communication and Image Representation \n\n\nDeadline for Submission: 15 November, 2006\nNotification of Acceptance:    15 March, 2007\nFinal papers due:        15 April, 2007\nPlanned Publication:    August 2007\n\n\n\n\n\n\nCall For Papers\n\n\nJournal of Visual Communication and Image Representation\n\n\nSpecial Issue on High Dynamic Range Imaging\n\n\nHigh dynamic range imaging (HDRI) is an emerging technology, which has the \npotential to bring a new revolution in digital imaging. In HDRI, the image \nfiles record the actual colour and dynamic range of the real world scene \nrather than the limited gamut and dynamic range of the monitor or other \nreproduction media. This means that image processing, manipulation, \ndisplay, recognition and other operations will no longer be limited by the \nnumber of bits used to represent each pixel. Therefore, HDRI will have \nwidespread applications in digital cinema, digital photography, computer \ngames, etc., and will open up many new possibilities, including \ndramatically improving the visual realism of digital photographs and \nvideos, enabling the development of more accurate computational vision \ntechniques, etc. Many in academic and industry have advocated that the \nfuture of digital photography and video is high dynamic range imaging. It \nis anticipated that in the next decade, the imaging industry will \ninevitably move to HDRI which will affect all aspects of the imaging \npipeline, from capture (sensor, camera), to storage (compression coding) to \nreproduction (rendering, tone mapping, printing and display). New image \nprocessing and computational vision algorithms will also be developed \naround this new emerging imaging paradigm.\n\n\nThis special issue will highlight new research directions and the latest \ntechnological advancement in high dynamic range imaging and video by \ncollecting papers in all relevant areas of HDRI. We invite researchers and \npractitioners to submit their original unpublished work to this special \nissue. We solicit papers dealing with high dynamic range imaging subtopics \ndrawn from all stages of the high dynamic range imaging pipeline. This \nincludes, but is not limited to, the following topics\n\n\n·    Capture devices\n·    Multi-exposure techniques\n·    Response curve recovery\n·    Noise\n·    Ghost removal\n·    Encoding for images and video\n·    File formats for images and video\n·    Applications of HDRI\n·    Image-based lighting\n·    Dynamic range reduction\n·    HDR display devices\n·    Validation of techniques and algorithms\n·    Colour science\n·    Colour appearance modeling\n\n\nInformation for Authors\n\n\nAuthors should prepare their manuscript according to the Guide for Authors \navailable from the online submission page of the 'Journal of Visual \nCommunication and Image Representation' at http://ees.elsevier.com/jvci/. \nWhen submitting via this page, please select \u0093HighDynamicRangeImaging\u0094 as \nthe Article Type.\n\n\nImportant Dates\n\n\nDeadline for Submission:        15 November, 2006\nNotification of Acceptance:    15 March, 2007\nFinal papers due:        15 April, 2007\nPlanned Publication:    August 2007\n\n\n\n\nGuest Editors    \n\n\nGuoping Qiu (qiu at cs.nott.ac.uk)\nSchool of Computer Science, University of Nottingham \nErik Reinhard (reinhard at cs.bris.ac.uk)\nDepartment of Computer Science, University of Bristol \nGraham Finlayson (graham at cmp.uea.ac.uk)\nSchool of Computing Sciences, University of East Anglia\n\n\nThis message has been checked for viruses but the contents of an attachment\nmay still contain software viruses, which could damage your computer system:\nyou are advised to perform your own checks. Email communications with the\nUniversity of Nottingham may be monitored as permitted by UK legislation.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2006-September/000134.html).</sup>", "id": "hdri_000134", "created_by": "Guoping_Qiu"}