{"topic": "Mac OS X and nfs", "category": "radiance-general", "attachments": [], "created_by_name": "John S. An", "created_at": "December 22, 2003 at 03:37PM", "body": "Hi all,\n\n\nI'm at my wits end trying to get my machines to play nicely when \nparallel processing.  I have a 4 computer setup which I am trying to \nfarm together via nfs for some renderings, and I've come to an impass.\n\n\nSet-up:\n2 linux boxes running Mandrake 9.1\n2 Macintoshes running Panther (10.3.2)\n\n\nOne of the linux box is set as the nfs server.  I set the /etc/exports \nto give read write access and sync to all machines in my private \nnetwork (192.168.0.0/255.255.255.0).  The server and the other linux \nbox have no problems communicating and parallel processing.\n\n\nOn the Macintoshes, I used the shareware program NFSManager to set up \nthe mount for the exported folder.  In the Finder, I am able to access, \nread, and copy files from the Macintosh to the server, and to erase \nfiles that are on the server.  I can also use X11 to run single \nprocessor renderings on files that are located on the nfs server.  \nHowever, when I try to run the parallel renderings from the Macintosh, \nthe process just freezes.  Using the top command, I see that rpict is \nthere, but 0% of the computers resources is devoted to the process, and \nit remains in that state indefinitely (5 days).\n\n\nI doubled checked the UID and GID on all for machines to make sure that \nthey all match.\n\n\nJust to test what was going on, I tried setting up one of my \nMacintoshes as the nfs server.  In this instance, the linux box can \nmount the file system, but the process freezes when it starts the \nrendering, whether it be a single rpict command or an rpiece command.  \nThe other Macintosh is capable of running and completing the parallel \nrendering process, but only about 10% of the computers resources is \ndevoted to the process (this is something that I'll just have to look \ninto).\n\n\nCould somebody please help me figure out what is going on?\n\n\nThanks.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-December/001355.html).</sup>", "id": "radiance-general_001355", "created_by": "John_S._An"}