{"topic": "radiance-online upgrade", "category": "radiance-general", "attachments": [], "created_by_name": "Peter Apian-Bennewitz", "created_at": "February 29, 2004 at 06:24PM", "body": "Hi folks,\n\n\nafter spending the weekend at my office and getting a new Linux software \nand configuration, radiance-online.org is back in the rack and on-line.\n\n\nIf you feel no differences - good.  The reason for this major \nreconfiguration beneath the visible skin was to cast new foundations \nthat will allow features to be implemented in the future.\n\n\nHowever, there a some subtle changes in the mail processing system, \nwhich might be worth mentioning:\n\n\n   1. our new mail transport system (MTA, mail transport agent, Exim4)\n      is more aware of MIME attachments in emails. Mails not conforming\n      to the MIME specs or containing file attachments ending with \"bat\n      com exe pif prf scr vbs doc\" will be rejected. Obviously, this\n      tries not to relay emails originating from a subscribed, but\n      infected email address. It is not intended to be 100% foolproof\n      (or 100% MS-proof which is the same regarding their email\n      handling), so everyone is still urged to watch out for viruses on\n      her/his machine and protect it in general.\n      The usual disclaimer still applies: I can't take any\n      responsibility for malicious things posted on the list. The\n      measures just ensure a reasonable step beyond what we had before.\n   2. The mailing list and archive system (Mailman) now handles MIME\n      attachments. They used to clobber the archived mail, now they are\n      moved cleanly to separate files.\n   3. Presumably all per-user-settings have been brought forward from\n      mailman 2.0.11 to the new version 2.1.4 .\n\n\nIn case of questions or problems, please don't hesitate to contact me.\n\n\nMany thanks to the developers of  the public domain software Mailman, \nApache, Exim and the maintainers of the Linux Debian distribution,\n\n\ncheers\nPeter Apian-Bennewitz\n\n\n\n\n pab-opto, Freiburg, Germany, http://www.pab-opto.de\n [see web page to check digital email signature]\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-February/001485.html).</sup>", "id": "radiance-general_001485", "created_by": "Peter_Apian-Bennewitz"}