{"topic": "Photosphere 1.6 available", "category": "hdri", "attachments": [], "created_by_name": "Greg Ward", "created_at": "May 11, 2006 at 04:14AM", "body": "Hi All,\n\n\nI just uploaded version 1.6 of Photosphere, both PPC and Universal  \nversions to my website:\n\n\n\thttp://www.anyhere.com\n\n\nThe made addition since version 1.5 is the ability to create  \npanoramas from overlapping images.  It's not as easy to use as  \nPhotoshop perhaps, but the results are often nicer and best of all,  \nit works with HDR source images.  The user interface to it is a  \nlittle shaky, but it actually is fairly reliable once you get used to  \nthe concept.  Here is the item I appended to quickstart_pf.txt  \ndescribing the process:\n\n\n15) To stitch together a panorama, choose a set of images and open\nthem.  In each image, select a salient feature that is also visible\nin the adjacent image.  Click the \"Apply\" button in the image viewer\nand choose \"Pano Orig\" in the first image, then move to the second\nimage, select the matching feature, and choose \"Pano Dest\".  After a\nmoment, the selection box in the second image should disappear,\nindicating these two images have been linked.  If the \"Apply\" button\nis missing \"Pano Orig\" or \"Pano Dest\" in its pop-up menu, that means\nthe box is either too big or in the wrong image.  If you have\npreviously selected a set of anchors or created a panorama and wish\nto start a new one, use the \"Clear Pano\" command that shows up in\nthe \"Apply\" pop-up when nothing is selected.  After each link has\nbeen made, you may select the next feature for linking to another\nneighbor, or choose \"Make Panorama...\" from the \"File\" menu if you\nare done or wish to see what you have linked so far.  By scaling\ndown the output resolution, you can obtain a quick preview to check\nyour work.  You can always add new linked images or change existing\nlinks via the \"Apply\" pop-up menu, or start over by selecting \"Clear\nPano\" or pressing the \"Clear\" button in the \"Make Panorama\" dialog.\nIt may take a few tries before you get used to the idea of selecting\nimage features, and some features definitely work better than others.\nIt's best to select a corner or prominence with high contrast.  Busy\nareas make for poor feature matching, which can cause misalignment\nin the results.  Trees and mountain peaks are good features.  Fields\nof grass and waves on water are not.\n\n\nNote that I did not design it to handle complex panorama  \nassemblages.  It really only works for simple horizontal and vertical  \narrangements, with one feature joining each image in a chain.  You'll  \nalso find that it does not work well with fisheye or highly distorted  \nimages, as there is no unwarping operation applied.  Nevertheless, I  \nhope it finds some use.\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2006-May/000081.html).</sup>", "id": "hdri_000081", "created_by": "Greg_Ward"}