{"topic": "proposed featu interpreting view names in rad", "category": "radiance-general", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "July 22, 2009 at 01:05AM", "body": "Hi,\n\n\nI am not sure whether this would break anything, but it would be a \nrather useful way of organizing renderings:\n\n\nAt the moment, I can pass a view name to rad using the -v parameter, and \nthis will cause exactly one view to be rendered, which must have been \nnamed in the view= line in the rif file.\n\n\nNow, this view= line can point to a view file, which may contain more \nthen one view. I would have expected rad to render all the views in that \nfile, but as -v is defined to render exactly one view, rad takes only \none of the views defined in the view file and ignores the others.\n\n\nI would propose to change this behaviour. If I call rad e.g. as\n\n\nrad -v myview myoctree.oct\n\n\nit would be very useful if rad would look whether it finds a view= line \nfor myview. If it finds one defining one view, render that. If it finds \none pointing to a view file, render all the views in that view file. If \nI call rad as\n\n\nrad -v anotherview -v myview myoctree.oct\n\n\nit should render all views defined in the view= lines for anotherview \nand myview, be it view files or view definitions inside the rif.\n\n\nOne reason this would be helpful is as such: I am currently working on a \nscene, which needs some view-dependent processing. So I have a script \nwhich does some work, cleans up, creates an octree, creates photon maps, \nand then calls rad. Now I would like to call the same rif-file for all \nof these, as it eventually contains the same information for all \nrenderings except the views. And I cannot render all views at once, as I \nhave to modify the octree before moving to the next \"view group\" (this \ntranslates to rooms in my example).\n\n\nI am sure that there are other uses for this. What do you think? Is \nthere any way people may have used the -v parameter that could imply the \nrisk of breaking compatibility by introducing such a change?\n\n\nCheers Lars.\n\n\n\n\nLars O. Grobe (Mr) :: Research Fellow, Solar Energy Research Institute \nof Singapore SERIS :: National University of Singapore :: 7 Engineering \nDrive 1, Block #E3A-06-35, Singapore 117576 :: 65-6516 5816(Tel) :: \n65-6775 1943 (Fax) :: serlog at nus.edu.sg (E) :: www.seris.sg (W) :: \nCompany Registration No: 200604346E\n\n\nImportant: This email is confidential and may be privileged. If you are \nnot the intended recipient, please delete it and notify us immediately; \nyou should not copy or use it for any purpose, nor disclose its contents \nto any other person. Thank you.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-July/006122.html).</sup>", "id": "radiance-general_006122", "created_by": "Lars_O._Grobe"}