{"topic": "converter options for radiance", "category": "radiance-general", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "January 25, 2004 at 08:59PM", "body": "Hi!\n\n\nSome time ago, I asked about the mgf2inv tool, as this is the only \nprogram I know that is able to export from radiance's scene format to \nother 3d formats. However, as the only way goes through mgf, which \nAFAIK didn't change in the last years, it is e.g. impossible to export \nthe image map information from radiance. I wonder if there is really no \nneed for that?\n\n\nI found an interesting project called xrml which is enhancing vrml97 \ninto so-called PhBvrml, a vrml extension for physically based \nrendering. There are even converters for mgf, so again I can get into \nthis format through mgf only.\n\n\nI think that a similar approach like PhBvrml, simply not based on \nvrml97 but the xml'ed x3d, would be a great solution to keep scenes in \na more readable format also useable by other tools (e.g. x3d-browsers, \nxml-editors and validation tools). I think that if radiance could use \nsomething like that, we would make a big step in the integration of the \nsimulation with other developments.\n\n\nSo, finally, my question is: is there any interest and chance that we \nwill see radiance (directly or with the help of filters, like the \nmgf-support) will be able to handle such a format that can be read by \nother browsers and has the extendibility and validation features of \nxml? Might such a format even be an approach to get into real-time and \nhw-accelerated radiance rendering? If I can output \"prerendered\" \ntriangles with e.g. the ambient calculation done in radiance, I could \nuse whatever (accelerated) x3d-browser, couldn't I? So the task to \ndisplay would be given to other, specialised programs, while radiance \nwould export into standard formats.\n\n\nI hope my ideas are not to stupid in the context of radiance's use... \nand on this list. I am just fighting with problems of documentation / \nmodel integration, converters and loss of information here... ;-)\n\n\nCU Lars.\n\n\nLars O. Grobe, grobe@gmx.net, ++90-212-2458330\n\n\nKardesler Apartment, Turnacibasi Sokak 28\nGalatasaray - Beyoglu, 34433 Istanbul\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-January/001438.html).</sup>", "id": "radiance-general_001438", "created_by": "Lars_O._Grobe"}