{"topic": "mirror and virtual sources", "category": "radiance-general", "attachments": [], "created_by_name": "Christopher Rush", "created_at": "April 08, 2008 at 02:12PM", "body": "I am modeling a daylight redirection system, something like a light\nshelf type of geometry.  I have a two part question regarding the\nspecular component and virtual sources.\n\n\nIt's by no means a validated material definition, but I've been testing\nwith the following material meant to be something like brushed aluminum.\nThe intention is that the metal gives the best approximation of the\nsurface characteristics, while the mirror adds the virtual sources of\nthe specular reflection.\n\n\nvoid metal aluminum\n0\n0\n5 .7 .7 .7 .5 .01\n\n\nvoid mirror aluminum_mirror\n1 aluminum\n0\n3 .35 .35 .35\n\n\nMy first question is the value of the mirror material.  I want to\nconfirm that my value for the mirror of 0.35 is appropriate (0.35 = 0.7\n* 0.5).  I've based this on my general estimate of 70% general\nreflectance and 50% specular reflectance for the actual material. Or\nshould the value for the mirror be the full 0.5 to match the full\nspecular component?\n\n\nThe second part of the question is regarding the use of the alternate\nmaterial in the calculation.  From an old post I turned up the following\nfrom Greg:\n\n\n> If you are trying to reflect objects in a surface, the \"mirror\" \n> primitive allows you to specify any alternate material you choose when\n\n\n> it is not participating in the virtual source calculation.\n\n\nDoes this mean that the alternate material will participate in the\nindirect calculation? Or is the alternate material only used to produce\nthe appearance of the surface in direct view?  Or something else?\n\n\nAlso, is it reasonable that for a rough surface the mirror value should\nbe toned down a bit to account for roughness that is not part of the\nmirror definition?\n\n\n\n\nAny suggestions for appropriate definitions for actual metals found\ncommonly in the built environment are welcomed.\n\n\nThanks,\nChris\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-April/004913.html).</sup>", "id": "radiance-general_004913", "created_by": "Christopher_Rush"}