{"topic": "Radiance vs radiosity (and Google Books!)", "category": "radiance-general", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "January 22, 2008 at 08:49AM", "body": "loscotec at libero.it wrote:\n> Now, to the topic... I'm about to start writing my thesys which will be about road lighting with radiance and hopefully about tunnel-lighting... I am interested in doing an introduction in which I would like to talk also a bit about differences between Radiance-software method and radiosity, what is good and what is bad about both, mainly about illuminotechnic calculation. And I would like to include comparisons with other tecniques if they do exist.\n>\n>\n> Can someone give me some tip, or better, redirect me to someone else's job about this matter to read from ? \n>   \nhi Lucio,\n\n\nThe advantages of ray tracing will become evident when you read \n\"Rendering with Radiance\", and start using the software.  A really good \ntext on radiosity is \"Radiosity and Gobal Illumination\" by Sillion.  \nApparently, the entire text is available online these days at Google Books:\n\n\nhttp://books.google.com/books?hl=en&id=h2PP-lpWY84C&dq=radiosity+sillion&printsec=frontcover&source=web&ots=Z3iepCSU7O&sig=nyjipt7owAwLOnm3_IJtez0BHxM#PPP1,M1\n\n\nAnother good one that covers both methods is \"Advanced Global \nIllumination\", which can also be viewed at Google Books here:\n\n\nhttp://books.google.com/books?id=D0HMgNoDzRYC&pg=PA318&dq=rendering+with+radiance&sig=5wLiL0sRc-G8bnId3LXoVe3HNYk&vq=%22Rendering+with+Radiance%22#PPR9,M1\n\n\nHave a fun trip!  Radiance is a lot of fun.\n\n\nBy the way, am I late to this Google Books party?  Greg & Rob S., \nperhaps this is a good venue for RwR?  Apparently each author can decide \nhow much of the book to make browsable; maybe posting the tutorial \nchapters and the juicy chapters at the end could be of great use for the \ncommunity, and generate some hard copy sales as well?  If interested, \nhere's the FAQ:\n\n\nhttp://books.google.com/support/\n\n\n- Rob Guglielmetti\nwww.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-January/004717.html).</sup>", "id": "radiance-general_004717", "created_by": "Rob_Guglielmetti"}