{"topic": "hdrgen's -x option", "category": "hdri", "attachments": [], "created_by_name": "Axel Jacobs", "created_at": "February 27, 2012 at 03:49PM", "body": "Dear list and Hi Greg,\n\n\nIn the recent raw2hdr bundle you packaged for Yulia\nhttp://www.radiance-online.org/pipermail/hdri/2012-February/000363.html\nthere's a man page for hdrgen that list some options which do not appear \nin the man page that comes with the LINUX download you have on \nhttp://anyhere.com/\n\n\nI have just discovered that the -x option does actually exist in the \nLINUX version of hdrgen, which is from around 2006, I think.\n\n\nIn the more recent (MacOS) version, the -x option is described as\n\"-x         Toggle over- and under-exposed image removal.  Normally \n“off,” this option causes unnecessary exposures that are too light or \ntoo dark to contribute useful information to be automatically ignored.\"\n\n\nI have always lived under the impression that 'useful information' is \nlimited by pixel values of 200 in the darkest JPEG, and 20 (out of 255) \nin the brightest. I really don't remember where I took this from, but it \nmust have been a post on the hdri list which I am unable to find now. Sorry.\n\n\nIn your message to hdri just recently,\nhttp://www.radiance-online.org/pipermail/hdri/2012-February/000365.html\nyou stated\n\"Specifically, all values in the short exposure's histogram should be be \nbelow 245.\"\nwhich is different to the 200 threshold I mentioned above.\n\n\nI have been experimenting with HDR photography for glare studies (think \nUGR), and have noticed some discrepancies in the results that one gets \nif hdrgen is run with and without the -x option. I was therefore \nwondering what hdrgen considers as\n\"too light or too dark to contribute useful information\". I would think \nthat this is decision is made based on the value of the \ndarkest/brightest pixel in the image. Is this assumption correct, and if \nso, what are the threshold values that are used with the -x option?\n\n\nKind regards\n\n\nAxel\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2012-February/000377.html).</sup>", "id": "hdri_000377", "created_by": "Axel_Jacobs"}