{"topic": "Still having trouble, new pics........", "category": "radiance-general", "attachments": [], "created_by_name": "John Sutherland", "created_at": "March 29, 2004 at 08:01PM", "body": "Firstly, to Lars grobe in reply to how I mapped the texture on to the\nsurface of the book from my last post. The book was made in Maya, nurbs\nsurface -> polygon -> obj2mesh , the texture mapping was also done in\nmaya, basically it's a planar map going straight through the book as\nthough you were reading it. The texture was just a photo looking\nstraight onto the book, and the planar map causes it to stretch and bend\non the surface the right amount. Wasn't tricky at all.\n\n\nSecondly, was a bit confused by Georg's advice when you said -aa should\nbe increased, did you mean increased in accuracy? ie putting aa to a\nlower value? Or did you mean increasing aa by setting it to a higher\nvalue? Because the lower the aa value the more accurate the picture, so\nI can only see setting aa lower than .15 as a good thing not higher?\n\n\nWell anyway I definitely don't think aa is the problem anyway. Since the\nlast renders I sent out ive brightened the stained glass a bit so more\nlight gets in, and the results this time are pretty crazy! The glass is\nrose window at the front is projecting loads of blotches of colour.\n\n\nCheck out these renders, in the first I used \n\n\n-x 2560 -y 2048 -ar 128 -ad 512 -aa .15 -as 256 -ab 5\n\n\nin the second I set the -aa to .10 and halved the ad and as , as the\nrendering time would have been stupid\n\n\n-x 2560 -y 2048 -ar 128 -ad 256 -aa .10 -as 128 -ab 5\n\n\nThe second has much larger colour splotches which suggests to me that\nits not the ambient accuracy, and the splotch are being cause by to low\nad and as. So im doing a render now with ad and as up at 1024 and 512,\nwe shall see how that goes. If any one has any other ideas please say! I\nneed to get some results inside this building soon as my project is due\nin soon!\n\n\n\n\nhttps://www.bris.ac.uk/fluff/u/js0754/iBqEK1g3QV8ruqxb269Qsg7j/Output8.j\npg\n\n\nhttps://www.bris.ac.uk/fluff/u/js0754/VW4ynFc05IgiAVwIbzPjuA7j/Output9pc\nondlowaa.jpg\n\n\nThanks guys!\n\n\nJohn\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-March/001554.html).</sup>", "id": "radiance-general_001554", "created_by": "John_Sutherland"}