{"topic": "Differences between cylinders", "category": "radiance-general", "attachments": [], "created_by_name": "Tom Barnes-Lawrence", "created_at": "September 28, 2003 at 03:17AM", "body": "Hi,\n I first looked into Radiance about 4 years or so ago, and was very\nimpressed by it, but I've only really got a clue how to use it in the\npast year and I'm still not so comfortable with it. Either way, I don't\nthink I've posted to the list before(*), so hello to you all!\n\n\n Well, I'm currently using Radiance (not the very latest version, but\na recent one) to render sprites for a game. It's mostly gone well,\nand I now have a complete set, but I could do with making improvements\nto some of them, and I cant come up with anything more myself now, so\nI'm hoping some people will be able to help me out a little.\n(I'm posting each question separately, to avoid either getting lost).\n\n\n OK, the game uses simple tiled graphics, but different tiles need to\nmatch up. The main ones are for a snake. I created geometry for all\nthe different tiles for it: the body and tail of the snake are made\nof cones, and spheres, some created by genworm. These are supposed to\nmatch up, and they do quite nicely.\n\n\n But the head of the snake was created in a polygon subdivision modeller;\nits neck was made from one of the modeller's \"cylinder\" primitives, which\nI smoothed a couple of times so it was reasonably close to a real one.\nI exported it to a .obj file and converted it with obj2rad. Used a\nlittle stub file to xform it to the right scale and move it into place.\nIt should have reasonably matched the cone primitives used for the body.\n\n\n When the final images were rendered, the neck of the head tiles lined up\nproperly with the body tiles, BUT, they looked like they were a different\ntone. Both were brownish, but the head images were subtly (but quite\nconsistently) paler. Yes, they were using the same material!\n As I'd produced the head tiles last, I'd already experimented with\nthe effects of running my images through pcond (and had given up on using\nflags like -s and ended up just using the -e flag to give the exact same\nadjustment to each image). So I'm pretty sure it wasn't that. The head\nimages had been rendered with a purple background (for chromakeying)\nunlike the body images, but I tried replacing that with the exact same\nbackground the body tiles had. Still the head images were paler.\n\n\n Well anyways, I could get away with leaving the head tiles paler, as\nit's not *glaringly* obvious, but it's still visible and annoying. So\nif anyone can shed any light on why this might be happening, or what\nelse I could try, it'd be greatly appreciated.\n\n\nThanks in advance,\n Tom Barnes-Lawrence\n(* -although I can't help feeling I've said all that somewhere before...)\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-September/001000.html).</sup>", "id": "radiance-general_001000", "created_by": "Tom_Barnes-Lawrence"}