{"topic": "Photosphere 1.7 released", "category": "hdri", "attachments": [], "created_by_name": "Greg Ward", "created_at": "November 21, 2006 at 08:36AM", "body": "Hi All,\n\n\nThe HDRI list has been pretty quiet of late, so I figure it's time  \nfor an announcement.  I just updated Photosphere to version 1.7 at  \n<www.anyhere.com>.  The biggest changes are to the HDR build  \nfunction, which now has a \"Skip Exposures\" check box to eliminate  \nunneeded exposures.  The alignment algorithm also takes a little  \nlonger now, but does a better job in most cases if there is  \ndetectable rotation between exposures.  If anyone runs across  \nproblems with this new feature, let me know.  I did not offer a way  \nto selectively disable rotational alignment vs. the standard  \n(translational) alignment algorithm.  It's either both or neither  \nright now, and that's how I prefer to leave it.\n\n\nEnjoy.\n-Greg\n\n\nSignificant changes since 1.6 include:\n\n\nAdded the ability to expand the matte surrounding a panorama, trim\ninside corners, and a second complimentary color.\n\n\nAdded option to fill the uneven areas around panorama with randomly\nselected pixels, which mostly hides the fact that the result is\nnon-rectangular.\n\n\nFixed it so Photosphere can read a record list with nothing\nmore than the location (directory) and file name fields.\n\n\nAdded check for capitalization and typing errors on keyword,\nsubject, owner, and album entries.  Added check for duplicate\nkeywords and comments in info window entries.\n\n\nFixed problem combining HDR images for some Nikon cameras, which\ninsist they have different flash conditions even though the flash\nnever fires.\n\n\nMade it so control key works as well as option key for bringing\nup thumbnail detail window on image in browser window.\n\n\nAdded recognition and proper display conversion for Adobe RGB\nfiles (JPEGs) using conventional Exif identifiers.  HDR output\nis converted to CCIR-709 linear RGB space.\n\n\nAdded option for automatically skipping redundant, over- and\nunder-exposed images in an HDR capture sequence.\n\n\nAdded mode message to indicate when user is in a particular album.\n\n\nAdded auto-rotation of JPEG and TIFF images on input, TIFF on output.\n\n\nAdded understanding of 35mm-equivalent focal length in Exif header.\n\n\nView parameters are now written out to Radiance files even\nif the image has been cropped and/or rotated.  (The view\nup vector still isn't right after rotation.)\n\n\nAdded automatic rotational alignment to HDR build function.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2006-November/000145.html).</sup>", "id": "hdri_000145", "created_by": "Greg_Ward"}