{"topic": "Announcing the RADIANCE out-of-core photon map", "category": "radiance-general", "attachments": [], "created_by_name": "Schregle Roland HSLU T&A", "created_at": "June 22, 2016 at 06:40AM", "body": "Dear RADIANCE community,\n\n\nwe are proud to announce the release of a heavily revised RADIANCE photon  \nmap which includes parallelisation and out-of-core storage. This is the  \nfinal outcome of the software developed during our project at the  \nCompetence Centre Envelopes and Solar Energy at the Lucerne University of  \nApplied Sciences and Arts.\n\n\nThe out-of-core photon map enables simulations with very large numbers of  \nphotons on commodity hardware using on-demand loading and caching  \ntechniques. This is particularly useful with annual simulations using  \nrcontrib, where the number of required photons scales linearly with the  \nnumber of timestamps.\n\n\nSince we consider out-of-core storage an advanced option, it must be  \nexplicitly enabled during compilation of the RADIANCE software; currently  \nthe original in-core photon map is still the default. Details on building  \nthe out-of-core photon map from source are documented in the RADIANCE  \ndistribution under ray/doc/notes compile_switches. Irrespective of the  \nstorage option used, mkpmap is now parallelised and accepts the '-n'  \noption.\n\n\nThe software is now available from the RADIANCE CVS repository and will be  \nincluded in the next official release. We provide this software to the  \ncommunity as is, with the caveat that it is not actively supported; I can  \nvolunteer limited support in my free time when possible, particularly in  \nresponse to reported bugs.\n\n\nThe out-of-core photon map is documented in a paper in the Journal of  \nBuilding Performance Simulation, and in an online technical report:\nhttp://www.tandfonline.com/doi/full/10.1080/19401493.2016.1177116\nhttps://www.researchgate.net/publication/303550129_The_RADIANCE_Out-of-Core_Photon_Map_Technical_Report\n\n\nThis work was supported by the Swiss National Science Foundation as part  \nof the project ‘Simulation-based assessment of daylight redirecting  \ncomponents for energy savings in office buildings’ under grant SNSF  \n#147053.\n\n\nBest regards and happy photon mapping,\n\n\n  --Roland\n\n\n\n\n\n\nDr. Roland Schregle\nSenior Research Associate\n\n\nLucerne University of Applied Sciences and Arts\nSchool of Engineering and Architecture\nCC Envelopes and Solar Energy (EASE)\nwww.hslu.ch/ccease\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-June/011802.html).</sup>", "id": "radiance-general_011802", "created_by": "Schregle_Roland_HSLU_T&A"}