{"topic": "Scaling artifacts in Photoshop CS2 w/ Radiance files?", "category": "hdri", "attachments": [], "created_by_name": "Mark Banas", "created_at": "June 15, 2006 at 03:10PM", "body": "I've seen this a lot before: resizing a 32-bit file in Photoshop CS2  \nwith their bicubic interpolator produces artifacts that look like  \n\"excessive sharpening halos\" around high contrast details. Because of  \nthis, I simply stopped scaling images in Photoshop and instead use  \nPhotosphere (no problems).\n\n\nHowever, I was recently perusing the Adobe user-to-user forums, and  \nit was determined that the \"sharpening artifacts\" are only present if  \nyou subsequently save the file in Radiance format. It was then  \nproposed by an Adobe employee that \"the radiance file format code may  \nhave some problems dealing with extreme values.\" (keep in mind these  \nare user-to-user forums, not developer comments).\n\n\nHere is the thread in question:\nhttp://www.adobeforums.com/cgi-bin/webx/.3bbe9c64\n\n\nNow I know that Photoshop's Bicubic does some sharpening (even  \nwithout using \"Bicubic Sharper\"), and that sharpening of any kind on  \nan HDR file results in extreme values, but does the Radiance file  \nformat itself have a problem with extreme values? Or is this a combo  \nof PS Bicubic and their Radiance I/O? I pretty much store all of my  \n\"in progress\" files in Radiance format and then create \"final HDR  \nfiles\" from them in EXR, so this has effected me and my workflow.\n\n\n-Mark\n\n\nBTW, I've also found a huge flaw in Photoshop CS2's \"Merge to HDR\"  \nwhen small, bright details are moving between shots (think ghosted  \nleaves in a mild breeze) - so I don't even use PS CS2 for *creating*  \nHDRs anymore, but the PS CS2 \"clone tool\" and the plugin Flexify 2  \nare pretty much indispensable for retouching HDRs, so I'm using  \nPhotoshop in any case.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2006-June/000105.html).</sup>", "id": "hdri_000105", "created_by": "Mark_Banas"}