{"topic": "Call for Case Studies", "category": "radiance-general", "attachments": [], "created_by_name": "Erik Olsen", "created_at": "April 30, 2003 at 08:24AM", "body": "Your firm can provide valuable input to presentations that will be used\nacross the U.S. to promote the use of building performance simulation in the\ndesign process.\n\n\nThe International Building Performance Simulation Association, USA\naffiliate, has contracted OWP/P Engineers and Michael Iversen, Architect, to\nprepare presentation materials on the use of building simulation tools.\nThese presentations are intended for a general audience of architects and\nengineers that wish to learn more about incorporating this valuable tool\ninto the design process.  The presentations will not be highly technical or\nacademic, but rather provide a comprehensive overview of the different\nclasses of analysis tools and their application.  These presentations will\nbe available for use by IBPSA members and other interested parties (with\npermission from IBPSA-USA).\n\n\nWe are seeking case studies from U.S. projects to supplement the\npresentations.  Case studies should be completed (fully designed) U.S.\nprojects in which some form of building simulation was used to assist in\nmaking design decisions.  Simulation tools could include, but are not\nlimited to:  energy simulation, computational fluid dynamics, daylighting\nanalysis, and multizone network airflow models.  Projects demonstrating\nstrong synergy between the simulation and the remainder of the design\nprocess are especially encouraged.  Your firm will be credited in the\npresentation materials.\n\n\nTo submit your project, prepare an abstract or other descriptive document (1\npage maximum) describing the project, what simulation tools were used, how\nthey fit into the design process, and what effect the simulation had on the\nfinal design.  Submissions can be emailed to:\n\n\neolsen@owpp.com\nPlease give your message the subject line \"IBPSA case study abstract.\"\n\n\n***** Hurry - abstracts are due by May 12, 2003*****\nPlease contact me if you are interested in submitting a case study but are\nunable to make this deadline.\n\n\nWe look forward to input from the entire design and simulation community on\nthis exciting project!\n\n\nSincerely,\n\n\n\n\nErik Olsen\nOWP/P Engineers\nHVAC / Energy Consulting\n111 West Washington Street, Suite 2100\nChicago, Illinois 60602-2714\n312.960.8313 Direct\n312.827.8313 Fax\neolsen@owpp.com\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-April/000670.html).</sup>", "id": "radiance-general_000670", "created_by": "Erik_Olsen"}