{"topic": "Glare Analysis and HDR Photography in Contemporary Architectural Practice", "category": "hdri", "attachments": [], "created_by_name": "Rashida Mogri", "created_at": "January 07, 2011 at 04:18AM", "body": "*Glare Analysis and HDR Photography in Contemporary Architectural Practice\nSurvey Time:  Approximately 5 minutes\n*\n\n\nDear colleague,\n\n\nThis is your opportunity to influence future developments in high dynamic\nrange photography as a pioneering tool for glare analysis in architectural\npractice.\n\n\nYou are invited to participate in an online survey on the current methods\nfor glare analysis methods and its relation to high dynamic range\nphotography. The research is carried out as part of a Master’s thesis by\nRashida Mogri, Graduate School of Design at Harvard University (GSD). The\noutcome of the survey will be used to\n\n\n•    identify established methods of glare study\n•    better understand design practitioners’ understanding of HDR\nphotography\n•    judge viability of HDR photography as a tool for glare analysis in\nfuture design projects\n\n\nWe would like you to fill out an online questionnaire about your design\nexperience particularly how it relates to glare analysis through new\ndevelopments in high dynamic range photography. Please respond to all\nquestions as openly and honestly as possible. There are no right or wrong\nanswers; it is only your opinions that are important.\n\n\nAll of the information that we obtain from you through this survey will be\nkept confidential. Your participation in this research is voluntary. Should\nyou decide to participate in the survey, you still reserve the right to end\nyour participation at any time and for any reason, without prejudice.\n\n\nIf you are interested in participating in this survey, please go to\nhttp://www.surveymonkey.com/s/hdrphotography.\n\n\nThank you in advance for your participation.\n\n\nShould you have any questions or suggestions, please contact Dr. Christoph\nReinhart at reinhart at gsd.harvard.edu or Rashida Mogri at\nrmogri at gsd.harvard.edu.\n\n\n\n\n\n\nRashida Mogri | LEED AP\nHarvard Graduate School of Design\nMDesS, 2011 | Sustainable Design\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2011-January/000284.html).</sup>", "id": "hdri_000284", "created_by": "Rashida_Mogri"}