{"topic": "expert assistance/guidance please?", "category": "radiance-general", "attachments": [], "created_by_name": "John An", "created_at": "May 11, 2003 at 09:32PM", "body": "Hi all,\n\n\nThanks for helping me to get up and running with Radiance up to this point.  I have gotten to the point of being able to produce compelling images, and setting some variables to get results that I THINK I want.  In other words, I think I know enough to be naively dangerous.  Thus, I was wondering if some of the experts out there would be willing to give me some assistance.\n\n\nI am about to start rendering a series of images for different times of day throught out the year.  Accuracy is tantamount, speed, as long as it is reasonable, is not as important.\n\n\nSo, I have created a generic enclosed office space, assigned materials, etc.  After using the rad to create an .oct file, I gave the rpict command with the following options:\n\n\nrpict -t 60 -vf 1.vf -x 3000 -y 3000 -ps 1 -pt .04 -dp 4096 -ar 128 -ms 1.5 -ds .01 -dj .6 -dt .05 -dc .75 -dr 3 -sj 1 -st .01 -ab 7 -aa .08 -ad 1024 -as 512 -av 0 0 0 -aw 0 -af 6_21_8s.amb -lr 12 -lw .0005 office.oct > 6_21_8s.pic\n\n\nIt took about 13 hours, but I got an image.\n\n\nAre there any blatant newbie mistakes I have made that may compromise the accuracy of the rendering?  I decided not to use the illum material, and am relying completely on ambient bounces.  At this point, there are no electric illumination in the space, just purely daylight.  I have uploaded the resulting .pic images to http://homepage.mac.com/jsan/, as well as a .pic image that I used pfilt -x /2 -y /2 on.\n\n\nI would really appreciate it (and am sure I will learn a lot) if someone would tell me what I may be doing incorrectly.  Individually, I know all the information is in Rendering with Radiance.  However, because of the many variables, I feel a bit unsure as to whether I have gotten the settings  correct or not.\n\n\nAnother point I have been unsure about is the material properties of somewhat complex materials.  I understand that for simple materials (plastics, metals) the reflectance is determined strictly by the r g b values (each value multiplied by a specific coefficient).  However, if I apply a texture to the material, does the texture impact the reflectance value?  For instance, I want a floor with 20% reflectance, so I gave it r g b values of .2 .2 .2.  Does the fact that I applied a carpet texture further reduce the value?  In Lightscape, I know that textures don't impact the characteristic of the material; I have a suspicion that in Radiance, it does.\n\n\nSorry for the rambling.\n\n\nThanks.\n\n\n\n\nPS\nI also wanted to give an update on the availability of the book Rendering with Radiance.  My order with amazon.com was cancelled by the seller (saying that he had run out).  However, just yesterday, I checked amazon.com again, and found a retailer selling new and used copies for around $64.  I'm hoping this one doesn't get cancelled.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000724.html).</sup>", "id": "radiance-general_000724", "created_by": "John_An"}