{"topic": "A question about Animations, and about the Book that will solve all my troubles...", "category": "radiance-general", "attachments": [], "created_by_name": "Jeffrey McGrew", "created_at": "February 10, 2004 at 02:29PM", "body": "Hello all,\n\n\n    I've been learning Radiance over the last year or so, primarily \nrunning it within Cygwin, rendering models exported from Revit or \ngenerated by hand.\n\n\n    Now that I've gotten to where I can produce OK renderings (need to \nlearn more complex materials), I would like to try making a simple \nanimation to learn how. From reading the wonderful post I found in the \narchive from Greg Ward about making animation paths, I'm almost there, \nhowever I'm missing something and getting an error because of it.\n\n\n    I've generated the key.vf file with multiple viewpoints set for my \nanimation path, along with a -t following each one for the amount of \ntime I want between each point along the path. I've generated the \nkey.fmt file. However, when I run the command to extract the information \nfrom my key.vf into a form that can be manipulated to make the full \npath, all I get in the key.cal file is:\n\n\nPx(x):select(1,);\nPy(x):select(1,);\nPz(x):select(1,);\nDx(x):select(1,);\nDy(x):select(1,);\nDz(x):select(1,);\nH(x):select(1,);\nV(x):select(1,);\nT(x):select(1,);\n\n\nNow, it seems like this is wrong, for when I try the next step, which is \nto then use this key.cal along with spline.cal to generate my desired \nanimation path, it exits with an 'unexpected character' as soon as it \nreaches that blank value after the '1,' it even points at the space in \nthe error. And then my desired path file is created, but blank.\n\n\nSo I'm at a loss, as I've tried this several times, and I know I'm \ntyping everything verbatim from the example in the post. Is this \nsomething that's a problem because of Cygwin? Some grammar thing? I \nhaven't had a chance to test it on Linux yet.\n\n\nSo if anyone can point me in the right direction, I'd be terribly \nappreciative. Also, I'd love to know if the 'Rendering with Radiance' \nbook is going to be out/available anytime soon, for then it would \ngreatly lessen my nagging questions to all of you. :-)\n\n\nThanks in advance,\n\n\nJeffrey McGrew\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-February/001468.html).</sup>", "id": "radiance-general_001468", "created_by": "Jeffrey_McGrew"}