{"topic": "Five-phase Method: Proxy Geometry and BSDF material type", "category": "radiance-general", "attachments": [], "created_by_name": "Alireza Hashemloo", "created_at": "January 30, 2016 at 08:18PM", "body": "Hello,\n\n\nI have five questions about the five-phase method tutorial (version 2.2)\n(available at:\nhttp://www.radiance-online.org/learning/tutorials/fivephasetutorialfiles/Tutorial-FivePhaseMethod_v2.pdf)\nthat I would appreciate if you could help me with:\n\n\n1- In the tutorial, a single polygon (relative to the outline of the\nglazing surface) is modeled in the scene at the exterior side of the\nwindow. This polygon is referenced to generate the daylight matrix. A\nsecond polygon is modeled in the scene on the interior side of the window\nand it is referenced to calculate the view matrix.\n\n\nI was wondering if I could generate two identical co-planar polygons  where\nthe normal vector of one polygon is looking at the interior side  and the\nnormal vector of the other polygon looks at the exterior side to be\nreferenced, respectively, for the view matrix and daylight matrix\ncalculations? if so, would it still be necessary to model the thickness of\nthe walls hosting fenestration systems in the simulation scene?\n\n\n2- What is the \"proxy geometry\" in the five-phase method? is the \"proxy\ngeometry\" exclusively a reference to the polygon at the interior side of\nthe window system that is assigned a BSDF material?\nor is the \"proxy geometry\" a reference to the 3D geometry of the  venetian\nblinds (or any other type of shading layer of the fenestration system) in\nthe scene?\n\n\n3- what is the \"thickness\" as the first parameter in the Radiance BSDF\nmaterial type referring to? is it measured as the distance between the\ndaylight matrix polygon on the exterior side of the window and the view\nmatrix polygon at the interior side?\n\n\nor does \"thickness\" refer to the depth of the entire fenestration system\nincluding the glazing panes and any shading layers?\n\n\n4- If I model the mullions defining the edge condition of any individual\nglazing pane in 3D scene, what would be the difference between using LBNL's\nWindow to generate a BSDF file and using genBSDF?\n\n\n5- What would be the difference between using a BSDF file based on Klem's\ndivision scheme with higher resolution (where each Klem's patch is\nsubdivided to 4 new patches) and using a tensor tree BSDF?\n\n\nThank you,\nAlireza\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-January/011465.html).</sup>", "id": "radiance-general_011465", "created_by": "Alireza_Hashemloo"}