{"topic": "Radiance Consortium", "category": "radiance-general", "attachments": [], "created_by_name": "Charles Ehrlich", "created_at": "June 08, 2002 at 04:24AM", "body": "Radiance and Desktop Radiance Users,\n\n\nI applaud the efforts of Lawrence Berkeley National\nLab to develop an Open Source license for Radiance and\nDesktop Radiance.  Bravo!  Those of you who know me\nknow that this is something I've worked toward for\nmany years.\n\n\nAnd to those of you seeking a more streamlined way of\ncontributing to and maintaining Radiance, I think that\na CVS server for Radiance would be a great idea.  But,\nthe future of Radiance relies upon more than a\ntechnological solution.  There is also a need for\nongoing administrative support.  I do not know what\nplans LBNL has along these lines.\n\n\nAnd so, I think this is an appropriate time to propose\nthe formation of a Radiance Consortium.  Its purpose\nwould be to set forth a general direction for\ndevelopment of Radiance, handle the management of the\nsource code modifications, and distribute the\ndifferent source code development lines.  The\nconsortium's purpose should NOT be to limit the\npossible avenues of development such that progress can\nonly proceed along some ordained, pre-determined path.\n On the contrary, the success of Radiance has depended\nupon the independent efforts of researchers around the\nworld since is inception almost 15 years ago!  \n\n\nI think that a semi-formal organizational structure\n(as opposed to an ad-hoc group of programmers)\ncomposed of some programmers and some\ntechnically-minded non-programmers would be\nappropriate so that Radiance can go on to outlive its\noriginal progenitors.  I also suggest that we offer a\nleadership position to the firms which have purchased\n$10,000 distribution licenses from LBNL, of which\nthere are about 6.  I like the way the \"IntelliCAD\nTechnology Consortium\" is organized and would suggest\nthat we mimick its structure. (www.intellicad.org)  \n\n\nAnd for Desktop Radiance, I make the same suggestion. \nIt could exist as a special interest group within the\nRadiance Consortium, or as a separate entity. \nCompatibility between Desktop Radiance and IntelliCAD\nwould be a nobel goal for future, Open Source\ndevelopment efforts for Desktop Radiance.  This would\ngreatly reduce the cost of ownership and eliminate a\nmajor barrier toward widespread use of Radiance in the\narchitectural and lighting design communities.\n\n\nThe good news is that I have contacts with several\narchitecture/energy efficiency firms which are\ninterested in supporting this idea and will gladly\ncontribute (money and effort) to the Open Source\nversion of Radiance and Desktop Radiance once a\nmechanism is in place to do so.  I also think that it\nwill be possible to find some funding to support this\neffort if enough players come up into the fray and\nexpress support for this idea.\n\n\nI am willing to serve as a point man for these\nefforts, but the door is open for other suggestions\nand nominations.  Whatever way it falls out, I'm in\nthis for the long haul.  And, I've got a great domain\nname to contribute.  Check out the \"whois\" on\n\"radsite.org\".\n\n\nWith 100 Radiance-online subscribers and 200 Desktop\nRadiance list subscribers, I think we have a pretty\ngood base of support.  I know this is going to be\ncontroversial, but that has never stopped me in the\npast.\n\n\nThe Desktop Radiance Yahoo Group has a \"polling\"\nfeature\n(www.yahoogroups.com/group/desktopradiance/polls).  If\nthose of you who do not like Yahoo can plug your nose\nlong enough to subscribe to the Desktop Radiance list\n(under a fake alias if you wish), we can utilize this\nsimple mechanism for polling the users to determine\nwhich approach people favor the most.  Other ideas?\n\n\n-Chas\nCharles Ehrlich\nHeschong Mahone Group\nhttp://www.h-m-g.com\n\n\n\n\n\n\n\n\n\n\n__________________________________________________\nDo You Yahoo!?\nYahoo! - Official partner of 2002 FIFA World Cup\nhttp://fifaworldcup.yahoo.com\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-June/000290.html).</sup>", "id": "radiance-general_000290", "created_by": "Charles_Ehrlich"}