{"topic": "Radiance animation questions", "category": "radiance-general", "attachments": [], "created_by_name": "Zack Rogers", "created_at": "December 16, 2003 at 05:48PM", "body": "Hello group,\n\n\nI am attempting my first full blown Radiance animation and have several \nrelated questions.  This link has a rough version of the animation, done \nwith -ab 0.\n\n\nhttp://www.archenergy.com/downloads/pub/images/Radiance/walkthrough_init3.mov\n\n\nand yes, i seem to trip up the curb, have several neck spasms, and stare \nat a wall at one point....all have since been fixed but this leads to my \nfirst question.\n\n\n1.) What programs do people use to produce animation paths?  I initially \nwanted to use rshow but couldn't get it working on our Suse 8.2.  I \nunderstand programs like maya, studio vis, form-z?? have the ability to \ngenerate these animations paths but are too much (expensive) for what I \nneed.  It would be nice to be able to just export my spline path from \nautoCAD and then have the ability to adjust frames/sec, slow down \nportions of the path, and adjust the view direction throughout.\n\n\n2.) There are portions of this path that I want to slow down and I \nwanted to use pinterp to interpolate some extra frames.  How can I \ngenerate a z-buffer file for a view without recreating the picture?  I \nthought I could just run it at very low settings if nothing else.  And \nyes, I am running ranimate using the windows version (our linux machines \nwere filled up with CFD calcs at go time and I was forced to use our NT \nmachines - btw: ranimate does not work on XP - error \"Windows socket \noperations not supported\") and it is giving errors using INTERPOLATE and \nMBLUR which would have created the zbf files automatically.  Hence, I \nwas planning on using pinterp afterwards to achieve interpolation but \nnow I have no z-buffer files.  which leads to my next questions....\n\n\n3.) Where is pinterp?  I just installed the HEAD version on our linux \nmachines (yes, its been a while since I last dabbled in the linux \nrelease) and i can't find pinterp.  It shows up in the man pages but not \nin the bin directory.  BTW - pinterp does not seem to work in the \nwindows version either.\n\n\n4.) So, we then tried to install the last official release 3.5 and it \ngave us a bunch of errors.  The error log is here.  Help!\n\n\nhttp://www.archenergy.com/downloads/pub/images/Radiance/installLog.txt\n\n\n5.) Using an ambfile does not seem to be doing much for my animation \ntimes?  I was expecting a big decrease in calc time the further i got \ninto my animation but at about 5/6 through it has not sped up much.  It \nhas been building the ambient file the whole time, although it is only \n7MB after roughly 1000 frames, which seems too small (10 panoramic views \nI've been running on a different machine already has an ambient file of \n7MB).  Here is what one of my ranfiles looks like:\n\n\nDIRECTORY = anim/walkthrough_sect2\nVIEWFILE = anim_path2.pts\nSTART = 311\nEND = 622\nOCTREE = octrees/bc.oct\nRESOLUTION = 768\nrender = -av 2.5 2.5 2.5 -ar 46 -aa .1 -ad 4096 -as 2048 -ab 1 -af \nambfiles/bc.amb\nrender = -dp 512 -ds .3 -dj 0 -dt 0.2 -dr 1 -dc .5\nrender = -lr 6 -lw .002 -sj .9 -st 0.01\n\n\n6.) Any suggestions on the parameters used?  I am no expert on \noptimizing parameters.  These parameters give me a fairly good image \nwith about 1/2 hour calc time (which was the speed needed to meet \ndeadline).  But there are still a few splotches, the light from my \nelectric lights is a little too crisp, and I am not too happy with the \nspecular reflections.  You can see the quality I am getting in one of \nthe final images here:\n\n\nhttp://www.archenergy.com/downloads/pub/images/Radiance/frame741.tif\n\n\n7.) As can be seen, I have many curved surfaces in this model most of \nwhich have been faceted.  I would like to use a function to smooth the \nshading on these.  Is there any way to do this given the geometry is \nalready built?  Something like the Phong shading -s option in gensurf or \nmaybe with the new mesh primitive???  I apologize for my ignorance on \nthis topic, I rarely require this much detail.  I'm imagining a modifier \nor something I could give to the polygons I want to smooth over.\n\n\n8.) I was initially mapping wood grain onto a lot of the interior wood \nsurfaces but given the varying distances of the wood I could never get \nit to look very good.  When it looked good up close, it looks like \nparticle board far away.  And when it looks good far away (ie larger \nscale) it looks like a zebra up close.  I would like to have the grain \nat the correct scale, but don't want it looking like particle board (i'm \nassuming this is just cause there are limited number of pixels to \ndisplay this detail).  What strategies have others used to get a good \nlooking pattern at varying distances?  Also, I would like to map the \ntextures better onto these surfaces rather than using xgrain, \nygrain...etc.  How could this be done?\n\n\nSorry for the long e-mail and so many questions clumped into one and the \nvarious tangents my questions may have took.\n\n\nBest Regards,\nZack\n\n\n\n\nZack Rogers\nStaff Engineer\nArchitectural Energy Corporation\n2540 Frontier Avenue, Suite 201\nBoulder, CO 80301 USA\n\n\ntel (303)444-4149 ext.235\nfax (303)444-4304\nhttp://www.archenergy.com\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-December/001335.html).</sup>", "id": "radiance-general_001335", "created_by": "Zack_Rogers"}