{"topic": "Findglare and HDR photographs", "category": "hdri", "attachments": [], "created_by_name": "Axel Jacobs", "created_at": "February 03, 2012 at 06:27AM", "body": "Dear list,\n\n\nI've been exerimenting with Radiance's findglare and glarendx, trying\nto get UGRs from photographic HDRs. I'm using the Sigma 4.5mm on a\nD200, which seems to be quite a popular choice amongst you.\n\n\nUnlike the FC-E8/Coolpix combo, which produces an equidistant\nprojection (-vta), the Sigma 4.5mm results in a 180deg equisolidangle\nview. I gather from this post to the rad-gen list:\nhttp://www.radiance-online.org/pipermail/radiance-general/2010-April/006709.html\nthat the NYT cart was based on a Sigma lens (4.5mm ?), operated at\nF5.6. The code snippet in that post suggests that the HDRs were\nvignetting corrected.\n\n\nAn overall calibration of the image luminance can be carried out (I\nthink) by measuring the vertical illuminance at the lens when the\nexposure-bracketed sequence is taken, and then running findglare and\nglarendx -t ver_illu on the HDR, which should give a calibration\nfactor that can then be used to fiddle with the EXPOSURE= line. This\nis probably more accurate than calibrating against spot meter\nreadings. So far, so good.\n\n\nWhat I don't seem to be able to find in the googleable literature, nor\nin the HDR book, is any words of wisdom regarding the impact of the\nlens projection on glare metrics. Radiance doesn't have an\nequisolidangle view type, so using pinterp as detailed in this post:\nhttp://www.radiance-online.org/pipermail/radiance-general/2011-August/008141.html\nis not an option.\n\n\nIt might be possible to utilse ImageMagick to re-project the JPGs\nprior to running hdrgen, but I'd rather not go there.\n\n\nThe deviation between equisolidangle and -vta is most noticeable for\nhigh off-axis angles, which is also where glare sources have less of\nan impact (Guth position index). I'm therefore wondering whether\npeople just tend to go with the vignetting-corrected and\nluminance-calibrated HDR without worrying too much about re-projecting\nthe fisheye. The same question would apply to evalglare's DGP rating,\nwhich relies on the HDR coming in -vta.  Has anybody looked into this?\n\n\nCheers\n\n\nAxel\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2012-February/000348.html).</sup>", "id": "hdri_000348", "created_by": "Axel_Jacobs"}