{"topic": "9th International Radiance Workshop @ ISE, Germany", "category": "radiance-general", "attachments": [], "created_by_name": "Jan Wienold", "created_at": "June 30, 2010 at 05:45AM", "body": "Dear colleagues,\n\n\nAs previously announced Fraunhofer ISE will be hosting this year’s\nInternational Radiance Workshop on September 20/21(22) at our\ninstitute in Freiburg, Germany.\n\n\n\n\nThe International Radiance Workshops are annual, two-day gatherings of\nRadiance developers and users. The workshops consist of a series of\npresentations that in the past included case studies on the use of\nRadiance in lighting and/or daylighting projects, recent advances in\nmodeling glare and energy savings from lighting controls as well as the\nuse of Radiance in Art and Design. Presentations from previous workshops\ncan be downloaded from http://www.radiance-online.org/.\n\n\n\n\nThe workshop will be held on two days (Monday, Tuesday, 20-21st\nSeptember). On Wednesday 22nd we intend to hold a special course on\nmodeling advanced fenestration systems. Topics at this course will be\nrtcontrib, photon mapping and material measurements/modeling.\n\n\nThe workshop web-site will be online in the next days and the link will\nbe announced in a separate email. On that site you can find more\ninformations + registration formula. We try to put the site online as\nsoon as possible, since the hotel bookings are unfortunately somewhat\ndifficult in that time and they cannot reserve a large contingent for a\nlonger time.\n\n\nIf you are interested in presenting at the workshop please send us a\nworking title and a brief abstract to jan.wienold at ise.fraunhofer.de\n and sandra.mende at ise.fraunhofer.de\n\n\nWe are looking forward to receiving your abstracts and welcoming you to\nFreiburg!\n\n\n\n\nJan Wienold and Sandra Mende\nFraunhofer ISE,\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-June/007026.html).</sup>", "id": "radiance-general_007026", "created_by": "Jan_Wienold"}