{"topic": "BRTF for glazing (was: experiences with the photon map)", "category": "radiance-general", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "December 10, 2008 at 03:43AM", "body": "> A remark from me: I never use BRTF in RADIANCE now, since all the\n> angular information you put into your model is lost for the glow\n> material. That means, if you model a specific sky luminance distribution\n> and you are using BTDF-func, no angular information of your BTDF-model\n> is used! It is treated lambertian ! And this is especially hard, if you\n> want to model a system, which is intended to redirect the bright zenith sky.\n>  If I model advanced glazings, I use either standard glass and modify it\n> by brightfunc or for high reflective materials I use a mixfunc of glass\n> (+brightfunc) and metal. I always check the angular transmission and\n> reflection of the model by a virtual measuement - and I also test, if it\n> still works for the sky.\nHi Jan, hi list,\n\n\none more late reply to this. At the moment I am setting up the materials \nfor a model with known specifications for the glazing, but I do not have \nsamples to measure. So if I want to get a material description e.g. for \na double-glazing including coating and such, I use the script glaze to \nhave some reasonable values that I could not produce else (and I can \nwrite this down as a reproduceable routine for the docs). I could use \nOptics and access the glazing database, but for some strange reason it \nrequires administrator access to a Windows maching that I do not have at \nthe moment (did anyone manage to open the database file using something \nlike Openoffice?) - but also Optics would give me brtf modifiers.\n\n\nDid anyone try to model such glazings in radiance, using dielectric and \ninterface? What are you using for defining glass panes if no samples to \nmeasure are available? Ah, and one more question (which leads me back to \nthe idea of modeling glazing), what about glazings that consist of \nlaminated glass panes + non-uniform laminate (such as printed screens \nfor sun protection or advertising), would it be possible to model these \nusing dielectric&interface, having one (very) thin layer for the \nlaminate modified by a pattern and two dielectric layers of glass on \nboth sides? Is it complete nonsense to try modeling such layers \ngeometrically (there will be a limit as the thinnest layers surfaces may \nget too close to each other)? Or is all this trouble about considering \nthe coatings and such only introducing error, and a simple clear glass \ndefinition ignoring the coating would still be \"better\" to use?\n\n\nTIA&CU... Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-December/005572.html).</sup>", "id": "radiance-general_005572", "created_by": "Lars_O._Grobe"}