{"topic": "Material database - taking measurements", "category": "radiance-general", "attachments": [], "created_by_name": "Axel Jacobs", "created_at": "November 07, 2008 at 09:28AM", "body": "Dear all,\n\n\nI was thinking to myself and talking to my boss about this material\ndatabase. You will know that the ColourPicker on LUXAL.eu has\nsomewhere between 20,000 and 30,000 entries, the majority of which are\nscreen scraped from various web sites. Since I have now idea how the\nRGB values for those colours were determined (measured, guessed, gamma\netc), they can't really be relied upon.\n\n\nThis leaves us with Jan's RAL materials (I'll put them up soon), and\nthe Building Materials which are taken from Adeline and are hopefully\ncorrectish, although I have no idea just how good they are. Moreover,\nI am potentially infringing on somebody's copyright by putting them up\non a web site. Need to check this. Who owns the Adeline intellectual\nproperty now? Does somebody have a contact into Fraunhofer Bauphysik?\n\n\nAnyhow. We in LEARN have one of these:\nhttp://www.atecorp.com/Equipment/Minolta/CR300.asp\nI also made up an RS232 cable, have some LabView code, and know the\nserial protocol. So here is an offer to those of you who are based in\nor around London:\n\n\nYou may borrow the meter for one week free of charge, provided that:\n\n\na) Your company will assure us in writing that if anything should\nhappen to the instrument, we will receive a replacement. No pay-off.\nAn actual instrument.\nb) You will share all your measurements with the Radiance community.\nc) I have a small collection of about 3000-4000 colour samples from\nvarious paint manufacturers here (the ones you find at your local\nbuilder's merchant). You agree to input some of them too, so they can\nbe added to the database. Once the software is cobbled together, which\nshould not be too hard, the actual measurement takes about one second\nfor each sample. What is somewhat more time consuming is the input of\ncolour names, codes, swatch numbers etc, although this could\npotentially be semi-automated with some scanning/OCR scripts.\n\n\nYou are also welcome to come and visit us in Holloway Road and do some\ncolour measurements there. We'll find a desk for you.\n\n\nIf you think you can contribute with writing the software, scanning,\nOCR or anything else, please do get in touch. It's a rather laborious\nexercise...\n\n\nOh, one last thing: We won't be able lend the instrument before\nJanuary because of the scheduling of the academic year and the student\nprojects.\n\n\nCheers\n\n\nAxel\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-November/005497.html).</sup>", "id": "radiance-general_005497", "created_by": "Axel_Jacobs"}