{"topic": "genprism | no explicit hole", "category": "radiance-general", "attachments": [], "created_by_name": "Jelle Feringa", "created_at": "January 07, 2005 at 12:25PM", "body": "Dear George, Greg,\n\n\nThank you both for your feedback, most helpful!\n\n\n\n\n> One alternative approach would be to cut the outer polygon apart\n> instead of keeping it intact. Just sort the corner points of all\n> the holes eg. vertically, and make a horizontal cut at each\n> height. You need to be careful to combine equal hights (allow for\n> some numeric rounding error), and not to cut through tall holes\n> sitting next to short ones. This method should work particularly\n> well if the wall and hole polygons are orthogonal to each other,\n> which happens to often be the case in architectural models.\n\n\nGeorge,\n\n\nThe solution proposed by the author of the python Polygon package does\nexactly this; the complex polygon is split into a list of simple polygons,\nusing the center of gravity of the polygon. After the split it isn't\ndifficult to write it out to a .rad format!\n\n\n> Maybe I'm being naive, but I've had good luck creating connecting seams\n> between arbitrary vertices in holey polygons.  Make sure the outer\n> vertices are in counter-clockwise order around the normal, and the\n> interior (hole) vertices are clockwise.  Then, the algorithm goes\n> something like this:\n> \n> \tFirst N vertices are N vertices of outer contour\n> \t\tNext M1 vertices are M1 vertices of hole 1\n> \t\tClose hole loop with vertex that is copy of the first hole\n> vertex\n> \t\tClose seam by adding copy of last outer contour vertex\n> \t\tRepeat 3 steps above for each hole contour\n> \n> In Radiance, polygon seams can cross all over each other and it doesn't\n> create any artifacts.  This is how fonts are rendered, for example.\n> This is also why I never bothered implementing holes in polygons; I\n> never found where seams caused a problem, and I couldn't think of any\n> way besides seams for implementing holes.\n> \n> -Greg\n\n\nGreg,\n\n\nThanks for the sketched out algorithm, I was hoping for that kind of\nresponse! By no means was my mail intended as criticism for the lack of\nexplicit holes, just hoping for a way to get passed the problem!\nI'm sure your suggested algorithm will be helpful in further development of\nmy project.\n\n\nCheers,\n\n\nJelle.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-January/002273.html).</sup>", "id": "radiance-general_002273", "created_by": "Jelle_Feringa"}