{"topic": "DIVA-for-Rhino workshop after Building Simulation 2011", "category": "radiance-general", "attachments": [], "created_by_name": "Christoph Reinhart", "created_at": "November 07, 2011 at 10:05AM", "body": "Dear Building Simulation 2011 attendee (or Sydney resident),\n\n\n\n\nDIVA is a Radiance/Daysim/EnergyPlus plug-in that we have developed for the Rhinoceros/Grasshopper - NURBS modeler for Windows. DIVA supports a series of performance evaluations including:\n\n\n\n\n\n\n- Physically-based scene visualizations (Radiance)\n\n\n- Annual radiation maps (Radiance/GenCumulativeSky)\n\n\n- Climate-based daylighting metrics (Daysim)\n\n\n- Glare analysis (Evalglare)\n\n\n- LEED IEQ Credit 8.1 compliance (Radiance)\n\n\n- Hourly load calculations (EnergyPlus)\n\n\n\n\n\n\nThe plug-in offers highly optimized simulation workflows within Rhino and can be combined with parametric Grasshopper scripting in order to generate animated simulation movies (see for example http://vimeo.com/31269386). More information can be found at www.diva-for-rhino.com<http://www.diva-for-rhino.com> and http://wiki.diva-for-rhino.com/HomePage. DIVA is currently available free of charge from http://www.diva-for-rhino.com/download.html.\n\n\n\n\n\n\nAlstan Jakubiec and I will be attending Building Simulation 2011 next week in Sydney and - if there is sufficient interest - we will be offering a 3 hour hands-on DIVA workshop on Thursday, November 17, from 9AM to noon at the University of Sydney, Faculty of Architecture, Design and Planning. The workshop fee would be $US250 per participant. (We do not have a student rate at this point.) If you are interested in participating, please send me a brief email by November 8, 10AM EST. Based on the number of responses we will announce the workshop tomorrow.\n\n\n\n\n\n\nBest regards,\n\n\nChristoph Reinhart\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2011-November/008222.html).</sup>", "id": "radiance-general_008222", "created_by": "Christoph_Reinhart"}