{"topic": "Transparencies outside image boundaries with mixpict and colorpict", "category": "radiance-general", "attachments": [], "created_by_name": "Victor LRG", "created_at": "September 29, 2017 at 08:20AM", "body": "Just for the record, I sent this email to the wrong address so I am copying\nit again just in case it is useful for somebody else. I have also included\nthe original attachments.\n\n\nHi Greg,\n\n\nThanks for that. The tiling option with match is not what I was looking for\nat the moment because I am using a site map, but I will keep it mind for\nother projects. However, your suggestion about mixfunc was very useful,\nalthough the result was a bit unexpected. The bits that were supposed to be\ntransparent were actually picking up the white plastic material receiving\nbound_image as a modifier. If I changed it to red plastic, the background\nof the image became red. It works for me, others should be aware of this\npotential effect. On another note, I was trying to change void (second\nmaterial) for another material in mixfunc but I was getting an error. I\nwonder why. Finally, I figured out how to make it work with rectangular\nimages. Thanks!\n\n\nVictor\n\n\n[image: Inline images 4]\n\n\nHi Victor,\n\n\nDid you try replacing \"pic_u\" and \"pic_v\" with \"match_u\" and \"match_v\" in\nyour original description?  If all you care about is avoiding the black\nborders, this should give you a reasonable-looking result by tiling the\nimage over the terrain.\n\n\nThe other option is to use a mixfunc to clip to the edges of your pattern,\ni.e.:\n\n\nvoid colorpict image\n15 clip_r clip_g clip_g image.hdr picture.cal pic_u pic_v\n0\n0\n\n\nvoid mixfunc bound_image\n4 image void \"if(and(inside(0,pic_u,1),inside(0,pic_v,1)),1,0)\" picture.cal\n0\n0\n\n\nbound_image plastic terrain\n0\n0\n5 1 1 1 0 0\n\n\n\n\n\n\nThis is assuming your picture is square.  If not, then you need to adjust\nthe upper bound of pic_u or pic_v, whichever is larger.\n\n\nCheers,\n-Greg\n\n\nP.S.  The double-quotes above aren't strictly necessary, but they allow\nspaces in the formulas for readability if desired.\n\n\n*\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2017-September/012275.html).</sup>", "id": "radiance-general_012275", "created_by": "Victor_LRG"}