{"topic": "trans parameters for translucent fabric", "category": "radiance-general", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "October 08, 2013 at 05:59AM", "body": "Hi Mona.\n\n\n> hi\n>  I have used a kind of translucent   fabric in my project that i need to know its definition as a radiance material  to use in my analysis \n> i have some  characteristic of the fabric  like  solar transmittance(Ts) =18%,solar reflection(Rs) =61% ,solar absorption(As)=21%,normal -hemispherical light transmission(TV ,n-h)=17% ,normal-normal light transmission(TV, n-n)=14%\n> external solar factor=0.13  internal solar factor=0.37\n> \n> how can I define it using above data?\n> I need the following numbers:\n> \n> > void trans fabric\n> > 0\n> > 0\n> > 7 ?  ?  ?  ?  ?  ? ?\nGetting the trans-material's parameters right implies some calculation. For the lazy ones, there is Andy McNeil's trans-widget for the Mac, which is what I used to get a quick set of parameters. The tool needs as input:\n\n\nTransmission (diffuse and specular) Td, Ts\nReflection (diffuse and specular) Rd, Rs\nRoughness (scattering in the specular transmission/reflection)\n\n\nIf you want to do photometric calculations, meaning that you are interested in light rather than solar radiation (including e.g. IR), you use light transmission and reflection. Unfortunately, you gave only solar reflection, but as solar and light transmission are similar, I assume light reflection to be the same as solar reflection for your example. I also assume the reflection to be purely diffuse.\n\n\nProbably reflection is not critical for you anyway, if you are more interested to know how much light enters your room. However, if you look at a sunshade from a bright room, in theory a specular reflection could even cause glare. Also, view-through is affected by highly reflective surfaces.\n\n\nSo, I assume from your numbers:\n\n\nTd=0.03 (normal-hemispherical minus normal-normal)\nTs=0.14 (normal-normal)\nRd=0.61 (guessed from given solar reflection)\nRs=0.00 (perfectly diffuse, so no specularity)\nRoughness=0 (we simply have no information based on your data)\n\n\nEntering this into the trans widget leads to\n\n\n#Td=0.03 Ts=0.14 Rd=0.61 Rs=0\nvoid trans translucent_fabric\n0\n0\n7 0.78 0.78 0.78 0 0 0.218 0.824\n\n\nNo warranty for any of the above :)\n\n\nHope this helps. For the full background of the meanings A1-A7 used with the trans material, browse the mailing list archives, check the Radiance Cook-Book and/or tutorial, see Schorsch Mischler's documentation, the Materials-pdf part of the Radiance distribution as well as the book \"Rendering with Radiance\"...\n\n\nCheers, Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2013-October/009831.html).</sup>", "id": "radiance-general_009831", "created_by": "Lars_O._Grobe"}