{"topic": "Thanks for support ...", "category": "radiance-general", "attachments": [], "created_by_name": "Christian Fusenig", "created_at": "June 19, 2006 at 11:24PM", "body": "Hi there,\n\n\nthanks to everyone for helping me with my radiance problems in my \nthesis, especially Greg for his help on explaining the integration of a \nbetter RGB rendering, mentioned in the 'Picture Perfect' essay. I never \nexpected this list to be that helpful and supportive as it is,  this is \nreally a living 'handbook'!  I gave the thesis  in last wednesday and \nhope it will turn out all right.\nSeven months ago i didn't know anything about radiance only that Relux \nVision uses a version of it. I am a windows user and found the cygwin \nimplementation of radiance. I used this one because it was the only one \ni could find on the net. I was happy to be able to use all the Unix \ncommands out of the 'Rendering with Radiance Book'. Cygwin is not really \na practical system but it was enough for my needs and i didn't wanted to \nswap systems in the middle of my thesis. Now i want to move on and use a \nmore practical and stable version of radiance. After following your \ndiscussion about radiance on different systems can you tell me, what is \nthe better alternative: using the windows based version 'mingw' ( of \nwhich i heard for the first time) or ( as i planned ) use the Knoppix \nVersion of Linux from the Learnix platform. Up to now i don't plan to \ninstall a Unix system.\nThanks for advice,\n\n\nChristian\n\n\n\n\nChristian Fusenig\nDiplomand, Medientechnik\nUndergraduate, Media Technology\nHamburg University Of Applied Sciences\nhttp://www.mt.haw-hamburg.de\n\n\naddress: Beim Schlump 27/07\n              20144 Hamburg\n\n\nemail:    christian_fusenig at gmx.de\n\n\nmobile:  ++49 179 5975845\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-June/003778.html).</sup>", "id": "radiance-general_003778", "created_by": "Christian_Fusenig"}