{"topic": "Three Phase Simulation rfluxmtx switches for view mtx", "category": "radiance-general", "attachments": [], "created_by_name": "Sandi Sirikhanchai", "created_at": "December 15, 2017 at 01:09AM", "body": "Hi everyone,\n\n\nI am having a problem with the rfluxmtx switches when creating a View Matrix.\n\n\nFirst of all as I am new to this I am following three different sources to compare the commands and outcomes.\nThe three documents I am following are:\n\n\n\n\n  *   Andy McNeil’s Radiance Three Phase Method Tutorial published on GitBook.\n  *   Andy McNeils BSDFs, Matrices and Phases - Presentation slides on Sept 1, 2014 and\n  *   Sarith Subramaniam’s Daylighting Simulations with Radiance using Matrix-Based Methods.\n\n\nThe switches used in the above sources vary between the examples and also Sarith’s method uses an octree. As I still do not have a strong grasp of radiance and the switches yet which one would be best to follow? What’s the difference? I am currently testing them all out.\n\n\nWhen I use the example lines from the documents above to create a vmtx, I have a recurring issue with -vf. The bash will say “rfluxmtx: cannot load -vf”. I posted earlier this month about something similar and all I had to do is retype the switch as it copied in a dash not a hyphen. I thought this issue might be the same case however “rfluxmtx: cannot load -vf” still appears. If I delete -vf file.vf  I will get another error saying “rfluxmtx: cannot load -x” and this continues with all the other switches.\n\n\nWhen I use Sarith’s view matrix example I get the same thing but for -ab: “rfluxmtx: cannot load -ab”.\n\n\nAfter trying all the different examples from the different sources a view matrix file was generated but nothing was created inside. I also tried the older method using rcontrib which generated a view file but only had rows and columns full of zeros. (In regards to using rcontrib, I am also using rvu to generate a rendered view matrix and believe I am using a newer version of radiance affecting the ability to use rvu).\n\n\nI am following the examples from the three sources but using my own rad files and mat files. Does anyone have any idea of what I am doing wrong? Is it likely to be how radiance is set up on my computer?\n\n\nAny insight would be much appreciated,\n\n\nMany thanks,\nSandi Sirikhanchai\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2017-December/012372.html).</sup>", "id": "radiance-general_012372", "created_by": "Sandi_Sirikhanchai"}