{"topic": "bean counting the photon array", "category": "radiance-general", "attachments": [], "created_by_name": "Chris Kallie", "created_at": "October 24, 2015 at 03:26PM", "body": "Fellow Renderers,\n\n\nI am using The Radiance Photon Map Extension to analyze the light \npassing through an irregular glass object. The luminaire is not visible \nfrom the viewpoint, and the environment is a simple Lambertian surround.\n\n\nI wish to account for all scattering events (i.e., specular reflections \nand refractions) that eventually make it to the viewpoint, and I wish to \nrender (or at least account for) scattering events incrementally, in \norder to visualize the unfolding (and hopefully the order) of \ncontributing events. I have been successful (to some degree) when the \nenvironment has a non-zero reflectance, but mkpmap fails when I set the \nsurrounding environment reflectivity to zero.\n\n\nSo far, the only way I have been able to record a single bounce in a \nnon-reflective environment is with rpict, but there I notice not just \none, but also two or three scattering events: 1) an expected specular \nreflection on the outer hull of the object; plus 2|3) what appears to be \nan inner specular reflection after an initial refraction--followed by an \nexit refraction--from within the object. This indicates to me that rpict \ndoes not count refractions the same way it counts specular reflections \n(although I think mkpmap does). I have also been able to render 1+ \nscattering event(s) with mkpmap, plus 1+ scattering event(s) with rpict, \nwhen including a non-zero reflectance Lambertian environment, but I \ndon't think those images are useful because I don't think they describe \nany realistic physics (although I might be able to use similar images \nwith pcomb in some clever way to reverse-engineer the contributions of \nphysical events).\n\n\nThe other issue I have with using rpict for computing the first \nscattering event is because I know it under-samples the caustic \nenvironment without mkpmap, so I am guessing that rpict will be useful \nfor computing some proportion of all but (at least) the first scattering \nevent(s) (i.e., perhaps I could use some thoughtful combination of \nn+p-scattering events between n-scatter-distributions and \np-scatter-gatherings).\n\n\nI hope this description/shorthand wasn't too confusing.\n\n\nIn summary, I would like to use a combination of mkpmap and rpict to \nincrementally build the photon array, and perhaps use pcomb or some \nother statistical or combinatorial technique to analyze the \ncontributions of scattering events as they relate to the viewpoint. \nFinally, whatever limitations are imposed by the software can be \nincorporated into the limits of the model (in other words, I'll take \nwhat I can get!).\n\n\nP.S. Unrelated question: How do I tell Radiance the right physical units \nfor my glass object?\n\n\nThank you, always!\nChris\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-October/011318.html).</sup>", "id": "radiance-general_011318", "created_by": "Chris_Kallie"}