{"topic": "Again transmissivity for color filter/ glass", "category": "radiance-general", "attachments": [], "created_by_name": "Christian Fusenig", "created_at": "April 28, 2006 at 12:13PM", "body": "Hey Greg,\n\n\n>It sounds like we're back on track, here.  I'm relieved.\n>  \n>\nAnd I AM too!!!\n\n\n>Did you erase the info. from the CM-2002?  Maybe the spectral data is  \n>still there.  It would be better to use it if you have it.  Even if  \n>you used a tungsten illuminant to determine the XYZ value, shifting  \n>to a different illuminant without the spectral data is a shaky business.\n>  \n>\nI try to retrieve the spectral data.\n\n\nAs i think i understand this procedure, now i am left with my last problem:\n\n\nI have a plexiglass cylinder with a height of ca. 2 cm  and a radius of \nca. 15 cm.\nI got the transmission/transmissivity of this glass from the \nmanufacturer it´s around 92%.\n\n\nOn top and on the side of this cylinder there is this LEE 061 Mist Blue \ncolor filter attached.\nI have the spectrum of this filter.\n\n\nThis cylinder is part of a news desk in a studio and ca. 1 m under this \nglass there is a incandescent spotlight ca. 3200K  that shines at it.\nThe whole desk is in the same scene described in my previous mail, color \ntemperatures vary from 2400 - 3200 K.\n\n\nI have the problem now that this filter is not attached directly to a \nlamp. If it would be like this i would simply multiply the two spectra \nand convert to CIE xy etc..\nLike in 'RwR' p. 435\n\n\nNow i want to ad the color attributes of this filter somehow to this \ncylinder:\nI think the best way to simulate this, is to use the 'trans' material \nbecause the surface shouldn't be so shiny or polished like the glass \nmaterial.\nI made an Excel sheet to calculate the 'trans' parameters but it's \nconfusing.\n\n\nWhat would you suggest?\n(I promise this my last problem ;-)\n\n\nThanks again,\n\n\nChristian\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-April/003617.html).</sup>", "id": "radiance-general_003617", "created_by": "Christian_Fusenig"}