{"topic": "Radiance-general Digest, Vol 31, Issue 23", "category": "radiance-general", "attachments": [], "created_by_name": "Jelle Feringa", "created_at": "September 29, 2006 at 12:26PM", "body": "Hi!\n\n\n\n\n\n\nThanks so much for the overwhelming replies!\n\n\n\n\n\n\nAbsurd it is. This is a problem when you have a scene like yours. You \n\n\nwant some distant object or scenery to be visible out the window, for \n\n\nexample, so you put it in your model and then the images seem really \n\n\nflat or have light leaks because the -ar isn't high enough. One thing \n\n\nyou could do is cheat, and place the objects closer to your area of \n\n\ninterest than they really are, scaling them up a bit. This works for \n\n\ntreelines and things like that, anyway. Another would be to exclude the \n\n\ndistant objects from the ambient calculation with the -ae option, the \n\n\nproblem there (and maybe some folks here have input on this) is that \n\n\nyour objects are outside, your area of interest is inside, so your -av \n\n\nis likely to be too low for the exterior objects (which is how all the \n\n\nindirectly lit surfaces derive their radiance information when their \n\n\nmaterials are on the -ae list).\n\n\n\n\n\n\n-ar 5000 would take forever to render!\n\n\n\n\n\n\nActually, it wasn't *that* bad! An hour and a half (fairly lo-res, but good\nenough for its purpose) wasn't that dramatic, so I suppose that the\nalgorithm for getting a reasonable -ar setting really is quite ok! Still I'm\nsure that there are more intelligent strategies rather than brute-force\ncomputing power. \n\n\nI'm interested to get fairly optimal ambient settings since I'm producing a\nsun path study, so I need to render quite a quantity of imagery here. \n\n\n//if fellow pythoniasts on the list are interested in my script, let me\nknow, it would be interesting the have a \n\n\n//a solid python script for sun-path that runs beautifully cross-platform &\non multi-core machines. \n\n\n\n\n\n\nGood luck, Jelle.\n\n\n\n\n\n\nThanks Rob! \n\n\n\n\n\n\n\n\n\n\nHi Rob and Jelle,\n\n\n\n\n\n\nAlthough I have not tried this, what about rendering a light probe of \n\n\nthe exterior environment (using parameters suitable for an exterior \n\n\nscene) and then using the light probe to supply the background for the \n\n\ninterior scene?\n\n\n\n\n\n\n-Jack\n\n\n\n\n\n\nHey Jack!\n\n\n\n\n\n\nThat's an interesting suggestion!\n\n\nAlthough since I'm producing a sun path study, HDR isn't really the way to\ngo, it be fairly work-intensive ;')\n\n\nInteresting idea though, did you apply this technique perhaps in some of the\nwork shown on your site?\n\n\n\n\n\n\n\n\n\n\nWell there you go. However, we do not what exactly Jelle's objectives \n\n\nare with respect to numeric accuracy.\n\n\n\n\n\n\nIt's in-between; my goal is to give architects accurate feedback about the\nlighting conditions on the project they're working on. Their interest is a\nmore visual interest than numerical. Missing a couple of lux isn't too\nproblematic, the idea is to be able to communicate the lighting conditions\nin the building in a visual & fairly accurate manner.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHi Lars!\n\n\n\n\n\n\nI just have to quote Greg, as he replied on a similar question I had \n\n\nposted some days ago in great detail:\n\n\n\n\n\n\n > One other note -- you might try setting -ar 0 in your case.\n\n\n > If you have really large and small geometry that require\n\n\n > enormous -ar settings, you may be better off without it.\n\n\n\n\n\n\nI have a scene which would also require an incredible high ar here, and \n\n\ngot processes close to 2GB (which will always lead to slow rendering on \n\n\ntoday's machines).\n\n\n\n\n\n\nThat's a very interesting suggestion!\n\n\nWill try that right away!\n\n\nCheers, \n\n\n\n\n\n\n-jelle\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-September/004034.html).</sup>", "id": "radiance-general_004034", "created_by": "Jelle_Feringa"}