{"topic": "Radiance documentation organization", "category": "radiance-general", "attachments": [], "created_by_name": "Greg Ward", "created_at": "October 25, 2006 at 03:08AM", "body": "I promised at the Leicester workshop to propose a hierarchy for  \nextant Radiance documentation, sort of a straw man to get people  \nthinking about this.  I strongly encourage others to rearrange these  \ntopics, change names, add categories, etc.\n\n\nThinking about it for a bit, I opted for a functional organization  \nover an application-based hierarchy, simply because so many tools and  \ntechniques are common to different applications, and I was trying to  \nkeep the organization as tree-like as possible, realizing that this  \ngoal is basically unachievable.\n\n\nCaveats aside, here's what I have:\n\n\nI. Input\n\tA. CAD links and conversion tools\n\tB. Photometry & Sky models\n\tC. Generator programs\n\tD. Scene processing (xform, replmarks, oconv, etc.)\n\n\nII. Computation\n\tA. Rendering (batch & interactive)\n\tB. Illumination calculations\n\tC. Executive programs (rad, rayfront, etc.)\n\n\nIII. Output\n\tA. Image processing\n\tB. Image viewing\n\tC. Image format conversion\n\tD. Graphing & plotting\n\n\nIn addition, I suggest we include an alternate arrangement of  \ntutorial materials, which necessarily bridge these functional  \nboundaries.  I am hoping others can offer suggestions for how these  \nshould be organized, as I don't even have a good list of tutorials  \navailable.\n\n\nSome thought should also be given to how one might organize materials  \nfrom the Radiance workshops.  Again, the basic categories above will  \nbe bridged or extended by many of the talks, and the chronological  \narrangement we now have is of less and less use as time goes on.\n\n\nHelp, please!\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-October/004054.html).</sup>", "id": "radiance-general_004054", "created_by": "Greg_Ward"}