{"topic": "trouble creating coloured window glass", "category": "radiance-general", "attachments": [], "created_by_name": "A. Prowse", "created_at": "September 27, 2002 at 10:08PM", "body": "Hi,\n\n\nFirst, an apology if this is not the right place to post this kind of\nquestion, but it was the only suitable-looking mailing list I could find.\n\n\nI'm new to Radiance, although I think I've got the hang of the basics now.\nI'm working on an archaeological model---an Anglo-Saxon church building. The\nproblem is creating some coloured glass for a window. I have created a\nsuccessful sky file, and the sunlight pours through the window (when there's\nno glass) to leave a window-shaped highlight on the floor and illuminating\nthe rest of the room via ambient bouncing. When I tried adding a\nwindow-shaped polygon and assigned it the \"glass\" material using 0.96 0.96\n0.96 as my rgb transmissivities (as advised in the online manual) everything\nwas still fine. However, when I specified the following:\n\n\nvoid glass blue_glass\n0\n0\n3  0.2 0.2 0.96\n\n\nthe light entered the window, but instead of appearing blue inside the room,\nit was a very low-intensity white. Experimentation seemed to indicate that\nthe light would always be white, and that it seems to adopt an intensity\nrelated to the *lowest* of the values 0.2 0.2 0.96, ie 0.2. (Indeed, 0 0 1\ngives no light at all, not blue light.) I've since tried all sorts of\nthings, including the following \"illum\" approach recommended in the online\nintro chapter to the \"Rendering with Radiance\" book:\n\n\nskyfunc brightfunc window_dist\n2 winxmit winxmit.cal\n0\n0\nvoid glass window_glass\n0\n0\n3  0.96 0.96 0.96\n\n\nwindow_dist illum RAL5013_Cobalt_blue\n1 window_glass\n0\n3  0.2 0.2 0.96\n\n\nbut the light was still white and not blue. Then I tried using the \"trans\"\nmaterial with some success, in that the light coming in was blue! But I lose\nthe nice window-shaped sun highlight on the floor---the blue light is just\ndiffusely spread around. Indeed, when I use no ambient bounces, I just get a\ncompletely black image (instead of a white, window-shaped highlight inside\nan otherwise completely black image, which is what I was getting when I used\n\"glass\"). Changing the values for the \"trans\" material doesn't seem to\ncorrect this.\n\n\nWhat's more, I'm totally guessing the values to use, which kind of defeats\nthe point seeing as I'm trying to make visually accurate images. I'm sure\nthe correct values are tied up with the \"glass\" material---if only I could\nget it to be coloured!\n\n\nI'd be really grateful for any help with this.\n\n\nMany thanks,\nAnton Prowse\nantonsgroups@yahoo.co.uk\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-September/000420.html).</sup>", "id": "radiance-general_000420", "created_by": "A._Prowse"}