{"topic": "accurate light levels", "category": "radiance-general", "attachments": [], "created_by_name": "william reynolds", "created_at": "January 14, 2006 at 04:59PM", "body": "hi there\n\n\nAs I said in my other question today (spliting a render by light \nsources) I am quite new to radiance, and I am having some issues setting \n  up my renderings. I have radiance installed and working fine, but I \ndont quite understand how I make sure the brightness of the final render \nis realistic. There are a few reasons for this:\n\n\nI'm not sure what exposure setting to use with pfilt - is it as simple \nas setting '-e 1' so as not to adjust the exposure? I have tried this \nand my images all come out very dark, but this might be because I don't \nhave enough light in the scene (see next paragraph, below).\n\n\nHas anyone used radiance with any theatrical light fixtures? and would \nthey be prepared to share the .rad files for them? I have found the .rad \ndescriptions of architectural fixtures, but i'm not familiar with any of \nthem, and even if I was I need to be able to use accurate models of the \nspecific instruments I'll be using in theatres. I would simply build my \nown files, using the iestorad utility, but rather unhelpfully the \ninstrument manufacturers dont seem willing to give out ies data.\n\n\nHas anyone made any more materials information available to the public? \nI have looked through the material.rad list of materilas in the lib \nfolder, but I'm specifically looking black paint and heavy black cloth \ntype materials. If not, then does anyone have any recomendations of how \nto go about determining good values to use in my own materials \ndefinitions? I dont have access to any way of measuring reflected light \nlevels in an experiment.\n\n\nThanks for your help with my probably rather basic questions\nWill\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-January/003256.html).</sup>", "id": "radiance-general_003256", "created_by": "william_reynolds"}