{"topic": "New SPOT Pro version released!", "category": "radiance-general", "attachments": [], "created_by_name": "Zack Rogers", "created_at": "June 16, 2016 at 11:00AM", "body": "Fellow Radiance enthusiasts,\n\n\nA new version of the SPOT Pro daylighting and lighting design and analysis\nsoftware is now available!  Visit SPOT home\n<http://www.daylightinginnovations.com/spot-home>\n\n\n\n\n\n\n\n\n\n\n\n\nto learn more about SPOT v5.02 and download the software.\n\n\nSPOT Pro is a Windows-based stand-alone lighting and daylighting design\ninterface to a powerful Radiance ray-tracing engine that sits, accessible,\nbehind the scenes.  SPOT Pro has a number of unique simulation capabilities:\n\n\n   - *Automated annual metric reports - compare various daylighting metrics\n   with standard daylighting reports for LEED (v4, 2009), CHPS, IgCC, UDI PBSP\n   and a robust SPOT daylight performance report.*\n   - *Optical daylighting system annual simulation* - SPOT uses \"system\n   BSDF\" files to describe Complex Fenestration Systems, like LightLouver or\n   Tubular Daylight Devices, and perform annual Climate Based Daylight\n   Modeling.\n   - *Accurate Simulation of photosensor controlled electric lighting*\n- SPOT simulates\n   the actual photosensor system response, lets you refine the control system\n   settings, and provides an annual simulation of the interaction between\n   electric lighting and daylighting.  For those aiming for truly accurate\n   simulation, this is the *only tool* that directly simulates the\n   photosensor signals rather than using a workplane illuminance proxy, and\n   that accounts for the interaction of electric light feedback on common\n   closed-loop control systems.\n   - *Output to EnergyPlus and DOE-2* - After optimization and simulation\n   of the photosensor system, SPOT provides annual LPD multiplier schedule\n   output files for both DOE-2 and EnergyPlus.\n   - *Shade control simulation* - both automated/photosensor-based control\n   and a range of unique manual shade control algorithms are available\n   - *\"Design Day\" calculations* - results showing average \"design day\"\n   conditions (calibrated to climate data) rather than a specific weather\n   condition in an hourly weather file.\n   - *Internal Geometry Modeler* - The internal modeling tools are fairly\n   robust, with blocks, sloped ceilings, monitors, and sawtooth geometries\n   available, yet still easy and quick to use with no CAD experience\n   necessary.  Sketchup models can be imported into the software behind the\n   scenes.\n   - *Material Database and Editor * - New material database allows colors,\n   patterns, glass, metals, and BSDF files to be assigned to your model's\n   surfaces.\n   - *Improved Renderings -* The use of materials and patterns greatly\n   improve the quality of the perspective and sectional renderings.\n\n\nThe SPOT user manual\n<http://www.manula.com/manuals/zrogers/spot-pro-v-5/1/en/topic/1-0-introduction>\n\n\n\n\n\n\n\n\n\n\n is an excellant resource and provides detailed information about the\nsoftware.  This SPOT webinar <https://www.youtube.com/watch?v=ecBFe83HRSY>\n\n\n\n\nalso provides a good introduction to the software.\n\n\nWe had a great workshop at LightFair in San Diego this year and are\noffering the same workshop online as a series of 3 free webinars, as\nscheduled below:\n\n\n- SPOT Pro daylighting design and analysis.  Tuesday, June 21, 10AM MDT\n- SPOT Pro materials and electric lighting design and analysis.  Tuesday,\nJune 28, 10AM MDT\n- SPOT Pro photosensor system design and optimization: Tues, July 5, 10AM\nMDT\n\n\nAttend a webinar and recieve $100 off a SPOT Pro license purchased within\n30days!  E-mail spot at daylightinginnovations.com if you are interested in\njoining one of the LightFair workshop webinars or in scheduling a personal\nSPOT webinar for your own company.\n\n\nJoin the growing list of design professionals and Universities using SPOT\nto optimize daylighting and electric lighting designs.\n\n\nHappy Simulating!\n\n\n\n\nZack Rogers, P.E., LEED AP BD+C\nDaylighting Innovations, LLC\n808 S. Public Road, Suite 200\nLafayette, CO 80026\n(303)946-2310\n\n\n\n\nwww.daylightinginnovations.com\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-June/011800.html).</sup>", "id": "radiance-general_011800", "created_by": "Zack_Rogers"}