{"topic": "OpenStudio v0.7.0 Released", "category": "radiance-general", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "March 27, 2012 at 07:58PM", "body": "Dear Colleagues,\n\n\nI am pleased to announce that OpenStudio version 0.7.0 is now available, which includes a fair bit of functionality that might be of interest to some of you. While still rough around the edges, users can now build a model in the OpenStudio SketchUp plugin and then use some Ruby scripts to create a Radiance-ready model and use Radiance to perform annual climate-based daylight modeling (CBDM) with the three-phase method (or single phase, or \"Radiance classic\"). Documentation is in the works, but for those existing OpenStudio users, the main release note is this:\n\n\nAdded \"3-phase\" option to DaylightSim.rb to allow for facade-independent dynamic window simulations with Radiance and the daylight coefficient method. Users must now specify the \"--x\" (for single phase method) or \"--z\" (three phase method) options when running DaylightSim.rb. ModelToRad.rb now also creates a \"bsdf\" directory as part of the radiance output. In this directory is a \"mapping.rad\" file which contains a single entry for each unique window group found in the .osm. Each line is a comma-separated list of each window group's necessary 3-phase input files. The first value is the daylight matrix, computed when the user pre-computes the matrices (with the \"--dc\" option), followed by the BSDF filename for the shades-up window configuration, followed by the BSDF filename for the shades-down window configuration, and finally the view matrix. Users must replace the two bsdf filenames with their own valid BSDFs for their windows, and place the BSDF files (Radiance .xml format) in the \"bsdf\" directory. When performing an annual simulation, DaylightSim.rb will test for direct sun on each window group, and will deploy shades whenever the solar azimuth is within 90 degrees (plus or minus) to the window group's surface normal. (Support for image generation and stochastic blind operation models is planned.) Three phase is only supported for illuminance maps, no images. Windows support of the new features is untested. Validation efforts are ongoing, and have been interesting, use caution!\n\n\nThere is a Ruby script called \"MakeSchedules.rb\" that will take an annual daylight illuminance file, a setpoint, and an OpenStudio model and work out a new lighting schedule based on daylight availability, lighting setpoint, and occupancy schedule, ultimately producing an .osm file with an embedded lighting response schedule based on Radiance-computed values. This can be run in the OpenStudio App, to perform an EnergyPlus simulation to get total annual energy savings from daylighting. I'm happy to work with any of you offline or here or on the OpenStudio forums to discuss the use and abuse of the new stuff. \n\n\nCheck it out at https://openstudio.nrel.gov!\n\n\n- Rob\n\n\nP.S. We now have a contract in place with Kitware to wrap up the Radiance binary project. =)\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2012-March/008475.html).</sup>", "id": "radiance-general_008475", "created_by": "Rob_Guglielmetti"}