{"topic": "PhD Studentship - Electrochromic Glazing Performance: Measurement and Modelling (Leicester, UK)", "category": "radiance-general", "attachments": [], "created_by_name": "John Mardaljevic", "created_at": "March 21, 2011 at 04:21AM", "body": "Electrochromic Glazing Performance: Measurement and Modelling\n\n\nhttp://www.iesd.dmu.ac.uk/vacancies/index_studentships.htm\n\n\nThree years scholarship comprising bursary and UK/EU fees\n\n\nA PhD research studentship within the Institute of Energy and Sustainable Development (IESD), an internationally leading multi-disciplinary research institute focused on the technological and human dimensions of sustainability, is available to suitably qualified UK or EU students.\n\n\nElectrochromic (EC) glazing is a window material that varies its transmission properties based on a sensor input. This project will be a combined monitoring and modelling study on the performance of EC glazing. The monitoring will use high dynamic range (HDR) imaging to quantify the visual field in actual office spaces – the objective measures will be related to subjective response. For the modelling of EC performance, the IESD’s in-house suite of climate-based daylight modelling software will be enhanced to account for variable transmission glazing materials. The field-study will provide validation data for the modelling. The first degree (see below) should be in physics/engineering, or a related numerate discipline. Some prior experience of programming is helpful as it gives an indication of aptitude for the work, but this is not essential.\n\n\nFor a more detailed description of the studentship project please contact Dr John Mardaljevic +44 (0) 116 257 7972, e-mail jm at dmu.ac.uk.\n\n\nThis research opportunity is one of 28 scholarships funded by DMU in 2011/12 to build on our excellent achievements in the RAE2008 and looking forward to REF2014. It will develop the university’s research capacity into new and evolving areas of study, enhancing DMU’s national and international research partnerships.\n\n\nApplications are invited from UK or EU students with a good first degree (First, at least a 2:1 or equivalent) in a relevant subject.  Doctoral scholarships are available for up to three years full-time study starting October 2011 and provide a bursary of £13,770pa in addition to University tuition fees.\n\n\nClosing date: 11 April 2011\nInterview date: To be confirmed\nStarting date: October 2011\n\n\nApplicants should contact Clare Perry at the Institute of Energy and Sustainable Development to receive an application pack, which requires a full CV with two supporting references. Please email cperry at dmu.ac.uk or call +44 (0)116 257 7979 for further details.\n\n\nPlease quote ref:  DMU studentships 2011\n\n\n\n\nDr. John Mardaljevic                \nReader in Daylight Modelling\nInstitute of Energy and Sustainable Development\nDe Montfort University\nThe Gateway\nLeicester\nLE1 9BH, UK\n+44 (0) 116 257 7972   \n+44 (0) 116 257 7981 (fax)\n\n\njm at dmu.ac.uk   \nhttp://www.iesd.dmu.ac.uk/~jm\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2011-March/007728.html).</sup>", "id": "radiance-general_007728", "created_by": "John_Mardaljevic"}