{"topic": "MPI-version versus Radiance with rpiece", "category": "radiance-general", "attachments": [], "created_by_name": "Thomas Seebohm", "created_at": "July 28, 2002 at 11:10AM", "body": "It is possible to obtain a copy of the MPI version of Radiance from LBNL by\nsigning a license agreement for the source code.  This version uses\nparallelization method known as message passing. It was written for a Cray\nand can be modified to run on an SGI without too much difficulty by someone\nfamiliar with parallel programming. This is, however, not necessary because\nthe current version of Radiance can make use of multiple processors to speed\nup rendering by using the rpiece function. This is explained in Chapter 15\nof the Radiance text. There was a also an email exchange on this subject in\nJune which can be found in the Radiance-general archives in June under\n(rpiece and parallel processing). The same approach will work on clusters of\nPC's running Linux. I hope to report on a comparison between running\nRadiance on a multi-processor SGI machine versus running it on a cluster of\nLinux PC's soon. Note that rpiece speeds up rendering with rpict by\ndistributing the work to of rendering an image to multiple processors. It\ndoes not speed up creation of the octree, however. Octree creation can be\nspeeded up by breaking the scene into several rad files and creating an\noctree separately for each and then combining them with the -i option in the\noconv function. The different sub-octrees could be created in parrallel on\ndifferent processors.\n\n\nA final word about the MPI version: it does not correspond to the current\nversion of Radiance but an earlier one. It is not clear that the MPI version\nwould be any faster than  the current version using rpiece. I have had very\ngood results.\n\n\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-July/000373.html).</sup>", "id": "radiance-general_000373", "created_by": "Thomas_Seebohm"}