{"topic": "Radiance pmap extension on Windows", "category": "radiance-general", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "April 01, 2011 at 08:16AM", "body": "Hi Valère!\n\n\n> I am using desktop radiance2.0b on windows. As I need to simulate a room\n> with a deep lightpipe, I would like to use the photon map but I can't find\n> any version of it I can use on windows.\n\n\nI think it would be worth to find out the status of the current attempts \nto update the photon map extension to the Radiance 4.x code base. I am \nnot sure whether Jan or anyone else involved at Fraunhofer ISE is \nreading, but probably they are the only ones who know about the project.\n\n\nFirst, I would immediately stop using Desktop Radiance. We are in 2011 \nnow, and I think the old releases are interesting mostly for historical \nreasons now.\n\n\nSecond, I do not know how well a patched Radiance 3.7 (the latest \nofficial patch of the pmap) compiles on Windows. It used to work find on \nMac OS, but Windows is quite different from everything else. You may \nstill consider to use a virtual machine (e.g. Virtualbox, available for \nfree) to get a complete Linux environment on a Windows machine.\n\n\nThird, as I am doing some experiments on light pipes and the pmap, I \nwould really be curious whether we will have some validation data once a \nRadiance 4.x pmap is to be released. There used to be caveats which I am \nstill trying to understand.\n\n\nI imagine that once we have a complete pmap patch for Radiance 4.x, \npeople will get it useable in cygwin & Co., too. Still, probably it \nwould make sense to get your hands on a Linux installation for now. And \nusing a virtual machine is the easiest way to go for people not having \naccess to a native installation.\n\n\nCheers, Lars.\n\n\nbtw: I changed the subject line, please make sure to avoid subject lines \nsuch as \"Re: [Radiance-general] Radiance-general Digest...\" when replying.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2011-April/007734.html).</sup>", "id": "radiance-general_007734", "created_by": "Lars_O._Grobe"}