{"topic": "Rendering Panoramas", "category": "radiance-general", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "November 26, 2002 at 11:56PM", "body": "On 27 Nov 2002 at 1:14, Lars Grobe wrote:\n\n\n> BTW, do you know about good ressources on using make to do rendering?\n> I know the example files from radsite, and I know the gnu-make\n> documentation, but is there anybody who has done some more work on\n> this? I am developing my own makefile templates at the moment, but I\n> have still lots of problems as some aspects of radiance differ from\n> the standard build process.\n\n\nHmmm.  Using make to do your renderings?  This is interesting.  I \nremember Raphael showing some examples of his make-based stuff \nat the Workshop, and thought that was interesting.  Being a UNIX \nnewbie I barely understand makefile scripts that *other* people wrote, \nnever thought of doing my own.  \n\n\nQuestion:  Why aren't you using rad?  \n\n\nrad does a lot of expert-level (program author-level) thinking about \nyour model for you, and sets a lot of the myriad switches correctly, \nbased on three global assumptions: \"quality, detail, and variability\".  \n(see radsite.lbl.gov/radiance/refer/rad.pdf for the full lowdown.) \n\n\nI have been building shell scripts around rad and it's working ok for the \nmoment.  I am in the midst of rewriting a script to better serve my \nneeds, as sometimes the rad rendering pipeline is not what what you \nneed, but the ability of rad to intelligently set rendering parameters for \nyou is a powerful one, and can be (ugh, I hate this use of the word...) \n\"leveraged\" in your shell scrips even if you simply use it to determine \nthose parameters.  You could have rad determine the rendering \nparameters and pipe it to a \"settings variable\".  Then call rpict or \nrtrace or whatever and reference the settings via the @optfile \nstatement.  You can even tweak the settings with the RENDER= \nline(s) in your rif file, which can be manipulated by the shell script with \nsed, or whatever, and... well you get the idea.\n\n\nI'm interested to hear everyone's thoughts on the use of make vs. \nshell scripts.  Since I'm more of a user than a programmer, I \ngravitated to shell scripts because they are really just regurgitated \ncommands, which is the way I tend to think.  But if the \"next level\" is \nmake, then I'm all ears.  What are you all using out there in the real \nworld?  \n\n\n       Rob Guglielmetti\n     rpg777@earthlink.net\nhttp://home.earthlink.net/~rpg777\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-November/000493.html).</sup>", "id": "radiance-general_000493", "created_by": "Rob_Guglielmetti"}