{"topic": "Two windows different directions Three Phase simulation", "category": "radiance-general", "attachments": [], "created_by_name": "Sandi Sirikhanchai", "created_at": "January 22, 2018 at 03:14PM", "body": "Hello everyone,\n\n\nI am working through re-simulating existing radiance models that were created in another programme and wanted to check if I am using the right method.\n\n\nThe files that I have received are 1 radiance model, 2 material files, and a range of bsdf files. (There are no window glow files for creating a view matrix or sky.rad files). The model has two windows, one faces north and one south and having these two windows is tripping me up a bit.\n\n\nSo overall, I have to create one sky matrix, two view matrices and two daylight matrices? Is this correct?\n\n\nTo make the view matrix I am using the command:\nrcontrib -f klems_int.cal -bn Nkbins -fo -o results\\photocells_%s.vmx -b kbinS -m windowsouth -b kbinN -m windownorth -I+ -ab 12 -ad 5000 -lw 2e-5 model2windows.oct < points.pts\n\n\nin which %s should generate two files, but when I run it only generates one. Because of this I ran the command twice – one for the north window and one for the south window.\n\n\nTo make the daylight matrix for each window I used two commands to make each matrix:\nrfluxmtx north.rad sky.rad material_detailed.rad materialsAliasesDetailed.rad radmodel.rad > north_dmx.dmx\n\n\nrfluxmtx south.rad sky.rad material_detailed.rad materialsAliasesDetailed.rad radmodel.rad > south_dmx.dmx\n\n\nThen I combine the matrices for the north window together and then south window together and then add together?\n\n\nI would also like to know whether the window glow that needs to be inwards facing to create a view matrix can be in the same plane as the windows in the radiance model or if I can have it a couple millimetres in front of the radiance model window. It will mean I have two material directly on each other.\n\n\nAny clarifications/comments would be very much appreciated.\n\n\nMany thanks,\nSandi\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2018-January/012415.html).</sup>", "id": "radiance-general_012415", "created_by": "Sandi_Sirikhanchai"}