{"topic": "Sketchup location settings [was Radiance-general Digest, Vol 45, Issue 1]", "category": "radiance-general", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "November 01, 2007 at 03:06PM", "body": "On 1 Nov 2007, at 20:48, Evangelos Christakou wrote:\n\n\n> Google Sketchup (free)  doesnt offer location settings\n> (LAT/LONG), so SKY settings are  difficult!!!!\n> You must have SKETCHUP Pro version to do it.\n>\n> Thomas, there is a way to overcome this limitation?\n\n\nAh, there is me having the inside view of the API and not so much\nthe outside of the GUI. Sorry, I thought there was a point to set\nthat directly ...\n\n\n[ ... checking right now and there it is! ...]\n\n\nIn the 'Model Info' dialog (menu 'Windows') you will find a 'location'\nentry in the left list of options. Here you can select from predefined\nlocation in the 'locations.dat' file or roll your own via\n'Custom location ...'.\n\n\nOne word of warning, though: When the script writes out the sky file\nit reads the 'locations.dat' file, searches for the country and city\nname to match the entry and uses the time offset to calculate the\nstandard meridian for the timezone. Not entirely accurate but it should\nhave the right effect on the shadow settings. If you use your own\nvalues they are not in the file, so the standard meridian is calculated\nas the nearest multiple of 15 to the location. This is wrong for\nall locations east of their standard meridian (I should work on that)\nand for those areas where the timezone difference does not match the\nlongitude (timezones that cover more than 15 degrees - don't know\nwhat to do about that).\n\n\nYou will get a warning in the log file but nevertheless you should\ncheck the final sky file if you intend serious daylight studies.\nA simple solution that makes everyone happy is to add your own\nlocations to the 'locations.dat' file (perhaps Sketchup does that\nautomatically, I haven't checked).\n\n\nThe last time I tried the look-up on Windows it didn't work because\nSketchup couldn't find the file. It might be confused by a language\nsetting but I fear I have to write my own function to locate support\nfiles ...\n\n\nBTW: In the 'shadow setting' dialog (via menu entry Windows -> Shadows)\nyou can set day and time. I have not figured out yet if daylight saving\ntakes a part in this at all.\n\n\nThe settings 'View -> Shadows' and 'use sun for all shading' (in 'shadow\nsettings') define if the proposed sky type is intermediate or sunny and\nhas a sun or not: 'View -> Shadows' switches the sun on and off,\n'use sun for all shading' switches from intermediate to sunny sky.\n\n\nHTH, Thomas\n\n\n\n\n\n\nWhen I'm old I want to be a wiki page at\nhttp://www.bozzograo.net/radiancewiki/doku.php.\n                         -- anonymous email\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2007-November/004550.html).</sup>", "id": "radiance-general_004550", "created_by": "Thomas_Bleicher"}