{"topic": "Bug fix for ies2rad", "category": "radiance-general", "attachments": [], "created_by_name": "Greg Ward", "created_at": "April 01, 2002 at 12:37PM", "body": "Jack de Valpine found a couple of bugs in the latest (3.4) release of \nies2rad, one of them fairly serious.  If you are using this program, I \nsuggest you download the patch I just put together on the Radiance \nwebsite fromt he download page:\n\n\n\thttp://radsite.lbl.gov/radiance/license.html\n\n\nUnfortunately, I have not managed to recompile the binaries, so if you \ndon't have a C compiler, you will have to fall back on the previous \nversion of ies2rad for the time being.\n\n\nFollowing is the list of changes in this patch:\n\n\n\n\nFixed bug in replmarks pointed out by Georg Mischler, which caused\ngarbage to be output under specific conditions (unscaled, unrotated\ninstances).\n\n\nFixed bug in normtiff that caused occassional weird colors\non human tone-mapping of 32-bit LogLuv inputs (tmapluv.c).\n\n\nFixed -o option of pcomb so it resets le(i) and color exposure functions\nto unity.\n\n\nFixed a bug in Type B photometry in source.cal introduced in last fix \nwhere\nspherical sources were getting symmetric distributions front-to-back.\n\n\nFixed another bug in ies2rad for 90-270 bilaterally symmetric fixtures, \nwhich\nseems to have been there from the beginning.  Thanks to Jack de Valpine\nfor pointing it out.\n\n\nAdded NORANDOM symbol for tests with all random sampling turned off.\n\n\nFixed a bug in expression evaluation code that was causing unneeded\nevaluations of constants.  This is a fix on an earlier fix of a more\nserious bug prior to the 3.4 release, where the expression clock\nwas wrapping silently and allowing values to go stale.\n\n\nFixed an even more serious bug in ies2rad for thin fixtures, where\nit was using \"flatcorr\" without the proper correction for the\nemitting area.  Thanks again to Jack de Valpine for spotting this.\n\n\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-April/000204.html).</sup>", "id": "radiance-general_000204", "created_by": "Greg_Ward"}