{"topic": "2018 International Radiance Workshop (Feb update)", "category": "radiance-general", "attachments": [], "created_by_name": "John Mardaljevic", "created_at": "February 16, 2018 at 09:09AM", "body": "Dear Colleagues,\n\n\nThe 2018 International Radiance Workshop (3-5 September) webpage is up and abstract submission is open (please use the email link on the webpage):\n\n\nhttp://climate-based-daylighting.com/doku.php?id=radiance2018\n\n\nThe page contains travel and accommodation information.\n\n\nThus far, the following are proposed for the tutorial/training day:\n\n\n1.  Ambient calculation crash-course.  A perennial favourite giving a excellent 'under the hood' introduction to one of the keystone features of the Radiance system.\n\n\n2.  A exposition of the 4 Component Method (4CM) daylight coefficient approach.  The 4 Component Method was, it seems, the first daylight coefficient implementation (originally devised in 1995).  It was revised in 2003, and tweaked since then.  The rationale for including it during the tutorial day is because knowing how the 4CM approach works makes it much easier to understand how all the other, subsequent, daylight coefficient formulations work.  Also, the rigorous validation that the 4CM approach was subjected to helps illustrate and explain many of the accuracy issues that apply to all the Radiance DC formulations.\n\n\nFurther suggestions are invited for the tutorial/training day – either sessions you'd like to hear or give – please send them to the organisers (Eleonora & myself) using the email link on the webpage.\n\n\n\n\n\n\nPresentation titles so far include:\n\n\n-  Visual comfort with side-lit at restaurants under sunny climates (determined using DIVA and the multi-phase methods).\n\n\n-  New metrics to evaluate quantity and quality of daylight for multi-zoned electrochromic glazing.\n\n\n-  Meteorological data for climate-based daylight modelling.\n\n\n-  Validation of HDR derived illuminance measurement in a conservation setting.\n\n\nLooking forward to receiving many more in the next few weeks!\n\n\n\n\n\n\nWorkshop costs are being finalised.  Rest assured, they will be in keeping with the long-standing Radiance tradition of affordability.  Also, accommodation in Lboro is fairly reasonably priced (see the webpage).  I know there are some other meetings are happening in Lboro that week, so if you are set on coming you may wish to book accommodation fairly soon.  The (very handy for the Workshop) Burleigh Court Hotel is likely to get fully booked that week.\n\n\nCheers\nJohn\n\n\nJohn Mardaljevic PhD FSLL FIBPSA\nProfessor of Building Daylight Modelling\nSchool of Architecture, Building & Civil Engineering\nLoughborough University\nLoughborough\nLeicestershire\nLE11 3TU, UK\n\n\nTel: +44 1509 222630 (Direct)\nTel: +44 1509 228529 (Secretary)\n\n\nj.mardaljevic at lboro.ac.uk\n\n\nhttp://www.lboro.ac.uk/departments/abce/staff/john-mardaljevic\n\n\n2018 International Radiance Workshop\n3-5 September 2018, Loughborough University, UK\n\n\nhttp://climate-based-daylighting.com/doku.php?id=radiance2018\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2018-February/012458.html).</sup>", "id": "radiance-general_012458", "created_by": "John_Mardaljevic"}