{"topic": "Strange Glowing Buildings... Ack.", "category": "radiance-general", "attachments": [], "created_by_name": "Jeffrey McGrew", "created_at": "May 27, 2004 at 06:54PM", "body": "Hello all,\n\n\n\tI'm having a problem with my buildings I'm exporting out of Revit, \nand am trying to figure out where the problem is coming from. I'm \nhoping someone out there can help me out a little with this issue, for \nI don't understand enough about Radiance to really know why this is \nhappening, and can only guess at why.\n\n\n\tJust for the record, if I make a model from scratch using textfiles I \ndon't have any of these problems. Additionally, the problem crops up \nwhether I'm using Radiance on Cygwin, OS X, or Mandrake Linux, so it's \nobviously something I'm doing or a problem with the models coming out \nof Revit.\n\n\n\tMy problem is the fact that my buildings all appear as if they are \n'glowing'. Things like the site, and any Radiance-created objects or \ninstances render correctly, however the buildings, especial the large \nflat surfaces such as walls and such, almost appear to be glowing \nbecause they seem to be bouncing so much light off of them, almost as \nif they are made of perfect white gypsum in broad daylight.\n\n\n\tThe material definitions for the walls aren't set too high, the \ncolors are typically .8 or .7 for the RGB values, and the roughness is \nusually set to .15 or so- both values that don't seem too far off. \nAlso the Exposure for the scene tends to be about right for other \nExterior Radiance scenes and the sun is a simple Gensky straight from \nthe first tutorial file. Yet however the building will be bouncing \nalmost twice the light off of it of anything else in the scene!\n\n\n\tThe way I get my models from Revit to Radiance might be the key to \nwhy the models are behaving the way they are. I export the models to a \nDWG file that I then bring into AutoCAD and then use RADOUT to produce \nthe models. However there are issues with this, for RADOUT or TORAD \ndon't work quite right in the latest version of AutoCAD that I'm \nusing. I've tried to use dxf2rad, but it always seems to choke on the \nmodels. They are very large, very complex, and have many surfaces. So \nI'm wondering if that's the root of my problem; is something in the \nexport process possibly causing this?\n\n\nThanks for your time,\n\n\nJeffrey McGrew\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-May/001742.html).</sup>", "id": "radiance-general_001742", "created_by": "Jeffrey_McGrew"}