{"topic": "FYI - Columbia-Utrecht Reflectance and Texture Database", "category": "radiance-general", "attachments": [], "created_by_name": "Daniel Matthews", "created_at": "August 04, 2002 at 11:42AM", "body": "http://www.cs.columbia.edu/CAVE/curet/\n\n\nColumbia-Utrecht Reflectance and Texture Database \n\n\n\n\n Kristin J. Dana \nBram Van Ginneken \n\n\n\n\n Shree K. Nayar \nJan J. Koenderink \n\n\n\n\n\n\n Researchers at Columbia University and Utrecht University have collaborated \nin an extensive investigation of the visual appearance of real-world \nsurfaces. This joint effort, sponsored in part by REALISE of the European \nCommission, the National Science Foundation and by DARPA/ONR under the MURI \nGrant No. N00014-95-1-0601 has resulted in 3 databases: \n\n\n BRDF (bidirectional reflectance distribution function) database with \nreflectance measurements for over 60 different samples, each observed with \nover 200 different combinations of viewing and illumination directions. \n BRDF parameter database with fitting parameters from two recent BRDF models: \nthe Oren-Nayar model and the Koenderink et al. representation. These BRDF \nparameters can be directly used for both image analysis and image synthesis. \n BTF (bidirectional texture function) database  with image textures from over \n60 different samples, each observed with over 200 different combinations of \nviewing and illumination directions. Each of these databases is made publicly \navailable for research purposes. For details about the measurements, and \nfitting procedures a technical report and summary paper are provided. Also \nsee the following journal paper: \n\n\nReflectance and Texture of Real World Surfaces, K.J. Dana, B. van Ginneken, \nS.K. Nayar and J. J. Koenderink, \nACM Transactions on Graphics, Volume 18, No. 1, pp. 1-34, January 1999\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-August/000380.html).</sup>", "id": "radiance-general_000380", "created_by": "Daniel_Matthews"}