{"topic": "Fritted Glass", "category": "radiance-general", "attachments": [], "created_by_name": "Zack Rogers", "created_at": "June 21, 2002 at 11:58AM", "body": "Hello,\n\n\nI just recently tackled fritted glass for a project with a huge central\natrium covered by a huge glass spire roof.  I used the perforate function to\ncombine the glass material and the frit material as follows (the perforate\nfunction creates a pattern of dots or holes, a different function would be\nneeded for fritted lines);\n\n\n1).....Definition of glass material from optics 5;\n\n\nvoid  glass       SGP_VE1-2M_glass\n0\n0\n3     0.661     0.759     0.670\n\n\nvoid  BRTDfunc    SGP_VE1-2M_front\n10\n      0.104     0.105     0.107\n      0.607     0.696     0.615\n      0 0 0\n      .\n0\n9 0 0 0 0 0 0 0 0 0\n\n\nvoid  BRTDfunc    SGP_VE1-2M_back\n10\n      0.095     0.110     0.102\n      0.607     0.696     0.615\n      0 0 0\n      .\n0\n9 0 0 0 0 0 0 0 0 0\n\n\nnotice this definition can be simplified to an identical definition as\nfollows (as seen in the glazing.cal file);\n\n\nvoid BRTDfunc CLEAR_6_2_glass\n10     rrho grho brho\n        rtau gtau btau\n        0 0 0\n        glazing.cal\n0\n18    0 0 0\n        0 0 0\n        0 0 0\n        0.104     0.105     0.107\n        0.095     0.110     0.102\n        0.607     0.696     0.615\n\n\n\n\n\n\n2)....Definition of Frit material;\n\n\nvoid trans blackfrit\n0\n0\n7 0.091 0.091 0.091 0.010 0.150 0.556 0.000\n\n\n\n\n\n\n3).....Using mixfunc and perforate.cal to combine glass and frit materials;\n\n\nvoid mixfunc frit-b40\n6 SGP_VE1-2M_glass blackfrit z_hole perforate.cal -s .5\n0\n1 .357\n\n\nor in general\n\n\nvoid mixfunc name\n6 foreground_material background_material (z_hole,x_hole or y_hole)\nperforate.cal -s 1\n0\n1 (radius-to-spacing fraction)\n\n\nwhere;\nx,y,z_hole signifies the direction of the dots or holes\nthe spacing of the holes is determined by the scale -s command (one-to-one\nrelationship. ie. -s 1 = 1 unit spacing)\nthe radius/spacing fraction tells how large the radius is compared to the\nspacing.  (ie. with a value of .5 the dots will touch, a value of 1 is\ncompletely dots, a value of 0 is no dots)\n\n\nHope this helps!\nZack\n\n\n\n\n> Hello:\n>\n> I am interested in people's comments on how best to simulate frit\n> glazing systems from a performance and appearance standpoint.   We are\n> interested in comparing the appearance based on available performance\n> data of a variety of fritted glazing systems on the exterior of a\n> building system under daylight conditions. The fundamental challenge it\n> seems to me is how to use the data that is readily available (from\n> software such as LBL's Optics5 as well as from manufacturers themselves)\n> to make an appropriate material in Radiance and whether the readily\n> available data is in fact sufficient to describe the material behavior.\n>\n> All the frit systems that we are looking at use the same basic\n> insulating glass with the following makeup:\n>\n>     * (exterior) 6mm clear glass with low-e coating on the second surface\n>     * (airspace) 13.2mm\n>     * (interior) 6mm clear glass\n>\n> A Radiance material description (brtdfunc) for this makeup can be\n> generated by the LBL Optics5 program. Note that Optics5 outputs material\n> descriptions for the glass primitive as well as interior and exterior\n> descriptions based on the BRTDfunc. In this case I believe that the\n> \"front\" version of the BRTDfunc represents the exterior and is the\n> appropriate description to use for this study.\n>\n> void  glass       ve1-2m_glass\n> 0\n> 0\n> 3     0.712     0.791     0.719\n>\n> void  BRTDfunc    ve1-2m_front\n> 10\n>       0.111     0.114     0.116\n>       0.653     0.726     0.659\n>       0 0 0\n>       .\n> 0\n> 9 0 0 0 0 0 0 0 0 0\n>\n> void  BRTDfunc    ve1-2m_back\n> 10\n>       0.112     0.125     0.122\n>       0.653     0.726     0.659\n>       0 0 0\n>       .\n> 0\n> 9 0 0 0 0 0 0 0 0 0\n>\n> The information that we do know is as follows:\n>\n>     * measured photopic transmittance, and exterior and interior\n>       reflectance of base insulating glass system (70%, 11% and 12%)\n>     * radiance material description of  base insulating glass system\n>     * measured photopic transmittance, and exterior and interior\n>       reflectance of selected composite frit glass systems (ie the\n>       composition of the frit silkscreen [white] onto the 2nd or 3rd\n>       surface of  the base insulating glass system, for example 45%,\n>       22%, and 24% based on a 50% frit on the 2nd surface) , note that\n>       as far as I can tell it is not possible to build up such as system\n>       in a program like Optics5 (unless additional baseline measured\n>       data can be obtained from the manufacturer)\n>\n> Is it sufficient to figure out the percentage variations for the\n> transmittance and reflectance values between the original glass and the\n> composite frit glass and then modify the brtdfunc material description\n> accordingly? I know that this will not completely account for the change\n> in color of the glass due to the white silkscreen on the 2nd or 3rd\n> surface. But is this a reasonable approximation to start with.\n>\n> Another thing to consider is the 'modeling' of the actual frit pattern\n> on the glass. My thinking is that this is only important for cases where\n> the glass is very close to the viewer. Typically a lot of the frit\n> patterns (such as dot and lines) tend to disappear the the farther away\n> from the building you are. Now in the cases where the view is close to\n> the glass, what is a good way to build a composite material in Radiance\n> (a mixfunc is probably a good starting point)? We know the data for the\n> base insulating glass but what is a good way to figure out the\n> reflectance of the frit silkscreen as seen through the glass?\n>\n> I will look forward to your suggestions and comments.\n>\n> Regards,\n>\n> -Jack de Valpine\n\n\n\n\nCelebrating 20 Years of Improving Building Energy Performance\n\n\nZack Rogers\nDaylighting Designer/Engineer\nArchitectural Energy Corporation\n2540 Frontier Avenue, Suite 201\nBoulder, CO 80301 USA\n\n\ntel (303)444-4149 ext.235\nfax (303)444-4304\nwww.archenergy.com\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-June/000326.html).</sup>", "id": "radiance-general_000326", "created_by": "Zack_Rogers"}