{"topic": "example of a street", "category": "radiance-general", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "October 02, 2001 at 06:44PM", "body": "Jan Hollan wrote:\n\n\n> I began to learn Radiance today in order to be able to compute simple\n> outdoor-lighting scenes, but did not succeed much with this powerful\n> engine.\n>\n> Please, could anybody give me an example of an input to give to rad? I\n> mean, e.g, a row of ten luminaires with a given ies photometric data\n> (<name>.ies or <name>.dat and <name>.rad, I've them for some producers)\n> and 7 klm bulbs, 10 m above the asphalt road (7 m wide), 3 m from its\n> axis, 50 m apart.\n>\n> Moreover, I need not only a view, but average luminance of the road and\n> ``uniformity ratios'' as well, from the view of a driver (1 m above the\n> road, 1 m from its axis). (I see, Chapter 7 of Rendering with Radiance\n> would say it, but it is not on-line and I've not the printed copy.)\n>\n> dark and peaceful skies,\n> Jenik Hollan\n>\n> PS.\n>  As an advocate of prevention of light pollution\n> (http://www.astro.cz/darksky is a hint, most my texts are just in Czech\n> however), I need to be able to compute the same things as lighting\n> professionals, but with a free software, of course.\n\n\n\n\nThere are many definitions of free software.\n\n\nIf your concern is just to avoid the costs, and if your work is\nabout research and education, then you could get an educational\nlicense of Rayfront, which would make the answer to most of the\nabove questions much simpler. You would still need some CAD\nsoftware to build your geometry model, but there are low cost\nsolutions to that as well. You can then calculate the required\naverage values and other ratios with a spreadsheat from the\nnumerical output. Contact me directly if you're interested.\n\n\nOther than that, really answering your questions would require\na repetition of almost all of \"the book\" (or one of the manuals\nfor Radiance). There are no simple recipes for this kind of tasks\nif you only have the bare Radiance engine at your hands. Radiance\nis an open toolkit, whch requires you to supply some of the logic\nby yourself, unless you are using a more abstract toolkit.\n\n\nYour question is a bit of the \"tell me everything\" type.\nYou will have to study the documentation in any case, even if\nyou use one of the user interfaces available. And I really\nrecommend to get a copy of the book, just for the understanding\nof what you're dealing with.\n\n\nMaybe this is not the answer you hoped for...\n\n\n\n\nRegards\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch.com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2001-October/000059.html).</sup>", "id": "radiance-general_000059", "created_by": "Georg_Mischler"}