{"topic": "Official RADIANCE 3.6 release", "category": "radiance-general", "attachments": [], "created_by_name": "Greg Ward", "created_at": "October 22, 2004 at 12:37AM", "body": "Well, it's about time.\n\n\nWith Georg Mischler's and Peter Apian-Bennewitz's help, we now have a \nnew, official release of Radiance: Version 3.6.  This is essentially \nthe HEAD release with an official designation, so the only real benefit \nto installing it is knowing where you stand in relation to other users \nof the system.  Also, we have made Linux and Mac OS X binaries \navailable for your convenience, and with the generous help of our \ncommunity, will hopefully be adding to this list in the days and weeks \nahead.\n\n\n From the U.S., the new distribution may be downloaded from the LBNL \nRadiance website:\n\n\n\thttp://radsite.lbl.gov/radiance/download.html\n\n\n From Europe, it will be closer to use Peter's radiance-online server:\n\n\n\thttp://www.radiance-online.org/software/\n\n\nNote that the links to binaries may not be updated immediately for the \nnew release.  To find out what release you have installed, \"rpict \n-version\" should tell you.  The official 3.6 version will say:\n\n\n\tRADIANCE 3.6 official release 21 Oct 2004 by Greg Ward\n\n\nIncidentally, I have a number of CDs leftover from the workshop.  If \nanyone wants to send me a self-addressed, stamped envelope, I'll be \nhappy to mail one out to them.  The postage is probably a dollar or so, \nand the envelope has to fit a CD.  Probably most of you who have an \ninterest have already downloaded a copy from radiance-online, but in \ncase there are some folks stuck with a 56K modem, this is your chance.\n\n\n-Greg\n\n\nP.S.  My address for the CD offer:\n\t1200 Dartmouth St., #C\n\tAlbany, CA  94706-2358\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-October/002066.html).</sup>", "id": "radiance-general_002066", "created_by": "Greg_Ward"}