{"topic": "Solid acrylic cylinder", "category": "radiance-general", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "September 14, 2001 at 11:17AM", "body": "Barbara Matusiak wrote:\n\n\n> I am trying to simulate a cylinder made of solid acrylic material, lying on\n> the table by the window. I defined the sky as \"sunny sky with sun\". The\n> sunlight is incident on the cylinder. I used the \"dielectric\" material\n> description and the primitive \"cylinder\".\n>\n> You can see on the picture, that the cylinder is transparent, but there is\n> no any spot of the sunlight that comes through the material. I gues the\n> reason is that the dielectric material is not a secondary light source.\n>\n> Has anybody an idea which other \"material\" should I use?\n\n\n\n\nAs Peter already mentioned, you'd need a forward raytracer to\ndo this \"right\".\n\n\nIf you're really desperate, then you could try to cranc up the\nnumbers of diffuse rays to really insane values (-ad >10000 ?)\nand hope that you generate enough rays on paths that actually hit\nthe sun through your cylinder to get some visible effects. As\nlong as the receiving surfaces are close enough to the cylinder,\nsomething *might* become visible, but it certainly won't be\nrealistic on a numerical level. The sun is much to small for that.\n\n\nYou can see that *in principle* it does work when all elements\nare very close together, and the light source is very big, on\nthis page:   http://www.q-bus.de/Blender/test009.html\nThe first picture made with Radiance is the only one where the\nhighlight inside the shadow of the glass sphere has a square\nshape, which is what you'd expect given the square light source.\nBut this really rather happens almost by chance (and of course\nbecause Radiance follows physical models in the core). The\nbackwards raytracing method used by Radiance makes caustics\nextremely inefficient in almost any other situation, eg. with\nsmaller light sources, greater distances, and especially with\nnon-trivial scenes that prohibit excessive numbers of diffuse\nrays.\n\n\n\n\nHave fun!\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch.com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2001-September/000046.html).</sup>", "id": "radiance-general_000046", "created_by": "Georg_Mischler"}