{"topic": "RAW capture", "category": "hdri", "attachments": [], "created_by_name": "L.Yimm", "created_at": "January 25, 2006 at 09:29PM", "body": "Greg,\n\n\nThanks for the information on RAW capture....definitely worth more \nthan 2 cents!  I've never been good at the math part of digital \nphotography...my knowledge is purely experiential.  Many years of \nZone system shooting, printing, and plotting film curves.\n\n\n\n\n>\n>The potential benefit you cite for RAW images, the bit depth, turns \n>out to be an illusion.  Although many RAW files contain 12 \n>bits/channel, it's in a linear space rather than the gamma response \n>space of JPEG or 24-bit TIFF, and doesn't actually encompass a \n>greater dynamic range.  (See my page at \n><http://www.anyhere.com/gward/hdrenc/>  and scroll down to \"What Is \n>a Gamma Encoding?\" to more.)  Since the camera and the A/D converter \n>inside the camera are both linear devices, this is in fact why 12 \n>bits is necessary for an 8-bit gamma-encoded output.  Otherwise, \n>you'd end up with horribly visible quantization errors (banding) at \n>the bottom end.\n\n\nI also expect this is why CS2 is inferior in assembling HDRs to \nPhotosphere.   I recently ran a test with the same set of 5 \npanos...and the CS2 image was noticeably contrastier, with banding in \nthe extreme ends of the exposure.   Also the .hdr file size was 4 MB \nsmaller than the one generated in your app.\n\n\nIt's taken me many months of trial and error...but I've finally got \nan all OSX work flow that's reliable and repeatable.\n\n\nI capture 5 or more exposures at each of 6 positions around, using a \nNikon 5700 with FC-E9 full spherical fisheye.  I crop and de-warp \nimages in Photoshop (using a custom plug-in), then stitch in \nStitcher 4 (now 5), then put back the missing EXIF data and do the \nfinally assembly in Photosphere.\n\n\nAnyone else have experience using a non-SLR digital camera for HDR capture?\n\n\nLisa\n\n\n\n\nMANGABABE MEDIA PRODUCTIONS\n1433 - 43rd Avenue, San Francisco, CA 94122 USA\nEmail: yimm at mac.com\nMobile: 415.260.9475\nhttp://www.manga-babe.com\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2006-January/000039.html).</sup>", "id": "hdri_000039", "created_by": "L.Yimm"}