{"topic": "out of memory in avstore", "category": "radiance-general", "attachments": [], "created_by_name": "Casper Esmeijer", "created_at": "May 13, 2008 at 05:54AM", "body": "Hello radiance users,\n\n\nI am performing calculations on illumiance values inside a 22 x 13 x 6 m\ngeometry that is exclusively lit by a sort of rectangular light pipes.\nThere's no direct contribution on the spot where I want to know the\nirradiance values so I've put some emphasis on the ambient parameters. I've\ndone measurements on a scale model so I already have a clue on what the\noutcome should look like. I use rtrace and it goes like this:\n\n\nrtrace -I+ -h -ab 7 -aa 0.05 -as 512 -ad 1024 -ar 10000 -av 0.1 0.1 0.1 -aw\n1 -af ambfiles/trace.amb -dp 512 -ds .2 -dt .05 -dc .75 -dr 3 -dj .7 -sj\n1 -st .01 -lr 8 -lw .001 -e errorfile octrees/room.oct < input > result\n\n\n(Transformation from irradiance to illuminance happens elsewhere.) The\nproblem I'm faced with is that the process runs out of memory (on a 2 Gb\nmemory system). Depending on the platform the process is either terminated\n(mingw) or starts swapping to HD (osx). The error message goes: rtrace:\nsystem - out of memory in avstore. I've tried several alternative settings,\ne.g. leaving out the -av and -aw parameters (that is setting them to -av 0 0\n0 -aw 0) but it won't help. Thuogh reducing the ab setting to 3 solves the\nproblem, I need more bounces to get anywhere near the final result. I also\nwonder if the continuously expanding ambfile behaves normally (it reaches up\nto 1.5 Gb when the process terminates). It seems as if new values are added\nrather that substituted in the ambfile. Or do I have to use some sort of\ncut-off criteria?\n\n\nI am not at all new to radiance, but obviously not familiar enough with the\ncode to sort out this problem. Can anyone help?\n\n\nKind regards,\nCasper Esmeijer\n\n\nP.S. The model is pretty straightforward. For the light pipes I created a\nseparate (frozen) octree and I used the instance surface type and xform to\nput them in place.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-May/005006.html).</sup>", "id": "radiance-general_005006", "created_by": "Casper_Esmeijer"}