{"topic": "setting RAYPATH (was: Upgrading to R4: \"There were some errors.\")", "category": "radiance-general", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "May 12, 2010 at 06:46PM", "body": "Hi!\n\n\nCramer Silkworth wrote:\n> echo $RAYPATH currently yields nothing, so maybe that's the problem \n> (but PATH does include usr/local/bin). My problem is, i'm not really a \n> linux guy, and googling how to set it returns no fewer than a \n> gazillion different places that PATHs are set. Can you tell me where \n> the best place would be, and what exactly the line is (in Ubuntu \n> 9.10)? Sorry, I know it's a newbie question, but there doesn't seem to \n> consensus on the internet (not that there ever really is) on how to do \n> this.\nThis is required ONLY for those not using an installer or package \nmanager. Typically these are developers or advanced Radiance users who \ndo not need this advice. I however add this to complete the thread on \ninstalling Radiance.\n\n\nThe RAYPATH variable contains directories that are searched by Radiance \nat runtime for all scene-related files. This can be geometry, octrees, \nprocedural cal-files, textures,... It is NOT used to search for binaries \n- the system's standard PATH variable is used for that.\n\n\n1) To do anything useful with Radiance, one should have the directory \ncontaining the cal-files coming with Radiance included in RAYPATH. This \nis the lib-directory in the installation target - the default makeall \nscript would probably use /usr/local/ray/lib (you are asked for the \nlibrary location when running makeall). So this is the first.\n\n\n2) Many of us will maintain their own library for textures, cal-files, \noctrees to be used as instances. This one should be the second directory \nincluded, say, /usr/share/radiance/objlib\n\n\n3) There may be a directory containing a similar library, but only for \nuse with one project. This may be a subdirectory of the project, say, \n/home/cramer/project/theater1/lib\n\n\n4) Many of us like to have the current directory in their RAYPATH as a \ndefault. May lead to messing up the system, but is comfortable while \ndeveloping e.g. a cal-file that is not ready to go into the library yet.\n\n\nSo - the RAYPATH should always include 1, 2, and 4, but 3 on a \nper-project base. If you are using the Bash as a shell (probably you do \non Linux), add the RAYPATH to your Bash-configuration in your home \ndirectory:\n\n\ncd\ngedit ,bashrc\n\n\n(if you do not want the Gnome-GUI use nano instead of gedit) and add the \nfollowing line to the end\n\n\nexport RAYPATH=$RAYPATH:/usr/local/ray/lib:/usr/share/radiance/objlib:.\n\n\nThis APPENDS the directories to the RAYPATH instead of overwriting it.\n\n\nFor point 3, you can just include it before starting a simulation by typing\n\n\nexport RAYPATH=$RAYPATH:/home/cramer/project/theater1/lib\n\n\nat the command line before starting a simulation, or you add it to the \nbeginning of a small script that you may use for calling the necessary \ncommands for your simulation.\n\n\nI hope this helps. It should at least explain why you found many \ndifferent RAYPATH-setting in the archives - it really depends on where \npeople keep their stuff.\n\n\nCheers,\n\n\nLars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-May/006876.html).</sup>", "id": "radiance-general_006876", "created_by": "Lars_O._Grobe"}