{"topic": "Updates for gendaylit and evalglare", "category": "radiance-general", "attachments": [], "created_by_name": "Wendelin Sprenger", "created_at": "January 31, 2013 at 07:07AM", "body": "Dear RADIANCE users,\n\n\ngendaylit:\n\n\nwe are happy to announce an updated version (from now on we have version \nnumbers, this release is called 2.0) of gendaylit. It is already \nintegrated in the Radiance CVS system, which means you can download it \nwith the HEAD-release. You can find it also on our web-site here ( \nhttp://www.ise.fraunhofer.de/radiance ) in a zip file, together with a \nWindows-version.\n\n\nVersion 2.0 has the following additional features:\n\n\nif any of the Perez parameters are out of the model parameters, the \nparameters are set to the border and an output is produced (+ a warning \nmessage) \nIf gendaylit is used with weather files, the specified instantaneous \npoints of time may be incorrect.This error occurs due to the fact that \nmeasurement results are frequently defined for time intervals, not for \nspecific points of time.Although gendaylit is working correctly, this may \nlead to wrong outputs especially at low sun altitudes. The \"-l min_angle\" \noption avoids these errors by returning zero values if the sun altitude is \nbelow min_angle degrees over the horizon. The default value is zero; the \nrecommended number for min_angle in the case of using weather files is 1 \ndegree. \nAs the new gendaylit version does not depend any more on additional files \n(except the further processing of the gendaylit outputon perezlum.cal, of \ncourse), it is more stable than the version before. \nWarning messages that are written to stdout, especially at too low sun \naltitudes or at too high or too low sky brightness or clearness, can be \nsuppressed by the -w option. \nThe -v option disappeared. \nThe output during the night has changed: the error message is replaced by \nzero numbers for the Perez coefficients. \nThe sun coordinates are also calculated when the sun is below the horizon. \n\n\nThe man page has been updated.\n\n\nThis updated version has been validated on a measured annual weather data \nset - all possible radiation/illuminance inputs have been successfully \nproven and show high accordance to the measured values.\n\n\nPlease give feedback to wendelin.sprenger at ise.fraunhofer.de if something \nis\nnot working properly.\n\n\nevalglare:\n\n\nthere is also a new version available on the ISE server ( \nhttp://www.ise.fraunhofer.de/radiance ).\nThere are some performance improvements included + some small bugs \nremoved.\nThe current version is now v1.11.\n\n\n\n\nJan + Wendelin\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2013-January/009243.html).</sup>", "id": "radiance-general_009243", "created_by": "Wendelin_Sprenger"}