{"topic": "Ecotect Export Lighting Fixture Color", "category": "radiance-general", "attachments": [], "created_by_name": "Omer Moltay", "created_at": "September 08, 2010 at 08:52AM", "body": "Hello Thomas,\n\n\nThanks for the reply. The funny thing, I am not defining the lights in\nEcotect myself, I am using the default materials. In all cases, those 3\nvalues are 0 (actually sometimes 0.001). And I see no way of modifying\nthose values even though I have played with all the material properties.\n\n\nÖmer Moltay, LEED AP\n\n\n> When I export this model to radiance, I get the following error:\n>\n> 3020: WARNING: Light object 87 is producing no light - check color and\n> lumen output.\n\n\nSo and how is your \"FloodlightNoShielding\" defined in Ecotect?\n\n\n> Indeed, when I look into the RAD file, I see the following:\n>\n> FloodlightNoShielding_dist light FloodlightNoShielding\n> 0\n> 0\n> 3 ? ? ? 0.000 0.000 0.000\n>\n> When I render it this way, there is no artifical lighting. When I convert\n> the \"0.000\" values to \"255\", then I get the desired result.\n\n\nYou don't want to use the display RGB values here (range 1-255). The\nthree values define the intensity of the light source in W/m^2. The\nright value for your _flood_light depends on the definition of the\ndistribution and the size of the fitting in the model.\n\n\n> Now, the\n> problem is, there are so many fixtures in the model that I cannot edit the\n> RAD file each time before simulation. Why is Ecotect creating the RAD file\n> with these values? Is there a bug or is there something that I am missing?\n\n\nBug is always possible with Ecotect but I expect that - as the error\nsuggests - you definition of the light (a type of material in Ecotect)\nis wrong.\n\n\n\n\nRegards,\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-September/007264.html).</sup>", "id": "radiance-general_007264", "created_by": "Omer_Moltay"}