{"topic": "material question: gold mosaic", "category": "radiance-general", "attachments": [], "created_by_name": "Greg Ward", "created_at": "January 07, 2002 at 06:40PM", "body": "Hi!\n\n\nI wish you a happy new year!\n\n\nI am working on a simulation of a certain phase of a historical building. My\njob is to do the light sim, and of course I try to do this with radiance ;-)\nWhile I am getting more and more successful concerning the reuse of big and\nbad CAD-models, I am getting some problems with materials now...\n\n\nI have got quite a lot of material data of the building. Most of the\ninterior has marble surfaces, in different colors, which we have documented and\nwhich should be well representable by radiance modifiers.\n\n\nBut the really difficult part seams to be the gold mosaic. E.g. there is a\ndome which has a surface of gold mosaics, afaik with glass in front of the\ngold pieces afaik. Now I could use a gold material, but this is far from the\nreal interior (while it might be ok to get the light simulation, the impression\nof the dome wouldn't be the same). So I wonder how to define this.\n\n\nSo should I try to use gold with roughness? I know this is a different\neffect, but as I view from quite a distance (in most cases), it might be\nsufficient to get quite close to it.\n\n\nThe best solution seams to be the use of brdfs, as those could really\nrepresent the behaviour of the gold pieces. Do you think this would be necessary,\nand is there anyone who has such data?\n\n\nMaybe someone tried similar things in radiance before and might give me a\nhint?\n\n\nThank You, CU, Lars.\n\n\nBTW: I compiled the 3r4 yesterday on an x86 (K6-2 3D) with gcc on SuSE Linux\n7.0 (kernel 2.2.1x) and this seamed to be ok, I couldn't really verify that\neverything works, but I was able to render a quite big scene.\n\n\n\n\nGMX - Die Kommunikationsplattform im Internet.\nhttp://www.gmx.net\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-January/000111.html).</sup>", "id": "radiance-general_000111", "created_by": "Greg_Ward"}