{"topic": "REGISTRATION DEADLINE FOR RADIANCE WORKSHOP", "category": "radiance-general", "attachments": [], "created_by_name": "Raphael Compagnon", "created_at": "June 17, 2002 at 03:51PM", "body": "REGISTRATION DEADLINE FOR RADIANCE WORKSHOP\n\n\nWhat:\tScientific Applications Using RADIANCE\n\n\nWhere:\tUniversity of Applied Sciences of Fribourg, Ecole d'ingénieurs et \nd'architectes de Fribourg, Switzerland\n\n\nWhen:\tSeptember 30 to October 1, 2002\n\n\nOrganizers:\tRaphael Compagnon and Greg Ward\n\n\nRegistration:\tCHF 200 for speakers\t(approx. 1.5 CHF per Euro)\n\t\t\tCHF 255 for attendees\n\t\t\tCHF -105 discount for students\n\n\nFee Includes:\tCoffee breaks, lunch both days, possibly a dinner, and a \nworkshop CD-ROM\n\n\nHotel:\tRooms will be reserved for participants at discount rates specified \non the registration form\n\n\nDownload registration forms at:\thttp://www.eif.ch/~compag/rw/\n\n\nDeadline:\tAugust 31, 2002\n\n\nPurpose of Workshop:\nTo provide researchers with an opportunity to present their work with \nRadiance, and to share ideas and solutions with workshop participants.\nSpeakers shall give a 20 minute talk, which will be followed by 10-15 \nminutes of open discussion.  No printed proceedings will be produced, but a \nCD-ROM will be distributed to attendees that will include electronic \nmaterials submitted by the speakers and edited by the organizers.\n\n\nWe have received 29 pre-registrations for the workshop, and a list of \nplanned speakers and preliminary titles is broken into categories below:\n\n\nIntroduction\n\n\n\tGreg Ward, \"Radiance 3.4 and Open Source Development\"\n\n\nDaylighting Studies\n\n\n\tGiulio Antonutto, \"a radiance application in daylighting analysis\" (from \nhis thesis)\n\tAnnalisa Simonella, \"daylighting analysis\" (two titles offered -- we liked \nthem both)\n\n\nLighting Analysis\n\n\n\tJack de Valpine, \"Architectural Visualization: Radiance in Production\"\n\tGeorg Mischler, \"Simulating daylight redirection systems\"\n\tHaico Schepers, \"Radiance use in Australiasia: an Engineers experience\"\n\n\nApplications in a Teaching Context\n\n\n\tRaphael Compagnon, \"IRAD: a simple automated simulation program to study \ndaylighting in rectangular room without knowing much about RADIANCE\"\n\tAxel Jacobs, \"Using RADIANCE for teaching lighting simulations on a \nEuropean Masters course\"\n\n\nExtensions, User-interface, and CAD Links\n\n\n\tJean Brange, \"a C4D/Radiance converter which is usable on MacOSX\"\n\tRoland Schregle, \"The RADIANCE Photon Map\"\n\tGreg Ward, \"The Holodeck Interactive Ray Cache\"\n\tJan Wienold, \"Radiance developments at Fraunhofer ISE\"\n\n\nSpecial Materials (BRDF BTDF, etc.)\n\n\n\tPeter Apian-Bennewitz, on material modeling\n\n\nHigh Dynamic Range Images\n\n\n\tMehlika N. Inanici, \"Post Processing of Radiance Images: Virtual Lighting \nLaboratory\"\n\tPatrick Ledda, \"Perception of High Dynamic Range Scenes\"\n\tBernhard Spanlang, \"Creating Lightmaps from HDR using Radiance\"\n\tGreg Ward, \"The Photophile Browser for HDR Images\"\n\n\nSpecial Applications\n\n\n\tAlan Chalmers, \"Very Realistic Graphics for Archaeological Site \nReconstructions\"\n\tRaphael Compagnon, \"PPF: a tool to study solar irradiation and illuminance \nin urban area\"\n\n\nThe names and titles above are not final, and we may get new speakers and \nlose some people before we can provide a proper workshop agenda in \nSeptember.  About half the pre-registrants have said they would like to \ncome but do not wish to speak, and we can accommodate everyone we have \nheard from at this point.\n\n\nBy August 31, we will also need the final titles and abstracts for all the \ntalks, along with any materials the speakers wish to include on the \nworkshop CD-ROM.  At minimum, we would like to get a copy of each speaker's \npresentation in PowerPoint, PDF, or HTML (preferred) format, and a short \nbio with contact information.  If the speaker also has test scenes, images, \nand/or software they would like to share, these would be most welcome.  We \nneed to get all of these materials in order to have sufficient time to \nassemble them into a usable CD-ROM, so we cannot promise to include \nanything submitted after the August 31 deadline.\n\n\nThank you to everyone who responded, and we look forward to meeting you at \nthe workshop!\n\n\nGreg Ward and Raphael Compagnon\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-June/000324.html).</sup>", "id": "radiance-general_000324", "created_by": "Raphael_Compagnon"}