{"topic": "HDRI Digest, Vol 88, Issue 9", "category": "hdri", "attachments": [], "created_by_name": "Clotilde Pierson", "created_at": "February 21, 2017 at 03:06AM", "body": "Dear Alstan,\nDear all,\n\n\n>Clotilde, there is one notable place where my workflow for calibration factors is a little different than yours. I calibrate each image based on a specific luminance >measurement as per Inanici and Van Den Wymelenberg's methods. Generally speaking, this brings my results reasonably close to the measured illuminances in >most cases where overflow is not present. I keep the measurement point near the image center (where vignetting~0) and perform vignetting correction after >calibrating the luminance at the near-center point.\n\n\nWell, I also take several luminance measurements each time I capture a LDR series. I was planning to use these measurements as a means of verification (rather than a means of calibration) to be sure I got the right luminance values with my HDR.\nBut anyway, I imagine that using an in-situ luminance measurement instead of a previously derived calibration factor to calibrate an HDR images does not have a great impact on the results. Both calibration factors (the one derived beforehand and the one derived for each HDR image) should be similar, shouldn’t they?\n\n\nI still have tried to calibrate my HDR image with an in-situ luminance measure:\nWith the Canon EOS 5D Mark II and a Sigma fisheye EX DG 8mm (aperture set on f/11, WB on daylight and all other settings on neutral), I took a JPG series of 17 images (shutter speed going from 1/8000 to 5s). Then I picked a sequence of 12 images out of these 17 jpg images (until there is no pixel <20 in the lightest exposure and no pixel >200 in the darkest exposure). To derive the HDR image, I used hdrgen –a –e –f –g and a response curve I derived previously. I applied the vignetting calibration and the reprojection with the pcomb command in Radiance. I cropped the image to a square (1000x1000) and modified the header (view and exposure).\n\n\nUsing Photosphere, I applied a calibration factor on the central grey card (the HDR gave 77.1cd/m² and I measured 111.9cd/m²). The calibration factor used is 1.45, which is not so far from the 1.48 I was using before. For the other luminance values I measured in the scene, I got these values with the calibrated HDR:\n2660 cd/m² (HDR) VS 2817 cd/m² (real)\n42.4 cd/m² (HDR) VS 41.04 cd/m² (real)\n1740 cd/m² (HDR) VS 1516 cd/m² (real)\nAnd for the illuminance value, I measured 550lux and I got 605lux with the calibrated HDR.\nThese are still big differences in my opinion, and not always on the same side. What do you think?\n\n\n>Secondarily, I'm curious about your vignetting correction process before cropping if you wouldn't mind sharing some more details. I imagine it is difficult to >correct when there is no valid Radiance view associated with the image yet.\n\n\nWell, I derived my vignetting curves exactly the same way that Cauwerts used (we are from the same lab). Then, from these curves, I created .cal files (one for each aperture I use). For instance, I have this .cal file for aperture f/11\n\n\nsq(x)=x*x;\nr=sqrt(sq(x-2825)+sq(y-1879))/1775;  (where I define the radius of the circular image where to apply the vignetting using the pixel coordinates of the centrum)\nsf=1/(1+(K_1*r^1)+(K_2*r^2)+(K_3*r^3)+(K_4*r^4)+(K_5*r^5)+(K_6*r^6)+(K_7*r^7)+(K_8*r^8)); (with K_x the factors I defined)\nro=sf*ri(1);\ngo=sf*gi(1);\nbo=sf*bi(1);\n\n\nThen, I simply use the command: pcomb -f  calFile  input.hdr > output.hdr\n\n\nAlso, I am not sure how the x option works in hdrgen but it seems it is not 100% reliable. I thus decided to manually pick the sequence of input JPG images, removing too light or too dark images myself.\n\n\nBest,\n\n\nClotilde\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2017-February/000622.html).</sup>", "id": "hdri_000622", "created_by": "Clotilde_Pierson"}