{"topic": "Illuminance and luminance values underestimation from calibrated HDR images", "category": "hdri", "attachments": [], "created_by_name": "Clotilde Pierson", "created_at": "February 08, 2017 at 11:10AM", "body": "Dear all,\n\n\nI am using a Canon EOS 5D Mark II with a Sigma EX DG 8mm f/3.5 fisheye lens to capture LDR images. I then use hdrgen with the response curves I defined previously to generate HDR images from these LDR images. I calibrate the HDR images for the vignetting effect and the distortion (equisolid to equidistant projection). Finally, I apply a calibration factor of around 1.39.\n\n\nWhen comparing the vertical illuminance and luminance values of the HDR images with the real measures I took (Minolta LS-110 luminancemeter and Hagner EC1-X luxmeter), I noticed that the HDR images are underestimating the illuminance (e.g. 1217lux instead of 1993lux) and the high luminance values (e.g. 208 cd/m² instead of 402.3cd/m²). I determined the illuminance value of an HDR with Evalglare -V and the luminance values with ximage in Radiance.\n\n\nI also tried only applying default hdrgen (+cropping & header modification to set the VIEW to vta to use in Evalglare) but I still got big differences between the HDR-derived and the measured luminance and illuminance values.\n\n\nIs somebody using the same instruments I am? If yes, do you also happen to have this issue? Or does anybody have already encounter this problem?\n\n\nThank you for your insights !\n\n\nBest,\n\n\nClotilde\n\n\n[Test]\n\n\nClotilde Pierson\nFNRS PhD Fellow | Arch. Eng.\nArchitecture et Climat\nFaculté d'architecture, d'ingénierie architecturale et d'urbanisme (LOCI)\nUniversité catholique de Louvain (UCL)\nPlace du Levant, 1 bte L5.05.04 B-1348 - Louvain-la-Neuve (Belgique)\nclotilde.pierson at uclouvain.be<mailto:clotilde.pierson at uclouvain.be>\nTél. 32 (0)10 47 91 52 - Fax 32 (0)10 47 21 50\nhttp://www.uclouvain.be/architecture-climat.html\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2017-February/000610.html).</sup>", "id": "hdri_000610", "created_by": "Clotilde_Pierson"}