{"topic": "Comparison Daysim with Measured data", "category": "radiance-daysim", "attachments": [], "created_by_name": "S.J.M. Koenders", "created_at": "February 09, 2017 at 04:54AM", "body": "Dear readers,\nCurrently I'm using Daysim (version 3.1b (beta)) for the simulation of irradiance on a new type of BIPV-system. According to what I've read in several articles, this should be possible. I am comparing my simulation results to irradiance data measured at a full-scale mockup of the BIPV-system using on-site recorded solar radiation data as input for the simulations. For a large part of the year, Daysim predicts almost the exact same irradiance as measured. However, suddenly from September on, Daysim significantly under-predicts the results.\nWhen looking at daily sun profiles and irradiance simulated and measured, it appears that Daysim uses only the diffuse irradiance instead of both direct and diffuse irradiance. Figure 1 shows a typical day, early in the year, where you can see that the agreement between measurement and simulation is quite good. Figure 2 is for 25 September, where you can see that the measured irradiance is much higher than the simulation results from Daysim and that irradiance simulated with Daysim follows almost exactly the diffuse irradiance.\nFigure 1: https://www.dropbox.com/s/11xu2ivuyf866zg/Comparison%20Daysim%20%26%20Simulation%20-%205%20May.png?dl=0\nFigure 2: https://www.dropbox.com/s/7wj8svs5nraex54/Comparison%20Daysim%20%26%20Simulation%20-%2025%20September.png?dl=0\nI've checked the following things:\n\n\n-        Perhaps there was a flaw in the weather file. I'm using a weather file created from a measurement station (DNI and DIFHI) and validated that it is correctly implemented in Daysim. I simulated the system also with a weather file based on an EPW file. Similar results occur.\n\n\n-        Perhaps there is a flaw in the design. I've modelled the system in SketchUp and imported this in Daysim. To see if the model was corrupted I have built a simple cube in SketchUp with sensors on the same orientation as the PV-system. Again similar results occur.\nEven though there are some slight changes during the year, one would expect a mirroring of the results around January (January to June show similar results as July to December, but then mirrored). However, the results in January from the simulation in Daysim show again almost perfect results with the measurements.\nI've talked to several people about these deviations, but none of them can give a clear explanation why this happens.\nI hope that some of you can give an explanation and help me with this problem.\nWith kind regards,\nStefan Koenders\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-daysim/2017-February/000138.html).</sup>", "id": "radiance-daysim_000138", "created_by": "S.J.M._Koenders"}