{"topic": "specifying sources", "category": "radiance-general", "attachments": [], "created_by_name": "william reynolds", "created_at": "March 27, 2006 at 05:16AM", "body": "hi there\ni'm after a bit more advice about light sources than i can find in th \nedocumentation, and i was wondering if anyone had any suggestions...\n\n\nfirstly, i want to specify the brightness of my light sources \naccurately. i am using photos (hdr images assembled from several photos) \nto specify the output distribution of the source (theatre spotlights) \nand i know the \"light output in lux\" at various distances from the lens \n(from here: \nhttp://www.seleconlight.com/english/support/english/acclaim%20pc.pdf  ) \nand i assume that they give the figure for the centre of the beam, \nrather than the average over the whole field.\nwhat i'm stuck on is what figures i should use for the (rgb) brightness \nin the rad file description of the \"light\" material.\n\n\ni need the light output of these sources to be physically accurate, \nbecause i want to compare them to models using ies-data described \ndistributions.\ni would like to be able to colour correct these sources (i believe the \nies2rad will do this automatically) given the colour temperature of the \nbulb.\n\n\n\n\nsecondly i want to colour my lights, as though they had colour filters \nin front of the lense, and i dont really understand the colour space \nthat radiance uses. can anyone point me towards any resources on this?\ni want to model the colours of commercially available filters (such as \nthis one:  http://www.leefilters.com/LPFD.asp?PageID=248  ) but i cant \nfind any RGB transmission data for them. is it possible to convert the \nXYZ values given on the data sheet to RGB?\n\n\n\n\nthanks for your help again\nwill\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-March/003524.html).</sup>", "id": "radiance-general_003524", "created_by": "william_reynolds"}