{"topic": "FIRST ANNOUNCEMENT - 15TH ANNUAL INTERNATIONAL RADIANCE WORKSHOP", "category": "radiance-general", "attachments": [], "created_by_name": "Giorgio Butturini", "created_at": "February 23, 2016 at 02:38AM", "body": "Dear Radiance Users\n\n\nManens-Tifs, in collaboration with EURAC Research, is pleased to host the\n15th Annual International Radiance Workshop from Monday, August 29th to\nWednesday, August 31th  2016 at Manens-Tifs headquarters, located in Padua\n(Italy). \n\n\nWith a long tradition of gathering academics, consultants and anyone\ninterested in lighting related subjects using Radiance software, this event\nis a great opportunity to learn and exchanging ideas. \n\n\nAttendees are invited to share examples of work they have performed using\nRadiance, or that is in progress, in a prepared 30-minutes presentation.\nCome to share your knowledge and/or learn about the latest Radiance\nfeatures, developments, and opportunities to apply Radiance in your\nprofessional practice. Connect with enthusiasts from around the world who\napply Radiance in research,  lighting design, daylighting, animation,\nsimulation, and rendering activities.\n\n\nIf you are interested in presenting your work, which is highly encouraged,\nplease upload a short abstract (300 words or less). \n\n\n\n\n\n\nSeparate proposals from a single presenter on more than one topic or project\nare acceptable.\n\n\nPresenters will receive a $50 discount on their registration fee. Students\nare entitled to a 50% discount. Details on registration and fees will be\nshortly available.\n\n\nPresentations will be made available after the workshop on the web.\n\n\n\n\n\n\nOnline workshop registration as well as the abstract submission will open\nshortly.\n\n\n\n\n\n\nHOW TO GET TO MANENS-TIFS HEADQUARTERS IN PADOVA\n\n\nManens-Tifs is located in  industrial area of Padua ( see:\n<https://goo.gl/maps/vARd1SKhn1U2> https://goo.gl/maps/vARd1SKhn1U2 ) at\nabout 8 kilometers from downtown Padua and the main railway station.\nManens-Tifs is connected to downtown by public bus line n.7 (departing in\nfront of main train station), however a private shuttle bus to and from\nPadua will be organized for those staying in city center  hotels\n\n\nHOW TO REACH PADUA\n\n\n- By Plane: Padua is located near to International Marco Polo airport in\nVenice (43 km), and Sant'Angelo airport in Treviso (50 km). Different public\ntransportation services are available. A shuttle service is also available\nfor attendees travelling to Padua from Marco Polo airport in Venice or Sant\nAngelo airport in Treviso. For availability, prices and reservations, please\nvisit  <http://www.airservicepadova.it> http://www.airservicepadova.it.\n\n\n- By Train: Padua is located on the main railway network and there are many\nhigh speed trains connecting to Venice, Verona, Milano, Bologna, and other\nimportant cities.\n\n\n- By Car: Attendees travelling from Milan or Venice on the A4 motorway must\nfollow directions to Bologna and exit at \"Padova Zona Industriale\",\nManens-Tifs is located at about 400 m on your left. \n\n\n\n\n\n\n\n\n\n\nFurher information on recommended hotels and special rates will be shortly\navailable\n\n\n\n\n\n\nWe look forward to your participation and attendance at this event.\n\n\n\n\n\n\nSincerely,\n\n\nGiorgio Butturini and Roberto Zecchin, Manens-Tifs\n\n\nGiuseppe De Michele and Luca Baglivo, Eurac\n\n\n\n\n\n\nFor more information please contact us at following email:\n2016RadianceWS at manens-tifs.it\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-February/011515.html).</sup>", "id": "radiance-general_011515", "created_by": "Giorgio_Butturini"}