{"topic": "HDRI capture of LED", "category": "hdri", "attachments": [], "created_by_name": "Yulia Tyukhova", "created_at": "February 19, 2012 at 09:31PM", "body": "Hello everybody!\n \nI’ll provide the summary of my research and have questions within the\nsummary.I would appreciate any of your help!\n \nMy research investigates if HDRI technique can precisely capture\nluminances of small bright light sources (e.g. LED garage fixtures) with narrow\nlight distributions.\n \nI was able to figure out luminance values for a single LED, which can be\ncompared to the ones from HDR images. But I have a couple of questions/concerns on HDRI technique and Photosphere. \n \nAt first, I’ve used “regular” scene to retrieve response\ncurve of the camera (large smooth gradients with very dark and bright areas,\nand had reflectance standards for the absolute calibration).\nCamera: EOS T1i Rebel with 28-105mm lens, at 28mm\nCalibrated at the grey reflectance sample 186.45 cd/m2\nCF=0.957\n\n\nI’ve got the following RC for RGB:\nred(r) = -6.434199e-03+ 4.518039e-01*r + 1.291426e+00*r^2 + 1.802896e+00*r^3;\ngreen(g) = -5.804720e-03+ 4.175837e-01*g + 1.176582e+00*g^2 + 1.721643e+00*g^3;\nblue(b) = -4.376831e-03+ 3.784418e-01*b + 1.075695e+00*b^2 + 1.658471e+00*b^3\n \nIf I look at the histogram of the scene, maximum\nluminance within the scene is 60,291 cd/m2. \n \nThen I use this RC to analyze HDRI of a captured LED.\nThe value is 230,000 cd/m2 for a single LED, which is low (it’s has\nto be around 7*106 cd/m2). So, it underestimates the\nluminance. \n \nIt seems like calibration point is critical here. I’ve\ndecided to try to capture a different scene for deriving RC with a wider range.\nIt would make sense that camera has to see higher luminance values in order to\naccurately measure them later. The dynamic range has to cover measured values.\n \n1.     1. How does\nPhotosphere deals/approximates/calculates the upper end of the curve? I assume\nit gives more weight to mid tone values? But what happens with high luminance\nvalues? \n \nSo, the new brighter scene was picked with the direct\nsun! But in order to avoid the damage of the camera’s sensor, measurements were\ntaken before the sunset. \n \nIn the new brighter captured scene without the\ncalibration all values for reflectance standards were overestimated, while the\nvalue for the sun underestimated. Then I decided to calibrate my scene at the\nsun!\nBut when I apply absolute calibration, it simply\nmultiplies CF to all values.\n \n2.     2. I assumed when CF\nis applied, it does not equally change all values, but does it proportionally\nto RC (since it is not linear).  Why does\nit do it equally for the whole range?\n \nLsun=80*106 cd/m2. And of course\nCF is very big 391. \n \nNew RC:\n\n\nred(r) = 3.219064e+00+ -2.655078e+01*r + 9.351069e+02*r^2 + -2.115052e+03*r^3+1.594538e+03*r^4;\ngreen(g) = 2.094164e+00+ -1.468109e+00*g + 7.306838e+02*g^2 + -1.720743e+03*g^3+1.380693e+03*g^4;\nblue(b) = 1.049078e+00+ 1.591820e+01*b + 5.848958e+02*b^2 + -1.461635e+03*b^3+1.251033e+03*b^4\n \nBut then something interesting happened. When I\nanalyze LED, it gives a value of 79*106 cd/m2. So, it\njumps to this upper limit calibrated with the sun previously. \n(I had similar results for EOS 7D with the lens 16-35mm,\nat 16mm)\n\n\n \n3.     3. Does photosphere\ncompress the response curve, so at the upper end all values above certain\nthreshold will have the same number?\n \n4.    4.  Any additional\nsuggestions on properly obtaining and calibrating HDRI for this purpose?\n \nThank you,\nYulia Tyukhova\n\n\n\n\nFulbright Scholar, \"Intern LC\"\nArchitectural Engineering Graduate Student, UNL-Omaha, NE, USA\nB.E. and M.E. in Lighting Engineering (MPEI), Moscow, Russia\njtyukhova at yahoo.com\nytyukhova at unomaha.edu\n+1 (402) 996 0910  \nPKI 247\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2012-February/000401.html).</sup>", "id": "hdri_000401", "created_by": "Yulia_Tyukhova"}