{"topic": "Call for SimAUD 2017", "category": "radiance-general", "attachments": [], "created_by_name": "Timur Dogan", "created_at": "July 28, 2016 at 10:55AM", "body": "Dear RADIANCE community,\nWe are pleased to announce the call for SimAUD 2017 and are looking forward to your participation.\nBest,\n\n\nTimur Dogan\nAssistant Professor Cornell AAP\n\n\n240B Sibley Hall,\nIthaca, NY 14853,\nUSA\n\n\nESL<https://es.aap.cornell.edu/> | Portfolio<http://www.timurdogan.de> | Archsim<http://www.archsim.com> | DIVA<http://www.diva4rhino.com> | UrbanModeling<http://www.urbanmodeling.net>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSymposium on Simulation for Architecture and Urban Design\nSimAUD 2017 – Toronto, Canada\nMay 22-24, 2017\n\n\nSymposium Chairs\nMichela Turrin and Brady Peters\nM.Turrin at tudelft.nl<mailto:M.Turrin at tudelft.nl> and Brady.Peters at daniels.utoronto.ca<mailto:Brady.Peters at daniels.utoronto.ca>\nScientific Chairs\nWilliam O’Brien, Rudi Stouffs, Timur Dogan\n\n\nSimAUD2017 – Call for Submissions  [ http://simaud.com/2017/call_for_submissions.php ]\n\n\nTo respond to the increasing complexity of cities and buildings, computer simulations for the built environment are not only required to support both specific disciplinary expertise and interdisciplinary collaborations, but also address all scales of the built environment, from exploring new urban configurations to the design of building components. Consequently, innovation in computer simulations questions disciplinary boundaries and derives from the convergence of knowledge from different fields. The 8th annual Symposium on Simulation for Architecture and Urban Design (SimAUD) tackles the interdisciplinary aspects of the development and use of simulations to measure, predict, assess, comprehend and manage the performances of buildings and cities, in regard to their technical and non-technical requirements. SimAUD offers the opportunity to present innovative simulation methods and techniques and to discuss their roles in urban planning, architecture, engineering, construction, and management. This year's event will be held at the MaRS Discovery District and at the University of Toronto in Canada, in the heart of one of the largest urban innovation hubs.\n\n\nIn past years, attendees have included researchers and practitioners in the fields of urban planning and design, architecture and building science, visualization and construction, as well as software developers, managers, educators, and business professionals. Past SimAUD symposia have attracted exceptionally high-quality submissions (papers, notes, works in progress, datasets, and videos). We highly encourage you to take advantage of the free downloads of previous years' proceedings<http://simaud.org/proceedings/>.\n\n\nWe invite you to submit and present an original contribution for SimAUD2017. All submissions are peer-reviewed and considered for selection by the Scientific Committee. All accepted full papers (8 pages) will be published in the ACM Digital Library<http://portal.acm.org/dl.cfm>. However, all the accepted submissions (both full and short papers) will be published in SimAUD’s proceedings. Please observe the submission types and deadlines on the Symposium website. SimAUD is run collaboratively with ACM/SIGSIM<http://www.sigsim.org/> and is sponsored by The Society for Modeling and Simulation International<http://www.scs.org/>.\n\n\nAreas of Interest\nSimAUD topics include, but are not limited to:\n•Simulation-based Design Generation and Exploration\n•Simulation-Based Collaborative Design\n•Simulation-Based Design Tools and Methods\n•Multidisciplinary Design Optimization\n•Simulation Performance and Scalability\n•Building Comfort and Energy Performance\n•Simulation of Occupant Behavior\n•Simulation of Building Control\n•Physics-Based Simulation in Design\n•Visualization of Simulation Data\n•Urban-Scale Modeling\n•Design Agency & Multi-Agent Systems\n•Intelligent Buildings & Building Lifecycle Management\n•Sensor Networks & Building Performance Monitoring\n•Interactive Environments\n•Responsive Facades\n•Robotic Fabrication in Design\n\n\nSubmissions Types\nResearch works can be submitted in several categories:\n•Full Papers (Archived at the ACM Digital Library)\n•Short Papers (Not archived at the ACM Digital Library)\n•Invited Papers (Archived at the ACM Digital Library)\n•Posters & Videos (Not archived at the ACM Digital Library)\nNote: All submissions are published in SimAUD’s Proceedings.\n\n\nImportant Dates\nAbstracts Submission: September 19, 2016\nPapers/Posters Deadline: December 5, 2016\nAcceptance Notification: January 23, 2017\nCamera-ready Deadline: March 6, 2017\nConference: May 22-24, 2017\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-July/011864.html).</sup>", "id": "radiance-general_011864", "created_by": "Timur_Dogan"}