{"topic": "Radiance feedback-form now online", "category": "radiance-general", "attachments": [], "created_by_name": "Peter Apian-Bennewitz", "created_at": "January 01, 2005 at 12:01AM", "body": "Dear coworkers,\n\n\nhope you all got through the wintertime holiday period well !\n\n\nThose of you already back at the PC, - you could be the first to try the\nnew online feedback form at\n\n\n    http://www.radiance-online.org/survey1/\n\n\nMy motivation for it was to get more info on the Radiance community,\nespecially from the silent majority of users who read the mailing list,\nuse Radiance and may have some views and ideas just below their level of\nactive posting to the list.\nE.g.: There's got to be a couple of students at Universities worldwide\nwho are confronted with Radiance each course and from which we never\nhear. Especially when they _don't_ liked it.\nLikewise there are probably consultants using Radiance, whose opinion is\nvaluable and should influence Radiance future.\n\n\nWhether the idea works out, depends on your input. Which in turn may\ngive the folks at the research labs and universities some indication as\nto what is needed next.\nThe number of questions is kept at a minimum (8) and the answers are\nselectable multiple choice. So the entry is fast and further more, it's\nanonymous.\n\n\nThe whole thing is planned to be used continuously over the next years,\nrather than being a one-time snapshot. The current state of the survey\nis listed on a second webpage, so anyone can monitor its progress.\n\n\nTechnically each entry is stored in a MySQL database, together with a\ntime stamp and the client IP number. The latter is handy in case some\nbored bad guy on the Internet floods the entry form, otherwise it won't\nbe made public. The time stamp allows for analysis over the next years,\nwhile the database structure allows for correlations like \"what do\narchitects see as missing\".\n\n\na happy start into 2005 to all of you\n\n\n-Peter Apian-Bennewitz\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-January/002254.html).</sup>", "id": "radiance-general_002254", "created_by": "Peter_Apian-Bennewitz"}