{"topic": "Color appearance and color temperature", "category": "radiance-general", "attachments": [], "created_by_name": "Greg Ward", "created_at": "February 07, 2002 at 10:35AM", "body": "> Does anybody know tools that might help in tuning chromaticity (color\n> temperature) adaptation for Radiance renderings? For example, if you \n> define\n> a tungsten source (2856 K), the result is far too reddish to be \n> plausible.\n> This question arises when mixing sources of different temperatures, \n> such as\n> daylight and incandescent light. (When this is not the case, I suppose \n> it\n> is reasonable to use neutral source color, which in the Radiance RGB \n> system\n> is near 5500 K).\n>\n> In pcond you have an opportunity to define, besides the RGB primaries, \n> also\n> the white point, with the -d option. Does it include any \"color \n> appearance\n> model\" or something of a kind which could be useful? Any other ideas? In\n> photography there are filters defined in \"mired\" units, which mean\n> reciprocals of megakelvins. They shift the overall color temperature \n> range.\n> So, at least in the spectral domain a feasible transformation might be\n> quite straightforward.\n>\n> Regards,\n> Markku N.\n>\nOne of the new features in Radiance 3.4 is a von Kries white-point \ntransform built into the -p option of pcond (and other programs).  This \ntransform does a reasonable job of simulating the apparent colors under \na different illuminant, and is an improvement over the straight color \ntransform that was used previously.  However, when you have a mixture of \nilluminants in your rendered scene, there is no accepted adaptation \ntransform for such a condition.  A number of researchers have worked on \nthis problem, and no one has proposed a workable solution to my \nknowledge.  The best you can do is pick an average of the illuminants \nthat seems right for the part of the scene you are viewing.\n\n\nThe issue of white balance is separate from the issue of spectral \nrendering, but as long as we're on the topic, one of the things people \nhave requested over the years is a means for full spectral rendering in \nRadiance.  As it turns out, this is difficult for the very silly reason \nthat all the materials and patterns have arguments whose count would \nchange with the number of spectral samples.  Choosing anything other \nthan three samples will make Radiance input files incompatible with the \nchange.  In hindsight, it would have been much better to do things the \nway I did them in the Material and Geometry Format (MGF), which \nseparates color into its own entity, with a number of different ways to \nspecify it.\n\n\nBe that as it may, it is possible to obtain accurate spectral renderings \nof a scene with a single illuminant, provided you precompute the \nadjusted RGB color of the surfaces using a technique I described in my \nmost recent paper at the Color Imaging Conference.  You can get a PDF \ncopy of the paper through the link below if you want to read about the \ndetails.\n\n\n-Greg\n\n\nhttp://viz.cs.berkeley.edu/gwlarson/papers.html\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-February/000147.html).</sup>", "id": "radiance-general_000147", "created_by": "Greg_Ward"}