{"topic": "Approximating the gross daylight flux through venetian blinds.", "category": "radiance-general", "attachments": [], "created_by_name": "George Chadwick", "created_at": "October 27, 2004 at 05:46PM", "body": "Hello Radiance people\n\n\n1) Anything wrong with this idea?:   \u0091If venetian blinds are involved, \nto get to the daylight factor with an overcast sky environment, \ncut a corner by using a few primitives with complex behaviour to \napproximate the gross daylight fluxes through the blinds, instead of \nmodelling the same using an awful lot of fiddly primitives albeit \nwith simpler materials.\u0092 (More details below.)\n\n\n2) If you have tried to use BRDFs or other types of materials with \nthe same idea in mind do you have experiences to relate, \nsupportive or otherwise? \n\n\n3) Does anybody know where I can get good data on venetian blinds re \ntypical performance and typical material surface properties?\n\n\n4) Details:\n\n\nI\u0092m usually under pressure to give the right answer yesterday, at all \ncosts and at no cost. So I went for quick and dirty. I asked around \nwhether quick and dirty would be fine if in professional hands \nwith some of the others here.\n\n\nThis generally got a lot of smiling for some reason; personally I can\u0092t \nsee how being forced into lack of rigour due to expedience could be \ncause for amusement in any true professional. I took their smiling as \nshowing their support for my approach.\n\n\nThe supporting environment was no magnificent computing facilities, \nno Unix, no full-scale lab test rigs, no photometers etc., as yet no \nCygwin, Photon Map, or Raydirect/Exergia's radiance \npreprocessors for blinds/mktis, or anything more recent than the \ncompiled binaries from DeskTop Radiance. I haven\u0092t tried using \nprismatic materials yet. I\u0092ve also yet to read the 2001 paper on daylight \nsimulations for a full-scale test office with outer venetian blinds that \nChristoph Reinhart kindly sent me, and the stuff re Photon Maps. \nAdding onto all that is my general ignorance and minimal Radiance \nexperience, so you'll agree that it's a truly impressive setup.\n\n\nReasonable rigour for my purposes was expectation of a daylight factor \nend figure being within 2:1 of \u0091actual\u0092. I.e. the final answer only needed \nto distinguish whether the daylight factor was either say 0.5% to 1%, \nor 1% to 2%. \n\n\nThe rad files I made grossly simplified the building\u0092s complex facade so \nas to more easily do the computing and extract the daylight factor \nstatistics I needed from the Radiance lux levels. \n\n\nThe daylight problem was a large geometrically complex multi-storey \natrium building, with a triple-glazed façade with 3 kinds of glass and \ninterstitial venetian blinds, proposed for a built-up city centre location \nwith complex geometry and lots of materials to model. The design basis \nwas the usual overcast sky. Not interested in direct sunlight.\n\n\nClearly there\u0092d have been some differences from the real world in \nassuming the materials and surface reflectances etc., but I'd only \nwanted the rough illuminance distributions anyway; not the fine details.\n\n\nSo being neither purist nor pure, I pressed on and:\n\n\n- modelled a small Test Room A with the triple façade modelled \n  accurately in geometric detail, using Optics5 data for each sheet \n  of glass, and assumed reflectances and detailed geometry for the \n  venetian blinds.\n\n\n- modelled a Test Room B of the same dimensions, but with a \n  pseudo-façade of simple plane elements with BRDFs,\n\n\n- tweaked the BRDFs until the renderings compared well between \n  Rooms A and B under 3 outside environments, with external \n  obstructions, materials and ground planes,\n\n\n- applied the façade and BRDFs of Test Room B to my big models, \n  so I can crank out the illuminances and extract the daylight statistics.\n\n\nEt voilà, yet how far will I be able to trust the end result?\n\n\nRegards\nGeorge Chadwick\n\n\nPossibly related stuff found in these threads:\n-   Gerold Furler   - query on BRDF - Venetian blinds \n     - Feb 1995\n-   Greg Ward - Amarpreet Sethi - Barbara Matusiak -Peter \n     Apian-Bennewitz -Carsten Bauer  - - \u0091Modeling blinds - \n     Suggesting photon-map\u0092 Oct 2003.\n-   Greg Ward -Jack de Valpine - Daniel Lash - Alex Summerfield - \n     - \u0091Query about accurately modelling glazing\u0092 Jan 2004.\n-   Anthony Farrell - Phillip Greenup - Jack de Valpine - - \n     \u0091Prismatic glazing-blind reflector system analysis\u0092 \n     Feb 2004.\n\n\n\n\n\n\n\n\n ALL-NEW Yahoo! Messenger - all new features - even more fun!\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-October/002078.html).</sup>", "id": "radiance-general_002078", "created_by": "George_Chadwick"}