{"topic": "Annual simulations + BSDF", "category": "radiance-general", "attachments": [], "created_by_name": "Andy McNeil", "created_at": "October 15, 2009 at 12:17PM", "body": "Hi Everyone,\n\n\nI¹m trying to figure out how to incorporate clearshade from panelite (\nhttp://www.e-panelite.com/downloads/Panelite_IGU_Oct08.pdf ) into an annual\ndaylight simulation.\n\n\nI¹m considering the three-phase method Greg described on slide 11 of in his\nworkshop #6 talk:\nhttp://www.radiance-online.org/radiance-workshop6/GregWard/WardUsingBTDF_tal\nk.pdf\n\n\nWhich in theory seems pretty straight forward:\n1 ­ determine daylight coefficients incident on the glazing\n2 ­ use a BSDF to define the relationship between incident light directions\nand exiting light distribution for the glazing.\n3 ­ determine the relationship between exiting light directions and\nilluminance in the space.\n4 ­ multiply results by many other results to produce an annual illuminance\nprofile.\n\n\nHowever I face a couple of challenges for which I seek advice:\n\n\nChallenge 1 ­ I don¹t have BSDF data from panelite, they are looking into\nhaving a sample measured but that won¹t help me right now.  I was thinking\nthat I could build a radiance model of panelite and use rtconrib to generate\na BSDF of sorts.  Is this a terrible idea?\n\n\nChallenge 2 ­ Writing a rtcontrib expression to separate contributions\naccording to exiting direction from the portal.  Can I use directions from\ntreganza.cal?  Is there some reason that this isn¹t a good idea?  Klems\ndirections has been mentioned.  I have no knowledge of klems directions.  Is\nthat a better alternative?\n\n\nAnd I guess the overall questions:  Are there more challenges I have yet to\ndiscover?  Is anyone who has done this willing to share experiences?  Would\nI be better off creating a model with thousands of cylinders between glass\npanes and using rtcontrib + brute force?  Is there an even better method\nthat I haven¹t discovered trolling through archives?\n\n\nThanks,\nAndy\n\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-October/006283.html).</sup>", "id": "radiance-general_006283", "created_by": "Andy_McNeil"}