{"topic": "Multiple spherical glow sources?", "category": "radiance-general", "attachments": [], "created_by_name": "Mark Stock", "created_at": "September 14, 2009 at 01:15PM", "body": "Hello,\n\n\nI am working on a star map for use with night renderings, and it \nseems like it should be decomposed into two layers: one is a \nhigh-resolution imagemap showing the stars themselves, the other \nis a low-resolution \"light map\" that should be used to actually \nilluminate the scene.\n\n\nThe problem is that I want the \"light map\" layer to do the \nillumination, but I don't want it to be visible. I want the image \nmap to appear in the sky in the final rendering.\n\n\nI know that I can use maxrad=-1 in the image map glow source to \nprevent it from contributing to scene illumination, and maxrad=0 \nto allow the light map to illuminate. But mixfunc must be placed \nbetween the colorpict and the glow source, forcing me to either \nallow both to illuminate, or neither. But when the imagemap \ncontributes to illumination, the result is very noisy \n(obviously).\n\n\nThis wouldn't be a problem if I could use two sky-dome sized glow \nsources in the same scene: \"skyglow source skydome 0 0 4 0 0 1 \n360\". But Radiance only sees the last one to be defined.\n\n\nAnd I can't make the light map into an \"illum\" because it then \ngets treated as a point source at the zenith of my \"source\" \ndescription (ignoring the 180-degree size of the source disc).\n\n\nDo I need to add transparency to the imagemap before making it \ninto a rad=-1 glow source, so that when a ray is traced between \nthe stars, it hits the illuminating light map rad=0 glow source? \nI am reluctant to include another circa-gigabyte imagemap to the \nscene just for that.\n\n\nAm I missing something else or is this impossible?\n\n\nMark\n\n\nPS. Shouldn't the file size limit for colorpict images be raised? \nI get a warning for using even a 134MB picture file. I intend to \ngo much larger.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-September/006216.html).</sup>", "id": "radiance-general_006216", "created_by": "Mark_Stock"}