{"topic": "Next year's workshop", "category": "radiance-general", "attachments": [], "created_by_name": "Greg Ward", "created_at": "September 27, 2010 at 06:22PM", "body": "Thanks to all who came to this year's workshop, especially to Jan Wienold and Sandra Mende who did an excellent job on organization.  Thank you also to the presenters -- I thought this was a very interesting set of new developments this year from multiple quarters!\n\n\nOn the topic of next year's workshop, we have two proposals:\n\n\nA)  The first is from LBNL to host the 10th Radiance workshop in Berkeley, California, where it was last held in 2003.\n\n\nB)  The second proposal is from Raphaël Compagnon, the host of the first workshop in 2002, who forwarded an offer from SERIS to host next year's workshop in Singapore.  The workshop has never been held in Asia.\n\n\nWe had an informal vote at the workshop, and there seemed to be some interest in both venues, with a slight leaning towards Berkeley.  I didn't think it fair to make a decision on the spot, however, since many parts of the world were under-represented in the audience.  So, I am writing to the general list in hopes of getting some further opinions and eventually reaching a consensus on the matter, so that plans may be laid.  In particular, I wonder who would be able to make it to a workshop in Singapore, given airfares and funding approval, etc.\n\n\nAt the same time, if people have a preference for dates, please speak now.  We are looking either at late August or early October if the workshop is held at LBNL.  I don't know if SERIS has a preferred time -- perhaps Raphaël can fill us in on that?\n\n\nFinally, I need to clarify a misunderstanding I seem to have caused by an earlier e-mail regarding LBNL funding.  While it is true that there is money this fiscal year to further Radiance developments, LBNL is not hiring at present nor looking to spend the funds elsewhere, as the positions that were available at the beginning of the year are now filled, and the funds have been earmarked for projects already underway.  \n\n\nHowever, if other research organizations are interested in cost-sharing collaboration (i.e., each institution covers its own expenses and personnel), this could be possible if the project goals are suitably aligned.  This is nothing new, except for the fact that there is significant ongoing work now at LBNL, particularly in the area of complex fenestration, controls, and annual simulation.\n\n\nBest,\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-September/007320.html).</sup>", "id": "radiance-general_007320", "created_by": "Greg_Ward"}