{"topic": "Radiance 4.1 official release", "category": "radiance-general", "attachments": [], "created_by_name": "Greg Ward", "created_at": "November 06, 2011 at 04:41PM", "body": "I have uploaded the official 4.1 release of the Radiance source, together with binaries for Mac OS X:\n\n\n\thttp://radsite.lbl.gov/radiance/download.html\n\n\nUnfortunately, I haven't figured out what I need to do for the radiance-online.org site, so that's stuck on 4.0 for the moment, though the HEAD is the same thing as 4.1 until it gets updated.\n\n\nThere have been a number of important features added in this release, excerpted from the release notes:\n\n\nModified dctimestep to accept sky vector and daylight coefficient matrix\nor list of images to sum together, as suggested by Andy McNeil.\n\n\nCreated genBSDF script to generate BSDF in Windows XML format.\n\n\nAdded ability for rsensor to output ray origins and directions\nrather than actually loading octree and computing sensor value.\n\n\nUpdated reflection model according to EGSR 2010 paper by David\nGeisler-Moroder and Arne Duer.\n\n\nReplaced C-shell version of falsecolor with Perl script written\nby Axel Jacobs.\n\n\n****** COMPATIBILITY CHANGE ********\nChanged -sj (specular jitter) option to something called specular\nsampling (-ss), which if set less than 1 has the same behavior as\nthe old -sj, but when set greater than 1, spawns multiple ray\nsamples from semi-specular surfaces.\n\n\nAdded BSDF data-driven material type with full sampling support.\n\n\nAdded BRDF calculations to genBSDF.\n\n\nAdded variable-resolution BSDF support in renderers and genBSDF.\n\n\nCreated pkgBSDF program to extract BSDF geometry and put it\ntogether with surface description suitable for inclusion in\na Radiance scene.\n\n\nMuted warning for \"no light sources found\" when there is at least\none glow object and interreflections are on (-ab > 0).\n\n\nChecked in cross-platform cmake build system created by Bill Hoffman\nof KitWare and sponsored by NREL.  This includes a qt-based\ndriver for rvu, which is built in the new subdirectory src/qtrvu.\n\n\n\n\nFor full details, see:\n\n\n\thttp://radsite.lbl.gov/radiance/refer/Notes/ReleaseNotes.html\n\n\nBest,\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2011-November/008220.html).</sup>", "id": "radiance-general_008220", "created_by": "Greg_Ward"}