{"topic": "More Results", "category": "radiance-general", "attachments": [], "created_by_name": "Zack Rogers", "created_at": "May 16, 2003 at 12:56PM", "body": "Hi Rob,\n\n\nThis has been a very interesting thread...many good things to know, and \nonce again Radiance shines on.  I was going to comment that your dealing \nwith a fraction of a lux difference now, there must be some sensitive \nobjects inside your space...is this an art gallery?  And your right, \nwith the logarithmic behaviour of the eye the difference becomes even \nmore insignificant.\n\n\nThat was my image in ArchRecord a couple months ago!  I'm excited \nsomeone noticed.  I used the same CAD model to create the CFD image that \nwas also in the article.  It was a very interesting project, the first \nproject I've worked on where the plants were the most important building \noccupant to provide light for.  With that project and another musuem \nproject, I used optics 5 a lot to look at the spectral qualities of \nglass.  Optics 5, with its new Radiance output functionality, is great! \n One thing we learned, and anyone correct me if I'm mistaken, is that \nthe adhesive layer in laminates almost completely eliminates \nultra-violet from the spectrum.  Ultra-violet, or more accurately the \nKrochmann factor (which is loosely related to UV and also determined by \noptics 5), is the main component of radiation that causes degradation of \nmaterials (artwork, furniture).  I may be completely off base by now, \nbut if you are concerned about obtaining such low light levels to \nminimize the footcandle-hours that fall on artwork or what not, I would \nlook at the spectral qualities of the light you are letting in as well \nas they may be more effective at preventing degradation than low light \nlevels.\n\n\nZack\nPS.  Your blog is great!  I had planned on doing something similar \n(although i typically rant and rave about politics) on my website and \nwasn't aware there was a name for something like that.\nwww.zrogers.fpcc.net - it is not nearly complete (I just had a baby boy \nlast month!) but the home page was made entirely with Radiance!\n\n\n\n\nZack Rogers\nStaff Engineer\nArchitectural Energy Corporation\n2540 Frontier Avenue, Suite 201\nBoulder, CO 80301 USA\n\n\ntel (303)444-4149 ext.235\nfax (303)444-4304\nhttp://www.archenergy.com\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000773.html).</sup>", "id": "radiance-general_000773", "created_by": "Zack_Rogers"}