{"topic": "CfP: Eurographics Symposium on Rendering", "category": "hdri", "attachments": [], "created_by_name": "Erik Reinhard", "created_at": "April 01, 2011 at 01:43AM", "body": "(Apologies for cross posting)\n\n\nCALL FOR PAPERS - Eurographics Symposium on Rendering, 2011\n\n\nThe Eurographics Symposium on Rendering 2011 will take place in Prague, Czech Republic, from June 27 to June 29, 2011. This is the 22nd annual event in the series of very successful Eurographics Symposia on Rendering and Eurographics Workshops on Rendering.\n\n\nConference topics include (but are not limited to):\n\n\n\t• Global illumination\n\t• Reflectance, volumetric scattering and translucency\n\t• Representations of material appearance\n\t• Human perception and error measures\n\t• Rendering hardware and its application\n\t• Rendering dynamic/animated environments\n\t• Shadows and visibility\n\t• Monte Carlo techniques\n\t• Finite element techniques\n\t• Sampling, filtering, and anti-aliasing\n\t• Texture models, analysis, and synthesis\n\t• Non-photorealistic rendering\n\t• Image-based measurement and rendering\n\t• Acquisition of appearance\n\t• Point-based rendering\n\t• Real-time rendering and real-time ray tracing\n\t• Systems and software architecture for rendering\n\t• Audio/sound rendering\n\n\nThe proceedings of EGSR will be a special issue of the journal Computer Graphics Forum. Because of this there will be a brief second review cycle for any papers that require changes to be accepted; such papers will only be accepted after the changes have been confirmed by the program committee.\n\n\nPromising papers that require more significant revisions may be referred to Computer Graphics Forum for an expedited review.\n\n\nImportant Dates\n\n\nAll deadlines are 11:00 p.m. Central European Daylight Saving Time (9:00 p.m. UTC).\n\t• Abstract submission deadline: Tuesday, April 5\n\t• Paper submission deadline: Friday, April 8\n\t• Author notification: Saturday, May 14\n\t• Revised papers due: Tuesday, May 24\n\t• Camera ready due: Friday, May 27\n\t• Symposium: June 27 - June 29 (Monday - Wednesday)\n\n\nThe EGSR review and publication process is very short, and to achieve this quick turnaround all deadlines must be strictly observed.\n\n\nInstructions for Submission\n\n\nAll contributions submitted to the Eurographics Symposium on Rendering 2011 must be original, unpublished work. Any work that has previously been published or simultaneously been submitted in substantially similar form to any other conference or journal will be rejected. Contributions must be written and presented in English.\nOnly electronic submissions will be accepted. Submitted manuscripts should be formatted using the Eurographics publication style proceedings templates, and be anonymized for the double-blind reviewing process.\nPapers should be as long as their content requires, but not longer. Papers with average length requirements are expected to be 8 formatted pages long, including references and all figures; up to 10 pages will be allowed only where justified. During the review process, each paper's contribution will be judged in proportion to its length: a solid contribution described clearly and succinctly is more likely to be accepted than the same result submitted in a longer paper.\nAll submissions must be made through the Eurographics Submission and Review Management system, using the following URL: https://srm.eg.org/SRM_SR201.\n\n\nThe submission deadlines will be strictly enforced. The authors of each accepted paper need to complete and return the EG Copyright Assignment Form before the paper can be published.\n\n\nKeynote Speakers:\n\n\nPeter Shirley, University of Utah / NVIDIA (US)\nMarc Pollefeys, ETH Zurich (CH)\n\n\nProgram Chairs:\n\n\nRavi Ramamoorthi (US)\nErik Reinhard (UK)\n\n\nLocal Organising Chairs:\n\n\nJaroslav Křivánek (CZ),\nJosef Pelikán (CZ),\nAlexander Wilkie (CZ)\n\n\n___________________\n\n\n Erik Reinhard\n reinhard at cs.bris.ac.uk\n___________________\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2011-April/000311.html).</sup>", "id": "hdri_000311", "created_by": "Erik_Reinhard"}