{"topic": "Giving UnmetHours.com a Try", "category": "radiance-openstudio", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "August 20, 2015 at 09:42AM", "body": "Greetings simulationists,\n\n\nThe very end of this week's International Radiance Workshop included an open discussion session, which spurred some excellent discussion about software tools, metrics, and support. This last topic (support) included all the usual talking points: information is scattered, and hard to find; the listserv is antiquated (tho there were people on both sides of this issue), etc...\n\n\nThe UnmetHours.com website was mentioned during this conversation, which has been successful as a \"Stack Overflow for energy modelers\" kind of resource. For those unfamiliar with Stack Overflow, it's simply a Q&A website for programmers, where people can ask and answer questions. Both the questions and answers can be up and down voted for relevance and quality, respectively. Users who ask good questions and give good answers receive \"karma points\" which unlock further functionality on the site and boost the self-esteem of the users, impressing their friends and peers. =) UH is basically the same thing, but with a focus on building simulation.\n\n\nUnmetHours posts can accept software- and workflow-specific tags, allowing the content to self-organize and become searchable on these keyword tags. Images can be embedded in posts, as well as formatted code blocks. Users can comment, and offer answers, which can then be up or down voted; the idea being the community shapes the knowledge base. There are things I don't like about the site, versus the old-school listserv method. But the discussion yesterday focused on the problems of the new user, and offering greater visibility into the tremendous resource that is the radiance-online list archives (and those from the radsite list that preceded it). Matter of fact, I posted an announcement about UnmetHours on radiance-online last fall, but I can't find it now. So, there ya go.\n\n\nIn the end, the general consensus was to give UnmetHours a try, for Radiance support. There was no agreed-upon methodology for this, but the general idea is:\n\n\n0. Post this announcement here, and then:\n1. Encourage the community to post new Radiance questions on UnmetHours (and tag appropriately)\n2. When answers already exist on radiance-online.org, post a brief answer on UH, cross-referencing the post or thread on radiance-online.org\nThis is as far as we got, frankly.\n\n\nMy biggest beef with the UH workflow is that the onus is on me to check the site for new content, whereas the listserv simply sends me the conversations in realtime. The rss feed for UH is not at all good for this, either. So this is a big ask in my opinion, but I'm willing to give it a go, and - significantly - Greg was, too. So how about it? I'm hereby encouraging this lot to head over to unmethours.com, and sugn up for a free account. Have a look around, and check out the help page (https://proxy.unmethours.com/help.html) for info on getting started posting and voting, and bookmark the site so you can check in frequently. Let's see where this goes.\n\n\nOne question I have for the group is do we want to follow suit with the radiance-dev list?\n\n\nOK, bye, see you over there.(?)\n\n\n- Rob\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-openstudio/2015-August/000145.html).</sup>", "id": "radiance-openstudio_000145", "created_by": "Rob_Guglielmetti"}