{"topic": "HDRI capture of LED (histograms and range)", "category": "hdri", "attachments": [], "created_by_name": "Yulia Tyukhova", "created_at": "March 01, 2012 at 12:46PM", "body": "Hello!\n\n\nI've been experimenting with the number of photos to include in final HDRI.\n\n\nI took a sequence of photos of a single LED with reflectance standards\nincluded in the scene.\n\n\nEOS7D 28-105mm lens at 28mm\n\n\nF16 1/8000-1/15’’\n\n\nF4   1/30-5 mins\n\n\nWith the ND filter t=0.0094\n\n\nImages are fused with raw2hdr.\n\n\nThey were calibrated at white reflectance standard 215 cd/m2.\n\n\nI’ve noticed the following tendency:\n\n\nIf I fuse different number of photos (cut the number of photos on the\nshortest end), after calibrating at white reflectance standard, I get\ndifferent luminance values for the LED.\n\n\n*Shortest exposure to fuse             L,cd/m2*\n\n\n1/125’’ f16                                   4.5*106\n\n\n1/250’’ f16                                   9.06*106\n\n\n1/500’’ f16                                   18*106\n\n\nI've seen interesting discussion between Axel and Greg on photos to\ninclude. But it seems like there are many uncertainties.\n\n\nIn HDRI second edition book it says \"The darkest exposure should have no\nRGB values greater than 200 or so, and the lightest exposure should have no\nRGB values less than 20 or so. Do NOT include an excess of exposures beyond\nthis range, as it will do nothing to help with the response recovery and\nmay hurt.\"\nI assume it is the same for any HDRI sequence, not only for response curve.\n\n\nI have plenty of photos of dark exposures that have no values greater than\n200, same with the light exposures and 20.If somebody can clarify what\nphotos should be included or have any other suggestions that would be great\n\n\nThank you,\n*Yulia *\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2012-March/000385.html).</sup>", "id": "hdri_000385", "created_by": "Yulia_Tyukhova"}