{"topic": "Some trans oddities", "category": "radiance-general", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "May 09, 2003 at 12:28PM", "body": "I am struggling to understand some seemingly inconsistent results I'm \ngetting with the trans material.  We are doing some fairly complex \nstudies of the daylight penetration in a bunch of art galleries.  These \ngalleries receive daylight that is filtered through some diffuse glass, \nand further modulated with sun control shades. It is the material \nproperties of these shades that is giving me fits at the moment.  In \nbrief, certain shade transmissions give wacky results, while most \nperform as expected.  To reduce the possibility of error, I have \nconstructed a simple box room (16'x16'x9'), with a single 3' square \naperture in the ceiling.  this aperture has two panes of diffuse glass \n(as the real building will), between which I have a polygon that I \nassign various shade materials (using trans) to.  I am then computing \nthe horizontal illuminance on the floor with rtrace for each shade.\n\n\nResults:\n\n\nTest1 (no shade): EhFloor - 222 Lux\nTest2 (10% shade): EhFloor - 23 Lux (10.41% of Test1, 4% off)\nTest4 (5% shade): EhFloor - 12 Lux (5.4% of Test1, 8% off)\n\n\nSo far, so good!\n\n\n(in all cases, the exterior horizontal illuminance is being predicted to \nwithin 10 Lux, so it's not even worth weighting the interior predictions \nfor each individual calculation, IMHO.)\n\n\nNow, we have two shades in the real building, both of which can be \ndeployed at a time.  So next I tried simulating a 10% and a 1% shade \ndown, but I \"cheated\", by assigning the net transmission of the two \nshades to the single polygon (IOW, .10 * .01 = .001).\n\n\nTest3 (10% + 1% shade as a single polygon): EhFloor = 0.4434 Lux (0.20% \nof test1, or 100% off!)\n\n\nThinking that maybe the aforementioned cheat was ill advised, I added a \nsecond polygon to the model, so I had two physical objects to apply \nshade materials to:\n\n\nTest8 (10% + 1% shades, as two separate polygons): EhFloor - 0.5509 Lux \n(0.25% of Test1, or 148% off)\n\n\nSo much for that theory.  thinking maybe there's a limit to how much you \ncan remove from the daylight before the calculation goes awry (hey, I'm \ngrasping at straws at this point), I tried another scenario:\n\n\nTest7 (10% + 5% shades, as two separate polygons): EhFloor - 0.9656 Lux \n(0.43% of Test1, 13% off)\n\n\nThis is certainly close enough for Government work.  But then:\n\n\nTest9 (single 01% shade): EhFloor - 1.189 Lux (0.54% of test1, 46% off)\n\n\nSo, the 10% + 5% was accurate, which is cutting out more light together \nthan a single 1% shade, but the 1% shade calc was fairly inaccurate.  I \nthought maybe it was the inherent variability in the indirect \ncalculation, so I ran test9 again and got exactly the same numbers! \n(I'm using rad with Q=M D=M V=H and -ab 3 for these tests, and it's a \nclear sky at noon at a latitude that pretty much places the sun directly \nover this aperture.)\n\n\nThe reason this entire test came about is because I can't seem to affect \nany further light reduction in my model past a certain point.  I even \ntried making the shades totally opaque, and when I do that my model goes \ncompletely dark, as I expected, so the model seems to be \"tight\", and \nhave no light leaks.  Everything points to my shade material definitions \nbut I can't find anything wrong with them, except for the fact that \ncertain ones seem far less acurate than others.  I have been trying to \nuse Radiance as a relative performance evaluation tool on this project, \nbut for this last part of the project where we are trying to knock out a \nvery high percentage of the available light, I seem to be getting \ncounter-intuitive results.  Does anyone have any insight as to why these \nresults are occurring?\n\n\nHere are the trans parameters for the various shade materials (all are \nassumed to have a 95% transmitted specularity, as they are view \npreserving shades, even tho it probably does not matter too much because \nthey are between two pieces of diffuse glass.):\n\n\n## 10% shade\nvoid trans shade.10\n0\n0\n7 .4 .4 .4 0 0 .25 .95\n\n\n## 05% shade\nvoid trans shade.05\n0\n0\n7 .25 .25 .25 0 0 .2 .95\n\n\n## 01% shade\nvoid trans shade.01\n0\n0\n7 .21 .21 .21 0 0 .047619 .95\n\n\n## 10%+01% shades in single polygon\nvoid trans shade.001\n0\n0\n7 .201 .201 .201 0 0 .004975 .95\n\n\n## 10%+5% shades as single polygon\nvoid trans shade.005\n0\n0\n7 .205 .205 .205 0 0 .02439 .95\n\n\nAny help appreciated.\n\n\n\n\n\n\n\n\n      Rob Guglielmetti\n\n\ne. rpg@rumblestrip.org\nw. www.rumblestrip.org\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-May/000719.html).</sup>", "id": "radiance-general_000719", "created_by": "Rob_Guglielmetti"}