{"topic": "CVS, ANSI", "category": "radiance-general", "attachments": [], "created_by_name": "Randolph Fritz", "created_at": "June 08, 2002 at 12:27PM", "body": "This is really a collection of notes on various Radiance software\nengineering issues that I've gathered up into one message...\n\n\nI think that who decisions about what code goes into mainline Radiance\nis very important.  I, at least, want very much to see the physical accuracy\nof the simulation maintained; in my view it's the engagement with\nthe physical behavior of light that makes Radiance so very valuable in\narchitectural design.  (I bow in the general direction of Greg Ward.)\n\n\nGeorg Mischler:\n  Speaking more generally, I'd like to put in a strong vote for\n  ansifying Radiance completely. Even though this might look like a\n  highly tedious task (and probably is), I'd expect it to uncover\n  and eliminate at least a one or two dozen subtle bugs throughout\n  the code. In the long run, it would make all future development a\n  lot easier.\n\n\nDo I understand that you are thinking of using function prototypes\nthroughout?  Then I agree it's an excellent idea--in fact, I would\nlike to see clean compilation with strict prototype warnings.  The gcc\ntool \"protoize\" might be useful in approaching the problem, but I say\nthat without experience with the tool.  I also agree with Greg Ward\nLarsen about the problems of conditional compilation (and so do the\nBell Labs developers of C, see\n<http://plan9.bell-labs.com/sys/doc/comp.html>), and hope that whoever\nhandles the development avoids cluttering the code with conditionals\nand their associated reliability problems.\n\n\nPeter Apian-Bennewitz:\n  positively a good idea. IMHO a full rewrite would be a better\n  investment, timewise, than an ANSIfication, at least for the existing\n  core rendering.\n\n\nI agree with Greg Ward that this would be lot of work with no\nguarantee of improvement at the end.  The core of Radiance works\nfairly well; I think we could get bogged down trying to perfect it.\nPersonally, I'd rather see effort spent on new facilities, perhaps on\nbetter support of current graphics technologies, and updating some of\nthe associated scripts.\n\n\nAlso, tendered very cautiously, it might be worth removing some of the\nolder system components that are not much used, or at least relegating\nthem to unsupported status.  I think, for instance, we could do\nwithout Imagewriter support.<g>\n\n\nThat said, I will admit that I have had a very rough quarter at\nschool, and am unlikely to have much time to spend on this until the\nfall of 2003, at least.\n\n\nRandolph\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-June/000292.html).</sup>", "id": "radiance-general_000292", "created_by": "Randolph_Fritz"}