{"topic": "horizontal band in large image", "category": "radiance-general", "attachments": [], "created_by_name": "Zack Rogers", "created_at": "December 30, 2003 at 08:46PM", "body": "Hello,\n\n\nI am getting a strange result in some high quality, high resolution \nrenderings.  I have posted one of the images here:\n\n\nhttp://www.zrogers.fpcc.net/zrogers/images/node1_test.jpg\n\n\nThey are panoramic images, -vtc -vh 360 -vv 90, and I am running them at \n12288 x 3072 resolution and reducing them by 1/3rd with pfilt.  The top \n2/5ths rendered as I had hoped but the bottom 3/5ths of the image seems \nto have run at very low quality and the color and patterns are off. \n Prior to running this image I had checked the model with some lower \nresolution rview images and everything seemed ok, I had a nice green \ngrass map that is now showing up purplish in the image.  The brick map I \nhave on the walls and other textures and patterns render correctly above \nthe line and do not show up at all below the line.  I was not able to \nview the original 12288 x 3072 *.unf picture - it just showed up white \n(with exposure adjusted) and I had to pfilt by 1/3 just to get it to \nshow up on my screen.  So I'm not sure if this is a problem with the \noriginal image or with pfilt.  \n\n\nAny ideas what is wrong?  It seems maybe its just a problem trying to \nrun such high resolution since it was rendering ok with rview at lower \nresolutions.  I don't think it was a problem with ram, since the process \nwere taking up roughly 500MB and I have 1GB.  This may be similar to the \nhorizontal line artifacts discussed in Mark Stock's previous post \n(6-27-03).  I think that problem was solved with the newest HEAD release \nof Radiance.  Could this just a problem with the wonderful Windows \nversion I am working with?\n\n\nIt looks as though I may have to rerun these, or atleast some of these. \n Could I reuse the ambient file or should a new one be created?  Also, I \ncould just rerun the bottom 3/5ths of the picture and use pcompos to put \nthem together, correct?\n\n\nThanks!\nZack\n\n\n\n\nZack Rogers\nStaff Engineer\nArchitectural Energy Corporation\n2540 Frontier Avenue, Suite 201\nBoulder, CO 80301 USA\n\n\ntel (303)444-4149 ext.235\nfax (303)444-4304\nwww.archenergy.com\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-December/001365.html).</sup>", "id": "radiance-general_001365", "created_by": "Zack_Rogers"}