{"topic": "Free version of SketchUp released by Google (but there's a catch)", "category": "radiance-general", "attachments": [], "created_by_name": "John Mardaljevic", "created_at": "April 28, 2006 at 03:18PM", "body": "Google bought SketchUp a few months ago.  Today they have released a  \nfree, but limited, version of SketchUp (Mac OS X & Windows):\n\n\nhttp://sketchup.google.com/\n\n\nPro version is as before with, I think, one or two minor additions.\n\n\nSketchUp is so easy to use that I managed to create a 3D model for a  \nproject whilst learning how to use SketchUp and got it done well  \nbefore the 8hr evaluation period ran out (Pro version).  Search this  \nsite for \"3ds2rad\" for how to convert from 3DS to Radiance format.\n\n\nHere's the catch: only the Pro version exports SU models to formats  \nsuch as 3DS etc.  So I'm afraid that the offer of a free version of  \nSU is not terribly useful for Radiance users.  Where it may count is  \nto have it sitting there as a freebie which you can toy with every  \nnow and then and perhaps learn how to use as a 'background' task.   \nThen when you really do need to use SU to make a Radiance model, you  \ncould either buy the Pro version or see how much you could get done  \nduring the 8hr demo period.  I don't know if you could run the Free  \nand Pro versions alongside each other; that would be a sneaky way of  \ngetting a lot out of the 8hr trial period.  I never said that.\n\n\nWell worth a look -- but not quite the gift (for Radiance users) that  \nit might have been.\n\n\n-John\n\n\n\n\nDr. John Mardaljevic\nSenior Research Fellow\nInstitute of Energy and Sustainable Development\nDe Montfort University\nThe Gateway\nLeicester\nLE1 9BH, UK\n+44 (0) 116 257 7972\n+44 (0) 116 257 7981 (fax)\n\n\njm at dmu.ac.uk\nhttp://www.iesd.dmu.ac.uk/~jm\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-April/003618.html).</sup>", "id": "radiance-general_003618", "created_by": "John_Mardaljevic"}