{"topic": "Job Posting: Daylight and Climate Concept Development and Validation Engineer", "category": "radiance-general", "attachments": [], "created_by_name": "Cramer Silkworth", "created_at": "June 14, 2010 at 06:41AM", "body": "Transsolar is a German-based climate engineering firm, and one of the \npremier such offices in the world. We are seeking talented, highly \nmotivated engineers for our New York office.  Our current needs place \nspecial emphasis on daylighting specialists with grounding in \nengineering science.\n\n\nTranssolar develops and validate concepts for high quality environments \nthat require minimal energy use. To achieve this we work collaboratively \nwithin the design team from the start of the design process, considering \neach step from the standpoint of fundamental thermodynamics. This \ngenerates a climate concept in which form, material, and mechanical \nsystems are synergistic components of a well-orchestrated climate \ncontrol system; and conversely, an environmental control strategy that \nis integral to the architectural concept.\nWe use a wide variety of computer simulation tools to evaluate our \nconcepts. We perform daylight simulations using RADIANCE, with \nevaluation based on a wide variety of metrics, increasingly expanding to \nclimate-based daylight metrics.  Similarly, we perform dynamic thermal \nsimulation using TRNSYS and computational fluid dynamics (CFD) using FLUENT.\n\n\nTranssolar engineers are often specialized in their work, but all carry \nout a broad range of tasks. Responsibilities may include but are not \nlimited to:\n.    Design and validation of ongoing projects via RADIANCE, TRNSYS, or \nFLUENT simulation\n.    Collaboration with German Transsolar offices\n.    Project coordination\n.    Participation in meetings and design charettes\n.    Graphical representation of climate and energy concepts\n.    Writing reports and correspondence\n.    Domestic and international travel to project meetings and sites\n\n\nEngineers with an emphasis on daylight simulation, including \nclimate-based metrics, are our highest priority, but experts in dynamic \nthermal simulation are also of interest.  Both entry-level positions and \npositions for 3-5 years experience are available.  Our New York office \nis small but growing, providing ample opportunity for advancement.\n\n\nPreferred qualifications include:\n.    Proven ability to creatively develop and apply non-traditional \nclimate solutions to the indoor environment\n.    Education related to building energy flows and building science: \nheat transfer, thermodynamics, fluid mechanics, solar geometry and \ndaylighting, etc. Ideal is a degree in mechanical engineering. An M.S. \nis preferred but not required.\n.    Familiarity with basics of computational analysis (text-based \ninput, computer programming, spreadsheet analysis)\n.    Experience with daylight simulation and climate-based daylight metrics\n.    Experience with electric lighting design and simulation\n.    Experience with dynamic thermal/energy simulation\n.    Experience with computational fluid dynamics in built environment \napplications\n.    Education/professional experience with architectural, mechanical, \nand lighting systems for building climate control\n.    Excellent oral and written communication skills\n.    Computer-based drawing skills (e.g. Corel Draw, Adobe Illustrator, etc)\n\n\nInterested applicants may submit their resume and work samples via email \nto nycjobs at transsolar.com\n\n\n\n\n*Cramer Silkworth\n212 219 2255 | silkworth at transsolar.com <mailto:silkworth at transsolar.com>\nTranssolar Inc. | 134 Spring Street Suite 601 | New York, NY 10012\n\n\nTranssolar Climate Engineering\nTechnical consulting for energy efficiency and environmental quality in \nbuildings.\nNew York - Stuttgart - Munich*\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-June/006984.html).</sup>", "id": "radiance-general_006984", "created_by": "Cramer_Silkworth"}