{"topic": "BSDF orientation and implementation", "category": "radiance-general", "attachments": [], "created_by_name": "Chris Coulter", "created_at": "February 25, 2014 at 08:06AM", "body": "Good morning Gurus!\n\n\nI have worked through the 3- and 5-phase tutorials in hopes of being able to apply a BSDF to one of my projects. This project will be using micro-louver cellular structures imbedded within an IGU, in both skylights and vertical windows. I think I understand the general process, but wanted to ask a few questions before getting too far down the road...\n\n\nThe skylights and windows are all different sizes and the windows are in multiple orientations (of course). My understanding of the BSDF and seemingly from this mail (http://www.radiance-online.org/pipermail/radiance-general/2011-November/008248.html), I should be able to calculate the BSDF once for my system. I was planning model the louvers as 1m by 1m, but run genBSDF with the -dim arguments smaller than this. Is this the correct approach? Ideally I would not calculate the BSDF for each orientation, assuming that micro-louver geometry does not change.\n\n\nIn my BSDF material definition, I would alter the up vector according to the surface being applied - the up vector matches the BSDF orientation (calculated in xy space) to the specific geometry's orientation (0 0 1 for a window). If the louver are rotated within the IGU assembly (rz -45) for a skylight, I can account for this with the up vector of 1 1 0 (surface normal is 0 0 1). This would hold true for rotation within the vertical apertures as well. Each different up vector would be a different BSDF material.\n\n\nLastly, if the glazing properties (VLT) are not defined yet, can I import the BSDF file into Window and create multiple options for IGU's with varying properties? It seems so from David Geisler-Moroder's presentation at the 2012 Workshop (http://radiance-online.org/community/workshops/2012-copenhagen/Day1/Geisler-Moroder/geisler-moroder_BSDF_tutorial_s.pdf). Certainly skylights and windows will have different VLT and it would again be nice to not be required to run genBSDF multiple times.\n\n\nI am in the process of working through the steps on my own, but wanted to ask these questions while I'm waiting on genBSDF.\n\n\n\n\nAny help is much appreciated, as always.\n\n\nChris Coulter\nSenior Lighting Designer\nBuro Happold Consulting Engineers\n100 Broadway, 23rd Floor\nNew York, NY 10005\nTel: 212.334.2025\nDirect: 212.616.0254\nEmail: chris.coulter at burohappold.com\nWebsite: www.burohappold.com\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2014-February/010125.html).</sup>", "id": "radiance-general_010125", "created_by": "Chris_Coulter"}