{"topic": "Linux installation", "category": "radiance-general", "attachments": [], "created_by_name": "Mark Steven Baker", "created_at": "July 19, 2002 at 08:30AM", "body": "Bruce,\n\n\nSome comments below on your questions.\n\n\nThere are two styles of shells on most UNIX (and Linux) systems: those\nderived from the original bourne shell (sh) which include bash, ksh, etc. \nand those derived from the C shell (csh, tsch, etc.). The difficulty for\nmany beginners is that these two families of shells support different\nsyntax for setting variables in the environment along with different\ncontrol flow commands.\n\n\nUnder sh or bash, you set an environment variable as follows:\n  RAYPATH=/usr/local/radiance/lib  \n  export RAYPATH\n\n\nThe first line sets the RAYPATH environment variable only for the current\noperating shell. If you start another shell from the current shell, then\nthe RAYPATH environment variable will not exist. The second line \nexports or sets the RAYPATH variable in the environment so it will be\ninherited by other shells. These two commands can be combined into a single\nline as follows:\n\n\n  RAYPATH=/usr/local/radiance/lib; export RAYPATH\n\n\nThe semicolon allows multiple commands to issued on the same command line.\nNOTE: make sure the RAYPATH environment variable points to where you\nactually installed the radiance lib files.\n\n\nNormally, this command would be placed in the .profile file located in your\nhome directory. The .profile file is read when the sh, bash, or ksh shell \nstarts.  It acts as an initialization file where you can set all kinds of \nenvironment variables, change behaviors of the shells, etc. The bash shell \nwill also read a .bshrc resource file in your home directory if it exists. \nThis .bshrc file is for commands that only the bash shell understands. A\nsimilar .bash_profile file can be used for bash-only startup commands. If\nthese files don't exist in your home directory, then the system uses some\nsystem-wide files in the /etc (/etc/profile, for example). These system-wide\nfiles should not be changed (except by very experienced administrators).\n\n\nTo set the RAYPATH environment variable and add the radiance bin folder\nto your path in your .profile file might look something like the following.\nNote comment lines begin with a # character.\n\n\n# set a RAYPATH if this environment variable does not exist\nif [ ${RAYPATH:-\"\"} = \"\" ] ; then\n        RAYPATH=/usr/local/radiance/lib\n        export RAYPATH\nfi\n\n\n# add the radiance binaries to the PATH (note we added at front of path)\nPATH=/usr/local/radiance/bin:$PATH\n\n\n# set a MANPATH environment variable if it doesn't exist\nif [ ${MANPATH:-\"\"} = \"\" ] ; then\n        MANPATH=/usr/share/man\n        export MANPATH\nfi\n\n\n# Add the radiance man pages to the MANPATH\nMANPATH=$MANPATH:/usr/local/radiance/man\nexport MANPATH\n\n\nIf you set these environment variables for bash in the .profile file, then\nthey will be inherited by any shells that you start (spawn) from this\nshell including c shells.\n\n\nThe \"set\" command will display all of your current environment variables.\nYou may need to pipe this command through less or more to see all of the\nvariables if you aren't in anm X window:\n  set |less\n\n\nNote that the SHELL variable is confusing since this variable indicates the\nlogin shell, not the shell that you may be using if you started a csh from\nbash.\n\n\nNow we switch to the C shell side of things. The syntax to set enviroment \nvariables in the csh (and tcsh) is different. In this case, there is a \nsingle command to set an environment variable.\n\n\nsetenv RAYPATH /usr/local/radiance/lib\nsetenv PATH /usr/local/radiance/bin:$PATH\n\n\nThe \"setenv\" command will display the environment variables. These commands\ncould be placed in a .cshrc file in your home directory that is read\nwhenever a c shell starts. The .login file is read after the .cshrc file\nwhen this is a login script. \n\n\nThe choice of shells is a personal preference. You will find that most books\non Linux will discuss and provide examples for sh and bash, not csh. So I\nwould suggest that you stick with bash for the time being. In any case,\nyou would be better to use tcsh than csh as your csh shell since it\nsupports a similar syntax for history (executing previous commands again).\nBoth bash and tcsh support using control-p and control-n or the up-arrow\nand down-arrow to move through a list of previous commands. They also\nsupport very similar syntax for editing a previous command line. The\nleft-arrow and right-arrow move left or right one character at a time,\nwhile the home and end keys move to the beginning or end of the line. The\ndelete and backspace delete characters from the command line and any\nother characters are inserted. Both bash and tcsh support similar syntax\nfor filename completion. \n\n\nOnce you have logged into Linux you can start another shell easily (just type\ncsh or tcsh to start a C shell). This new shell will inherit all of the\nenvironment variables from the previous shell\n\n\nThe radiance developers were familiar with the C shell, so the examples that \nthey provide are written using the C shell syntax. \n\n\nThe command to change your login shell is chsh. If this command is given\nby itself, it will prompt you for the shell you which to use for login.\nNote that you have to provide the full path to the shell you wish to use.\nThe following command will list the command shells that Linux knows about\n(the command shells listed in /etc/shells):\nchsh -l\n\n\nThe chsh program edits the /etc/passwd file in a safe way and changes the\nprogram (command shell) that the operating system runs when you login.\n\n\nYour choice of scripts for running radiance are a personal preference. Note\nthat the first line of a shell script file indicates what shell or command is\nto execute the commands. Take a look at the rlux or xyzimage shell scripts\nlocated in the radiance bin directory. These scripts begin with the following:\n\n\n#!/bin/csh -f\n\n\nThis could just as well have been a perl scripti starting with a first line:\n#!/usr/bin/perl\n\n\nNote that shell script files need to be marked as executable (chmod +x) if\nyou want to be able to just type the shell file name and have them execute.\nOtherwise you have to give the name of the file to the shell:\n  csh /usr/local/radiance/bin/rlux \n\n\nI built and installed radiance from the sources, so ignore the locations\nin the examples above for where the radiance files are installed. I\ncustomized my installation so all of the radiance files where placed in\ndirectories under /usr/local/radiance. This likely differs from the\nlocation where these files are placed when installing the Linux binaries\ndownloaded from LBL.\n\n\nRegards,\n-Steve\n\n\nBruce Sounes writes:\n[ Charset ISO-8859-1 unsupported, converting... ]\n> I have recently installed Suse Linux V8 at home to explore using Radiance in\n> its \"native\" environment. Starting with the Desktop Radiance installation\n> under Windows, I am now reasonably confident in setting up scenes, lights\n> etc using Cad and a text editor.\n> \n> I am finding Linux a bit of a challenge.  How do I set the RAYPATH\n> environment variable under the Bourne Again Shell (bash), and how do I set\n> it as part of my login? I have discovered that if I change to the c-shell\n> (csh) and follow the installation instructions, it works for that session.\n> Similarly the animation scripts in the old email archives work under csh,\n> but not under bash. Should/Can I set Linux to use the c-shell as standard?\n> Is it worth the bother? Can anyone offer advise on the best way to go, or\n> refer me to good documentation sites.\n> \n> Not being familiar with either language, and because of its cross-platform\n> support, I have been reading up on Perl as an alternative for writing\n> scripts to use with Radiance. Has anyone used Perl for animations and would\n> they be willing to share their efforts? \n> \n> Many thanks \n> \n> Bruce Sounes\n> \n> _______________________________________________\n> Radiance-general mailing list\n> Radiance-general@radiance-online.org\n> http://www.radiance-online.org/mailman/listinfo/radiance-general\n> \n\n\n\n\nSteven Baker                      Contributing Editor, Unix Review\n(541) 683-5927                    360 East 15th Avenue\nmsbaker@cs.uoregon.edu            Eugene, OR 97401\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-July/000354.html).</sup>", "id": "radiance-general_000354", "created_by": "Mark_Steven_Baker"}