{"topic": "14th International Radiance Workshop - 2015", "category": "radiance-general", "attachments": [], "created_by_name": "Richard Mistrick", "created_at": "May 26, 2015 at 01:29PM", "body": "Penn State University is pleased to host the 14th Annual International Radiance Workshop from Monday, August 17th to Wednesday, August 19th 2015 at the headquarters of the Consortium for Building Energy Innovation (CBEI), located in the Philadelphia Navy Yard.  The Navy Yard is a vibrant and growing urban business campus located approximately 7 miles south of downtown Philadelphia, 6 miles east of the Philadelphia airport, and 4 miles south of the 30th St. Railway Station (AMTRAK).  The site address is 4960 South 12th St, Philadelphia, PA  19112.\nOnline workshop registration will open shortly and a block of rooms is currently reserved at the Marriott Courtyard South at a rate of $184 plus tax (Phone: 215-644-9400)  This hotel is on the Navy Yard site and within walking distance of the workshop.  Parking is free.  Please refer to the \"International Radiance Workshop - Penn State\" when registering.  Additional hotels are available in downtown Philadelphia, from which you can ride a free shuttle to the Navy Yard (see Center City Express shuttle at http://navyyard.org/information-and-directions/the-navy-yard-shuttle). More hotels are located adjacent to the airport (taxi or rental car required for transportation to the Navy Yard).\nAttendees are invited to share examples of work they have performed using Radiance, or that is in progress, in a prepared 30-minute presentation.  Come to share your knowledge and/or learn about the latest Radiance features, developments, and opportunities to apply Radiance in your professional practice.  Connect with enthusiasts from around the world who apply Radiance in lighting design, daylighting, animation, simulation, and rendering activities.\nIf you are interested in presenting your work, which is highly encouraged, please send a short abstract (300 words or less) for consideration for inclusion on the conference program to 2015RadianceWS at gmail.com<mailto:2015RadianceWS at gmail.com> by June 12.  Separate proposals from a single presenter on more than one topic or project are acceptable. Presenters will receive a $50 discount on their registration fee.  Details on registration and fees will be available within the next week (expected registration fee of $250 or less).\nPresentations will be made available after the workshop on www.radiance-online.org\\workshops<http://www.radiance-online.org/workshops>. Presentations will also be livestreamed for individuals who cannot attend.\nI look forward to your participation and/or attendance at this exciting event.\n\n\nSincerely,\nRichard Mistrick\nWorkshop Host\nPenn State University\nDept. of Architectural Engineering\nEmail: RMistrick at psu.edu\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-May/010956.html).</sup>", "id": "radiance-general_010956", "created_by": "Richard_Mistrick"}