{"topic": "Heavily different sensor values with different (rcontrib?) versions", "category": "radiance-general", "attachments": [], "created_by_name": "Stefan Bohren", "created_at": "May 23, 2016 at 05:32AM", "body": "Dear Radiance community\n\n\nI am doing my master thesis about the relevance of reflections on solar fassades, for what I want to make some simulations with radiance, and also testing it with a little live experiment.\n\n\nAfter having worked myself through most radiance tutorials and the book (very helpful), my prof helped me to put a script together, which in the end should be able to return radiation values at several sensor points, and opt on different ambient settings, surfaces and sensor point locations.\n\n\nAnd now where we are stuck atm: His results with the script are reasonable (on OSX 10.9, likely with radiance 4.1), but if I use exactly the same script and files (on Ubuntu 16 with newest radiance), I get values that are far away from realistic (three to ten times too high radiation values, and slightly different to physically impossible rgb-tripplets), without any error messages. I searched through the archive, but didn't find a similar issue.\n\n\nAs the results of gendaylit -> genskyvec are identical, I think the problems are starting with rcontrib, which we use to produce the sensor radiation readings for each sky patch:\n\n\n  cat $sensors |rcontrib -h -I -fo @scene.opt -ab 4 -ad 100000 -lw 0.000004 -e MF:1 -f reinhart.cal \\\n    -b rbin -bn Nrbins -o results/p%04d.dat -m sky_glow -w scene.oct\n\n\nand are getting worse where we set them all together:\n\n\n  for i in $(seq -f \"%04g\" 0 145); do\n    cat results/p${i}.dat |rcalc -e '$1=($1*0.265+$2*0.67+$3*0.065)' |tr '\\n' '\\t' >> $sensors_vec\n    echo >> $sensors_vec\n  done\n\n\nAs the results are fine with the older version, and not the other way around, we'd really be happy if you helped us on how to adapt the script to the current radiance version - or told us if  we are doing something completely wrong!\n\n\nLooking ahead this issue, we also are wondering which will be the important ambient settings to optimise, in the end it will be a large (several buildings) outdoor setting, and I'd be glad if you could hint me into the right direction with that as well!\n\n\nThank you very much,\nStefan\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-May/011744.html).</sup>", "id": "radiance-general_011744", "created_by": "Stefan_Bohren"}