{"topic": "Bump mapping", "category": "radiance-general", "attachments": [], "created_by_name": "Tom Barnes-Lawrence", "created_at": "September 28, 2003 at 04:20AM", "body": "Hi again,\nI wrote:\n>(I'm posting each question separately, to avoid either getting lost)\n\n\nSo heres the other one:\n\n\n My snake sprites are currently smooth brown plasticky tubes, and they\nlook a bit rubbish. I plan to add patterns to the skin, to make them\nlook better, but I think then they'd still look plasticky, so more\nthan that, I'd like to add bump maps (yeah, I know you call them\ntextures in Radiance, but that just gets a bit confusing) to make the\nskin material look more like scales.\n\n\n Unfortunately, even with the big Radiance book, the bump mapping stuff\nseems to be a bit obscure. I know there's texfunc and texdata, and I saw\nthe thing about the patch for a texpict type (but I didn't really want\nthat here, and I don't want to muck about with my working source tree).\n\n\n But it gets fairly confusing: the texturing is in terms of actual\ndisplacement of the surface normals, rather than the height of ridges\nor depth of grooves, right?? In which case, those modifications of\nsurface normals could be as vectors, or as angles (2 angles?), or\nmaybe something else I haven't thought of.\n And then for example, a groove would presumably  have to be represented\nby having the normals on the left of the groove point right across it,\nthe normals on the right of it pointing left across it (and the normals\neverywhere else unmodified); so if I've got this right, the texfunc or\ntexdata would have to describe the exact direction the normals are\nperturbed in, not just an angle from 0 to 90 degrees.\n\n\n So I'm already bewildered there. Next, there's the actual structure of\nthe 3d bump map: I'm not sure I could come up with a function that could\nproduce such a structure, but I suspect I might be able to produce\nsomething using texdata. But I have little idea how the numbers in\ntexdata are grouped and organised- especially if there might be numerous\nvalues required for each point. And the number of figures I'd have to\nenter for texdata might be too high to be practical (I'd like to finish\nthis project in the next day or 2!).\n If I went the texfunc route, I feel as though the sort of function\nI'd want would be something like (sin(x))*(sin(y))*(sin(z)), but I\nthink not only would that give the wrong sort of overall structure,\nbut I don't think it'd give all the directional details for surface\nnormals. It seems extremely hard to visualise.\n\n\n So overall, I scarcely even know where to start; the best I have here\nis a firm idea of the final result I want :P So explanations, suggestions,\nwhatever, are more than welcome!!\n\n\nThanks again,\n Tom Barnes-Lawrence\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-September/001001.html).</sup>", "id": "radiance-general_001001", "created_by": "Tom_Barnes-Lawrence"}