{"topic": "2013 Radiance Workshop - Let's pick some dates!", "category": "radiance-general", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "November 16, 2012 at 09:01AM", "body": "Greetings Simulationists,\n\n\nI am thrilled and proud to announce that the 2013 Radiance International\nWorkshop will be held right here at NREL, in sunny Colorado, USA. I'm\ndelighted to be able to pay back all the other fine institutions who have\nhosted this event over the years, and I look forward to showing off my\nbeautiful adopted home state, and the great things we have going on here\nat NREL.\n\n\nI've been advised by my co-workers to book conference rooms early around\nhere, hence the somewhat early inquiry about setting a date for the event.\nGreg has pointed out that we should try to have the event prior to the\nstart of the US academic year, which is nominally August 20th 2013.\nBacking up a week from there, we have a typical workshop schedule that\nlooks like this:\n\n\nMon, Aug 12 2013 - Tutorial Day\nTue, Aug 13 2013 - Presentation Day\nWed, Aug 14 2013 - Presentation Day\n\n\nMoving the workshop to the end of that week (Aug 14-16) is problematic. We\ncould have it earlier I suppose, or later, but we thought we'd see if Aug\n12-14 works for most folks. You guys are all pretty good at calling out\nconflicts fairly quickly, so I thought I'd throw this out to the list and\nsee what y'all come back with.\n\n\n\n\nA short drive from Denver, NREL is located right against the foothills of\nthe Rocky Mountains in Golden, CO. We have several new buildings on campus\nthat we can tour, including a couple of net-zero energy buildings as well\nas a unique grid-scale experiment laboratory -- that will also be home to\na petascale supercomputer. For planning reference, Denver International\n(KDEN) is the closest major airport, and the lab is about 30 minutes away.\n\n\nBut, that's all details. For now, we're just looking to set a date, and\nwe're hoping the proposed calendar above works for most of you. Let us\nknow!\n\n\n- Rob\n\n\n\n\nRob Guglielmetti\nNational Renewable Energy Laboratory (NREL)\nCommercial Buildings Research Group\n15013 Denver West Parkway MS:RSF202\nGolden, CO 80401\n303.275.4319\nrobert.guglielmetti at nrel.gov\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2012-November/009050.html).</sup>", "id": "radiance-general_009050", "created_by": "Rob_Guglielmetti"}