{"topic": "Photosphere question", "category": "hdri", "attachments": [], "created_by_name": "Greg Ward", "created_at": "May 27, 2008 at 12:09PM", "body": "Hi Chris,\n\n\nThanks for writing.  If you want to subscribe to the HDRI mailing  \nlist at radiance-online, here is the URL:\n\n\n\thttp://www.radiance-online.org/mailman/listinfo/hdri\n\n\nIt's generally pretty quiet, but this sort of discussion is very  \nwelcome.\n\n\nThe warnings you are seeing in Photosphere are just that -- they are  \njust my way of saying, \"If the output looks funny, it's not my  \nfault.\"  In particular, the 'Trouble Finding HDR Patch' warning is  \nnothing to worry about.  It just means some of your exposures are  \nvery dark or very light, and there's not much information to be  \ngleaned from them in deriving a camera response.  The same is usually  \ntrue of the alignment warning, though small, bright objects like  \nlight sources may show double-images if the camera wasn't mounted on  \na tripod.  If it was, then you should probably turn alignment off  \naltogether.  In the latest version of Photosphere, turning alignment  \noff kicks in a new feature to remove \"hot pixels\" from the output.\n\n\nIf you are not deriving the camera response for the first time,  \nduring on 'Skip Extra Exposures' in the dialog is a good idea, since  \nit will avoid most of these problems.  In fact, you shouldn't see the  \n'Finding Patches' error at all if you use a saved response function.   \nHopefully, this is working for you, as following the hints in  \nquickstart_pf.txt (part 12) and reusing a saved response is the best  \nway to avoid problems.\n\n\nI should mention that it doesn't really help the process to include  \nexposures that have no dark pixels (values all over 20) and no bright  \npixels (values all under 200).  You can use Photosphere's histogram  \nviewer to check this and exclude extreme exposures.  This will help  \nreduce the number of warnings.\n\n\nBest,\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2008-May/000186.html).</sup>", "id": "hdri_000186", "created_by": "Greg_Ward"}