{"topic": "genskyvec with HDR sky view?", "category": "radiance-general", "attachments": [], "created_by_name": "Achim Geissler", "created_at": "May 27, 2016 at 12:29PM", "body": "Hi all,\n\n\nafter searching high and low without clear results apart from a lot of pointers that “everybody seems to be doing it” (so it should actually be easy and I am probably missing the forest due to seeing trees, as they say) a short question: The goal is to use HDR (fisheye) views of the sky for radiance calculations. All I could manage to date are pretty pictures with HDR skies. Ideally, the workflow would be “the same” as when using a sky from gensky or gendaylit. E.g., it would be nice to be able to generate the sky vectors (genskyvec) from the HDR sky view. Is that possible? How? Trying to simply pipe a sky definition along the lines of\n\n\nvoid colorpict skyfunc_hdr\n7 red green blue sky_image.hdr map_sky.cal u v\n0\n0\n\n\nskyfunc_hdr glow sky_glow_hdr\n0\n0\n4 1 1 1 0\n\n\nsky_glow_hdr source sky_hdr\n0\n0\n4 0 0 1 180\n\n\ninto genskyvec didn’t work - well, would have been too simple (the map_sky.cal is from the PhD by Coralie Cauwerts, 2013). The following approaches resulted in the “pretty pictures” (replacing “source” above)\n\n\nsky_glow_hdr bubble sky_hdr\n0\n0\n4 0 0 0 2000\n\n\nor\n\n\n!genbox sky_glow_hdr boxenv 2000 2000 1000 -i | xform -t -1000 -1000 -500\n\n\nA further topic will be a “calibration” of the HDR sky views - we have global horizontal and diffuse horizontal radiation values available. The current idea of a (possibly slightly rough) method of calibration would be to use the HDR sky to calculate the corresponding sensor value with radiance and “somehow” introduce a scaling factor into the HDR sky such that the measured and calculated global horizontal radiation values tally.\n\n\nThanks for any hints & ideas!\n\n\nBest\nAchim\n\n\nachim.geissler at intergga.ch\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-May/011747.html).</sup>", "id": "radiance-general_011747", "created_by": "Achim_Geissler"}