{"topic": "Finding contribution of different glass roof panels using r(t)contrib", "category": "radiance-general", "attachments": [], "created_by_name": "Reinier Zeldenrust", "created_at": "July 15, 2013 at 07:53AM", "body": "Dear all,\n\n\nI've been following some of the discussions on the mailing list with keen interest and gratitude. Now, I'd like to hear your thoughts on something I'm working on. (Hopefully, I'll be able to start answering other people's questions soon too!)\n\n\nI'm working on a building with a large glass roof, with plants and people inside. The goal is to find optimal light transmittances for different parts of the roof so it is relatively uniformly lit throughout the year. The main worry is getting enough light for the plants, yet limiting irradiance to not require excessive cooling.\n\n\nHere's what I am thinking at the moment:\n\n\n*         Break up dome into N separate panels using Rhino/Grasshopper, assign each panel to a layer, and then export layers as materials using DIVA\n\n\n*         Generate a materials file with N identical materials with material_i as name\n\n\n*         Run r(t)contrib for the different modifiers (using -M and a modifier file)  and points, using a cumulative sky generated by DIVA, to find to each point by each panel\n\n\n*         Visualise output data using Rhino/Grasshopper\n\n\n*         Find (near) optimum light transmittances based on 2-3 criteria (still to be defined, but likely UDI and uniformity). With the available data is should a purely numerical exercise, no simulations involved.\n\n\nI've tested the separate steps but not yet the whole workflow. I may need to extend the simulation by doing an hourly simulation to obtain useful daylight illuminances, probably by creating genskyvec+rtcontrib-loop, like in Axel Jacobs' rtcontrib tutorial. That may get computationally intensive, in which case I may resort to using EC2.\n\n\nA few questions:\n\n\n*         Any experiences with something similar? Ways to simplify /improve my workflow? Which errors will I likely run into?\n\n\n*         obj2rad generates an interpolated .rad file using texfunc.cal and something called 'M-nor'. This means I can't use my material as a modifier for rcontrib. For now, I have exported my model as simple planes so that the materials can be used as modifiers, but is there a better way?\n\n\n*         Should I use a CPU-optimised instance on EC2? What are some ways to properly do parallel computing on EC2? Any examples?\n\n\n*         An alternative is using one material for the dome and creating a custom binning for rtcontrib. Does this have any computational advantages?\n\n\nAny help greatly appreciated!\n\n\nCheers,\nReinier Zeldenrust\nEnvironmental Designer\nAtelier Ten\nBuilding Services Engineers + Environmental Design Consultants\nCIBSE Building Services Consultancy of the Year 2011\n[image001][image003]<http://www.amazon.co.uk/Green-House-Sustainable-Gardens-Singapore/dp/1935935569/ref=sr_1_2?ie=UTF8&qid=1351789637&sr=8-2>\n19 Perseverance Works\n38 Kingsland Road\nLondon E2 8DD\nT +44 (0)20 7749 5950\nF +44 (0)20 7729 5388\natelierten.com<http://www.atelierten.com/>\nAtelier Ten is an accredited ISO 9001 company and is pleased to be a founding member of the UKGBC. This e-mail (and any attachments) may contain privileged and/or confidential information. If you are not the intended recipient of this e-mail you must not disclose, copy, distribute, disseminate or take any action in reliance on it. If you have received this message in error please notify the sender and then delete it from your system. For the 12-months to the end of October 2012, with Clear we have offset our expected CO2 emissions in respect of our business energy usage within our UK offices; commuting; work-related travel; office vehicles; couriers including supplies and deliveries; waste from our UK office and the production of our project reports. Click here<http://www.atelierten.com/about-us/clear.asp> for more information\n\n\nCompany Registration Number: 255 2224. Company Registered Address: 19 Perseverance Works, 38 Kingsland Road, London, E2 8DD\n\n\n\n\n________________________________________________________________________\nThis e-mail has been scanned for all viruses by Star. The\nservice is powered by MessageLabs. For more information on a proactive\nanti-virus service working around the clock, around the globe, visit:\nhttp://www.star.net.uk\n________________________________________________________________________\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2013-July/009617.html).</sup>", "id": "radiance-general_009617", "created_by": "Reinier_Zeldenrust"}