{"topic": "Sky Definition Part 2", "category": "radiance-general", "attachments": [], "created_by_name": "Zack Rogers", "created_at": "October 18, 2003 at 04:37PM", "body": "Hi Francesco,\n\n\nThanks so much for your input.  I need to apologize, when I started this \nthread I narrow mindedly thought the IESNA equations were all part of \nwhat's defined as the \"CIE standard sky\".   I had no idea there were so \nmany differing equations to determine the magnitudes of the sun and sky \ncomponents.  I believe IES uses the CIE 110-1994 luminance distribution \nfunctions but I could not track down a copy of this at the moment.  Is \nit the same function from his 1967 studies and then adopted by CIE in \n1973?  or was it changed in 1994?  IES still lists the refence as \nKittler 1967.\n\n\nFirst, a note on sun/sky efficacies.  The 94.2 lm/W efficacy I had said \nIES gives is for extraterrestrial solar.  Which, along with the solar \nirradiation/illumination constants are the same for the entire world. \n It can then range from ~95 - 120 lm/W or whatever depending on the \namount of particles it has to travel through, which is a function of \nelevation, solar angles, and turbidity and as Santiago pointed out a \nfunction of the eccentricity of the earth orbit which just slightly \nvaries the extraterrestrial values throughout the year.  I'm guessing \nair particles absorb more heat then light, hence the more particles the \ndirect solar travels through the more efficacious it becomes.  Given \nthis, it does not seem like the determination of solar illuminance or \nsolar efficacy should be that difficult as long as it is a function of \nextraterrestrial solar, eccentricity, elevation, solar angles (day, \ntime, lat etc), and turbidity.  This is partly why I trust the IES \nequation for direct solar at sea level because its a function of \nextraterrestrial solar, eccentricity, and sun angles.  It falls short by \nnot including elevation or just estimating a turbidity.  Also, this is \nwhy I think direct solar estimates can be fairly accurate and not a \nmatter of guesswork, since every input variable is extremely accurate \nexcept for perhaps the turbidity, which in the IES equations is assumed \nto be a constant value and probably based off weather data for north \namerica.  But given an accurate turbidity value there is no reason why \nan accurate estimate of the direct solar component can't be made.  Also, \nit seems more logical to be able to vary the turbidity (and have it \naffect the solar component) as input to gensky rather than vary the \nsolar radiance.  \n\n\nFurthermore, the sky estimate shouldn't be too much harder to achieve \nsince, for one, it can not exceed the difference between ground level \nand extraterrestrial direct solar.  It is also a function of the same \nvariables listed above and is distributed according to either the \nkittler distribution function or perez or whatever.\n\n\n> If we only specify location and time, gensky uses the following formula:\n>\n> solarbr = 1.5e9/SUNEFFICACY*sin(sunaltitude)\n>                         if (1.147 - .147/sin(sunaltitude) > .16), \n> otherwise\n>          1.5e9/SUNEFFICACY*.16\n>          (could anybody give any reference about this equation?)\n>\n> where\n> SUNEFFICACY = 208 /* illuminant B (solar dir.) */\n\n\nGiven what I just said above, from what I can tell, this equation only \ntakes into account the sun angles with perhaps an estimate for ext. \nsolar radiance.  Hence, I'm more inclined to believe the IES equations \nwhich estimate a turbidity value and only misses an elevation factor.\n\n\n>\n> DIFFUSE CONTRIBUTION from the sky\n>\n> If neither zenith radiance (zenithbr) nor horizontal diffuse \n> irradiance (eed)\n> are given, the Krochmann equation is used for the CIE OVERCAST SKY:\n>\n> zenithbr = 8.6*sin(sunaltitude) + .123 [kcd/m^2] (Krochmann)\n>\n> CIE 110-1994 also reports equations by Kittler and Nakamura, Oki et \n> al. for this\n> purpose.\n\n\nIES's equation for cloudy sky zenith luminance (Lz) is this;\n\n\nLz = (0.3 + 21.0*sin (sunaltitude))*0.409\n\n\nFor comparison on summer solstice at 12:00PM at 40 lat., the Krochmann \nequation gives 8,366 cd/m2 and IES equation gives 8,356 cd/m2.   Pretty \nclose!!!\n\n\n>\n> For the CIE CLEAR SKY the LBL equation (Karayel, Navvab, Ne'eman, \n> Selkowitz) is used\n> (here the Linke Turbidity appears for the first time):\n>\n> zenithbr = (1.376*turbidity-1.81)*tan(sunaltitude)+0.38 [kcd/m^2]\n> (Karayel, Navvab, Ne'eman, Selkowitz)\n\n\nFor comparison on the same day and lat. etc., the IES equation, which I \nlisted earlier, gives roughly 8,147 cd/m2 and this equation gives 7,023 \ncd/m2.\n\n\n>\n> CIE 110-1994 also reports a lot of equations that should be chosen \n> according to\n> the climate condition in the location of interest (Kittler, Dogniaux, \n> Krochmann,\n> Liebelt, Gusev, Nagata, Nakamura Oki et al.), but gensky only uses the \n> LBL one.\n>\n> For the CIE CLEAR SKY, CIE 110-1994 suggests two different polynomial \n> approximations\n> by Kittler (as said, \"for practical purposes\") and by Gusev (for polluted\n> atmosphere):\n> both of them are not used by gensky.\n>\nI'd be interested how these other equations compare.\n\n\n>\n> Part 2: proposal(s)\n>\n> A)\n> As we've seen, gensky is compliant with the CIE standard for the CIE \n> CLEAR and\n> CIE OVERCAST skies when the user gives solar and zenithal radiances.\n>\n> When the user only specifies time and location, gensky uses only some \n> of the\n> equations suggested by CIE. It would be useful to be able to switch \n> between\n> those equations for practical reasons.\n> As I've already said, in Italy there is only a few directly measured \n> illuminance\n> data:\n> some illuminance data series have been derived by using the Perez model.\n> Berin and Vio (University of Venice) have shown that the Doginaux \n> equation\n> approximates very well the Italian luminous conditions, that's why I'm \n> proposing\n> this integration inside the gensky code ...\n\n\nYes, I would prefer not to have to input solar and zenithal radiances in \nlieu of some of the more accurate estimates discussed here.  Actually, I \nwould prefer to just be able to adjust the turbidity to get my desired \nvalues as that should be the only less than accurate input variable.\n\n\n>\n> B)\n> There is no standardised intermediate sky luminance distribution model \n> at the\n> moment, but\n> CIE 110-1994 cites the Nakamura, Oki et al. intermediate sky (does \n> anybody know\n> about\n> recent works of CIE commissions about this topic?)\n> Zack (hi Zack!) showed interest in being able to use the IESNA \n> (Kittler) sky model.\n>\n> It would be very useful to have a sort of \"plug in\" method to insert \n> new sky models,\n> for instance simply via .cal files (at the moment sky definition is \n> splitted between\n> a program and a .cal file).\n>\n> Does anybody else think that this could be useful and feasible?\n> Probably it would be better to develop another program to generate \n> skies and\n> leave gensky\n> as it is now ... and to add a sky library of .cal files to it ...\n\n\nGood idea.  I think this is a good approach, that way old stuff reliant \non gensky will not be affected.\n\n\nThanks again Francesco, that was some great info to add to the \ndiscussion!   Again, please correct me if I am wrong in any of this \nthinking.\n\n\nZack\n\n\n\n\nZack Rogers\nStaff Engineer\nArchitectural Energy Corporation\n2540 Frontier Avenue, Suite 201\nBoulder, CO 80301 USA\n\n\ntel (303)444-4149 ext.235\nfax (303)444-4304\nwww.archenergy.com\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-October/001090.html).</sup>", "id": "radiance-general_001090", "created_by": "Zack_Rogers"}