{"topic": "non-technical", "category": "radiance-general", "attachments": [], "created_by_name": "Tom Young", "created_at": "May 01, 2008 at 01:33AM", "body": "hi\n\n\nI have enjoyed fiddling w Radiance, playing w models successfully  \nexported from SketchUp.\n\n\nI will go on doing this because it's enjoyable. It is time consuming  \nbut I recognise, from past experience, that sometimes you have to  \naccept that time properly spent on work, should, in fact, be spent  \nplaying.\n\n\n From this, good things will come.\n\n\nI am completely non-technical. I approach Radiance in the hope of  \nmaking images that tell me something useful about the fall of light  \nin rooms.\n\n\nTo tell whether or not an image does that is both technical and non- \ntechnical. Certainly, one can tell from experience if an image has  \nany plausibility.\n\n\nPlus, changing settings such as the gensky settings informs one about  \ndifference, even if inexactly.\n\n\nExactitude may be a red-herring. Difference is what matters in the  \nrough and ready world of a practising small-scale architect.\n\n\nOne possibility is setting up a model of light and ground source  \nsettings, with a basic materials file, to review light in spaces one  \nis working on.\n\n\nLet's see: materials aren't that variable in the ordinary world of  \nthe domestic architect. Glass - yes. Decorated plaster - yes. Gloss  \npainted timber trim and structural elements - yes. Marble, various  \nstones primarily Yorkstone, Limestone - yes. Concrete - yes. A range  \nof timbers - larch, walnut, oak, western red cedar. Brick of course -  \nnew and old, red thru yellow to blue.\n\n\nThe impression is that Radiance is used by consultants who have the  \nskill to create the palettes of material which they need from scratch  \nbased on a technical grasp of reflectance, specularity, perturbation  \netc. A practising architect is unlikely to share this facility.\n\n\nSo a materials file such as the one alluded to would be very helpful.\n\n\nI am aware that I am bleating somewhat, and pleading for something  \nthat takes years of skill to produce, but the lighting and rendering  \nconsultants out there are never going experience competition from the  \nlikes of me. So why not release a set of sky files for London and a  \nmaterials file which are credible.\n\n\nI have scoured the Net for Radiance materials and I haven't found  \nanything which deals with the world that I inhabit. The stuff out  \nthere is useful for basic self-tutoring only.\n\n\nNone of the Radiance generated imagery wh I have seen relates to the  \nkind of projects which I am talking about as the meat-n-drink of the  \nordinary London architect.\n\n\n\n\n\n\ntom\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-May/004969.html).</sup>", "id": "radiance-general_004969", "created_by": "Tom_Young"}