{"topic": "rpiece and parallel processing", "category": "radiance-general", "attachments": [], "created_by_name": "Thomas Seebohm", "created_at": "June 13, 2002 at 12:36PM", "body": "Here is part of a recent exchange with Greg Ward on this subject:\n\n\nHi Greg,\n\n\nWhen I first started to use rpiece I thought it would automatically start up\n\n\nseparate processes but then I realized that the processes I started were all\n\n\non the same processor. I don't know where to find the option in rpiece to\nstart parallel processes. I could not find it in the manual. ..... As for\nthe -PP option, I included it with a file name and\nnoticed that Radiance put something into the file when I checked after a run\n\n\nbut it was only one entry, I think. ............\n\n\nThomas\n\n\nHi Thomas,\n\n\nTo run rpiece on a machine with 4 processors, do like so:\n\n\n% rpiece -X 10 -Y 10 -F syncfile -o output.pic -PP mach1.pst -af ambfile\n[rpict options] octree &\n# wait 10 seconds or so for the first process to load the octree, then:\n% rpiece -F syncfile -o output.pic -PP mach1.pst octree &\n% rpiece -F syncfile -o output.pic -PP mach1.pst octree &\n% rpiece -F syncfile -o output.pic -PP mach1.pst octree &\n\n\nThe first invocation initializes the synchronization file and starts the\ninitial rpict process.  The rpict process then forks itself and waits\nfor another process to attach to it via the named pipes in mach1.pst.\nThis is why you don't need to specify the rpict options on subsequent\ninvocations.  However, you need to invoke rpiece once for each separate\nrendering process, and that is how it's supposed to work.\n\n\nTo run rpiece on another machine sharing the same directory over NFS,\nexecute:\n\n\n% rpiece -F syncfile -o output.pic -af ambfile [rpict options] octree &\n\n\nIf that machine also has multiple processors, add a -PP option to the\nfirst invocation, this time giving it a unique name for that machine,\nand add one invocation as above for each additional processor, assuming\nyou want as many rpict processes running as you have processors.\n\n\nIs that clear enough?\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-June/000314.html).</sup>", "id": "radiance-general_000314", "created_by": "Thomas_Seebohm"}