{"topic": "lighting simulation of blinds in Energy Plus vs. Radiance", "category": "radiance-general", "attachments": [], "created_by_name": "Svetlana Olbina", "created_at": "June 05, 2008 at 10:34AM", "body": "Hello, All,\n&nbsp;\nWe are doing research on blinds that we call “split controlled blinds”.\nBasically, we divided a window in three sections in a vertical direction. \nIn each window section we use the same type of the blinds but the slats have different tilt angles in each section (for example, 0 degrees in the upper part (completely open) , 15 degrees in the middle part and then 90 degrees in the lower part (completely closed).\n&nbsp;\nWe plan to do both energy and lighting simulations for these blinds. For the energy simulations we use Energy Plus.\nEnergy Plus also performs lighting simulations. &nbsp;I wanted to ask for your opinion about accuracy/validation of Energy Plus when it comes to lighting simulation.\nI have read that Energy Plus has integrated DElight software (radiosity based lighting simulation software) and that measurements are within 10% error? Is this margin of error acceptable?\n&nbsp;\nOur building is very simple (10’x15’ in the plan), and it has a 6'X6' window on a 10' X 11' wall. We expected sufficient\nlevels of illuminance &nbsp;for this room but we got low illuminance value of 270 lux at the workplane close to the window. \nI am concerned is that either Energy Plus is not accurate enough or we have some error in our input.\n&nbsp;\nHow would you compare Radiance and Energy Plus (or DElight) when it comes to simulation of blinds?\n&nbsp;\nWe are new to Radiance and work already in Energy Plus, so we want to see if we can use Energy Plus for lighting simulation instead of Radiance. \nOr Radiance is still the most accurate tool for lighting simulations? \n&nbsp;\nThank you.\nSvetlana\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-June/005090.html).</sup>", "id": "radiance-general_005090", "created_by": "Svetlana_Olbina"}