{"topic": "mkillum usage", "category": "radiance-general", "attachments": [], "created_by_name": "Marija Velickovic", "created_at": "February 21, 2012 at 05:17AM", "body": "Hi,\n\n\nI've been thinking about mkllum usage and parameters for mkillum\ncalculation. I've explored mailing list and my private archives and also\nRWR book, and come to some conclusions, but also some questions.\n\n\n\n\nAll notes below are for few types of daylight simulations, where windows\nwith/without fenestration are (not)treated with mkillum.\n\n\n########\n\n\n*Luminance images calculation*\nBased on RWR page 351\n“For image generation, the conversion of a window to a light source using\nthe mkillum utility can significantly speed up the production of smooth\nrenderings. The technique works well as long as the total number of\nsecondary light sources is kept reasonably small.”\n\n\n“For those rare occasions when images need to be rendered using high value\nfor -ab, it may be best to avoid using secondary sources and rely on\nambient calculation.”\n\n\nClassical usage of these ideas is usage of mkillum either manually or\nthrough rad program, for window surfaces.\nMkillum parameters:\n\n\n   - -ab 2 is usually sufficient if building exterior is not too complex.\n   If illum surfaces should seal some complex shading system (Venetian blinds)\n   this parameter should be >2.\n   - other parameters - default values can be used because they are\n   sufficiently high\n   - -aa 0 can be used when mkillum is used for Venetian blinds output\n   calculation\n   - -av r g b is set to:\n      - if glazing is between building exterior and interior -  av should\n      be set to *“ground ambient value*” obtained from gensky command.\n      - if glazing is between exterior and interior for upper floors in the\n      building - use the same value as for bottom floors\n      - if glazing is between two interior areas - either use 0 0 0 (which\n      will always underestimate values) or use the compamb script with interior\n      views to come up with a good setting\n\n\n*Question:* If outside environment is heavily obstructed, as it is usually\nthe case in urban areas, how should we determine -av value for mkillum\ncalculation? I think that simple usage of 'ground ambient value' for -av\nwould overestimate luminance inside of the building.\nRad parameters:\nBeside setting of ambient parameters it is good idea to experiment a little\nand find nice set of -d* parameters.\nExample of parameters: -ab 3 -av 0 0 0 -ad 1024 -as 256 -aa 0.1 -ar 600 -ps\n1 -ds 0.05 -dj 1 -dt 0.03 -dc 0.9 -af tmp/floor1_illum.amb\n\n\n###\n*Illuminance images calculation*\nBased on RWR page 351:\n“For illuminance calculations, where -ab >2 is usually essential, the\npreprocessing of windows to secondary light sources is generally not\nrecommended.”\n\n\nIlluminance calculations are needed for DF or Autonomy calculations.\n\n\n*DF calculations*\nGenerally this approach is used in dayfact script, where illuminance on a\nworkplane is calculated with rtrace -I option, and rather high parameters\nare recommended eg: -ab 5 -av 0 0 0 -ad 2048 -as 512 -aa 0.1 -ar 600 -af\ntmp/amb_file.amb\n\n\n*Question:* Why it is not recommended to use mkillum for illuminance\ncalculations?\nI've tried to include mkillum for DF calculation on workplane, and set\nparameters with similar manner like for luminance images - and internal\nilluminances were much higher then without mkillum (with same rtrace\nparameters for the image).\n\n\nSo I need some answer if for illuminace calc approach with mkillum gives\nwrong results, or parameters should be set differently.\n\n\n*Autonomy calculations*\nThese are also illuminace calculations, but since numerous time moments are\nincluded, mkillum doesn't have any sense to be used.\nFor this we can use 3-phase method, or Daysim approach - and calculate with\nhigh ambient parameters.\n\n\n###\n\n\nSo if we say it all in short: what is bothering me the most is -av setting\nfor mkillum, because \"ground ambient values\" seem to high for real project\ncases where there is complex environement outside of the building.\n\n\nAny info about list members' experience with mkillum and daylighting is\nwelcome.\n\n\nThanks in advance,\nMarija\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2012-February/008388.html).</sup>", "id": "radiance-general_008388", "created_by": "Marija_Velickovic"}