{"topic": "VI-Suite v0.4", "category": "radiance-general", "attachments": [], "created_by_name": "Ryan Southall", "created_at": "August 07, 2017 at 12:26PM", "body": "Hi. \nYes, sorry Greg. Probably should have contextualised my previous post a bit. I did announce the VI-Suite on this list but that was a wee while ago.\n\n\nFor those that don't know, the VI-Suite is an addon (plugin) for the Blender 3D content creation suite. As Blender attempts to be the Swiss Army Knife of digital content creation so the Vi-Suite tries to be the Swiss Army Knife of building contextual and performance evaluation. It is indeed free and open source and is released under the same license as Blender (GPL v2).\n\n\nThe VI-Suite has two children: LiVi (Radiance) and EnVI (EnergyPlus). Both emphasise ease of use over exposing a complete set of underlying capabilities. There are also a number of nephews and nieces (sun path, wind rose, shadow mapping, sky view factor). The VI-Suite is also currently pregnant with FloVi (OpenFoam).\n\n\nLiVi, although geared towards the generation of lighting metrics and the visualisation thereof, does I think encompass a fair amount of Radiance functionality including:\n\n\n*    Static and parametric basic (Lux, DF, Irradiance), compliance (LEEDv4, BREEAM, Green Star), Exposure (Luxhours, kWh) and CBDM (DA, ASE, SDA)  calculations. CBDM is done with a two-phase \n     method with Numpy Python matrix transformations to keep it quick and relatively simple.\n\n\n*    Patterns and textures support as posted.\n\n\n*    BSDF creation, simulation and visualisation (only currently Klems for the last one).\n\n\n*    Glare analysis.\n\n\n*    Rpict image generation and falsecolor processing.\n\n\nResults can be exported to CSV or visualised within Blender. Blender mesh objects are used to define the sensor points for rtrace numerical calculations and LiVi visualises the results by colouring these meshes. The integration with Blender is generally pretty deep. Blender's text editor can be used to manually edit Radiance input files and Blender cameras are used for rvu viewpoint etc.\n\n\nCurrent version number is 0.4.12, and as the number suggests it is by no means bug free.\n\n\nAs Greg correctly identified, the main website is at http://arts.brighton.ac.uk/projects/vi-suite where the VI-Suite can be downloaded for OS X, Win & Linux, but most of the 'action' happens at the blog site https://blogs.brighton.ac.uk/visuite. \nThere is also a YouTube video channel where I attempt to explain how the whole thing works https://www.youtube.com/playlist?list=PLySrjcxbIMopXVXNU6FWqy5BCPU1oif8I and a google group https://groups.google.com/forum/#!forum/vi-suite where you can rave at me for writing dodgy code. \n\n\nCheers.\nRyan\n\n\n___________________________________________________________\nThis email has been scanned by MessageLabs' Email Security System\non behalf of the University of Brighton. For more information see:\nhttps://staff.brighton.ac.uk/is/computing/Pages/Email/spam.aspx\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2017-August/012215.html).</sup>", "id": "radiance-general_012215", "created_by": "Ryan_Southall"}