{"topic": "Post-Doc in Image-Based 3D Modeling of Fine Art (RIT/MOMA)", "category": "hdri", "attachments": [], "created_by_name": "Jim Ferwerda", "created_at": "June 03, 2009 at 12:03PM", "body": "Post-Doctoral Position in Image-Based 3D Modeling of Fine Art (RIT/MOMA)\n\n\nSponsor: Andrew W. Mellon Foundation\n\n\nLocation(s): The Munsell Color Science Laboratory, Rochester Institute \nof Technology, Rochester, NY and the Museum of Modern Art, New York City\n\n\nPrincipal Investigators: Drs. Roy S. Berns and James A. Ferwerda\n\n\nProject Description: The Munsell Color Science Laboratory (MCSL) at RIT \nis seeking an outstanding researcher for a two-year postdoctoral \nfellowship in the area of Image-Based 3D Modeling of Fine Art. The goal \nof the research is to develop advanced methods for creating rich digital \nrepresentations of paintings and other cultural heritage objects that \ncan serve as surrogates for archiving, analysis, restoration, \nreproduction, and scholarship. The fellowship is sponsored by the Andrew \nW. Mellon Foundation as part of a project entitled “Improving Artwork \nReproduction through 3D-Spectral Capture and Computer Graphics \nRendering”. Research resources of the MCSL include a light measurement \nlaboratory, a custom imaging goniospectrophotometer, a compute cluster, \nand calibrated spectral printing, display systems, and visual \npsychophysics laboratories. In addition to research at the MCSL in \nRochester NY, the appointment will include extended residencies at the \nMuseum of Modern Art in New York City.\n\n\nRequirements: Applicants should have a Ph.D. in Computer Science, \nComputer Graphics, Image Processing, or a related field. Applicants with \nresearch backgrounds in the following areas will be preferred: \nImage-Based Modeling/Rendering/Lighting, Computational Photography, \nPhysically-Based Rendering, and Material Appearance. Strong mathematical \nand computational skills (MATLAB and C/C++) and a proven track record of \nindependent research and publication are required.\n\n\nApplication Process: Applicants should email a curriculum vitae, and a \ncover letter that describes their graduate training, research interests, \nand qualifications for the position to Ms. Val Hemink (val at cis.rit.edu). \nApplicants should also arrange to have three letters of recommendation \nsent to the same address. Review of the applications will be ongoing and \nwill continue until the position is filled.\n\n\nSalary: Commensurate with experience.\nStart date: Negotiable but no later than October 2009.\nDuration: Two years.\n\n\nMore information about the Munsell Color Science Laboratory is available \nat http://mcsl.rit.edu/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2009-June/000224.html).</sup>", "id": "hdri_000224", "created_by": "Jim_Ferwerda"}