{"topic": "RGB colour conversion", "category": "radiance-general", "attachments": [], "created_by_name": "Axel Jacobs", "created_at": "April 05, 2008 at 12:57PM", "body": "> I tried to implement a colour conversion from RGB (display) to\n> RGB (Radiance) for my Sketchup exporter with information I could\n> find in the archive and on the web. I had some sort of conversion\n> working but the closest match is achieved by using the RGB values\n> directly in Radiance (without any of the -> XYZ -> xyY -> etc steps).\n\n\n> So I'm wondering: Do you have to convert the colour triples at\n> all to get a visual match in Radiance? And if so, has anyone\n> already written a script for this or can point out a simple\n> documentation on the process?\n\n\nRwR, ch. 5.1.4 Estimating Surface Color (new edition) states that the\nRadiance primaries are 'very similar to the primary colors used in\ncomputer RGB monitors, although there is no widely accepted standard.'\nConsidering the colour variations you get with different monitors, and\neven different settings of the same monitor, it's probably not worth\nit.\n\n\nTo be honest, I didn't even look into different RGB colour systems.\nI was more concerned with\na) improving on the Photoshop colour picker technique (also described\nin RwR), which requires:\n  a1) converting the 0-255 range to a 0-1 range, and also\n  a2) applying a gamma correction\nb) creating the material data bases. There are currently well above\n20000 entries.\nc) coding import filters for other colour notations\n\n\nWhile a1), b) and c) are done, I haven't actually had the time to look\nat gamma correction yet, although it should be fairly\nstraight-forward. This is why the swatch may appear rather different\nto the preview render, which has a gamma of 2.2\n\n\nAxel\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2008-April/004908.html).</sup>", "id": "radiance-general_004908", "created_by": "Axel_Jacobs"}