{"topic": "Problems using hdrgen for hdri generation", "category": "radiance-general", "attachments": [], "created_by_name": "Despina Michael", "created_at": "January 06, 2005 at 06:07PM", "body": "Hi all,\n\n\nI am a student and I am new to hdri generation or processing so I need your help:)\n\n\nI am trying to use hdrgen (for linux) for generating an hdr image from a series of photographs with different exposure each, of a static scene . \nI faced some problems and I have some questions for the whole process..\n\n\n1) First of all, I would like to know which is the best way to take photographs with different exposure. \nIf I understand correctly there are two ways. Either by changing F-number and let fixed the shutter speed or either by varying shutter speed and let the f-number fixed.\nI would like to know witch of two ways is the best?\n\n\n2) Are \"Lens Aperture\", \"F-number\" and \"F-stop\" same thing? \nAre \"exposure time\" and \"shutter speed\" same thing?\nI know that these questions may seem to be \"stupid\" to most of you.. but as I said I am not familiar at all, with all these ...\n\n\n\n\nThe following questions are for hdrgen software..\nI used it with different combinations of image... \nSome times the hdr image is generated but it's not clear at all and \"scene\" are not aligned... and some other times the hdr image is not generated at all..\n\n\n3) Where is the fault \nwhen there is a warning:  Trouble finding HDR patches***** ?\nwhen ther is a warning: Poor convergence for order 1 fit? (is 1 or any other number X appear there refers to a problem with the Xth image in command arguments?)\n\n\n4) Where is the fault when there is an error:\n\"Cannot solve for response function\" ?\nIs that because it can not generate file for response function of camera, with specific series of photographs?\n\n\n5) One problem of resulting hdr images (in cases that there was a generation of image)\nwas that they were somehow \"green\". What can cause that?\n\n\n6) My photographs are not perfectly aligned. \nAs I understood, the hdrgen uses an algorithm to align the photographs.\nBut as I noticed when the uses of alighnment algorithm is enable (NOT use of -a option) the \"alignment\" getting worst..\nand when I disabled it (Using -a option) the result is better.. but still no good (I guess because that original photographs are not aligned)\n\n\nIs there anything I can do for that???\nDoes the algorithm has \"limits\" on how much dis-aligned can the original images be?\n\n\nI would appreciate it if you can answer some (or all;-)  ), of these questions.\nRegards,\nDespina\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-January/002264.html).</sup>", "id": "radiance-general_002264", "created_by": "Despina_Michael"}