{"topic": "PRESS RELEASE: DesignBuilder Team Wins ASHRAE Energy Modelling Conference's 'Best Innovative Workflow' Award (DesignBuilder uses Radiance)", "category": "radiance-general", "attachments": [], "created_by_name": "Christian Stalberg", "created_at": "October 23, 2015 at 11:56AM", "body": "DB Logo Small\n\n\n\n\n\n\nFOR IMMEDIATE RELEASE:\n\n\n\n\n\n\nContact:\n\n\nChristian Stalberg\n\n\nDesignBuilder USA\n\n\n(415) 743-0537\n\n\nsales at designbuilderusa.com\n\n\nhttp://designbuilderusa.com\n\n\n\n\n\n\nDesignBuilder Team Wins ASHRAE Energy Modelling Conference's 'Best\nInnovative Workflow' Award\n\n\n\n\nDesignBuilder's advanced cost-benefit analysis tools enabled the team to\nproduce a cost-optimal net-zero energy building in a fraction of the normal\ntime.\n\n\n\n\n\n\n\n\nSanta Rosa, CA - October 23, 2015 - Team DesignBuilder was thrilled to be\nannounced winners of the Lowdown Showdown competition's \"Best Innovative\nWorkflow\" category at the recent ASHRAE Energy Modeling Conference.\n\n\n\n\n\n\nThe competition was designed to showcase the work of teams pushing the\nboundaries of mainstream modelling software tools to create a net zero\nenergy (or below) building. ASHRAE's requirement was to design a 53,600 sq.\nft. 3-storey office building with a number of constraints, but left other\ncriteria such as the building location, form, fabric and HVAC systems open\nto stimulate creativity and innovation.\n\n\n\n\n\n\nCost is an important part of most projects so the team was keen to test\nDesignBuilder's optimization capability and decided on a 3-step advanced\ncost-benefit analysis approach. DesignBuilder Optimization uses a genetic\nalgorithm which mimics the \"survival of the fittest\" principle of natural\nevolution to efficiently identify the best combination of design variables\n(such as orientation, insulation, glazing, lighting, HVAC). This makes it\npossible to find optimum solutions much more quickly than traditional\nmethods, providing the design team and client with an added level of\nconfidence that all viable solutions have been identified. Using\nDesignBuilder Optimization, which is unique among mainstream software tools,\nenabled the team to identify the optimum net-zero solution and also to\nquantify the cost-benefit of higher and lower performing solutions.\n\n\n\"Given the team's desire to use this innovative cost-benefit approach to\nmodelling, we were all delighted to win this particular award for\ninnovation,\" said Dave Cocking, one of the DesignBuilder coaches. \"This was\na great opportunity for us to work with some very talented and enthusiastic\nteam members and gave us all the opportunity to present something\ncutting-edge and a little different at the conference. It is fantastic that\nthe team's effort resulted in this accolade from the voting ASHRAE\naudience.\"\n\n\nThanks again to the DesignBuilder team members: \n\n\n*\tArchitect: Dr. Khee Poh Lam (Carnegie Mellon University)\n\n\n.        Designers: David Polson and Holly Stevenson (Arup)\n\n\n.        Engineers: Gonzalo Lema, Dante Garcia, Billy Condor (SUMAC)\n\n\n.        Energy Modelers: Mike Tillou (Atelier Ten); Mitchell Gleason\n(Building Performance Team); Weili Xu, Adrian Chong, Dr. Omer Karaguzel\n(Carnegie Mellon University); Ignacio Martinez (Revitaliza Consultores).\n\n\nIn addition to the ASHRAE competition web page, the team's work (which\nprovides a useful overview of the optimization process) is summarized here:\nhttp://designbuilderusa.com/lowdown-showdown-competition-ashrae-energy-model\nling-conference-2015\n<http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2Rlc2lnbmJ1aWxkZXJ1c2EuY29tL\n2xvd2Rvd24tc2hvd2Rvd24tY29tcGV0aXRpb24tYXNocmFlLWVuZXJneS1tb2RlbGxpbmctY29uZ\nmVyZW5jZS0yMDE1> \n\n\n\n\n\n\nASHRAE competition website\n<https://www.ashrae.org/membership--conferences/conferences/ashrae-conferenc\nes/2015-ashrae-energy-modeling-conference> \n\n\nDesignBuilder Team Entry Poster\n<http://designbuilderusa.com/sites/default/files/DesignBuilderTeamLDSD2015.p\ndf> \n\n\n\n\n\n\n\n\n\n\nCompany Profile\n\n\n\n\n\n\nDesignBuilder Software Ltd. (Stroud, UK) specializes in developing\nhigh-quality, easy-to-use and affordable simulation software tools for\nassessing the environmental performance of building designs. The flagship\nproduct DesignBuilder provides data to building designers on energy\nconsumption, carbon emissions, occupant comfort, daylight availability as\nwell as the status of the building with regard to several national building\nregulations and certification standards. Leading services engineers and\nenergy modelers across the world use DesignBuilder to gain an insight into\nthe impact of their design strategies on building environmental performance.\nThe software is the result of considerable investment in user interface\ntechnology and an uncompromising approach to software design.\n\n\n\n\n\n\nThe DesignBuilder software is distributed throughout the world by a network\nof reseller Partners.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-October/011315.html).</sup>", "id": "radiance-general_011315", "created_by": "Christian_Stalberg"}