{"topic": "Irradiance due to a sphere and circular surface light sources", "category": "radiance-general", "attachments": [], "created_by_name": "Andrei Kolomenski", "created_at": "January 06, 2016 at 08:05AM", "body": "Dear Radiance/Radiometry Experts,\nI need help understanding the rtrace/rpict irradiance output for a sphere light source. The sphere has a radius of 1 mm. and it is projecting light onto a planar surface, 1 m. away. For this geometry, a point source approximation can be used to represent the light source.\nThe irradiance falling onto the planar surface is governed by the analytical relation:\n               E(theta) = I(theta=0)*cos(theta)*(1/d^2).\nI(theta=0) is the radiant intensity falling perpendicular to the surface. I(theta=0) = L*A, where L=10, is the radiance of the light source and A=4*pi*r^2, is the surface area of the sphere light source. Plugging the numbers into the irradiance formula for sphere at theta=0 (normal projection) yields:\n               E_sphere(theta=0) = (L * A * 1)/(1) = 10 * 4 * pi * (0.01)^2 = 0.012566 W/m^2\nI ran Radiance with this geometry, both rpict(-i) and rtrace (-i -I) produced the irradiance of 0.003141 W/m^2 for theta=0. This result is consistent with the analytical solution if a circle surface is used for the light source, instead of a sphere.\n               E_circle(theta=0) = (L * A * 1)/(1) = 10 * pi * (0.01)^2 = 0.003141 W/m^2\nI changed my Radiance simulation to use a circle (ring with no inner radius) for the light source. For this case, rpict & rtrace both produced that same answer (0.003141), equal to the case of a sphere light source..\nWhy is the irradiance the same for both light source geometries? The sphere emanates light in all directions (4pi sr.), unlike the circular surface which emanates light into a hemisphere (2pi sr.). Since both light geometries were given the same radiance definition (Lr=10, Lg=10, Lb=10), why do they yield the same result in Radiance? While their analytical solutions are different, by a factor of 4.\nI did not use the brighdata primitive to assign a beam pattern to the sphere or circle light sources. I'm assuming a Lambertian light distribution is default, if no beam pattern is provided. Anyway, I would really appreciate your explanation on why these two different geometries produce the same irradiance.\n\n\nThank you very much for your insight,\nAndrei Kolomenski\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-January/011439.html).</sup>", "id": "radiance-general_011439", "created_by": "Andrei_Kolomenski"}