{"topic": "Sketchup to Radiance [was: dxf2rad]", "category": "radiance-general", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "October 23, 2007 at 02:29PM", "body": "On 23 Oct 2007, at 20:39, Rob Guglielmetti wrote:\n\n\n> Yeah, I got two models recently, one built in SketchUp and the other\n> in Revit (same project, same model extents), and the Revit one was\n> literally unusable in AutoCAD, much less Radiance.\n>\n>> I would certainly be interested in trying your translator if and when\n>> you feel it is ready to share.\n>\n> As a very recent licensee of SketchUp Pro, I too would be interested\n> in your translator, Thomas!\n\n\nIt should be said that the script works with the free version.\nI don't have a licence.\n\n\n> I'd also like to hear (maybe off-list) your thoughts on how to model\n> accurately in SketchUp, since it seems to still lack direct coordinate\n> input, UCSs, and the object snaps seem a little lean compared to  \n> ACAD...\n\n\nWell, I have to say that I personally don't use Sketchup a lot. But my\ncolleagues in the office do and just about every computer trained  \narchitect\nout there. I started the script because the export via OBJ wasn't  \nsuccessful\nwith our models (double entities, totally uncontrollable materials  \netc.) and\nI wanted something with a bit more control.\n\n\nI share your opinion that Sketchup is the '6B pen' of CAD tools. And yet\nonce someone has done all the work to create the model, I think it's not\neffective to do it again in another application. Changes are necessary\nto get meaningful results in Radiance but these changes can be done in\nSketchup as well. For Radiance (and lighting in general) the model  \ndoesn't\nhave to be 100% accurate.\n\n\nIt would be nice if the architects would pay more attention on the  \naccuracy\nof their models. But it's not their job to provide the consultants with\nusable models for their particular simulation tool. It's their job to do\nthe fuzzy visual things and that's what Sketchup was design for. If  \nit would\nrequire more precision and accuracy it would not be as popular as it is.\n\n\nEveryone has a favourite and if you know how to use your tools I  \ndon't see\nwhy it shouldn't be possible to create good Radiance models in Sketchup.\n\n\nI just can't get the hang of it.\n\n\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2007-October/004517.html).</sup>", "id": "radiance-general_004517", "created_by": "Thomas_Bleicher"}