{"topic": "Perez Sky for Daylight Simulation", "category": "radiance-general", "attachments": [], "created_by_name": "Greg Ward", "created_at": "March 28, 2003 at 01:21PM", "body": "Hello Jorg,\n\n\nNot knowing anything about your model, it is difficult to say what \nmight be the source of your error.  There are so many possibilities, \nit's difficult to even count them.  First off, you should include a \nground description in your sky description, like so:\n\n\nskyfunc glow sky_glow\n0\n0\n4 1 1 1  0\nsky_glow source sky\n0\n0\n4 0 0 1 180\nskyfunc glow ground_glow\n0\n0\n4 1 1 1 0\nground_glow source ground\n0\n0\n4 0 0 -1 180\n\n\nOr, you could simply increase the coverage of your sky by changing the \n180 to 360.  The result will be the same.  The reason it's important to \ninclude the ground glow is so that rays outside of your ground plane \nare not counted as black.  I assume your model includes a ground plane \n(a large ring or polygon).  If it does not, and your window is near to \nthe ground such that the shadow of the building is important, it can \nmake a significant difference to your results.\n\n\nIf you haven't done so already, I strongly recommend you read the \nchapter in \"Rendering with Radiance\" authored by John Mardaljevic, \nwhich goes into some detail regarding daylight simulations.  His thesis \nis an even better reference, if you can get a copy.  I didn't see a \nlink to it on his website, but there are lots of other useful \nreferences there:\n\n\n\thttp://www.iesd.dmu.ac.uk/~jm/\n\n\nI do not have personal experience with the Perez model of gendaylit, \nbut I can tell you from the experience I do have that real skies almost \nnever match simulated ones.  Unless you start from full angular \nmeasurements of your sky distribution, you cannot really hope for \nagreements between measurments and simulations of much better than \n+/-25%.  This is not the fault of Radiance or of the options you give \nto the simulation, but simply a \"reflection\" of the difficulty of \nmodeling something as naturally variable as skylight.  Sky distribution \nmodels are designed to provide a basis for comparison between designs \nunder \"typical\" sky conditions, and are ill-suited to matching specific \nskies or physical measurments.  Try taking the same reading two days in \na row under what you consider to be an overcast sky.  I wouldn't be \nsurprised if the ratio you measure between the outdoor and indoor \nilluminances doesn't vary under different real skies by at least \n10-15%.  You can't ask any simulation to get errors below this \nvariation no matter how good it is or how well you have modeled the \nsky.  To match the reality of a particular sky, you must measure it.\n\n\nI hope this is helpful.\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-March/000605.html).</sup>", "id": "radiance-general_000605", "created_by": "Greg_Ward"}