{"topic": "modeling blinds / suggesting photon-map", "category": "radiance-general", "attachments": [], "created_by_name": "Peter Apian-Bennewitz", "created_at": "October 29, 2003 at 08:01AM", "body": "Greg Ward wrote:\n\n\n> Hi Barbara,\n>\n> You could use a smaller polygon for a light shelf, but there is less \n> benefit from doing so.  You get a more efficient calculation in the \n> case of blinds simply because you don't have to compute and place as \n> many ambient values if you restrict mkillum to a smaller area, yet the \n> result (provided there is no nearby exterior geometry) will be just \n> the same. \n\n\nUsers may find modelling blinds with direct sunlight benefits from the \nphoton-map add-on, since forward raytracing is more effective than \nbackward raytracing in this situation. At least when using the entry \naperture option in photon-map. The photon map method avoids problems \nwith mkillum's glowing area surfaces as well.\n\n\n-Peter\n\n\nPS: The basic idea is to trace only lightpaths which carry most of the \nscene's energy. A low energy ray is a wasted ray in terms of computer \ntime. That's why modeling blinds with ambient rays only on a sunny day \nis such a drag: Most rays miss the window, those traced through the \nstructure miss the sun and hit something low lit outside (or inside, \ndepending on the blind). On a cloudy day it actually doesn't work as bad.\nMkillum intruduces an auxilary surface and does the same backward step \nfrom this surface. This speed things up, but doesn't work well for \nglazings of complex structure (multiple reflecting elements in it), is \nlimited in angular output resolution and is based on self luminous area \nsources (which are subdivided). The latter two can be eased with \nparameter setting, but  the concept is not nice for elements generating \na highly directed output (light redirecting elements without diffuser).\nPhoton-map was motivated to cope with these: Tracing rays from the sun \n(actually from the bounding cube, see Roland's phd for details) though \nthe window structure (including mulitple reflecting surfaces) into the \nroom. It solves the problem of interfacing the forward with the backward \nstep more elegantly, as the traced photons are stored on the inside room \nsurfaces and not at the window. If you're prepared to face some new \nparameters for photon-map, you'll find it worth the effort.\nIf anyone locates money and workers, there's another interesting step \nbeyond that: more effective raytracing based on the Metropolis algorithm.\n- end of compact early-morning Radiance comment -\n\n\n\n\n pab-opto, Freiburg, Germany, www.pab-opto.de\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-October/001120.html).</sup>", "id": "radiance-general_001120", "created_by": "Peter_Apian-Bennewitz"}