{"topic": "Announcing Radiance 3.7 release", "category": "radiance-general", "attachments": [], "created_by_name": "Greg Ward", "created_at": "July 27, 2005 at 12:36AM", "body": "Hi All,\n\n\nI have put together an official release of Radiance 3.7 on the LBNL  \nRadiance server at:\n\n\n     http://radsite.lbl.gov/radiance/framed.html\n\n\nI think Peter Apian-Bennewitz is on vacation, so it will take a week  \nor two before radiance-online is updated.  I have compiled under Mac  \nOS X, Linux, and FreeBSD, though I expect there will be the usual  \nbinary/library compatibility issues to sort out.\n\n\nBe sure to check out the new mksource and rtcontrib programs, and let  \nme know if you run into any serious compile or runtime issues on your  \nplatform.  A list of significant changes since the previous 3.6  \nrelease last October is listed below.\n\n\nEnjoy!\n-Greg\n\n\n\n\nChanges between Radiance 3.6 and 3.7:\n\n\nChanged default temporary directory from /usr/tmp, which doesn't exist\non a lot of systems these days, to /tmp.\n\n\nEliminated many unused files and programs from the distribution,  \nincluding\nthe following programs that were being built but no longer used:\n     oki20    - printer driver for OkiMate 20 printer (B&W)\n     oki20c    - printer driver for OkiMate 20 color printer\n     pcwarp    - intended as more general substitute for macbetcal,\n             but never quite worked\n     ra_avs    - convert to & from AVS image format\n     ra_bn    - convert to & from Barneyscann format\n     ra_pr    - convert to & from 8-bit Sun rasterfile format\n     ra_pr24    - convert to & from 24-bit Sun rasterfile format\n     thf2rad    - convert GDS \"things file\" to Radiance scene format\nIf anyone is still wanting any of the above programs, let us know and  \nwe'll\nreinstate it.\n\n\nAdded script to convert to/from ICT's Poskanzer Float Map, which I don't\ncare to support officially due to its machine-dependent byte order.\n\n\nFixed bug that caused incorrect reporting of non-surface in set when\nmixing meshes and instances.  (Thanks to Jack de Valpine for discovery.)\n\n\nFixed innacuracy in calculation of diffuse transmission in the presence\nof pure specular (Fresnel reflection) using \"trans\" material.  Thanks\nto Christoph Reinhart for pointing out the error.\n\n\nMade internal change to tone-mapping library to use structure pointer\nrather than stack, making code re-entrant and more up to modern  \nstandards.\n\n\nAdded -pd option to handle depth-of-field blur in rpict.  This requires\nthat the view directon (-vd option) include focal distance information,\nwhich is now preserved by the various view file routines, and reported\nby the vwright command.\n\n\nAdded DBLUR variable to ranimate and pmdblur script to handle  \nsimultaneous\nmotion and depth-of-field blurring.  Thanks to Visarc for funding  \nthis work.\n\n\nAdded setting of focus distance in rvu (\"focus\" command) and rholo\n('f'/\"frame\" command).\n\n\nChanged default remote shell in ranimate to \"ssh\" rather than \"rsh\",\nwhich has been abandoned on most Unix systems due to security issues.\n\n\nFixed behavior of source primitive using illum with no alternate\nmaterial.  These now become transparent so one can see the sky or\nlight-probe background for use in image-based lighting.  Previously,\nthe user needed to specify the background glow as the alternate\nmaterial for a distant illum source to behave properly.  (This still\nworks.)\n\n\nFixed some minor problems and inconsistencies with 16-bit/channel\nTIFF i/o in ra_tiff.\n\n\nCreated mksource program to generate distant sources for improved\nimage-based lighting with light probes.\n\n\nAdded -oM option to rtrace to report material (rather than modifier)\nfor cases where actual material is aliased or further up modifier chain.\n\n\nRearranged the way ray contributions are computed so that it might be\npossible to use rtrace to derive daylight coefficients and optical\ntransfer functions.  The new -oTW option of rtrace produces color\ncontribution weights for each ray, which combined with the -ti (or -tI)\noption permits the contribution of selected surfaces or sources to\nbe determined.  Using the -oTW option, one should also specify\noptions \"-dt 0 -aa 0 -as 0\" for optimal results.  In particular,\none cannot expect reasonable tallies with -ab >= 1 and irradiance\ncaching on (-aa > 0).\n\n\nThe same code modifications included a change to the indirect  \ncomputation\nwith caching switched off (-aa 0).  Whereas before, the number of  \nsecondary\nrays after the first bounce were half of the previous generation,  \nthey are\nnow determined by the surface reflectance, making for a better and  \nfaster\ncalculation.  It should now be possible to compute many bounces with - \naa 0,\nwhich used to be prohibitively expensive.\n\n\nAdded -T option to xshowtrace to trace rays to light sources.\n\n\nAdded meta2bmp program to produce BMP files from metafile graphics.\n\n\nIncreased maximum number of input pictures in pcomb and pcompos to 512.\n\n\nCreated rtcontrib program for computing ray contribution coefficients.\nThis tool may be used to do standard optical ray tracing or daylight\ncoefficient calculations for annual simulations, among other uses.\n\n\nImplemented Russian roulette ray termination with -lr <= 0.\nMade -lr -10 the default in rtcontrib and rtrace.\n\n\nAdded -if and -of options to total for binary i/o (following rcalc  \nmold).\n\n\nAdded -u rendering option for pure Monte Carlo sampling.\n(Got rid of -DMC compile option, which this makes superfluous.)\n\n\nChanged -t option of rlam to accept strings as well as single  \ncharacters.\n\n\nFixed truly ancient bug in bounding box computation for cones, which\ncould (and did) cause missing segments.\n\n\nAdded -z option to normtiff to output LZW-compressed files.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2005-July/002871.html).</sup>", "id": "radiance-general_002871", "created_by": "Greg_Ward"}