{"topic": "metal material - roughness", "category": "radiance-general", "attachments": [], "created_by_name": "Chris Coulter", "created_at": "September 11, 2017 at 06:02AM", "body": "Hello Radiance gurus!\n\n\nI have a quick question about defining roughness in a metal/plastic material. The reference manual describes roughness as “the rms slope of surface facets”.\nWe had a sample tested and the lab has given us this value back, something in the order of magnitude of a few hundred microns. Does this number get input as the roughness factor (after converting microns to meters)?\n\n\nThis number is quite small, but for a metal panel surface it could be correct. Just curious how to take the input and make it a bit more useful.\nThanks in advance. Sorry to have missed everyone in Portland, hopefully next time!\n\n\nChris\n\n\nChris Coulter\nAssociate\nBuroHappold Engineering | Lighting Design\nT: +1 212 334 2025\nM: +1 646 574 2791\nwww.burohappold.com<http://www.burohappold.com/> | @burohappold<http://www.twitter.com/burohappold>\n\n\n\n\nThis transmission is confidential and intended solely for the person or organization to whom it is correctly addressed. If you are not the intended recipient of this transmission, you should not take any action in reliance on it. Further, this transmission may contain confidential design and other information owned by Buro Happold Engineering (“Buro Happold”). You should not copy, distribute, use, offer for sale or hire such information or in any way infringe the design and intellectual property rights of Buro Happold Engineering. It is intended that communication by email from Buro Happold Engineering or its employees is limited to communications connected to the services provided by Buro Happold Engineering. Buro Happold Engineering accepts no liability for any communications not connected to the services it provides. Computer viruses may be transmitted or downloaded onto your computer system via email communication. It is the recipient’s responsibility to take any action necessary to prevent computer viruses being transmitted in this way. Accordingly, Buro Happold Engineering disclaims all responsibility which arises directly or indirectly from such transmission of computer viruses. Buro Happold Engineering.. Registered in New York State, USA. Registered Office: 100 Broadway 23rd Floor, New York, NY 10005. If you receive this message in error, please notify the sender by return e-mail immediately and delete this message, any attachments and all copies from your system.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2017-September/012254.html).</sup>", "id": "radiance-general_012254", "created_by": "Chris_Coulter"}