{"topic": "rad3R5 from latest stable cvs doesn't compile", "category": "radiance-general", "attachments": [], "created_by_name": "tom", "created_at": "April 06, 2003 at 11:46AM", "body": "Hi all,\n\n\nI'm having problems compiling radiance from sources from \nradiance-online cvs. I downloaded the stable tarball and am able to \ncompile most of the executables, but it errors in the src/px dir every \ntime. It seems that the tiff directory is the cause of the problem. It \nappears that the configure script is borked in some way. I have run the \nscript manually and end up with the same results:\n\n\nIt seems to fill the resulting Makefile with random spew\n\n\nWarning, this file was automatically created by the TIFF configure \nscript#Warning, this file was automatically created b\ny the TIFF configure script Warning, this file was automatically created \nby the TIFF configure script@Warning, this file\n  was automatically created by the TIFF configure scriptWWarning, this \nfile was automatically created by the TIFF configu\nre scriptAWarning, this file was automatically created by the TIFF \nconfigure scriptRWarning, this file was automatically\n  created by the TIFF configure scriptNWarning, this file was \nautomatically created by the TIFF configure scriptIWarning,\n  this file was automatically created by the TIFF configure \nscriptNWarning, this file was automatically created by the TI\nFF configure scriptGWarning, this file was automatically created by the \nTIFF configure script@Warning, this file was aut\nomatically created by the TIFF configure script\n\n\nis all one line. This behaviour continues in the version, libdirs, \nmachine type, and random(?) lines throughout the file. This causes make \nto bomb out with a missing separator error during the compile.\n\n\nI'm wondering if this is a local toolchain problem, or if anyone else \nhas experienced this behaviour. I'm compiling on a linux system \n(gentoo), which has been compiled from scratch using this same toolchain \n- gcc 3.2.1, glibc 2.3.1, and the gnu toolset. I have invoked the \nmakeall script from a tcsh shell.\n\n\nany ideas?\n\n\ntom\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-April/000643.html).</sup>", "id": "radiance-general_000643", "created_by": "tom"}