{"topic": "Question about transdata usage", "category": "radiance-general", "attachments": [], "created_by_name": "Mark Stock", "created_at": "April 02, 2003 at 09:53AM", "body": "Hello Radiance users,\n\n\nI have a question about the transdata material type. It doesn't\nseem like I am using it properly, the results always look like\nan unmodified \"trans\" material, no matter what I do with the\ndata file.\n\n\nUntimately, I would like to render a smoky cloud by using multiple\nplanes, each totally transparent except where the smoke exists,\nwhere it is semi-transparent. It seems like \"transdata\" is the\nbest way. I have a 3D data field of density values, scaled either\n0 to 255 or 0.0 to 1.0. I can also write individual planar data\nfiles, if need be. The density is controlled only by position\nin space, not by view vectors, angle, etc. This makes my\nfuncfile very simple.\n\n\nRight now, my scene.rad looks like this:\n\n\nvoid transdata layer1trans\n5 noop layer1.dat translayer.cal pos_u pos_v\n0\n6 0.5 0.5 0.2  0.0 0.97 0.0\n# r g b  rspec trans tspec\n\n\nlayer1trans polygon layer1\n0\n0\n12  0 0.1 1  0 0.1  1 1 0.01  0 1 0.1\n\n\n[other scene stuff: ground plane, light \"source\"]\n\n\nThe simplified data file that I am using now is (layer1.dat):\n\n\n2\n0.0 1.0 3\n0.0 1.0 3\n1 0 1\n0 1 0\n0 0 1\n\n\nAnd the .cal file contains:\n\n\npos_u = Px;\npos_v = Py;\n\n\nWhat this does is create a brown-ish semi-transparent plane\nwith no variations across it. I can only change the trans component\nof the material, and that works properly. When I make the rspec\nor tspec non-zero, I get a \"rview: pos_u: undefined function\"\nerror.\n\n\nSo, I have a few questions:\n\n\n1) do the values in the data file need to be in any particular form?\n   (one of my files has integers 0 to 255, others are 0.0 to 1.0;\n    I know I can scale them within the .cal file)\n\n\n2) how do you control rspec, trans, and tspec from the .cal file?\n   It seems like I can only return one value from there; I use\n   a noop for that one.\n\n\n3) shouldn't I be seeing *some* variation across the plane here?\n\n\nI've been trying variations on these files for a few hours. I\ndon't have the Radiance book here with me to help, but I have\nscoured the digests, online archives, and everything in the\ndistro.\n\n\nCan someone please tell me what I'm doing wrong? I am very geeked\nto make some high-quality renderings of my fluid dynamics research.\n\n\nMark Stock\nmstock at umich dot edu\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-April/000620.html).</sup>", "id": "radiance-general_000620", "created_by": "Mark_Stock"}