{"topic": "Porting Photosphere to Windows & Linux", "category": "hdri", "attachments": [], "created_by_name": "Greg Ward", "created_at": "May 12, 2011 at 09:29AM", "body": "Dear HDRI List,\n\n\nI hired a programmer friend, Helena Eydelberg-Vileshin, to port Photosphere to wxWidgets under Windows with the intent of offering a cross-platform version.  She has nearly completed her arduous task, with just a few bugs to fix and missing features to add.  At that point, probably in the next couple of weeks, I will take her code and port it to the other platforms.\n\n\nI know how to do this on the Mac, although wxWidgets is in flux due to Apple's abandonment of the Carbon library, but I don't know what to do for Linux.  I was thinking I could install a \"virtual appliance\" for one of the available Linux systems under VMWare Fusion:\n\n\n\thttp://www.vmware.com/appliances/directory/cat/5793?k=&sort=created\n\n\nThis should permit me to do the development work on my Mac, avoiding the need for another computer or dual-boot system, but I'm open to alternative suggestions.  If I did get one of these VA's, which one would be most useful to the community?  Would I have to distribute Photosphere in source form with a build system to reach a reasonable number of Linux users?  I ask because I still have some hopes of recovering some of my development and documentation costs for Photosphere, which has been in the works for nearly a decade.  (For those of you who don't know, I have been distributing the Mac version for free from www.anyhere.com, but since it is also based on Carbon, I can't go any further with it.)\n\n\nPlease vote for your favorite version of Linux, clue me in to how I could create one binary that would run on multiple Linux systems, and share your wxWidgets experience if you have any.\n\n\nBest,\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2011-May/000312.html).</sup>", "id": "hdri_000312", "created_by": "Greg_Ward"}