{"topic": "Glass & MTL file troubles... (or how to go from Revit to Radiance with little pain...)", "category": "radiance-general", "attachments": [], "created_by_name": "Jeffrey McGrew", "created_at": "May 11, 2006 at 05:13AM", "body": "So I haven't been doing much with Radiance for the last year and a half \nor so, and suddenly something came up at work where it seemed the best \nsolution. And actually, I've got a secret plan to make better and more \nwidespread use of it where I work (Gensler). My day job is being their \nfirmwide Revit guy, and the more folks we got using Revit, the more \ncomplete and nice models we've got to run design analysis tools on, \nRadiance being one of them.\n\n\nAnyways, I figured out how to go from Revit to Radiance somewhat-quickly \nby using 3D Studio Max as an $3000 converter. Revit only exports DWG, \nDXF, DGN, and SAT's, and Max is the only 3D application that can import \nthose DWG's and leave the Revit materials all intact (so you don't have \nto re-map stuff). So I then export out of Max as an .Obj, grouped by \nmaterial, and I get a nice Radiance-ready OBJ file. Or so I'd hoped. \nI've got two issues, and I'll start with the first big one:\n\n\n1. Revit likes to model glass as a solid plate, not a flat surface. So a \nbit of glass is a rectangular solid, not a flat plane. So when I try to \nmake the windows into Illum's so that they spread light into the room, \nI'm getting errors and problems because I think it's looking for a flat \nplane with the normal pointing into the building. How important is it to \nhave the Windows be a lightsource for interior renderings? Is there some \nway, via Mkillum or something, that I could quickly work around this \nissue? I can flatten the glass in Max, but that's an extra step and one \nthat seems to also cause issues with zero-area light surfaces.\n\n\n2. When I export out of Max, I get a .OBJ and a corresponding .MTL \nmaterials file. I currently use Grep and such to pull out all the \nmaterial definition names out of the RAD file I get from OBJ2RAD, and \nthen creating the .MAT radiance material file by hand. I'd love to hear \na way to take the exported .MTL file and turn it into a starting point \nfor my .MAT (short of having to write my own tool to do so...).\n\n\nNow, we're just designers, and looking for design feedback not hard \nnumbers. We'd be happy with something somewhat-accurate, for if/when we \nneed 'real numbers' we'll typically turn to a lighting designer who know \nhow to generate accurate numbers. But I figure, heck, we're generating \nthese models anyways, why not try to put that to better use?\n\n\nAnd sorry for the long post. As payback for all the help I've gotten \nhere by lurking over the years I'll answer any Revit questions you might \nwanna ask...\n\n\nThanks everyone!\n\n\nJeffrey\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-May/003659.html).</sup>", "id": "radiance-general_003659", "created_by": "Jeffrey_McGrew"}