{"topic": "hdrscope: per-pixel lighting analysis tool", "category": "hdri", "attachments": [], "created_by_name": "Mehlika Inanici", "created_at": "June 11, 2012 at 04:06PM", "body": "Colleagues,\n\n\nWe would like to announce the release of a new tool for image- based \nlight analysis. Hdrscope is a Windows based, user friendly tool that can \nprocess and analyze High Dynamic Range (HDR) photographs and rendered \nimages from Radiance Lighting Simulation and Visualization software. The \nanalysis techniques focus on per-pixel luminance analyses. It is free \nand can be downloaded from: http://courses.washington.edu/hdrscope/\n\n\nHdrscope features a combination of existing and novel tools and image \nprocessing techniques. The fundamental algorithms and programs running \nbehind the scenes within hdrscope are derived from Radiance software, \nand new features are added. One of the most exciting capabilities is the \nability to isolate and analyze a region or two regions of interest from \nan image; the regions can be defined using a rectangle, circle or a \nclosed polygon interactively. Luminance values, ratios, descriptive \nstatistical calculations, percentile ratios, criterion rating, and \nluminance contrast are reported. The software also provides a front end \nto Evalglare. It allows for calibration using luminance measurements, or \nilluminance measurements taken at the camera level for fisheye images. \nIt provides an automated image capture tool for selected Canon cameras \nto take multiple exposure photographs. ‘Single aperture / multiple \nshutter speed’ option is used for general image capture; and ‘two \napertures / multiple shutter speed’ option is provided to capture the \nsun and the sky. Photosphere (of course) is recommended for image assembly.\n\n\nThe work behind the software formed the basis of my student’s \n(Viswanathan Kumaragurubaran) Master of Science thesis in Architecture \nat the University of Washington (Seattle). If you have any questions, \nfeedback, or comments, please let us know (hdrscope at uw.edu)\n\n\nRegards,\n\n\nMehlika Inanici\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2012-June/000417.html).</sup>", "id": "hdri_000417", "created_by": "Mehlika_Inanici"}