{"topic": "defining structured (textured) surfaces in radiance?", "category": "radiance-general", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "January 28, 2004 at 01:49PM", "body": "Hi list!\n\n\nOnce again a question about texturing a surface. In radiance, I know \nabout two ways putting color modification (pattern) or / and normal \nmodification (texture) on a surface to achieve a structured appearance. \nBesides, brdf-modifiers allow to implement the reflection effects of \nmore complicated surfaces.\n\n\nHowever, if I have surfaces with effects caused by their \n(micro-)structure, I get into difficulties. Radiance does not have \nsomething like displacement maps, so the effects from geometry can only \nbe achieved by modeling the surface. I have been thinking a while about \nhow to get the appearance of a mosaic for example, which conists of a \nlayer of gold, a piece of glass in front of it, and which has it's \neffect when seen from a distance because of the specular reflections, \nthe different layers and the irregularities in the overall surface. \nAnother example might be the well-known tennis-ball, which can be \nrendered in radiance only by entering the geometries as instances. \nHowever, this example hass afaik less complicated reflection \nproperties, e.g. the specular reflection is not that important. There \nare other known examples for textures with important geometric details, \nof course, e.g. textiles.\n\n\nIs there a way now to apply a geometry (in the radiance software \nhandled like an instance for memory effectiveness) as a texture? It \nwould be much more convenient to apply such a 3d-texture by using the \ntex-modifiers to an existing surface than writing scripts to place \nthese instances following an imaginary surface. Did anybody think about \ndoing something like that with radiance, or are there reasons why one \nshould not even try that?\n\n\nCU, Lars.\n\n\nLars O. Grobe\ngrobe@gmx.net\n\n\n\n\n\n\nLars O. Grobe, grobe@gmx.net, ++90-212-2458330\n\n\nKardesler Apartment, Turnacibasi Sokak 28\nGalatasaray - Beyoglu, 34433 Istanbul\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-January/001442.html).</sup>", "id": "radiance-general_001442", "created_by": "Lars_O._Grobe"}