{"topic": "Opportunity for PhD studies in RADIANCE (almost :-)", "category": "radiance-general", "attachments": [], "created_by_name": "Alexa I. Ruppertsberg", "created_at": "June 21, 2004 at 11:04AM", "body": "Please, reply to MARINA, not me!\n\n\n\n\nI have funds to pay for an interested person to carry out Doctoral (PhD)\nstudies over a 3 year full time period.\n\n\nClosing date for applications: 30 July 2004. Only open to UK, EU\ncitizens and others classed as Home fees by the UK government.\n\n\nYou will be involved in a project funded by the EPSRC (www.epsrc.ac.uk)\nto study how we see colours of real objects compared to computer\nsimulated ones. We will use Radiance to generate the computer images.\nThe aim of this project is to establish how good human colour constancy\nis in the presence of gradients and to study how it depends on the image\ncharacteristics (real vs simulated, etc) but you can also think of the\nproject as an attempt to carry out a psychophysical validation of the\nimages generated by Radiance.\n\n\nYou will be working with me and another experienced post-doctoral\nresearcher within the Department of Optometry at the University of\nBradford (www.brad.ac.uk). The EPSRC funding covers the construction of\na unique lighting booth in which to carry out the real objects\nexperiments, other equipment (computers, etc), travel money to attend\nconferences and payment of observers. The project has scope for you to\ndevelop your own ideas particularly in the later years of the PhD.\n\n\nSee:\nhttp://www.brad.ac.uk/acad/lifesci/optometry/research/projects/ColourGrad.htm\nfor more info.\n\n\nThis is an interdisciplinary project combining techniques from colour\nscience, psychology and computing. It would suit an enthusiastic\ncandidate with a degree in architecture, engineering, computing, design,\nphysics, maths or psychology with an interest in human factors and\ncomfortable with computers (and Radiance!). It will give you an\nopportunity to acquire experience in academic research, gain a PhD and\npublish in top quality journals.\n\n\nThe University upholds a strong equal opportunity policy and I welcome\nenquiries from mature students. Bradford (www.bradford.gov.uk) is\nsituated in West Yorkshire (in the North of England) among beautiful\ncountryside including the Yorkshire Dales National Park\n(www.yorkshiredales.org.uk) and Bronte Country\n(www.bronte-country.com/welcome.html). You will find excellent mountain\nand road biking, walking, rock climbing and long boat sailing a short\ndistance from the University. The city is small and multicultural with\nlow cost of living, host to the National Film and Photography Museum\n(www.nmsi.ac.uk) and the Bradford Bulls (www.bradfordbulls.co.uk). There\nare excellent rail links (Leeds 20min, London 2.5 hs, Ilkley 30 min) and\nan international airport.\n\n\nStart date for the PhD is flexible; between September 04 and February 05.\nStipend is at Research council level (currently pounds 10000), as a full\ntime student you will be exempt from paying tax. There are opportunities\nto supplement your income via teaching/demonstrating.\n\n\nInterested parties should submit a personal statement indicating why\nthey are interested in the project and their background, a CV and\ncontact details of 3 referees (by 14 June 2004) to:\n\n\nDr Marina Bloj\nDepartment of Optometry, Richmond Building\nUniversity of Bradford\nBD7 1DP\nUK\n\n\ne-mail applications accepted at m.bloj at brad.ac.uk\n\n\nShort list will be drawn up soon after the closing date and award\ndecisions will be made by July 2004.\n\n\nI am happy to deal with informal enquiries via e-mail m.bloj at brad.ac.uk\n\n\n\n\n\n\nMarina Bloj PhD, Lecturer\nDepartment of Optometry, Richmond Building\nUniversity of Bradford\nBD7 1DP\nTel: +44-(0)1274 23 6258 Fax: +44-(0)1274 235570\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-June/001823.html).</sup>", "id": "radiance-general_001823", "created_by": "Alexa_I._Ruppertsberg"}