{"topic": "sky definition", "category": "radiance-general", "attachments": [], "created_by_name": "Greg Ward", "created_at": "October 14, 2003 at 09:40AM", "body": "hello everyone,\n\n\nThanks to u’all ‘the gurus’ I have not only started getting better results, \nbut know better what I am doing.  However the sky still completely baffles me, \nespecially since it is defined so easily even though it is so complex.  \n\n\nHere are the questions:\n1. All I do to specify the sun is write the following one line for the sun : \ndoes gensky model the sun as a light material using these definitions?\n!gensky 4 11 13:0 +s -a (latitude) -o (longitude) -m (meridian) –B (horizontal \ndiffuse irradiance) –R (horizontal direct irradiance, can direct normal be \nused?)\n\n\n2. Should skyfunc be defined by me before it is used as a modifier in the sky \ndefinition, or does the skyfunc modifier take the input from the first line \n(as above) to modify the glow command?  (pg 355 of RWR)\n\n\n3. Following parameters define the sky and I believe it is modified so as to \ngive a blue hue etc, but how is it determined as to what it should be for a \nspecific case?\nskyfunc glow skyglow\n0\n0\n4 .986 .986 1.205 0 (these values are modified, sometimes 4 .9 .9 1 0 is used \nalso for sunny skies)\n\n\nskyglow source sky\n0\n0\n4 0 0 1 180\n\n\n4. Similarly while defining the ground, what is the best way to determine what \nthe ground values for RGB should be – I have been contemplating between using \none of the following case but what should I base the decision on? How do you \njudge as to what values should be used for your specific case?\nskyfunc glow ground_glow\n0\n0\n4 1 .7 .25 0 (or 4 1 1 1 0 is used, I am guessing, for a uniform glow!)\n\n\nground_glow source ground\n0\n0\n4 0 0 -1 180\n\n\nI would really be grateful if someone could help me with this or guide me to a \nspecific text material which I may have missed when trying to look for the \nanswer to the above questions.\n\n\nThanks and have a great day!\n\n\nAmarpreet\n\n\nGraduate Student\nArizona State University\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-October/001055.html).</sup>", "id": "radiance-general_001055", "created_by": "Greg_Ward"}