{"topic": "Irradiation on a Solyndra solar module", "category": "radiance-general", "attachments": [], "created_by_name": "Lovati Marco", "created_at": "January 28, 2015 at 08:32AM", "body": "Dear Radiance guys,\n\n\n                      i was trying to estimate the irradiation on a Solyndra solar module, I created the model in GrassHopper (attachment:Solyndra.gh,); the Solyndra pipes are modeled as 24 side regular polygons extruded, their length is not perfectly aligned north-south, but is oriented some 8.5° clockwise (I'm trying to match some experimental data).\n\n\nI run the simulation 4 times every hour of one day (therefore 96 times) using gendaylit with a sky description like the following one:\n\n\n# Sky Definition\n\n\n\n\n\n\n!gendaylit 12 16 11.5 -W 828 39 -a 46.467 -o -11.333 -m -15 -O 1 # 828 and 39 are values i copied from weather data, the weather station is close to the real Solyndra\n\n\nskyfunc glow sky_mat\n\n\n0\n\n\n0\n\n\n4\n\n\n1 1 1 0\n\n\n\n\n\n\nsky_mat source sky\n\n\n0\n\n\n0\n\n\n4\n\n\n0 0 1 180\n\n\n\n\n\n\nskyfunc glow ground_glow\n\n\n0\n\n\n0\n\n\n4\n\n\n.5 .5 .5 0\n\n\n\n\n\n\nground_glow source ground\n\n\n0\n\n\n0\n\n\n4\n\n\n0 0 -1 180\nThe command for Radiance is written like the following (I have chosen as example the one which utilizes the sky shown above):\ncd C:\\Users\\MLovati\\Documents\\Solyndra\\quarterofhour\noconv -f C:\\Users\\MLovati\\Documents\\Solyndra\\quarterofhour\\blue_skyes_over_my_head\\Solyndra_sky46.rad C:\\Users\\MLovati\\Documents\\Solyndra\\quarterofhour\\Solyndramaterial.rad C:\\Users\\MLovati\\Documents\\Solyndra\\quarterofhour\\Solyndra.rad > Solyndra.oct   #Solyndra_sky46.rad is the one shown above, (46/4 =11.5)\nrtrace -I -h -dp 2048 -ms 0.063 -ds .2 -dt .05 -dc .75 -dr 3 -st .01 -lr 12 -lw .0005 -ab 2 -ad 1000 -as 20 -ar 300 -aa 0.1   Solyndra.oct < Solyndra.pts > _results\\solyndra46.dat\n    don't read: the folder name \"blue_skyes_over_my_head\" is in honour of a song from Tom Waits\n\n\nin this way I can have a curve of the solar irradiation on the solyndra in one day (in this case the december 16th), and here it comes the puzzling part:\n[cid:image003.png at 01D03B20.5C09C200]\nWell, for those who think that the shape is strange: it's not, also the electricity production has that spike in the morning\nThe real question is: why it changes just a few from 10° to 9.25° (0.75°) and then abruptly from 9.25° to 8.5° (0.75°)\nDoes it makes sense? I didn't expect such a difference for 0.75°\nfor the sake of completeness: in the next chart this results are compared with the ones provided by a full deterministic model, please notice how there is not much difference, and they all are really similar to the 10° one, so the 8.5° clearly stands out of the group\n[cid:image005.png at 01D03B20.5C09C200]\n\n\nHope somebody can give me a clue, I am clueless\nThank You much everybody for your kind attention.\n\n\nMarco Lovati, MEng\nInstitute for Renewable Energy\n\n\nEURAC research\nInstitute for Renewable Energy\nVia Luis Zuegg 11, I-39100 Bolzano\nt +39 0471 055 667\nmarco.lovati at eurac.edu<mailto:marco.lovati at eurac.edu>\nwww.eurac.edu<http://www.eurac.edu/>\n\n\nEURAC research\nLegal Seat\nViale Druso 1, I-39100 Bolzano\n\n\nThis transmission is intended only for the use of the addressee and may contain confidential or legally privileged information.\nIf you receive this transmission by error, please notify the author immediately by mail and delete all copies of this transmission and any attachments.\nAny use or dissemination of this communication is strictly prohibited by the \"Privacy-Code\", D.Lgs. 196/2003 and may lead to penal prosecution and liability for damages.\nP Think before you print\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-January/010718.html).</sup>", "id": "radiance-general_010718", "created_by": "Lovati_Marco"}