{"topic": "evalglare changing luminance values??", "category": "hdri", "attachments": [], "created_by_name": "Chris Coulter", "created_at": "June 02, 2011 at 01:37PM", "body": "Good day HDRI list!\nI have taken a series of fisheye photos of a completed project in hopes of gathering some data on glare sources as it relates to the special occupancy. So far I have been able to successfully composite them into an HDR with hdrgen. Then, using pcomb, I scaled the luminance values and reduced image size for input into evalglare. The output from evalglare is where I run into problems.\n\n\nFor instance: in my pcomb'd image, I get a local average luminance of 176.3 nits and the same spot in the evalglare image shows 1127 nits. This of course results in false identifications of glare sources by evalglare. Can anyone please explain this phenomenon? Here are my commands used to generate both images:\npcomb -x xmax/4 -y ymax/4 -s 1.175 -o pt2.hdr > pt2_conv.hdr\nevalglare -b 2000 -c pt2.glr pt2_conv.hdr (currently interested in glare sources > 2000 nits)\n\n\nI noticed that hdrgen set the image header to VIEW=  -vtv -vh 104.96 -vv 104.16. I've tried to use vinfo to edit the header to correctly set VIEW= -vta as evalglare would expect, but achieve the same results as mentioned above.\n\n\nIf anyone is interested, I've posted my pcomb image and evalglare image to my GoogleDocs:\npcomb: https://docs.google.com/leaf?id=0Bx321BZMymleNzc5NWRhZjEtZWM5Mi00NjgxLTliZWUtN2RjMTgyMmVjNDhj&hl=en_US&authkey=CJTZnPYI\nevalglare: https://docs.google.com/leaf?id=0Bx321BZMymleZmZhNWM0YTEtZTVkZS00ZDA5LWE5ZTAtZjMxOTI4NzRkM2Ey&hl=en_US&authkey=CI6xwfAH.\n\n\nI appreciate the help I've received from the Radiance gurus on the general list and look forward to hearing your thoughts on yet another issue.\nBest,\nChris\n\n\nChris M. Coulter, LC, IESNA, LEED AP\nAssociate\nLighting Designer\nPresident, Detroit Section of the Illuminating Engineering Society\n............................................................\n\n\nSmithGroup\nwww.smithgroup.com<http://www.smithgroup.com/>\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2011-June/000323.html).</sup>", "id": "hdri_000323", "created_by": "Chris_Coulter"}