{"topic": "Properly defining a roller shade fabric asa TRANS material type", "category": "radiance-general", "attachments": [], "created_by_name": "Christopher Rush", "created_at": "January 22, 2010 at 07:25AM", "body": "Good point about the thickness. If the shade is 3% open I suppose the\nexpectation would be slightly less than this in pure specular\ntransmission due to the thickness of the fabric.\n\n\nLars, Does this agree with your goniophotometer experience with woven or\nperforated materials?\n\n\n-----Original Message-----\nOn Behalf Of Lars O. Grobe\nSent: Thursday, January 21, 2010 9:16 PM\n\n\nChristopher Rush wrote:\n> I would have guessed if your total measured transmission was 20%, and \n> you know the openness is 3%, the 3% would correspond to specular \n> transmission and the other 17% must be diffuse transmission, no?\n>   \nWell, it is still a simplification valid only for normal incident\nangles, as the fabric has a thickness and the projected area of the\nwholes between the fibres depends on that incident angle. You will have\nlight hitting the front of the fabric being reflected back, the \"sides\" \nof the opening, being scattered, light passing through the openings\nwithout touching any material being transmitted as specular, light\nhitting the fibres but being transmitted as diffuse.... You can assume\nto get a pretty diffuse reflection, but the 3% information will not be\nenough to accurately descibe the transmissive properties. This would\nrequire either measurements (we have used a goniophotometer for this\ntype of materials) or a good model for the fabric where you could derive\nthe raypaths for different incident angles from.\n\n\nCheers,\n\n\nLars.\n\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-January/006481.html).</sup>", "id": "radiance-general_006481", "created_by": "Christopher_Rush"}