{"topic": "Depth-of-field hack", "category": "radiance-general", "attachments": [], "created_by_name": "Mark Stock", "created_at": "August 16, 2004 at 07:30PM", "body": "Radiance users,\n\n\nRecently, I have been playing around with several Radiance\nprograms that I never would ordinarily use, and I devised a new\nway to create depth-of-field blur. My primary motivation is\nfor creating very large images of very complex scenes. I\nwant to thank Greg for making time to meet me at SIGGRAPH,\nand for getting me started on this line of thinking.\n\n\nI have been creating images by using -aa 0 with -ps 1 for\nover a year now. In a little previous work\n(http://mark.technolope.org/radmisc/aa0_ps1_test/final.html)\nI found that the fastest renderings could be had with\nvery low -ad but high oversampling. I wanted to find a\nmethod for depth-of-field blur that worked similarly,\nand would be compatible with this method.\n\n\nI first tried pdfblur, which outputs a series of views, each\nof which can be rendered with rpict or created with pinterp.\nThe pinterp method is definitely faster, but, as expected,\nthe pixels that were in focus were never recalculated, and,\nthus, remained spotty:\nhttp://mark.technolope.org/radiance/dof_tests/img06_30.png\n(-ad 4, pdfblur 0.003 0.4 30, reduced 4:1)\n\n\nUsing pdfblur with rpict, though, forced resampling of each\npixel, so it took longer, but I didn't have to reduce the\nfinal image at all to get this:\nhttp://mark.technolope.org/radiance/dof_tests/img03_30.png\n(-ad 4, pdfblur 0.003 0.4 30, not reduced)\n\n\nThe problem that I see, though, is that some large images will\nneed hundreds, if not thousands, of images blurred together\nto eliminate the sharp lines in the highly-blurred regions,\nwhile the oversampling technique rarely needs more that 36-64\noriginal pixels to each output one (6-8x oversampling).\n\n\nThat's when I started reading lots of man pages. I wanted a way\nto simulate DOF within a single image. What I came up with could\nbe used as an option to rpict, where it could be implemented more\naccurately, I presume, (and which I may just do sometime). It\nconsists of a rather long command-line using vwrays (to create\neach pixels' view ray), vwright (to calculate numerous view\nparameters), rcalc (to adjust the view point and direction of\neach), and rtrace (to take that information and compute a pixel\nvalue).\n\n\nMy first try only supported aperture specification, but set\nthe focus distance to infinity. I then added a slightly-\nincorrect hack to point the view direction back toward the\noriginal view-at point. This is the script:\n\n\nvwrays -fd -vf vp -x 512 -y 512 | rcalc -id6 -e 'a:0.003;d:0.4'\n-e `vwright i < vp`\n-e 'theta=2*PI*rand(2*recno-1);r=0.5*a*sqrt(rand(2*recno))'\n-e 'r1=r*cos(theta);r2=r*sin(theta)'\n-e 'dx=r1*ihx+r2*ivx;dy=r1*ihy+r2*ivy;dz=r1*ihz+r2*ivz'\n-e '$1=ipx+dx;$2=ipy+dy;$3=ipz+dz'\n-e '$4=$4-dx/d;$5=$5-dy/d;$6=$6-dz/d'\n-od | rtrace -fdc -x 512 -y 512 @opts scene5f.oct > img04.pic\n\n\nThe \"a:0.003;d:0.4\" line specifies aperture and focus distance.\nThe \"vp\" file looks like this:\nrview -vta -vp 0.51 0.52 0.34 -vd -0.43427 -0.86854 0.238848 -vu\n0 0 1 -vh 70 -vv 70 -vo 0 -va 0 -vs 0 -vl 0\nThe opts file looks like this:\n-ab 2 -ad 4 -aa 0 -as 0 -dj 0.7 -ms 0.03\nThe resolution gets specified in two places on the command-line.\n\n\nAt 512x512, this produced the following image:\nhttp://mark.technolope.org/radiance/dof_program/img04.png\n\n\nAnd at 4096x4096, reduced to 512x512 (aperture was not\nhalved in radius calculation, thus appears more blurry):\nhttp://mark.technolope.org/radiance/dof_program/img05q.png\n\n\nAnd that's what I wanted to share. I hope someone finds it\nuseful. I especially hope that someone improves on it. Right\nnow it is less useful to me, as I cannot incorporate it\ninto an rpiece batch job, or restart it if it dies.\n\n\nMark\nmstock at umich.edu\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-August/001973.html).</sup>", "id": "radiance-general_001973", "created_by": "Mark_Stock"}