{"topic": "calibrating HDR pictures with real world luminance", "category": "hdri", "attachments": [], "created_by_name": "Pierre-Felix Breton", "created_at": "September 26, 2006 at 10:17PM", "body": "Hi!\n\n\nI am experimenting with HDR images and a luminance meter to see how tone\nmappers can actually help reproducing human perception.\n\n\nHere is what I  am currently  doing:\n\n\na)capture a serie of LDR images using a Canon Rebel XT, only changing the\nshutter speed, with constant Fstop,  saved as JPG with sRGB profile\nb)creating a calibration curve in HDR Shop\nc)measuring a few points in cd/m2 with a luminance meter (LS-110)\nd)making an HDR image out of the LDR images using the calibration curve\ne)experimenting different tone mappers available on the DVD of the HDRI book\nfrom our favorite well known HDRI gurus.\n\n\nHere are a few questions that puzzles me still:\n\n\n1)  I am trying to scale my HDR image to the measured physical  values.  I\nfound somewhere that luminance = 179 * (R*0.265 + G*0.067 + B*0.065).  Can I\nassume that this equation is the one to use to scale my HDR file properly?\n\n\n2) In some references, it is mentionned that I should always capture LDRs\nwith a Daylight white balance.  Is this the general agreement?  Even if my\nscene is lit with tungsten lights?\n\n\n3)I found limited explanation on how the camera calibration curve would\naffect the results in HDR Shop.  I would have to think  that this is to\nlinearize the color values (remove the effect of Gamma + CMOS response) so\nluminance measurements can be actually applied to the colors later on.\n\n\n4)HDR Shops refers to Fstops in the UI.  However,  I read that you want to\nmaintain Fstops constant and only change the shutter speed.  The problem I\nhave is that the interpreted Fstops of HDR Shop turn into some \"arbitrary\"\nnumbers and I can't really type-in the values used by my camera.  \n\n\nI am not too sure if I am using the right methods.   Some \"cook  book\" would\nbe handy.\n\n\nBest regards,\n\n\nPierre-Félix Breton\nwww.pfbreton.com <http://www.pfbreton.com/>\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2006-September/000135.html).</sup>", "id": "hdri_000135", "created_by": "Pierre-Felix_Breton"}