{"topic": "Replys", "category": "radiance-general", "attachments": [], "created_by_name": "Chris Foster", "created_at": "May 22, 2006 at 10:41AM", "body": "Jack\n\n\nI am eventually trying to model a large white chamber for testing the\nperformance of displays under different lighting conditions, specifically\nusing a spotlight to imitate the Sun (high brightness levels). i feel the idea\nis to put a land rover in the chamber, with a display on its windscreen \nalthough the full details have yet to be finalised. because of this i have been\nlooking at trying to find details of how to measure the sun's luminance\nbut the only standard i have managed to find (CIE 108-1994 Guide to recommended\npractice of daylight measurement) doesnt go into apparatus details. i have been\nlooking at the idmp but i havent been able to access their website since i have\nbeen at work, not sure if its my computer or the website is down.\n\n\nGreg\n\n\nMoney coming your way as my boss has decided to buy your book!\n\n\nWill\n\n\nunfortunately autodesk do not involve my university (dundee) so cant get it free,\nbut by the sound of most people's comments i shouldnt even if i could.\ni will look into doing the modelling on windows and then transferring them,\nthe pc im using has both linux and windows on which will help.\n\n\n\n\nLars\n\n\nIm on a industrial placement as part of my Masters course, so i suppose the project\nis commercial (as the work im doing will belong to npl) although i will be \ngetting graded on it as its my dissertation. dunno is any of the group has heard\nof my course (its apparently well known) but im on the displaysmasters course??\nill look into the things you have mentioned, thanks.\n\n\nThanks\nChris\n\n\n\n\n\n\n\n\n\n\nThis e-mail and any attachments may contain confidential and/or\nprivileged material; it is for the intended addressee(s) only.\nIf you are not a named addressee, you must not use, retain or\ndisclose such information.\n\n\nNPL Management Ltd cannot guarantee that the e-mail or any\nattachments are free from viruses.\n\n\nNPL Management Ltd. Registered in England and Wales. No: 2937881\nRegistered Office: Serco House, 16 Bartley Wood Business Park,\n                   Hook, Hampshire, United Kingdom  RG27 9UY\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-May/003702.html).</sup>", "id": "radiance-general_003702", "created_by": "Chris_Foster"}