{"topic": "Official 5.0 release", "category": "radiance-general", "attachments": [], "created_by_name": "Greg Ward", "created_at": "September 23, 2015 at 10:22AM", "body": "++++++++++++++++++++++++++++++++\nAnnouncing official Radiance 5.0 release\n++++++++++++++++++++++++++++++++\n\n\nIt's been over a year since the last official release, and 5 years since the last major one.  The biggest change is the addition of Roland Schregle's photon-mapping code, whose integration was sponsored and coordinated by the Lucerne University of Applied Sciences and Arts, Competence Centre Envelopes and Solar Energy (www.hslu.ch/ccease) in collaboration with the US Dept. of Energy.  Special thanks to Roland himself, Stephen Wittkopf, Lars Grobe, David Geisler-Moroder, and to Amir Roth, who covered my part in the final push.\n\n\nAnother significant addition/incorporation in 5.0 is Jan Wienold's evalglare tool, which he provided right before this year's workshop.  I would also like to thank Eleanor Lee (as always) for her ongoing support and management of Radiance development at LBNL.\n\n\nThe new release will be available from the following link, together with Mac OS X binaries (which hopefully work under Yosemite as well):\n\n\n\thttp://www.radiance-online.org/download-install/installation-information/latest-release/release.html\n\n\nNREL will post Radiance 5.0 binaries for Windows, Max and Linux on the NREL Radiance GitGub mirror, here:\n\n\n\thttps://github.com/NREL/Radiance/releases/tag/5.0\n\n\nA number of important fixes and features come in addition to the photon map.  Below are a few highlights.\n\n\nCheers,\n-Greg\n\n\n++++++++++++++++++++\n\n\nCreated wrapBSDF tool and incorporated into genBSDF along\nwith new rfluxmtx computation.\n\n\nAdded left-hand coordinate sytems to rfluxmtx to correct\nproblems with coordinate axis orientations pointed out by\nDavid Geisler-Moroder.\n\n\nAdded color output to genBSDF (+C option) and support for\ncolor rendering of Klems and tensor tree data.\n\n\nFixed bug discovered by Jacob Jonsson in Klems BSDF\ninterpolator that caused it to over-predict normal\ntransmittance and reflectance.\n\n\nAdded ability to read input from commands in dctimestep\nand rmtxop.\n\n\nAdded photon map support to rad.  Fixed some double-counting\nissues in photon-mapping spotted by David Geisler-Moroder.\n\n\nAdded photon map support to trad.\n\n\nPrompted by Roland S., added option to have pcompos -a order\nrows from top rather than bottom of image.\n\n\nChanged dctimestep to accept matrix as well as BTDF input\nin the VTDs invocation mode.  This permits the output of\nrmtxop to be used in a pinch when combining multiple BTDF\nlayers, although interreflection between layers is not\naccounted for properly as it is in the WINDOW program.\n\n\nAdded Jan Wienold et al.'s evalglare to distribution.\n\n\nHopeful fix to deadlock issue under Mac OS X 10.10.x (Yosemite).\n\n\n++++++++++++++++++++++++++++++++\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-September/011248.html).</sup>", "id": "radiance-general_011248", "created_by": "Greg_Ward"}