{"topic": "60Watt bulb comparison", "category": "radiance-general", "attachments": [], "created_by_name": "Anthony J. Farrell", "created_at": "June 30, 2004 at 08:46PM", "body": "John\n\n\nThanks for the useful info.\n\n\nI had to construct a small black box (0.5 cube) for calibrating electronic\nsensors I am currently using to monitor a full scale light pipe\ninstallation, which in turn will be compared with a Radiance model thereof.\n\n\nFurthermore, Recent research (Maamari et al. 2003) shows that a cube dark\nbox with an\nopening central to one of the walls is most appropriate for simulation\nmodelling\ncomparison because reflectance values are minimal and easily measured, and\nmodelling complexities and associated anomalies are minimised. Conventional\nmodelling architectural black/white card display board. The reflectance\nvalue for black mounting board was measured by Cannon-Brookes (1996) and is\nquoted at 8.5%. A standard 60W incandescent light bulb was also fitted to\nthe dark box to fit into the recessed aperture, and was made removable for\ndaylight monitoring whereby the recessed aperture acted as a window or sky\nlight (without glass). I take your points though, that scale will influence\nthe final results, and in absence of good data for the GE 60W standard light\nbulb I am using, its not good scientific comparison.\n\n\nAnyway, I am more interested in the accuracy of the program with respect to\n*daylight* rather than electric lighting. To date, I can only locate your\nown work to the accuracy of the Radiance accuracy with daylight (as in the\nRwR manual)...\n\n\nJust on this point....does anyone know of any other references that have\ncompared daylight measurements with Radiance? would be great to include them\nin my literature review.\n\n\nIt would be nice to model this simple box I have constructed in two\npositions = recessed roof light, and recessed side window, facing each\norientation on overcast and sunny days. I could then create the model of the\nbox to scale (1=1) in Radiance and compare results with monitored values on\nthe roof of the campus building here in Dublin. What do you think about\nthis? or can you suggest some ways of enhancing the tests?\n\n\nKind Regards,\n\n\n\n\nAnthony\nDublin Institute of Technology\n\n\n\n\n\n\n-----Original Message-----\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-June/001865.html).</sup>", "id": "radiance-general_001865", "created_by": "Anthony_J._Farrell"}