{"topic": "Modeling glare from light fixtures", "category": "radiance-general", "attachments": [], "created_by_name": "Chien Si Harriman", "created_at": "May 11, 2011 at 10:27PM", "body": "Hi-\n\n\n\n\n\n\nA question to the radiance community.  I've been tasked with modeling a\nT5 light fixture in its housing.  This is new for me as a project in\nRadiance, as I've largely used it to model natural daylight only, with\nthe use of imported .IES files when needed.  I believe that I have to\nmodel the light fixture and its associated housing because, for this\nhigh-end conference room, the client for whom I am working is concerned\nabout glare emanating from the fixture during video conferencing.  The\n.IES files just don't have that type of information, as they are really\n(at least in this case) files that really just describe the flux as a\nmathematical model, and does not physically model the interactions of\nthe light bulb in its housing.  As a result, I can't really show glare\nemanating from the fixture at all!  (these are all things I'm sure you\nare already aware of)\n\n\n\n\n\n\nI am wondering a couple of things, and am looking for some advice,\nreactions, precautionary tales, etc. based on the information that I\ncurrently have at hand.  I'm willing to take harsh criticism so lay it\non me.\n\n\n\n\n\n\nIt seems my most accurate option is to model a T5 fixture as a glow\nobject, giving off the appropriate luminous flux inside of a reflective\nhousing.  I would likely have to take some guesses as to the geometry of\nthe fixture just because, at least at this time, I don't have a physical\nsample of the fixture, nor do I have any sort of exploded orthgraphic\nprojection showing the inner details of the fixture.  I'd likely take\njust a section of the fixture (found on the cut sheet) and extrude it\nthe appropriate length.  My biggest concern is in regard to modeling\nsuch a high intensity of light in such a small confined space with so\nmany bounces of light.  I am not sure if there are \"standards\" in terms\nof simulation settings, or other helpful pointers, that would normally\nbe applied to simulate the fixture in this way.\n\n\n\n\n\n\nThe other option, far simpler though possibly just as effective (and\nthis is a huge possibly in my mind), is to simply place a square\nluminous glow object over the fixture where the light would normally\nexit the fixture.  I suppose I could build up my own mathematical\nrepresentation of how the glow object should distribute its light (in\neffect build my own .IES file (of sorts).  Though, I truly have never\ndone this before and I would assume there is a chance of error.  Any\nguidance for how to go about this would be appreciated, perhaps a\nreading supplement to the Ward & Shakespeare book to ground my thinking,\nat the very least.\n\n\n\n\n\n\n\n\n\n\nAs always, your help is appreciated.  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChien Si Harriman   LEED AP\n\n\nSenior Building Performance Engineer\n\n\n(P) 415.655.4005 \n\n\nGUTTMANN & BLAEVOET Consulting Engineers\n\n\nSan Francisco | Sacramento | Santa Rosa <http://gb-eng.com/page/Contact>\n| Walnut Creek <http://gb-eng.com/page/Contact>  | Website\n<http://www.gb-eng.com/> \n\n\nCertified Green Business <http://www.greenbiz.ca.gov/AboutUs.html>\ncommitted to the 2030 Challenge <http://www.2030challenge.com/> \n\n\nHVAC, Plumbing, Fire Protection, Electrical, Lighting,\nTelecom/Technology <http://gb-eng.com/page/services> \n\n\nNew and Existing Building Commissioning, Energy & Building Performance\nModeling <http://gb-eng.com/page/services>\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2011-May/007821.html).</sup>", "id": "radiance-general_007821", "created_by": "Chien_Si_Harriman"}