{"topic": "How does Pvalue determine CCT in HDR images and how is the EV of a HDR image determined?", "category": "radiance-general", "attachments": [], "created_by_name": "Morsink, K.", "created_at": "July 26, 2017 at 07:34AM", "body": "Hello everybody,\n\n\nI’m Kars and I’m new to this Radiance forum.\n\n\nIn the manual of Pvalue (https://www.radiance-online.org/learning/documentation/manual-pages/pdfs/pvalue.pdf) it is stated that inputting a file in XYZE format will give you the luminance values of the image (corresponding to the Y channel).  I’ve inserted some .hdr images in Pvalue with the following Primaries (taken from the EXIF data): PRIMARIES= 0.6400 0.3300 0.3000 0.6000 0.1500 0.0600 0.3127 0.3290, where the first two numbers correspond to the R primary (x,y), the third and fourth to the G primary (x,y), the fifth and sixth to the B primary (x,y), and the seventh and eighth to the white point (x,y). The EXIF data also shows an exposure value of the .hdr image.\n\n\nI’ve got two questions regarding this conversion.\n\n\nTo my knowledge the white point coordinates can be used to calculate the CCT, as described by Inanici in Evaluation of High Dynamic Range Photography as a Luminance Data Acquisition System. The white point coordinates, as found in the EXIF data, correspond to the CIE standard illuminant D65. Does this mean Pvalue assumes a constant CCT for all the .hdr images when converting to luminance? Or is Pvalue making other assumptions / calculations?\n\n\nMy second question refers to the exposure value of the .hdr image, as shown in the EXIF data of the image. How is this value determined? Since a HDR image consists of multiple images (in my case 7) with different exposure values. What is this exposure value of the .hdr image based on and is this used by Pvalue somehow?\n\n\nI hope I’ve made myself clear.\n\n\nKind regards,\n\n\nKars Morsink\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2017-July/012177.html).</sup>", "id": "radiance-general_012177", "created_by": "Morsink,_K."}