{"topic": "CVS, ANSI, C++", "category": "radiance-general", "attachments": [], "created_by_name": "Randolph Fritz", "created_at": "June 11, 2002 at 11:51PM", "body": "[Copied to both lists.  Until a few more people--including Greg\nWard!--sign up for radiance-dev I don't feel right about using it\nexclusively for this discussion.]\n\n\nOn Sun, Jun 09, 2002 at 08:02:07AM -0700, Greg Ward wrote:\n> I like what Randolph had to say about code conversion.\n\n\nThank you.\n\n\n> I never bothered to take them out because they still seem to compile, \n> and they don't affect anything (other than taking up a bit of space on \n> everyone's systems) since Radiance programs that are never run never \n> interact with the rest of the codebase...\n\n\nI agree...but I don't see good reasons to preserve some of them\nthrough an extensive rewrite.  If they're hard to ANSIfy, I think we'd\nbe advised to just put them aside.\n\n\n> We're probably looking at a week or two of one programmer's time, and a \n> few hours from each volunteer.  Who wants to step forward?\n\n\nI can offer a few hours, but exactly when is uncertain.\n\n\n> An afterthought to my last message.  The process of ANSI-fication should \n> probably include a merge of the Desktop Radiance version, at least \n> insofar as supporting Windows compilation as well.  \n\n\nHow do people feel about Cygwin/gcc\n<http://sources.redhat.com/cygwin/> under Windows?  I don't know the\npackage, and it probably still needs an MS compiler for the header\nfiles, but otherwise we can use the familiar Unix tools on Windows.  I\nhave, however, only a bit of experience with cygwin, and don't how\nwell it works for a large project.\n\n\nGeorg Mischler:\n> It could also be interesting to consider another implementation\n> framework for all the helper programs circulating around the actual\n> Radiance core. Some of the csh scripts have been rewritten in C for\n> Windows, with limited flexibility and robustness. My personal\n> favourite language for this kind of task would be Python (with some\n> parts already existing).\n\n\nI like this very much, but am a bit concerned about requiring all\nusers to install Python libraries.  Also, some users will want other\nscripting languages; TCL, Perl, and (gack!) Visual Basic are likely\ncandidates.  Ummm...probably Mathematica.\n\n\n> The problem of platform specific code variations is actually\n> independent from the ANSI conversion. In part, the ANSI standard was\n> supposed to reduce those incompatiblities, but succeeded in that\n> point only to a certain degree. I have no experience with GNU\n> autoconf myself, but maybe that would be a reasonable way to\n> eliminate the need to actually know which platform has what kind of\n> quirks.\n\n\nAutoconf...scares me.  It's one of the most difficult scripting\nlanguages and it actively encourages #ifdef-laden code.  Personally, I\nfavor the Kernighan and Pike (*The Practice of Programming*) approach\nto portability; write the base code portably, and bottle up the OS\ndependencies in separate libraries and APIs.\n\n\nPeter Apian-Bennewitz <apian@pab-opto.de>:\n> Thoughts on a rewrite were founded on the limited and cumbersome\n> \"interface\" for extending the core rendering. \n> [...]\n> However, that interface is not changed solely by prototyping functions.\n> Doing more than that risks new bugs- well, we'll get them out. Maybe\n> there's a core structure between just-prototypes and a full rewrite ?\n\n\nHmmmm...Radiance plug-ins.  Most Unices support some version of\ndynamic loading these days.  Windows does.  I don't think Plan 9 does...\n\n\nNow, I'm interested in ways to standardize the GUI API.  In my\nopinion, it would be useful if we could customize ximage and rview to\nnative OS conventions easily, perhaps by providing an OS specific\nlibrary.  It might also be useful to embed the core rendering tools in\na dynamic loading environment.  But, again, I don't know what it would\ntake.\n\n\n\n\nRandolph Fritz\nEugene, Oregon, USA\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-June/000303.html).</sup>", "id": "radiance-general_000303", "created_by": "Randolph_Fritz"}