{"topic": "Daylight Autonomy Benchmarks", "category": "radiance-general", "attachments": [], "created_by_name": "Bayanda Mpauli", "created_at": "October 04, 2012 at 03:52AM", "body": "Dear All \n\n\n\n\n\n\nI am looking for papers/research for DA thresholds related to good indoor\nenvironmental quality that can be referenced in our South African version of\nLEED and was wondering if anyone might be able to point me in the right\ndirection? \n\n\n\n\n\n\nThe Green Building Council of South Africa is considering using Daylight\nAutonomy as an indicator for their Daylight Credit for the Greenstar SA\nPublic and Education Building Tool - our version of LEED. They currently use\nDF. The credit falls under the Indoor and Environmental Quality section and\nso is about the positive impact of daylight on the occupants rather than\nenergy savings. They have a separate glare related credit and so this does\nnot have to be considered within this credit. \n\n\n\n\n\n\nAt the moment the proposal for inclusion of DA includes the following\nthresholds. \n\n\n\n\n\n\nA DA of 80%  for 160lux with\n\n\n1)      1 Point awarded for 30% of the occupied area\n\n\n2)      2 points awarded for 60% of the occupied area\n\n\n3)      3 points awarded for 90% of the occupied area\n\n\n\n\n\n\nThey are trying to find out from the Green building Council of Australia\n(who has put the DA credit out for review in their industry and is the basis\nof the South Africa credtit) where the 80% and 160lux threshold has\noriginated from and in the meantime have requested South Africa consultants\nto review these figures to determine what threshold would be considered\nappropriate and indicated of good indoor environmental daylight quality.\nSomething to note is that the certification is for the building being handed\nover to tenants and it assumes no furniture nor portioning as that is not in\nthe control of the landlord - in order for it to be representative  we would\nbe proposing quite a low reflectance floor level to try and build in at\nleast some representation of what might happen in the space if a daylight\nconscious tenant fitted out the space - alternatively we might up the 160\nlux threshold to something higher also to accommodate for furniture.  It is\ncurrently undefined whether it be incremental or continuous DA but I think\nthis will just impact on the threshold selected. \n\n\n\n\n\n\nIdeally we would like to have the threshold based on some form of researched\ndata already performed that can then be referenced. We are not in a position\nnor have the time to perform this research now. As the tools do get updated\nover time, it would be possible to review the figure and align it with the\nmost current research or even review the applicability of DA itself and\nsubstitute it with future indicators that are more representative of\ndaylight quality. \n\n\n\n\n\n\n\n\n\n\nRegards,\n\n\nBayanda\n\n\nBAS (UCT)\n\n\nGreen Star SA Accredited Professional\n\n\n\n\n\n\nPJ Carew Consulting\n\n\n3rd floor 71 buitengraght Cape Town 8001\n\n\ntel: 021 426 4051  fax: 021 426 5050  cell: 083 335 9365\n\n\n <mailto:bayanda at pjc.co.za> bayanda at pjc.co.za    <http://www.pjc.co.za/>\nwww.pjc.co.za\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2012-October/008928.html).</sup>", "id": "radiance-general_008928", "created_by": "Bayanda_Mpauli"}