{"topic": "答复: Generate sky-matrix by using TMY weather data", "category": "radiance-general", "attachments": [], "created_by_name": "Wang Clarence", "created_at": "November 27, 2017 at 06:12AM", "body": "Thanks for replying.\n\n\nIt seems that the .smx files are fine. But there is another question.\n\n\nWhen I combine the sun-matrix smx file with cds.mtx for direct sun coefficient simulation , which is the third part of the five-phase methods, the final data of cds.ill will be very small. Besides, since we use the data rendered by executing three phase method minus the data of direct solar part and plus the direct sun coefficient for rendering data of five phase method, the data of some measure  points which are close to the window rendering by five phase will be twice or  three times lower than that by three phase.\n\n\nSo what is the actual difference of data between three phase and five phase? Are the data rendering by five phase definitely similar to that by three phase?\n\n\nThanks,\n\n\nClarence\n________________________________\n发件人: Sarith Subramaniam <sarith at psu.edu>\n发送时间: 2017年11月27日 5:50\n收件人: Radiance general discussion\n主题: Re: [Radiance-general] Generate sky-matrix by using TMY weather data\n\n\n\n\nHi Clarence,\n\n\n\n\nIf by null you are implying zeros, then the generated files are fine. Your first gendaymtx command ( -m 1 -d) will generate a sky matrix that is almost entirely zeros except for radiation values in 3-4 patches per hour during day-time.  The second gendaymtx command (-m 2 -5 0.533 -d) will generate a file that contains radiation values only in a single patch per hour. If the direct-normal radiation data for a particular hour is zero, then the radiation values in all the patches for that hour in direct-sky matrix and sun-matrix will be zero as well.\n\n\n\n\n\n\nSarith\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2017-November/012336.html).</sup>", "id": "radiance-general_012336", "created_by": "Wang_Clarence"}