{"topic": "Radiance-general Digest, Vol 97, Issue 4", "category": "radiance-general", "attachments": [], "created_by_name": "Michael Donn", "created_at": "March 06, 2012 at 05:46PM", "body": "Hi Andy, Rob, Lars\n\n\nI'd like to endorse the concept of an FAQ for Radiance, but ask for a slightly broader view of the material definitions. They might initially be listed in the Radiance FAQ listing, but preferably they would also be listed in a more general materials database. There is an increasingly intense need for this: http://www.ibpsa.org/proceedings/BS2005/BS05_0373_380.pdf \n\n\nWe regularly export from SketchUp today to Daysim/Radiance - EnergyPlus and CATT Acoustic. I would love to be able to be sure that what we do with an 'acoustic tile' and its manufacturer's data for our acoustic analysis carries reliable light properties to the Lighting simulation - and that it can be tracked back to its source: http://www.ibpsa.org/proceedings/BS2009/BS09_1405_1412.pdf Our role as users could well be to rank / rate via social media style techniques the reliability of the data.\n\n\nIf we get these basic steps right then http://www.ibpsa.org/proceedings/BS2001/BS01_0731_738.pdf we have the basis for quality assurance - believable - simulations in an increasingly integrated (BIM or not) world...\n\n\nM\n\n\nPS: XML formatting is an example of how the approach could be implemented. XML /IFC or other formatting is not the issue; associated annotation and internet services based serving of data and associated rating of quality level of the data is. \n\n\nMichael Donn                                                       \nDirector Centre for Building Performance Research\nSchool of Architecture  \nVictoria University      +64 4 463 6221  work\nPO Box 600              +64 21 611 280  mobile\nWellington                +64 4 463 6204  work fax\nNew Zealand             +64 21 611 594  mobilefax\n\n\n\n\n-----Original Message-----\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2012-March/008451.html).</sup>", "id": "radiance-general_008451", "created_by": "Michael_Donn"}