{"topic": "New Radiance Packages on GitHub/NREL", "category": "radiance-general", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "January 16, 2018 at 11:35AM", "body": "I am delighted to announce the availability of a fresh set of Radiance installers (MacOS, linux and Windows) on NREL’s GitHub site, here:\n\n\nhttps://github.com/NREL/Radiance/releases/tag/5.2.0\n\n\nThis is the first release we’ve done since the official release, posted during the Radiance Workshop back in September of 2017. The reason for my delight is that we have completely revamped the CMake build files, allowing for much more reliable automated building AND testing of the Radiance source code. NREL now has a CI (continuous integration) server set up in-house as well, which performs a full build and test of the entire Radiance source tree upon every new commit. ASSuming successful testing, installers are automatically rolled out. I am still manually posting new release installers, but I will be doing them on a more frequent schedule from here on out – likely coinciding with OpenStudio quarterly releases. \n\n\nNote we have also abandoned the ‘combined’ branch on the GitHub mirror, letting branch ‘master’ reflect the current status of cvs ‘HEAD’. We have updated/fixed the very small and not terribly rigorous set of tests (ctest) on the repository, as well as added some resource files for them, and relocated all of that to /resources in the source tree. I hope to add some documentation on the use of the CMake system at some point, but hopefully our more frequent updates will suffice for most. The CI server itself is and will likely remain private, but we will be posting the automated build/test results to the GitHub mirror soon so you all can follow along. =) \n\n\nA big shout-out to Alex Swindler at NREL for setting this all up! \n\n\n- Rob\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2018-January/012410.html).</sup>", "id": "radiance-general_012410", "created_by": "Rob_Guglielmetti"}