{"topic": "Solar penetration", "category": "radiance-general", "attachments": [], "created_by_name": "Bruce Sounes", "created_at": "August 21, 2002 at 12:43PM", "body": "When I did 'Building Science' many years ago, we used \"solar protractors\" to\nread off the suns altitude and azimuth at different times of the year. The\nsolar protractor was a plot of the suns path across a hemisphere for\ndifferent times of the day for a given latitude, generally printed on a A4\nbit of clear plastic. This was used in assessing orientation of designs in\nplan and overhangs/shading in section. Alternatively we could use it to\nassess solar penetration from a point inside the building by marking out on\nthe protractor the area of sky visible through openings.\n\n\nWhat I would like to do is step back a bit to the solar protractor idea. I\nwant to plot the sun's path across the sky from a specified view - say for\nthe solstices and equinox - annotate the time of day, and overlay on a\npreviously rendered view. I think this could be a more graphic illustration\nof when and for how long the sun will penetrate into a space. It should be\nquicker than several animations.\n\n\nI think this could be quite easily done by rendering sequences of empty\nscenes from the required viewpoint and combining them and the fully rendered\nscene using pcomb. The sun positions could appear as dots. (Would the 0.5\ndegree angle subtended by sun be too small?). Can anyone help me with\nfunctions I would need to feed pcomb - to convert \"suns\" to dots and the\nskys to white graphic infomation and how do I automate the annotating? The\nfinal compositing could be done with Photoshop. I have tried the long way\nround - plotting the sun paths on cad - but this seemed unneccessarily\nfiddly and potentially inaccurate.\n\n\nMany thanks\n\n\nBruce Sounes\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-August/000395.html).</sup>", "id": "radiance-general_000395", "created_by": "Bruce_Sounes"}