{"topic": "Call for Participation: September Radiance Workshop", "category": "radiance-general", "attachments": [], "created_by_name": "Greg Ward", "created_at": "July 15, 2003 at 05:46PM", "body": "INITIAL CALL FOR PARTICIPATION\n\n\n\tLBNL Radiance Workshop, September 22-26, Berkeley, California\n\n\nWe are planning a second workshop on scientific applications of \nRadiance, this time in Berkeley, hosted by the Lawrence Berkeley \nNational Laboratory.\n\n\nThe first part of the week, Sept. 22-24, we will offer intermediate and \nadvanced tutorials in Radiance, covering (among other things) daylight \napplications and new features introduced in recent Radiance versions, \nsuch as the holodeck and the mesh primitive.  On Thursday and Friday, \nwe will provide a forum for researchers to present their  work to other \nattendees.  We will also discuss current Open Source development \nefforts and solicit ideas on future directions for the software.\n\n\nAt this time, we are asking for immediate feedback from people who are \ninterested in attending so that we can confirm a budget and pricing for \nthe event.  This is our current proposal for the registration fee \nschedule:\n\n\n\tTutorials Only (22-24):\t400 USD\t($200 for students)\n\tSeminar Only (25-26):\t200 USD  ($100 for students)\n\tSeminar and Tutorials:\t500 USD  ($250 for students)\n\n\nTo qualify for the student rates, you must be currently enrolled in a \ngraduate or undergraduate program at a university.  Presenters will be \noffered a uniform $100 discount on their registration, at most one \ndiscount per talk/presenter.  (E.g., if you are a professional \nattending the entire week and presenting two talks at the seminar, your \nregistration fee will be $400.  A student presenter attending the \nseminar only pays no registration fee.)  These rates will probably \nundergo some adjustments when we find out how many people are \ninterested in attending.  The more people who speak up and the sooner \nthey do so, the less it will cost for everybody.\n\n\nTentatively, John Mardaljevic has agreed to repeat his two-day \nintermediate daylight simulation course for us, and Greg Ward plans to \ngive a one-day tutorial on new Radiance features.  If others are \ninterested to present a tutorial, please contact the organizers \nimmediately by sending e-mail to:\n\n\n\t<workshop@radsite.lbl.gov>\n\n\nIf you are interested in presenting your work at the seminar, please \nsend a talk title and brief description of its content  to the e-mail \naddress above.  If you have an abstract ready, please include it, but \nwe don't require one at this point.  Deadline for talk titles is July \n31.  If you plan to attend, but are not sure if you will be able to \ngive a talk, or are sure you will not, we would still like to hear from \nyou by the 31st so we can get an approximate head count.  Let us know \nwhether you would like to attend the tutorials, the seminar, or both.\n\n\nWe intend to announce the final workshop pricing along with a \nspeculative list of talks in early August.  Registration payment will \nbe due towards the end of August.  We will offer suggestions for \naccommodations in the area in the next announcement.\n\n\nIf you accidentally REPLY to this e-mail, be aware that you will end up \nsending your thoughts to the entire list, so use the above address, \ninstead.\n\n\nI look forward to seeing you in September!\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2003-July/000897.html).</sup>", "id": "radiance-general_000897", "created_by": "Greg_Ward"}