{"topic": "Survey on occupant modelling practice in building simulation", "category": "radiance-general", "attachments": [], "created_by_name": "Liam O'Brien", "created_at": "September 26, 2015 at 12:05PM", "body": "Dear colleagues,\n\n\nI am conducting a survey to better understand assumptions that building \nsimulation users make about occupants and occupant behaviour. This is \npart of International Energy Agency - Energy in Buildings and \nCommunities Annex 66. I'd be greatly appreciative if you would take 15 \nminutes and fill out the survey. For your effort, you have a chance to \nwin a prize (see below) and you will have access to the aggregate survey \nresults in 2016.\n\n\nPlease find the survey link and notice below.\n\n\nMany thanks,\n\n\nLiam O'Brien, PhD\nAssistant Professor\nArchitectural Conservation and Sustainability Engineering\nCarleton University\n\n\n\n\n\n\nThe goal of this brief anonymous 38-question survey, aimed at \npractitioners (architects, engineers, other building modellers), is to \ninform researchers and software tool developers of current practices and \nattitudes about occupant modelling. Researchers are welcome to \nparticipate, but their responses may not be used in this study. The \nresults will be securely and anonymously stored. Your information will \nnot be shared with anyone. A summary of the aggregate results will be \npublicly released in approximately Summer 2016.\n\n\nhttp://goo.gl/forms/sbvCS6z5Zw\n\n\nWhen the survey closes (anticipated November 2015), the participants who \nprovide an email address at the end of the survey will be randomly \nselected to win one of the following generously donated prizes:\n\n\n  *      2 copies of the book “Modeling, Design, and Optimization of\n    Net-Zero Energy Buildings” edited by Andreas Athienitis and William\n    O’Brien. 396 pages.\n  *      1 copy of the book “Building Performance Simulation for Design\n    and Operation”, edited by Jan Hensen and Roberto Lamberts\n  *      1 one-year subscription to the Journal of Building Performance\n    Simulation\n  *      3 BeeWi Bluetooth color LED smart light bulbs\n  *      4 hard copies of “Daylight in Buildings - A source book on\n    daylighting systems and components”\n  *      2 copies of the printed proceedings of SimAUD 2015 (Symposium\n    on Simulation for Architecture and Urban Design)\n\n\n\n\nThanks for your time, in advance.\n\n\n\n\nWilliam (Liam) O'Brien, PhD\nAssistant Professor\nArchitectural Conservation and Sustainability Engineering\nCarleton University\nCanal Building, 5208\n(613) 520-2600 ext. 8037\nPI, Human Building Interaction Laboratory\ncarleton.ca/hbilab\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-September/011265.html).</sup>", "id": "radiance-general_011265", "created_by": "Liam_O'Brien"}