{"topic": "Aperture, take notice...", "category": "hdri", "attachments": [], "created_by_name": "Kirk Thibault", "created_at": "February 09, 2006 at 03:03AM", "body": "Folks, some of us on the HDRI forum are getting into the specifics of  \nRAW and image management (and the future RAW) - well, when Apple came  \nout with Aperture, a streamlined workflow for shooting RAW, I thought  \nit was pretty cool, although the idea of buying a new G5 just to run  \nit was a little iffy.  There were careful efforts to differentiate it  \nfrom Adobe Photoshop, etc. with the rampant speculation about how  \nAperture and Photoshop would get along on the playground, etc.  Apple  \neven noted that Aperture was equipped to launch an external image  \neditor, like Photoshop, to retain the flexibility of Aperture's  \nworkflow without compromising the tool set of photographers.  Then  \nthe initial reviews of Aperture came out and were mixed.  I  \npersonally have never used it.\n\n\nEnter Adobe ...\n\n\nhttp://labs.macromedia.com/technologies/lightroom/#\n\n\nHmmm - I always wondered what Adobe had in store for Macromedia....   \nMethinks Adobe has responded - and released the beta to the public  \nfor \"testing\" and \"feedback\".  I just downloaded the available beta  \nto see what's up - thought i'd share the love.  Very interesting.  As  \nlong as Adobe keeps forging into the RAW-o-sphere, it would seem that  \nproprietary RAW formats will isolate manufacturers that choose the  \nencrypted, secretive path.  But then again, what do I know?  :-)\n\n\nI have also noticed more and more commercial outfits making their  \nbetas available to the public - yea! for open source software that  \nmust be, in part, responsible for showing the big guys how to rally a  \ncommunity of devotees around their app.  Oh, what will be next?  I  \njust installed OpenOffice for OSX last week and thought \"how cool is  \nthis?\"  hehehehehehehe!\n\n\nkirk\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/hdri/2006-February/000059.html).</sup>", "id": "hdri_000059", "created_by": "Kirk_Thibault"}