{"topic": "Radiance Workshop 2013 @ NREL, Golden, CO USA", "category": "radiance-general", "attachments": [], "created_by_name": "Rob Guglielmetti", "created_at": "May 15, 2013 at 10:48AM", "body": "Greetings simulationists, photon wranglers, et al.,\n\n\nIt is my pleasure and an honor to announce the 12th International Radiance Workshop, which will take place August 12-14th 2013 in Golden, CO, USA at the National Renewable Energy Laboratory (NREL).  The format will be the same as in recent years, with the first day being full of tutorials and software demonstrations, and days two and three reserved for presentations of work you've done with Radiance over the last year.\n\n\nOn day one, we will have Greg Ward presenting on new features/functionality added to the Radiance code since last year's workshop, as well as a primer on BSDFs and their generation with, and use in, Radiance. Andy McNeil may even have a few words about an enhanced daylight coefficient method that Radiance is being adapted to utilize (those kooks at Berkeley decided three phases weren't enough). Jan Weinold (Fraunhofer ISE) will be talking about his glare metric (DGP) and his tool (Evalglare), while a mystery guest from Boise, ID will offer additional perspectives on glare metrics.  Kera Lagios (Solemma LLC / Lam Partners) will be giving a demo on DIVA, and members of NREL's Commercial Buildings Research Goup will be giving a demo on whole building energy simulations with Radiance and EnergyPlus, using the OpenStudio Application Suite and SDK.  \n\n\nDays two and three are what *you* make of them, really.  Time slots for user presentations will be contingent on how many people we get to come out, but figure about 20 minutes per person. What has Radiance done for you lately? We all want to know/see! \n\n\nWe will be webcasting the workshop, so if you can't make it out to Colorado, no worries, you can enjoy the proceedings from wherever you are, via the intertubes. We will also be recording the presentations and posting them online for future viewing.\n\n\nThis event will take place on NREL's main campus, in one of our newest buildings, the Research Support Facility (RSF) which is one of the largest net-zero energy facilities in the entire world. Daylighting was a core component of the integrated high-performance building design, and its performance was predicted with Radiance. Come see a real life example of the power of Radiance's predictive capability! We also have a nicely daylit cafeteria parking garage, and a new building (ESIF) housing first of its kind grid-level simulation and physical test facilities, and a rather zippy supercomputer which will be online by the time you all come out here. We'll try and tour as many of these facilities while you're here as well. More on the buildings, here:\n\n\nhttp://www.nrel.gov/sustainable_nrel/rsf.html\nhttp://www.nrel.gov/esi/esif.html\nhttp://www.nrel.gov/sustainable_nrel/buildings_garage.html\nhttp://www.nrel.gov/sustainable_nrel/buildings_cafe.html\n\n\nLastly, I am happy to announce that there will be no registration fee, for speakers and students. (!) The usual banquet/dinner will be an out of pocket expense, but hey, registration is free, so quit complaining. Seriously, we'll find a place that can feed us all and we'll have a good time and make inspiring speeches. \n\n\nWe will be posting a web page with all this info and more, but I wanted to get the word out so you can mark your calendars and start planning. Oh, and to that end, NREL is located in Golden, CO, USA, which is about 15 miles west of Denver. If you're flying in, you'd want to fly into Denver International (KDEN). More on getting here, here:\nhttp://www.nrel.gov/about/golden.html\n\n\nMore on staying here, here:\nhttp://www.nrel.gov/about/golden_info.html\n\n\nSince there is no registration fee, registration is simple. Send an email to me (robert.guglielmetti at nrel.gov).  If you are a foreign national, there is extra paperwork we need to do. If you are from Iran, Syria, Cuba, or , unfortunately you will not be able to attend in person. However, since we are webcasting the event, we will be able to support those of you from these countries who cannot attend in person by allowing you to present via webex. Please let me know ASAP if you will need this option.\n\n\nPlease do the following, ASAP:\n- Email me your intent to participate in Golden: \n- Please indicate your citizenship status. \n- Please indicate whether you're coming for day one, two, three or some combination thereof.\n- Please submit a brief abstract on your presentation.\n\n\nThanks for reading, and we're looking forward to seeing you all in beautiful Colorado in a few months! \n\n\nP.S.\nBring your hiking boots. \n\n\n\n\nRob Guglielmetti\nNational Renewable Energy Laboratory (NREL)\nCommercial Buildings Research Group\n15013 Denver West Parkway MS: RSF202\nGolden, CO 80401   --   303.275.4319\nrobert.guglielmetti at nrel.gov\nPrint if you want, I'm not your mother.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2013-May/009533.html).</sup>", "id": "radiance-general_009533", "created_by": "Rob_Guglielmetti"}