{"topic": "Greenhouse energy modeling", "category": "radiance-general", "attachments": [], "created_by_name": "Valerie Tan", "created_at": "August 02, 2017 at 11:18AM", "body": "Hello,\n\n\n\n\n\n\nMy name is Valerie Tan and I am a undergrad designing greenhouse energy\nmodeling software for the Cornell Controlled Environment Agriculture group. I\nam a computer science major (Cornell Engineering, Class of 2019) working\nfor the Cornell CEA group with Kale Harbick (researcher) and Kevin Ye (also\nan undergrad). I am new to using the Radiance libraries and have questions\non the features and capabilities of Radiance. I have been, and will\ncontinue to look through tutorials, archived mailing lists and\npresentations.\n\n\n\n\n\n\nWe are implementing a ray-tracing and energy modeling component of the\nNYSERDA funded GLASE project. See https://glase.cals.cornell.edu/ for a\nbrief synopsis.\n\n\n\n\n\n\nI was given a big task of designing software that models a greenhouse and\ncalculates the total amount of light (from all directions, not just one\ndirection as in backwards ray-tracing) that reaches particular sample\npoints, given the geometry, weather, time of day, artificial light\nconfigurations, etc. Imagine a typical greenhouse, with glass panels that\nreflect and refract light, and a rectangular plot where you grow the\nplants. We want to pick sample points on that rectangular plot and figure\nout how much energy reaches that point. Ultimately, we want to model and\noptimize everything such that all areas of the growing area receive optimal\nand equal amounts of light.\n\n\n\n\n\n\nMy main question is, how do I make light calculations in micromoles instead\nof lumens or RGB values? From what I've seen, Radiance appears to have this\ntype of focus, but I could be entirely wrong. (This is my first research\nposition and that I am still in the learning process of understanding\ntechnical descriptions and tutorials.) The issue with lumens and RGB values\nis that they are calibrated for human vision and are very difficult to work\nwith in terms of plant science, while micromoles measures the actual number\nof photons. It looks like the \"Photon map extension user manual\" from the\nwebsite (\nhttps://www.radiance-online.org/learning/documentation/photonmap-user-guide)\nis a possible solution.\n\n\n\n\n\n\nI really appreciate any kind of advice on using the Radiance libraries.\nThank you for your time and hope to hear from all of you.\n\n\n\n\n\n\nBest,\n\n\n\n\n\n\nValerie\n\n\n\n\nValerie Tan\nComputer Science\nCollege of Engineering\nCornell University '19\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2017-August/012205.html).</sup>", "id": "radiance-general_012205", "created_by": "Valerie_Tan"}