{"topic": "ambient include / exclude options (-ae, -ai, -aE, -aI)", "category": "radiance-general", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "May 12, 2013 at 04:42AM", "body": "Hi all,\n\n\nI had a closer look at the behaviour of the ambient exlude option -ae,\nwhich is one of several tweaks for detail geometry in large scenes.\n\n\nI set up a very simple test scene. A box 1 x 1 x 1 is indirectly lid by\na surface below the ceiling, pointing up. The walls of the box are\nassigned a material \"copy\", which inherits its properties from a\nlambertian plastic material \"original\". A sensor records illuminance\nbelow that light source, which means that it should receive only light\nreflected back from the box surfaces. I run rtrace four times:\n\n\na) direct only:\n\n\nrtrace -ov -I+ -h -ab X -av 0 0 0\n\n\nThis should give a zero reading, as the luminous (upper) surface of the\nlight source is not directly visible.\n\n\nb) direct+indirect:\n\n\nrtrace -ov -I+ -h -ab 3 -av 0 0 0 test.oct\n\n\nThis should give a reading of the light reflected by several bounces\nfrom the ceiling and walls of the box.\n\n\nc) direct+indirect with -ae original:\n\n\nrtrace -ov -I+ -h -ab 3 -av 0 0 0 -ae original test.oct\n\n\nThis should give the same result as b), as excluding the original\nmaterial definition, which is not applied to any surface, should not\naffect the ambient calulation.\n\n\nd) direct+indirect with -ae copy:\n\n\nrtrace -ov -I+ -h -ab 3 -av 0 0 0 -ae copy test.oct\n\n\nThis should give a zero reading, just as case a), as the light can be\nreceived only by the diffuse walls, which have their modifier excluded\nfrom the ambient calculation.\n\n\nInitial expectations:\na) = d) = 0\nb) = c) < 0\n\n\nThe results are:\na) 0.000000e+00\t0.000000e+00\t0.000000e+00\nb) 3.035680e-03\t3.035680e-03\t3.035680e-03\nc) 3.203512e-03\t3.203512e-03\t3.203512e-03\nd) 2.749251e-03\t2.749251e-03\t2.749251e-03\n\n\nThe difference between c) and b) is due to the default sampling\nalgorithm, so switching to -u- leads to equal values:\n\n\na) 0.000000e+00\t0.000000e+00\t0.000000e+00\nb) 3.159767e-03\t3.159767e-03\t3.159767e-03\nc) 3.159767e-03\t3.159767e-03\t3.159767e-03\nd) 2.845761e-03\t2.845761e-03\t2.845761e-03\n\n\nStill, d) is obviously non-zero. Why? So is that 2.85 the result of the\ndiffuse-direct calculation, which is not affected by the -ae option?\nThat would mean that even though specularity is zero, rays reflected\nfrom the (invisible) test surface introduced by the -I+ switch towards\nthe ceiling receive a value from there, which results from the direct\ncalculation at the ceiling. Setting all -ab 1 leads to an identical\nresult for a), b), c) and d):\n\n\nb1) 2.845761e-03\t2.845761e-03\t2.845761e-03\n\n\nNow, the one ambient bounce is \"used up\" by the reflection from the test\nsurface introduced by -I+, rays send out from there only return values\nfrom the direct calculation at the next intersection point.\n\n\nI hope my conclusions are correct. If they are, it may useful to share\nthis for others looking into using the ambient include / exclude options.\n\n\nCheers, Lars.\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2013-May/009525.html).</sup>", "id": "radiance-general_009525", "created_by": "Lars_O._Grobe"}