{"topic": "VI-Suite v0.3", "category": "radiance-general", "attachments": [], "created_by_name": "Ryan Southall", "created_at": "November 08, 2015 at 07:50AM", "body": "Dear all.\nJust want to announce the availability of VI-Suite version 0.3, my free,  \nopen-source pre/post processor for Radiance and EnergyPlus that functions  \nas an add-on for Blender.\nThe LiVi component of the VI-Suite deals with lighting simulations and can  \nuse Radiance to predict glare, Lux, DF, irradiance, radiation exposure,  \nlight exposure, daylight availability and UDI. Experimental support for  \nthe new Photon Mapping component has been included. Results can be  \nvisualised within Blender. It aims to be quick, iterative, and dare I say  \nplayful.\nBlog site with tutorial videos can be found at  \nhttp://blogs.brighton.ac.uk/visuite/ and the main site with downloads and  \nmanual can be found at http://arts.brighton.ac.uk/projects/vi-suite.\n\n\nWhile I am here, for v0.4 I want to incorporate BSDF creation and  \nsimulation. I can create and store the BSDF description within a Blender  \nobject and I can create the Radiance input file with I think the correct  \nBSDF entry, but I do not see the influence of the BSDF in either the rvu  \npreview or the rtrace calcs. Should BSDFs work in this simple context or  \ndo they only function with sky patches or a multi-phase method?\n\n\nRegards\n\n\nRyan\n\n\n\n\n\n\n\n\nDr Ryan Southall\nSenior Lecturer\nSchool of Art, Design & Media\nUniversity of Brighton\n\n\n___________________________________________________________\nThis email has been scanned by MessageLabs' Email Security\nSystem on behalf of the University of Brighton.\nFor more information see http://www.brighton.ac.uk/is/spam/\n___________________________________________________________\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-November/011327.html).</sup>", "id": "radiance-general_011327", "created_by": "Ryan_Southall"}