{"topic": "Surface normal and Rdot in mix functions", "category": "radiance-general", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "May 03, 2002 at 02:02PM", "body": "Peter Apian-Bennewitz wrote:\n\n\n> markku.norvasuo@vtt.fi wrote:\n>\n> >\n> > I have used .cal functions based on cos(theta) of the incoming (eye) ray.\n> > For this purpose, there is a special variable available, Rdot, which is the\n> > dot product of the eye ray and the surface normal and hence should be equal\n> > to cos(theta), if I have understood correctly. I have also supposed\n> > Radiance always flips the normal\n>\n> ... if I recall it right:\n> dielectric, interface, BRTDfunc, glow and mixfunc don't re-orient\n> surfaces and Rdot[-1:1]\n> colorfunc, brightfunc, transfunc (+ their ~data equivalents), trans,\n> plastic(2), metal(2), glass do flip surface normals and so Rdot[0:1] .\n\n\n\n\nNote that, as far as I am aware of, this \"normal flipping\" is\nNEVER done for non-material modifiers.  The original question\nwas about mixtures, though the wording unintentionally confused\nthe issue a bit. For the materials, I think the list above is\nabout correct.\n\n\nYou can assign different materials/patterns/textures to the front\nand back side of a surface simply by using \"if(Rdot,1,0)\" as the\ncoefficient for a mixture. In fact, there is a file \"diffside.cal\"\navailable in the Rayfront library that does exactly this.\n\n\nIf you don't want to differentiate between the two sides of a\nsurface in non-material modifiers, then you'll have to look at the\nabsolute value of Rdot (or the absolute values of Nx/Ny/Nz).\nPositive and negative values of Rdot are equivalent to each other\nfor the respective \"other\" side of the surface. I'm not sure if\nthe perturbation caused by the roughness parameter is reflected\nin the N# values seen by a function file.\n\n\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch.com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-May/000227.html).</sup>", "id": "radiance-general_000227", "created_by": "Georg_Mischler"}