{"topic": "rpict error: address not found in avlmemi", "category": "radiance-general", "attachments": [], "created_by_name": "Georg Mischler", "created_at": "July 23, 2001 at 07:29PM", "body": "> Hi List!\n\n\nSays the person who still owes me a materials tutorial for\nRayfront... ;-)\n\n\n\n\n> And here's my first question:\n>\n> I am trying to render a quite complex model (imported from CAD,\n> and there are no instances, so it takes a lot of memory). If I\n> try to get better quality and higher resolution, rpict gives me\n> an error:\n>\n> [...]rpict: 6581491 rays, 49,87% after... [...]\n> rpict: consistency - address not found in avlmemi\n> rad: error rendering view 1\n>\n> I did this on a netfinity with a lot of ram and two pIII-833. But\n> in fact, the machine is a fileserver... so is this error the\n> result of insufficient memory?\n>\n> I have installed 3r2p11. On Linux 2.4.4 (SuSE 7.0).\n\n\nRadiance 3.2 is \"experimental\" and was never officially released.\nTechnically, this error points to corrupted ambient data.\nYour problem will most likely go away when you try with 3R1p20.\n\n\n\n\n> BTW, as I know that Georg Mischler is on the list: dxf2rad is a\n> great way to import data from formZ!!! I wrote dxfr14 and\n> translated it with dxf2rad, it works perfectly!\n> So this is an alternative besides the obj-way and the\n> 3ds/mgf/rad-conversion.\n\n\nCool!\nIs there anything you need to set up correctly on the formZ side\nfor this to work? In particular, does formZ automatically create\nseperate layers, so that dxf2rad can use different modifier\nnames? You could earn yourself at least a pat on the back and\na honorable mention by writing a very short description of the\nexact procedure for my web site.\n\n\n\n\nHave fun!\n\n\n-schorsch\n\n\n\n\nGeorg Mischler  --  simulations developer  --  schorsch at schorsch.com\n+schorsch.com+  --  lighting design tools  --  http://www.schorsch.com/\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2001-July/000004.html).</sup>", "id": "radiance-general_000004", "created_by": "Georg_Mischler"}