{"topic": "manipulate rtrace for desired outcome", "category": "radiance-general", "attachments": [], "created_by_name": "Mengdi Guo", "created_at": "June 13, 2016 at 10:56PM", "body": "Hi,\n\n\n\n\n\n\nCurrently I'm using the ray tracing engine of radiance, trying to figure\nout the ray paths connecting designated view points and light resources (in\ncylinder and polygon type). In this process, I've encountered some\ndifficulties that I'd appreciate your assistance.\n\n\nI'm mainly using light as primitive type, since I want to figure out the\npossible ray paths between receiver point and artificial light sources.\nHowever the ray paths is not what I’ve expected.\n\n\nIn the testing condition where there is one receiver and one polygon light\nsources directly exposed to each other. The polygon light source is the\nonly light in this scene. The source and receiver are placed in the middle\nof two building blocks. I’m controlling rtrace function with the parameters\n‘ –ab’ ‘ –ad’ ‘–dj’ ‘– ds’ ‘-st’ ‘-ss’.\n\n\n1.       No matter what parameters I’ve set for rtrace function, there’s\nonly one ray in the output. Yet, I’m expecting multiple rays emitted from\nthe receiver points to the light source, as described in radiance manual.\n\n\n2.       I’d also like to know what parameters can control reflections\ncharacters of rays. For instance, I want the rays to partly diffuse after\nreflecting on the surface. The desirable condition is: for a bundle of rays\nhitting the surface, 1) 70% of the rays will follow specular reflection,\n30% will be scattered after reflection. 2) for the scattered part, I want\nthem to be reflected within an angle (e.g. 30 degree) to the specular\nreflected ray.\n\n\nCould you suggest me how to achieve the condition of 1 and 2 with radiance?\nIs there any other suggestions on the setting of model or scene?\n\n\n3.       Another question is: acknowledged that the emitted rays are not\nevenly distributed for hemispherical sampling. I'm still wondering if it's\npossible to evenly send rays with radiance.\n\n\nThank you very much with best regards,\n\n\nMengdi Guo\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-June/011801.html).</sup>", "id": "radiance-general_011801", "created_by": "Mengdi_Guo"}