{"topic": "16th Annual International Radiance Workshop", "category": "radiance-general", "attachments": [], "created_by_name": "Alen Mahic", "created_at": "April 28, 2017 at 01:58PM", "body": "Greetings daylighters,\n\n\nThe Energy Studies in Buildings Laboratory (ESBL) is pleased to host this\nyear's International Radiance Workshop at the University of Oregon campus\nin Portland, Oregon, USA!\n\n\nThe event will begin with an optional viewing of the 2017 total solar\neclipse on the morning of Monday, August 21st. The traditional 3-day\nRadiance workshop will then continue from Tuesday, August 22nd through\nThursday, August 24th. And finally, Friday, August 25th will feature an\noptional one-day hands-on Radiance training aimed at professionals and\nstudents looking to learn more about Radiance daylighting simulation.\n\n\nDetails on registration and fees will be made available shortly, with\nanother e-mail reminder to follow. The eclipse viewing and Radiance\ntraining events will each be available as separate and optional additions\nto the general admission for the traditional 3-day Radiance workshop.\nStudents will also receive a 50% discount for the optional hands-on\nRadiance training.\n\n\n*The call for presenters is live!* We invite you to share your work with\nthe Radiance community in a 30-minute presentation format. Presenters and\nstudents will receive a 20% and 40% registration discount respectively for\nthe traditional 3-day workshop. If you are interested in presenting your\nwork please go to https://radiance.uoregon.edu/call-for-presenters/ and\nsubmit a short abstract (up to 250-words; 1 optional figure/image; submit\nby June 1st, 2017). Multiple proposals per presenter are acceptable!\n\n\nThe event website is available at https://radiance.uoregon.edu. Any\ninquiries can be directed to Stephanie Luiere (sluiere at uoregon.edu) or\nmyself (alen at uoregon.edu).\n\n\nWe look forward to seeing you in Portland!\n\n\n\n\nSincerely,\n\n\nAlen Mahić and Kevin Van Den Wymelenberg, ESBL, University of Oregon\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2017-April/012107.html).</sup>", "id": "radiance-general_012107", "created_by": "Alen_Mahic"}