{"topic": "Strange behaviour with mixed material", "category": "radiance-general", "attachments": [], "created_by_name": "Santiago Torres", "created_at": "June 03, 2016 at 01:10PM", "body": "Dear all,\n\n\n\n\n\n\nI'm trying to define a mixfunc material to modify a mirror definition, so I can create holes (horizontal bands in this case) in the mirror. This was explained in an old tutorial by G. Antonutto, which now seems lost (at least I couldn't find it online... pillo?).\n\n\n\n\n\n\nThe complete definition is like this:\n\n\n\n\n\n\n## metal\n\n\nvoid metal metal_01\n\n\n0\n\n\n0\n\n\n5 .8 .8 .8 .05 0\n\n\n\n\n\n\n## mix the metal with void to create holes\n\n\nvoid mixfunc strip\n\n\n4 metal_01 void 'if(sin(Pz/10),0,1)' .\n\n\n0\n\n\n0\n\n\n\n\n\n\n## alter the reflectance of mirror, reflectance is 0% for holes\n\n\nvoid brightfunc band\n\n\n2 'if(sin(Pz/10),0,1)' .\n\n\n0\n\n\n0\n\n\n\n\n\n\n## mirror attached to the metal surface with holes\n\n\nband mirror mix_01\n\n\n1 strip\n\n\n0\n\n\n3 .9 .9 .9\n\n\n\n\n\n\n\n\n\n\nIf I create a cube with the \"mix_01\" material, it looks as expected. Horizontal bands of void in the mirror let the direct light through and the reflected light is also in matching stripes.\n\n\n\n\n\n\nHowever, with the diffuse calculation, light doesn't seem to get through the void part. For example, if I measure irradiance inside the cube with only a glow source outside, I get zero.\n\n\n\n\n\n\nThe strangest part is that if I look at the model in rvu, it looks fine and there is diffuse light inside... unless I set -aa 0!!!\n\n\n\n\n\n\nAll other settings seem to make no difference (with ab > 0, of course).\n\n\n\n\n\n\nRpict behaves like rtrace, no diffuse light through.\n\n\n\n\n\n\nI've tried setting all rtrace parameters to the rvu defaults (including dr 0), but the result is still nothing.\n\n\n\n\n\n\nI'm sure there is an explanation, which is possibly that the material is just too weird, but I'm still confused by the strange difference in behaviour between rtrace/rpict and rvu...\n\n\n\n\n\n\nAny ideas?\n\n\nThanks!\n\n\nSantiago\n\n\n\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2016-June/011769.html).</sup>", "id": "radiance-general_011769", "created_by": "Santiago_Torres"}