{"topic": "Beware, indeed!", "category": "radiance-general", "attachments": [], "created_by_name": "Greg Ward", "created_at": "May 25, 2002 at 08:48AM", "body": "Thanks to Raphael for pointing out that rlux is different from rillum -- \nI was mistaken in thinking them the same.  I really need to think more \ncarefully before I type, and especially before I press \"send!\"  I \nrealized after I'd sent that message that I had made another mistake, as \nthe following is the correct way to execute rad to create an options \nfile without running any renderings:\n\n\n% rad -n -s scene.rif OPTFILE=render.opt\n\n\nWithout the -n option (as I had put in the last message), rad will run \nwhatever renderings are indicated in the scene.rif file, which was not \nthe point.  The -s option simply prevents it from echoing the commands \nit _would_ have executed, which you probably don't want to see...\n\n\nThere are a number of other fun ways to execute rad.  The following \ncommand will fill in ambient values for all the views in the scene.rif \nfile at once (provided the AMBFILE variable is set):\n\n\n% rad -v 0 scene.rif OPTFILE=render.opt\n% rad -n -s -V scene.rif | rpict @render.opt -S 1 -x 64 -y 64 \nscene.oct > /dev/null\n\n\nThe -v 0 option causes rad to generate the octree without rendering any \nviews.  The -V option causes rad to print out all the views for this \nscene in the standard \"VIEW=\" specification that rpict accepts for \nanimated sequences.  These views are then rendered by rpict at very low \nresolution and discarded, filling in the ambient file as a side-effect.\n\n\nI used a trick like this in the \"compamb\" script to compute a good -av \nsetting for a particular scene.  (See the man page for compamb, which \ncomes with 3.4.)\n\n\nI hope the above is correct, because I'm pressing \"send,\" now!\n\n\n-Greg\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-May/000272.html).</sup>", "id": "radiance-general_000272", "created_by": "Greg_Ward"}