{"topic": "Radiance workshop preregistration deadline", "category": "radiance-general", "attachments": [], "created_by_name": "Greg Ward", "created_at": "May 15, 2002 at 10:12AM", "body": "Just a reminder that the deadline for pre-registration is TODAY!\n\n\n\n\nCALL FOR PARTICIPATION -- RADIANCE WORKSHOP\n\n\nWhat:\tScientific Applications Using RADIANCE\n\n\nWhere:\tUniversity of Applied Sciences of Fribourg, Switzerland\n\n\nWhen:\tSeptember 30 to October 1 or 2, 2002\n\n\nOrganizers:\tRaphaÎl Compagnon and Greg Ward\n\n\nEstimated Cost:\t200-300 CHF per person to cover meals and Greg's travel\n\n\nPurpose:\nTo provide researchers with an opportunity to present their work with\nRadiance, and to share ideas and solutions with workshop participants.\nParticipants are invited to give a 20 minute talk, which will be\nfollowed by 10-15 minutes of open discussion.  No printed proceedings\nwill be produced, but a CD-ROM will be distributed to attendees that\nwill include electronic materials submitted by the speakers and edited\nby the organizers.\n\n\nGreg will open the workshop with an overview of Radiance development,\nthe current 3.4 release, and an update on his work in high dynamic range\nimaging and visualization.\n\n\nIf you would like to give a talk, please submit a preliminary title and\nabstract or short description to the e-mail address below.  If you wish\nto attend the workshop but not give a talk, let us know and we will see\nif we can accommodate you.  If you are a student who would like to give\na talk but cannot afford the registration fee, let us know this, also.\n\n\nRates in Fribourg are around 120 CHF/night for a three star hotel.  (1\nCHF ~ 0.6 USD or 0.66 EURO)  We will look into getting a 10-15% discount\nat one or more hotels once we find out how many attendees we can\nexpect.  In all likelihood, the workshop will last two days start to\nfinish, but if the response is large, we may need to make it two and a\nhalf days.  There is also a national exposition happening at the time,\nwhich attendees may wish to include on their itinerary.  See\nhttp://www.expo.02.ch for details.\n\n\nA final announcement with the agenda, workshop dates and registration\nfees will be sent out in late May, and registration will be due on June\n15.  Please complete the form below if you would like to attend.  We\nlook forward to meeting you in Firbourg!\n\n\n------------------------- Pre-registration \nForm ----------------------------\n\n\nAttendee Name (First M. Last, Title):\nE-mail:\nAddress:\nTelephone:\n\n\nStudent (Yes/No):\n\n\nTitle (if you plan to give a talk):\nAbstract/Description:\n\n\nOther Comments:\n\n\n\n\n\n\nPlease respond by May 15 to:\n\n\nRaphaÎl Compagnon\nmailto:raphael.compagnon@eif.ch\nhttp://www.eif.ch\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2002-May/000254.html).</sup>", "id": "radiance-general_000254", "created_by": "Greg_Ward"}