{"topic": "Instances + octrees", "category": "radiance-general", "attachments": [], "created_by_name": "Lars O. Grobe", "created_at": "July 05, 2004 at 09:42PM", "body": "Hi list!\n\n\nFirst, I am still using v3.5 - I have a Mac and no X-sources, so it's \nhard to compile Head.\n\n\nTo improve the performance during rendering a very large model, I \natomized it into LOTS of small parts. These are assembled by replmarks, \nusing octrees generated with oconv -f. I thought this was the most \nefficient solution, and I want to save memory. This leads to a model \nwhich is assembled from hundreds of octrees (instances).\n\n\nNow, after importing one more (and big) part into the model, I am not \nable to oconv the file which is to assemble all these instances any \nmore. Oconv is running without end, I stop it when it takes about 300 \nMB memory. When I use xform to insert my elements (the same model, just \nreplaced the -i by -x and *.oct by *.rad in the replmarks command \nline), not instances, everything works fine (except of a very large \noctree).\n\n\nI heard about some \"overlapping octree\" problems, however, I never \nunderstood how they appear. May this be one such problem? Actually, the \ngeometry is not overlapping, but the small octrees bounding boxes \ncertainly are (as they are all cubes, right?). What did you experience \nwith such instanced models?\n\n\nIs the oconv tool in the 3.5 buggy? Any known bugs like that?\n\n\nIs it my error (should I check my scripts ten more times ;-) ?\n\n\nI really would like to keep using octree-instances, as the model is \ngrowing quite fast at the moment, and I won't be able to finally render \nit on my machine without instances. So I am very interested in why this \nproblem appears and how to resolve it.\n\n\nTIA+CU, Lars.\n\n\nLars O. Grobe\ngrobe at gmx.net\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2004-July/001882.html).</sup>", "id": "radiance-general_001882", "created_by": "Lars_O._Grobe"}