{"topic": "Utah sky model .cal file", "category": "radiance-general", "attachments": [], "created_by_name": "Mark Stock", "created_at": "August 12, 2009 at 06:17AM", "body": "All this talk of Radiance skies made me remember that I recently \nimplemented part of Preetham, Shirley, Smits, \"A Practical, \nAnalytical Model for Daylight\" for Radiance. It's rough around \nthe edges, but produces good (if not totally accurate) results.\n\n\nSpecifically, I modeled the part that determines the sky color \nand brightness, not the part that determines the color shift for \nfaraway objects due to atmospheric scattering (maybe I'll have \nthat done by the Radiance User Conference this year).\n\n\nTo use it, first run gensky (as normal), but comment out the \nbrightfunc description and add a new colorfunc entry. The real \narguments are turbidity and sun direction (copy the last 3 \nentries from the brightfunc line), like this example for a sky \nafter sunset:\n\n\n#void brightfunc skyfunc\n#2 skybr skybright.cal\n#0\n#7 1 9.75e-01 4.02e-01 2.68e-01 -0.918161 0.378882 -0.115887\n\n\nvoid colorfunc skyfunc\n4 skyr skyg skyb utah.cal\n0\n4 2. -0.918161 0.378882 -0.115887\n\n\nLike gensky, to use it attach it to a glow source:\n\n\nskyfunc glow skydome\n0 0 4  1. 1. 1. 0\nskydome source sky\n0 0 4  0 0 1  180\nskydome source sky2\n0 0 4  0 0 -1  180\n\n\nSo, for the sample scene file attached, run:\n\n\n% oconv duskscene.rad > duskscene.oct\n% rvu -vp 1 -5 2 -vd -1 5 -1.5 -vh 90 -vv 90 -ab 2 -ad 512 -ar \n512 -as 128 -aa 0.1 -pe -5 duskscene.oct\n\n\nIt isn't quite automatic yet, and it does emit some errors, \nthough I hope to clean those up soon.\n\n\nWould this be most useful as a command-line option to gensky? It \nwould seem most applicable there. Plus, that would allow control \nover the sun color, which shifts subtly from white to orange-ish \nnearer the horizons.\n\n\nEnjoy.\n\n\nMark\nmstock at umich.edu\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-August/006166.html).</sup>", "id": "radiance-general_006166", "created_by": "Mark_Stock"}