{"topic": "Daysim 3.1+ PS Tool", "category": "radiance-daysim", "attachments": [], "created_by_name": "Miguel Corujo", "created_at": "April 28, 2016 at 11:17AM", "body": "Hello Dr Rick Mistrick\n\n\n\n\n\n\nFollowing up on the below conversation, for what I can perceive at this\npoint, by installing not the current version (4.0) but Daysim 3.1 with the\nPS tool I’ll be able to import the file from Ecotect (Daysim 4.0 apparently\ndoesn’t allow the integration with Ecotect due to the lack of compatibility\nwith the GUI) and develop the SDA analysis for LEED V4 according to LM-83(\nspace by space for the moment)?!\n\n\n\n\n\n\nBest regards,\n\n\n\n\n\n\n\n\n\n\nMiguel Corujo\n\n\n*Consultant*\n\n\nmcorujo at greenlab.com.pt\n\n\nSkype: sea.miguelcorujo\n\n\n\n\n\n\nAv.Infante Santo, 69 a-c | 1350-177 Lisboa - Portugal | T: +351 213 939\n340/9  +351 217 120 510 | F: +351 217 120 511\n\n\n\n\n\n\n<http://www.greenlab.com.pt>[image:\nhttp://www.saraivaeassociados.com/rodape-mailgl-PT.jpg]\n<http://www.greenlab.com.pt>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRick:\n\n\n        If the glare has to be calculated by the ASE 1000-250 with no\n\n\npassive shading devices, won't that force us to design spaces that\n\n\neffectively have no glare that needs to be controlled by the user.  Of\n\n\ncourse I can use the dynamic shading model options in daysim to limit the\n\n\nglare as well, whether it is option 1 standard blinds or option 2 the\n\n\ndynamic model.\n\n\n\n\n\n\n        With that in mind will the work flow work?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe problem with your approach is that it does not accurately address the\n\n\nshading devices, which need to close completely across a window group to\n\n\nprevent direct sunlight from striking more than 2% of the work plane\n\n\nanalysis points.  Shading devices must be applied to obtain sDA according to\n\n\nLM-83.  Penn State currently have a new module for DAYIMps that can do this,\n\n\nbut it requires a slightly different header file format that is not 100%\n\n\ncompatible with the GUI.\n\n\n\n\n\n\nTo correctly calculate sDA with a manual approach like you are trying, you\n\n\ncan determine the direct sunlight values by running the model with the\n\n\nshades up and -ab set to 0.  The points without sunlight will have values of\n\n\nzero.  At any hours when the more than 2% of the points from this \"-ab 0\"\n\n\nrun reach 1000 lux, you apply the data from a full shade run, otherwise you\n\n\nuse the data from an unshaded window.  We are currently finalizing a new\n\n\ninterface to address this and other advanced calculations, but it is\n\n\nprimarily designed to analyze a single space rather than an entire building.\n\n\nWe are also working on a solution for an entire building, but that is\n\n\nperhaps 9 or so months from completion.\n\n\n\n\n\n\nRick Mistrick\n\n\nAssociate Professor\n\n\nPenn State University\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-daysim/2016-April/000121.html).</sup>", "id": "radiance-daysim_000121", "created_by": "Miguel_Corujo"}