{"topic": "Three Phase Method Tutorial - Example 1", "category": "radiance-general", "attachments": [], "created_by_name": "Alireza Hashemloo", "created_at": "November 30, 2015 at 01:04AM", "body": "Hello,\n\n\nI have a couple of questions with regards to the three-phase method\ntutorials:\n\n\n1- Following the Example 1 in the tutorial document titled as \"The\nThree-Phase Method for Simulating Complex Fenestration with Radiance\"\n(available at\nhttp://www.radiance-online.org/learning/tutorials/Tutorial-ThreePhaseMethod.pdf)\nI have encountered the following error message using the dctimestep (page\n21) to generate a rendering:\n\n\n\"fatal - unexpected EOF reading results/south.dmx\"\n\n\nI have checked the content of the south.dmx file generated in the previous\nsteps and it appears that with the exception of the first 9 lines providing\ninformation such as the Format, Software, Capdate etc, the remaining of the\nlines contain NULL values. This is despite the fact that I have not\nreceived any error messages following the Example 1 through each step prior\nto this last step where the EOF error is raised.\n\n\n2- There is another document titled as \"Radiance Three Phase Method\nTutorial\" (also by Andy McNeil) which I could not find on the Radiance\nwebsite but it it published via GitBook at the following link:\n\n\nhttps://www.gitbook.com/book/andymcneil/three-phase-method-tutorial/details\n\n\nFollowing the Example 1 of this new tutorial document, the 'rcontib' call\nis replaced with 'rfluxmtx' to create the view matrix renderings. I have\nalso attempted to pursue this example step by step, however, the call for\nthe 'rfluxmtx' for generating view matrix renderings (page 21) raises the\nfollowing error message:\n\n\n\"missing hemisphere sampling type\"\n\n\nI have checked the 'rfluxmtx' document describing the application of a\n\"#@rfluxmtx variable=value\" form to pass the sampling basis (eg. h=kf for\nfull Klems sampling model). However, I could not find the correct syntax to\nadd this variable to the rfluxmtx command call in the tutorial (page 21) in\nresponse to the \"missing hemisphere sampling type\" error.\n\n\n\n\nI would appreciate if you could help me with these two questions.\n\n\nThank you,\nAlireza\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-November/011376.html).</sup>", "id": "radiance-general_011376", "created_by": "Alireza_Hashemloo"}