{"topic": "BRTF measurements & some thoughts", "category": "radiance-general", "attachments": [], "created_by_name": "Peter Apian-Bennewitz", "created_at": "October 19, 2010 at 09:56PM", "body": "Hi all,\n\n\nsince the Radiance 2010 workshop CD, in which it was planned to be \nadded, seems still in the making, and in light of Andy McNeil's nicely \ndone and informative three-phase tutorial, it might be worthwhile to \nmention that the workshop talk on \nbidirectional-reflection-transmission-data (BRTF, BSDF, BTDF, etc) \nbasics, measurement and modelling had already been put at \nhttp://www.pab-opto.de/radiance/pab-brtf-talk.web.pdf . It gives some \ncompact summary from solid angle to BRTF, some basics on measurements \nand some thoughts based on previous experience with Radiance BRTF models.\n\n\nFor those who are primarily concerned about how to get measured BRTF \ninto Radiance at all, LBL's newly introduced, matrix based approach is \ncertainly a big step forward, that is vital to handle measured BRTF + \nRadiance in a general, project oriented, way.\n\n\nFor folks who endeavour to explore the BRTF world closer, and without \ngoing into too much detail here, there still seems good reason to \nconsider a matrix based approach as not quite optimal for many of the \nmost interesting materials. For the entertainment of the curious, \nreasons are given in the last 10 pages or so of the talk. Funny bit to \nmention: Both views are based on the same data generating measurement \ngonio-photometer (http://www.brtf.info/?d=/gonio-photometer).\nWhether or not this will influence any further and/or additional ways of \ngetting BRTF data into the Radiance simulation program in an adaptive \nand sleek way, with less  steps on the user-side, is to be seen. \nTechnically, there are one or two fairly major programming tweaks to \nthis, and both are inside the current rendering core code.\n\n\nhappy rendering,\nfeedback appreciated\n\n\nPeter\n\n\nPS: cross-posted to radiance-dev, in case of further technical threads\n\n\n\n\n pab-opto, Freiburg, Germany, http://www.pab-opto.de\n [see web page to check digital email signature]\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2010-October/007385.html).</sup>", "id": "radiance-general_007385", "created_by": "Peter_Apian-Bennewitz"}