{"topic": "getting irradiance from source defined inphotometric units", "category": "radiance-general", "attachments": [], "created_by_name": "Christopher Rush", "created_at": "October 08, 2009 at 11:33AM", "body": "Someone please speak up if my understanding is flawed, but ...\n\n\n\n\n> I would e.g. assume an efficacy of 100lm/W for my source, and if\nies2rad\n> would use 179 instead, the radiance values in my simulation would be\nby\n> far too low...\n\n\nIf you're using IES files via ies2rad, the IES files are measured in\ncandela, and the physically measured values already account for\nefficiency of the source from electrical power in - through to the\nlighting power out. The factor of 179 is just a conversion from W/m2 to\nlumens/m2, as a unit conversion, not an efficiency factor. The source\nefficiency is already incorporated into the physical measurements\ndocumented in the IES file.\n\n\n\n\n> I used white, incandescent, and fluorescent, and spread 200 lumens\nover\n> a 1 meter polygon, and ended up with 63.7, 60.5, and 54.1 cd/m^2\n> respectively.\n\n\nI had understood the factors lamp.tab are mainly intended to account for\nlumen depreciation, and just happen to have some color offset included\nas part of this. In Rob's tests the decreasing values roughly correspond\nto sources with more lumens lost over their life. I think if you test\nagain with metal halide or mercury you'll find those a little lower\nstill.\n\n\nIf accurate results are the goal, I would typically use the approach of\nspecifying everything as white, with my own -m multiplier calculated\nfrom lamp manufacturer maintained lumen data.\n\n\n> obtaining accurate CIExy data and lumen maintenance values for all the\nnew\n> lamps coming out seems a bit daunting too.\n\n\nRegarding accuracy of factors in lamp.tab, the values for metal halide\nand high pressure sodium seem higher than real world lumen depreciation,\nand halogen is defined with a factor of 1, but should still have some\ndepreciation over time. Considering that these factors vary so much,\nparticularly between different types of metal halide, this could be\ndifficult to keep accurate as part of the distribution.\n\n\n____________________________________________________________\nElectronic mail messages entering and leaving Arup  business\nsystems are scanned for acceptability of content and viruses\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-October/006254.html).</sup>", "id": "radiance-general_006254", "created_by": "Christopher_Rush"}