{"topic": "Again transmissivity for color filter, / glass", "category": "radiance-general", "attachments": [], "created_by_name": "Christian Fusenig", "created_at": "April 27, 2006 at 01:55PM", "body": "Hi Greg,\n\n\nOK, i think i was dead wrong! Thinking about some things makes your \nbrain go crazy.\nBut i don't want to give up. I went through your paper, several times, \nand through your discussion with Will on the list about \"specifying \nsources\".\nAdditionally i read \"Tools for Lighting Design an Analysis\".\nTo get this right from scratch:\n\n\n1. I have reflectance values for surfaces in XYZ. Measured with an \nspectrofotometer with a D65 test source inside. Actually it was the same\n   Minolta CM-2002 as in your paper. I have data with and without the \nspecular component. (SCI or SCE) Which on would you suggest or does it \ndepend on the surface?\n\n\n2. These surfaces are to be seen in a scene with sources which have \ncolor temperatures ranging from 2400 to 3000 Kelvin.\n    For these sources i calculated the xy coordinates with blackbody.cal.\n\n\n3. I think this is the first problem.  The reflectance values for the \nsurfaces should have been measured with a tungsten test illuminant in \nthe spectrofotometer.\n    And the spectral data would have been better than XYZ. Is that right?\n\n\n4. As i understand you in your conversation with Will, the \npremultiplying part is only efficient if i would have spectral data. If \ni have only XYZ data, i convert both reflectance values and color values \nof the sources to Sharp RGB color space like so:\n rcalc    -f xyz_rgb.cal      -f Sharp.cal    -e '$1=R($1,$2,$3); \n$2=G($1,$2,$3);  $3=B($1,$2,$3);'\n\n\n5. Now i render my picture and add the correct primaries to the picture \nheader with your suggested script. (addSharp.csh)\n\n\n6. When i call 'ximage' with rtrace -I, i should get the right \nilluminance values or not?\n\n\n7. To change the primaries for a special display i use 'pcond' later. I \nguess 'pcond' does a white point transformation?\n\n\n8. Does 'normtiff' does a white point transformation as well?\n\n\nWould this procedure be the best what i can get out if my data for \n\"correct\" color display?\nMany thanks again and regards,\n\n\nChristian\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-April/003612.html).</sup>", "id": "radiance-general_003612", "created_by": "Christian_Fusenig"}