{"topic": "Announcement - 3rd VELUX Daylight Symposium in Rotterdam, 13-14 May 2009", "category": "radiance-general", "attachments": [], "created_by_name": "Nicolas Roy", "created_at": "March 13, 2009 at 07:38AM", "body": "3rd VELUX Daylight Symposium in Rotterdam, 13-14 May 2009\n\n\nThe third VELUX Daylight Symposium on daylight quality in buildings will \nbe held at Van Nelle Factory in Rotterdam, the Netherlands, on 13 and 14 \nMay 2009.\n\n\nThe previous daylight symposiums, held in Budapest in 2005 and in Bilbao \nin 2007, brought together participants from research, education and \narchitectural practices as well as legislators and lighting designers from \nall over the world.\n\n\nWorldwide interest in daylighting has been renewed considerably to meet \nfuture challenges in relation to energy efficiency, and a growing movement \ntowards sustainable buildings has established a hopeful target for \nbuildings to reach energy self-sufficiency in the near future. At the same \ntime, medical and health research is focusing more on light and its effect \non human health and a unified understanding of light and its impact on \nhuman beings has evolved; in general, buildings that use daylight are \nhealthier places to live in.\n\n\nThis third daylight symposium will focus specifically on benefits in \nconnection with energy use and health. The programme will provide updates \non the scientific progress in the field as well as experiences and \nviewpoints from architectural practices. The programme will also include \nseparate sessions addressing particular aspects of daylighting as well as \nopen discussions between the speakers and the audience. The symposium will \nfeature invited papers and commentaries from leading scientists and \npractitioners. \n\n\nFor more information on the programme and registrations please visit \nwww.thedaylightsite.com.\n\n\nhttp://www.thedaylightsite.com/symposium.asp?tp=1024&y=2009\n\n\nDeadline for registration on 4 April 2009.\n\n\n\n\nRegards,\n\n\nNicolas Roy\nVELUX A/S\nnicolas.roy at velux.com\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2009-March/005817.html).</sup>", "id": "radiance-general_005817", "created_by": "Nicolas_Roy"}