{"topic": "Modeling reflective glazing and glazing with ceramic frit", "category": "radiance-general", "attachments": [], "created_by_name": "Arvinder Dang", "created_at": "December 27, 2006 at 05:11PM", "body": "Hello Everyone,\n  Its after a long time that I am posting a message on this list as I haven\u0092t been using Radiance much, so in a way I\u0092m starting from scratch and seeking help for some hopefully simple questions.  Recently I have been working on some daylighting calculations where I have to do studies for a few daylighting options for a laboratory building where they are proposing to use light shelves and external vertical fins for shading. \n  I am using radiance from within Ecotect however am refining the simulation parameter settings as well as the material definitions based on what I think would somewhat accurately reflect the material properties. \n\n\n\n\n  The architectural team wants to try out a couple of options for the light shelf material (metal, reflective glass, glass with a reflective ceramic frit coating.  Since the ceramic frit cannot be exposed to the outside environment this would actually be a sandwiched panel with the coating on the inner surface). I am actually facing difficulty defining the properties of the glass material which would be used as a light shelf. \n\n\n  I have read through the archives and have understood the following from it. Please correct me if I have misinterpreted any information\n\n\n  Convert glazing data from Optics 5 to Radiance.  However since this does not account for transmittance/reflectance dependence of incident angle use the BRTD definition and glazing.cal file to define the angular dependence of transmittance/reflectance values. (Since I have been using Radiance from within Ecotect, I really don\u0092t know how I should be doing this). I do not have cygwin installed on my computer and can only change the material definition files within Ecotect.  I know the definition should look like this.\n\n\n  mod BRTDfunc my_glazing\n  10         rrho       grho      brho\n              rtau       gtau      btau\n              0          0          0\n                          glazing.cal\n  0\n  18         0          0          0\n              0          0          0\n              0          0          0\n              FRRHO FGRHO FBRHO\n              BRRHO BGRHO            BBRHO\n              RTAU    GTAU   BTAU\n\n\n              where:\n                          FRRHO FGRHO FBRHO is front normal spectral reflectance\n                          BRRHO BGRHO BBRHO is back normal spectral reflectance\n                          RTAU    GTAU   BTAU    is normal spectral transmittance\n\n\n  Radiance material file from optics looks like this\n\n\n\n\n  # FileName= HMHPR18.SWT\n  # Product Name= Heat Mirror\u0099 HPR 18 Suspended Film\n  # NFRC ID= 1507\n  # Manufacturer Name= Southwall Technologies, Inc.\n  # Glazing Type= Coated\n  # Coated Side= Front\n  # Transmittance= 0.189\n  # Front Reflectance= 0.649\n  # Back Reflectance= 0.116\n  # Thickness(mm)= 0.076\n  # Appearance= Reflective\n  #\n\n\n\n\n  void  glass       HMHPR18_glass\n  0\n  0\n  3     0.143     0.215     0.371\n\n\n  void  BRTDfunc    HMHPR18_front\n  10\n        0.745     0.636     0.400\n        0.131     0.197     0.341\n        0 0 0\n        .\n  0\n  9 0 0 0 0 0 0 0 0 0\n\n\n  void  BRTDfunc    HMHPR18_back\n  10\n        0.163     0.100     0.092\n        0.131     0.197     0.341\n        0 0 0\n        .\n  0\n  9 0 0 0 0 0 0 0 0 0\n\n\n  Can someone walk me step by step as to how I can convert this and define my final material file which I should be using. I have to try a couple of options for glass types so will have to do this time and again, so I am interested in the process and not the final outcome only. I know it should be fairly simple but somehow not having worked in linux doesn\u0092t make it seem simple.\n\n\n  Also for modeling the ceramic frit coating I read I need to use the glaze.csh script. How can I model a glass which is a sandwiched panel with the ceramic coating on the inside.\n\n\n  Thanks\n  ARVINDER DANG, LEED® AP\n  SUSTAINABILITY SPECIALIST   \n\n\n  SKIDMORE, OWINGS & MERRILL LLP \n  224 SOUTH MICHIGAN\n  CHICAGO, IL 60604 \n  T: 312.360.4633  F: 312.360.4910 \n  ARVINDER.DANG at SOM.COM\n\n\n\n\n __________________________________________________\nDo You Yahoo!?\nTired of spam?  Yahoo! Mail has the best spam protection around \nhttp://mail.yahoo.com\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2006-December/004139.html).</sup>", "id": "radiance-general_004139", "created_by": "Arvinder_Dang"}