{"topic": "wxfalsecolor v0.52 released - minor updates", "category": "radiance-general", "attachments": [], "created_by_name": "Thomas Bleicher", "created_at": "June 20, 2015 at 09:10AM", "body": "All\n\n\nFor the first time in years I have created a new release of wxfalsecolor.\nThis is mostly a maintenance update to work with GitHub as the new code\nrepository but a few minor updates are included as well.\n\n\nDownload link:\nhttps://github.com/tbleicher/wxfalsecolor/releases/download/v0.52/wxfalsecolor_v0.52.exe\n\n\nNew Home Page (work in progress):\nhttp://tbleicher.github.io/wxfalsecolor/\n\n\nNew GitHub repository:\nhttps://github.com/tbleicher/wxfalsecolor\n\n\n\n\nThis release was necessary because the old Google Code website will be\nshutting down soon. As a result older versions will not be able to notify\nyou about new releases or bug fixes. This update adjusts the auto-update\nfeature to search for new releases on the GitHub repository page.  Also,\nupdates are now identified by version number (tag name) and not by release\ndate.\n\n\n*Please use this new version to receive future updates and bug fixes!*\n\n\nA new feature was added to allow the on-the-fly resizing of large HDR files\nduring loading. This process will create a backup of the original file,\nthen use *pfilt* to create a small version which is then used for the\nanalysis. It is supposed to always create a backup but please be careful\nand make a copy of your files first. You will find your original image next\nto the working copy with a suffix based on the image resolution (i.e. \"\n*image_3000x2000.hdr*\").\n\n\nThe reading of image data has been improved which should also help with\nlarge files. You still need some patience and a lot of memory.\n\n\nI also have changed the built-system to a 32-bit Windows 7 virtual machine.\nIf you are still using Windows XP you may see odd popup messages at the\nstart of the program.\n\n\nPlease report any bugs, issues or feature requests via the GitHub issue\ntracker:\nhttps://github.com/tbleicher/wxfalsecolor/issues\n\n\n\n\nRegards, and to all the dads out there: Enjoy Father's Day!\n\n\nThomas\n___\n<sup>Automatically generated content from [radiance mailing-list](https://radiance-online.org/pipermail/radiance-general/2015-June/011049.html).</sup>", "id": "radiance-general_011049", "created_by": "Thomas_Bleicher"}